{
 "title": "First ISCA Workshop on Auditory Quality of Systems",
 "location": "Akademie Mont-Cenis, Germany",
 "startDate": "23/4/2003",
 "endDate": "25/4/2003",
 "conf": "AQS",
 "year": "2003",
 "name": "aqs_2003",
 "series": "",
 "SIG": "",
 "title1": "First ISCA Workshop on Auditory Quality of Systems",
 "date": "23-25 April 2003",
 "papers": {
  "blauert03_aqs": {
   "authors": [
    [
     "Jens",
     "Blauert"
    ]
   ],
   "title": "Auditory quality of systems: Towards a unified approach",
   "original": "aqs3_009",
   "page_count": 0,
   "order": 1,
   "p1": "9",
   "pn": "",
   "abstract": [
    "In this contribution, the basic concepts behind sound quality will be reconsidered in a systemic way. This appears to be of some use, as sound quality is a mental construct which is very often insufficiently defined and, consequently, not understood properly by many. Ambiguous usage of the term - even among experts - provides ample evidence of this fact.\n",
    "The discussion will start from the problems associated with product-sound quality. Here, it is often the mission of the sound of a product to prompt confidence in the quality of the product. Thus, the \"Sound of Quality\" is the real issue. The next step will be a discussion of the auditory quality of speech. Here, either the quality of something or someone that the speech is standing for, or - alternatively - the quality of the speech sounds themselves is the object of judgement.\n",
    "From speech quality in the second sense it is relatively easy to generalise to the auditory quality of other sounds, such as of music or environmental sounds. The issue now is the \"Quality of Sound\".\n",
    "Finally, the quality of audio transmission will be discussed - with or without a reference signal being available - were we should talk about \"Sound-Transmission Quality\" rather than sound quality.\n",
    "Special effort will be put into an attempt to discuss all these different aspects of sound quality in a unified way, such that the general concept of sound quality does not change due to a specific application. Rather, it is only the frame of reference that has to fit a particular application.\n",
    "It is hoped that such a unified view of the formation process of sound quality will support current attempts to estimate sound quality instrumentally.\n",
    ""
   ]
  },
  "bramslw03_aqs": {
   "authors": [
    [
     "Lars",
     "Bramsløw"
    ]
   ],
   "title": "Objective scaling of sound quality for normal-hearing and hearing-impaired listeners",
   "original": "aqs3_010",
   "page_count": 8,
   "order": 2,
   "p1": "10",
   "pn": "17",
   "abstract": [
    "A new method for the objective estimation of sound quality for both normal-hearing and hearing-impaired listeners is presented. It is based on three main parts: 1) Subjective sound quality ratings, 2) An auditory model, coupled to 3) An artificial neural network. The paper presents sound quality predictions on two perceptual scales, Clearness and Sharpness, and compares these to actual subjective ratings.\n",
    ""
   ]
  },
  "hastings03_aqs": {
   "authors": [
    [
     "Aaron",
     "Hastings"
    ],
    [
     "Patricia",
     "Davies"
    ]
   ],
   "title": "The effect of attenuation rate and peak bandwidth of tonal components on perceived tonalness",
   "original": "aqs3_018",
   "page_count": 6,
   "order": 3,
   "p1": "18",
   "pn": "23",
   "abstract": [
    "Band-pass filtered noise can be perceived to some degree as tonal. The perceived strength of this tonal quality depends on the spectral shape of the filtered noise and the presence of other features in the total sound. The spectral shape of bandpass filtered noise can be characterized by the center frequency, bandwidth, and roll-off rate of the filter. In order to determine the interaction between bandwidth and roll-off rate for band-pass filtered noise, the tonalness of band-pass filtered noise was evaluated by using three test methods: paired comparison, direct scaling, and an adaptive forced choice method. All three test methods yielded very similar results. Trapezoidal band-pass filtered random noise was used for the experiments. For a roll-off rate of 300 dB per octave, the tonalness of the sounds ranged from 30 to 90 percent of a pure tone's tonalness for a bandwidth of 300 to 1 percent of the critical bandwidth. For a roll-off rate of 100 dB per octave, the tonalness of the sounds ranged from 30 to 60 percent of a pure tone's tonalness. As the roll-off rate of the filtered sounds approachedzero, the tonalness disappears.\n",
    ""
   ]
  },
  "vastfjall03_aqs": {
   "authors": [
    [
     "Daniel",
     "Västfjäll"
    ]
   ],
   "title": "Tapping into the personal experience of quality: Expectation-based sound quality evaluation",
   "original": "aqs3_024",
   "page_count": 5,
   "order": 4,
   "p1": "24",
   "pn": "28",
   "abstract": [
    "This paper addresses the role of expectation for product Sound Quality evaluation. In two different experiments it was shown that expectations (induced by priming tasks or as mood) systematically influenced how sounds are perceived. Moreover, temporary influences such as mood interacted with more stable individual differences such as noise sensitivity. These findings suggest that sound quality evaluation in variant across people and that both research and applications needs to consider subjective expectations to fully understand how the concept of quality in constructed.\n",
    ""
   ]
  },
  "werner03_aqs": {
   "authors": [
    [
     "Marc",
     "Werner"
    ],
    [
     "Karsten",
     "Kamps"
    ],
    [
     "Ulrich",
     "Tuisel"
    ],
    [
     "John G.",
     "Beerends"
    ],
    [
     "Peter",
     "Vary"
    ]
   ],
   "title": "Parameter-based speech quality measures for GSM",
   "original": "aqs3_029",
   "page_count": 6,
   "order": 5,
   "p1": "29",
   "pn": "34",
   "abstract": [
    "This contribution introduces non-intrusive instrumental speech quality measures for the GSM system based only on transmission parameters. The idea behind these measures is that parameters which quantify the transmission quality in terms of bit error rate, received power level, etc., may also be suitable to predict the resulting speech quality. Neither the original nor the received speech signal is needed for this kind of prediction. The proposed speech quality measures have been validated by extensive link-level simulations which are based on measurements of transmission parameters collected in a GSM-1800 network. Speech samples were produced by bit-exact transmission simulations using the measured link parameters for channel modelling. The reference speech quality assessments of these samples were carried out with the PESQ algorithm [4]. The correlation of the presented parameter measures with the intrusive PESQ measure is remarkable.\n",
    ""
   ]
  },
  "dresler03_aqs": {
   "authors": [
    [
     "Tomás",
     "Dresler"
    ],
    [
     "Jan",
     "Holub"
    ],
    [
     "Radislav",
     "Smid"
    ]
   ],
   "title": "Wavelet transform in voice transmission quality measurement",
   "original": "aqs3_035",
   "page_count": 4,
   "order": 6,
   "p1": "35",
   "pn": "38",
   "abstract": [
    "The article describes a research performed in the area of wavetel transform application for speech transmission quality measurements. Computational power saving can be acieved, however, there are certain limitations in variable delay compensation when DWT (Discrete Wavelet Transform) is used.\n",
    ""
   ]
  },
  "isabelle03_aqs": {
   "authors": [
    [
     "Scott K.",
     "Isabelle"
    ],
    [
     "Sandra J",
     "Guzman"
    ],
    [
     "Rindala",
     "Saliba"
    ],
    [
     "Robert",
     "Novorita"
    ]
   ],
   "title": "Application of objective speech quality metrics",
   "original": "aqs3_039",
   "page_count": 6,
   "order": 7,
   "p1": "39",
   "pn": "44",
   "abstract": [
    "Results of subjective evaluations of perceived sound quality preferences for mobile telephone handsets with different acoustic design strategies are presented and compared to predictions from two objective speech quality metrics.\n",
    ""
   ]
  },
  "gros03_aqs": {
   "authors": [
    [
     "Laetitia",
     "Gros"
    ],
    [
     "Noël",
     "Chateau"
    ],
    [
     "Sylvain",
     "Busson"
    ]
   ],
   "title": "The impact of real environments on transmitted speech quality judgments",
   "original": "aqs3_045",
   "page_count": 6,
   "order": 8,
   "p1": "45",
   "pn": "50",
   "abstract": [
    "This paper deals with the question of the validity of listening tests in laboratory, in the case of the time-varying speech quality characterizing mobile telephony. In order to measure the impact of real environments, especially those of real sound environments, speech quality judgments are collected in a field experimentation. This experimentation consisted both in a listening test and in a conversation-opinion one. It was carried out in two different places, a noisy one and a quiet one. Recordings both of sound environments and speech sequences heard by listeners allowed to reproduce them in laboratory. Therefore speech quality judgments were also collected in laboratory and compared with those collected in real environments. Results show a weak impact of the sound environment on quality judgments and validate the use of listening tests in laboratory.\n",
    ""
   ]
  },
  "hammer03_aqs": {
   "authors": [
    [
     "Florian",
     "Hammer"
    ],
    [
     "Peter",
     "Reichl"
    ],
    [
     "Tomas",
     "Nordström"
    ],
    [
     "Gernot",
     "Kubin"
    ]
   ],
   "title": "Corrupted speech data considered useful",
   "original": "aqs3_051",
   "page_count": 4,
   "order": 9,
   "p1": "51",
   "pn": "54",
   "abstract": [
    "The success of Voice-over-IP technology will crucially depend on the provision of a certain level of perceptual speech quality. In this paper we demonstrate that keeping as much corrupted speech data as possible results in a major step towards this goal. To this end, we explore the combination of two key factors which influence the speech quality as perceived by the user: networking mechanisms and signal processing algorithms. We present three strategies of dealing with voice packets that have been damaged by bit errors. The performance of these strategies is assessed using the standardized  PESQ-algorithm. Results of extensive simulations give a detailed insight into the behavior of the different strategies, and thus prove that corrupted speech data in fact have to be considered useful.\n",
    ""
   ]
  },
  "hoene03_aqs": {
   "authors": [
    [
     "Christian",
     "Hoene"
    ],
    [
     "Berthold",
     "Rathke"
    ],
    [
     "Adam",
     "Wolisz"
    ]
   ],
   "title": "On the importance of a VoIP packet",
   "original": "aqs3_055",
   "page_count": 8,
   "order": 10,
   "p1": "55",
   "pn": "62",
   "abstract": [
    "If highly compressed multimedia streams are transported over packet networks, losses of individual packets can impair the perceptual quality of the received stream in different degrees, depending on the content and context of the lost packet. In this paper, we investigate the impact of individual packet loss on the perceptual speech quality in Voice-over-IP systems using three popular coding types and receiver-side loss concealment algorithms. We set up a testing environment to measure the impairment of individual packet losses and define an appropriate quality metric. We evaluate published algorithms on packet loss quality prediction (DTX, Source-Driven Packet Marking and SPB-DiffMark) and identify their strengths and weaknesses. The quality of a VoIP telephone call can be enhanced significant, if a precise packet-loss quality model decides for each VoIP packet, how it should be forwarded throughout the network.\n",
    ""
   ]
  },
  "raake03_aqs": {
   "authors": [
    [
     "Alexander",
     "Raake"
    ]
   ],
   "title": "Speech quality of heterogeneous networks involving VoIP: Are time varying impairments additive to classical stationary ones?",
   "original": "aqs3_063",
   "page_count": 8,
   "order": 11,
   "p1": "63",
   "pn": "70",
   "abstract": [
    "This paper describes a series of four conversation tests, which were carried out in order to assess speech quality under degradations occurring in combined PSTN/ISDN/VoIP networks. Based on the test results, the validity of predictions by the model currently recommended by the ITU-T for network planning (the E-model, [1]) is discussed.\n",
    "",
    "",
    "ITU-T Rec. G.107, The E-Model, a Computational Model for Use in Transmission Planning, International Telecommunication Union, CH-Geneva, 2002.\n",
    ""
   ]
  },
  "ellermeier03_aqs": {
   "authors": [
    [
     "Wolfgang",
     "Ellermeier"
    ],
    [
     "Karin",
     "Zimmer"
    ]
   ],
   "title": "Using psychological choice models to investigate overall sound quality",
   "original": "aqs3_071",
   "page_count": 8,
   "order": 12,
   "p1": "71",
   "pn": "78",
   "abstract": [
    "One of the major goals of current sound-quality research has been to develop automated, objective metrics of perceptual attributes. These metrics have to be validated against subjective measures of the attributes which they claim to capture. To that end, typically, verbal reports are collected on complex psychophysical attributes from observers directly. That procedure, however, involves the risk of accumulating data of unknown validity, dimensionality, and unit. Rather than getting at the dimensions of interest directly, it is therefore advocated to ask but very simple judgments of preference from observers. Such data may then be used to model the listeners decision strategies when comparing auditory events. Once a valid decision model has been established, psychophysical scale values may be derived. The focus of the presentation will be on two approaches, the Bradley-Terry-Luce model, and the representation of paired comparisons by preference trees, which will be illustrated with examples from sound-quality research. It is shown that these indirect approaches offer (a) the advantage of an explicitly stated theory about the observers decision strategy, with (b) built-in checks of the consistency of judgments, and (c) statistical tests to validate if the attempt at scale construction succeeded or failed. In that way, indirect methods are able to (d) reveal the dimensional structure behind psychoacoustical judgments, and (e) provide the possibility to discover new, as yet undetected auditory attributes.\n",
    ""
   ]
  },
  "dahlquist03_aqs": {
   "authors": [
    [
     "Martin",
     "Dahlquist"
    ],
    [
     "Arne",
     "Leijon"
    ]
   ],
   "title": "Paired-comparison rating of sound quality using map parameter estimation for data analysis",
   "original": "aqs3_079",
   "page_count": 6,
   "order": 13,
   "p1": "79",
   "pn": "84",
   "abstract": [
    "A method for paired-comparison evaluation of subjective sound quality has been implemented and tested in a listening experiment. The test procedure is intended for the rating of e.g. hearing instruments or any other audio-coding or audio presentation systems. We now present results from an experiment with 31 persons evaluating the fidelity of  MP3-compressed versions of music material. Bit-rates of 192, 128, 96, and 64 kbit/s were used in comparison with the original CD version. Results are presented for three types of music material that were evaluated by 6-10 persons each.\n",
    "Two methods of data analysis are applied and compared; one non-parametric method yielding results only on a rankorder scale, and one parametric method which places the tested systems on an interval scale defined by a Gaussian linear model.\n",
    "Results show that the paired-comparison procedure could clearly quantify the quality degradation at 64 kbit/s for the three of the music materials presented here, and at 96 kbit/s for two of them. The degradation at 192 and 128 kbit/s is very subtle, and many test subjects could not distinguish these versions from the original. The median difference, across persons, between the original and the 192 kbit/s version for the three music materials were only 0.18, 0,04, and 0,001 units on the Gaussian linear scale. These differences mean that an average listener would prefer the original with a probability of about 55% or less, i.e. just slightly more than a random choice.\n",
    ""
   ]
  },
  "zimmer03_aqs": {
   "authors": [
    [
     "Karin",
     "Zimmer"
    ],
    [
     "Oliver",
     "Baumann"
    ]
   ],
   "title": "Direct scaling of sensations: Are Subjects able to produce consistent, and meaningful, numerical ratios?",
   "original": "aqs3_085",
   "page_count": 6,
   "order": 14,
   "p1": "85",
   "pn": "90",
   "abstract": [
    "In psychophysical scaling, direct estimation procedures like e.g. magnitude estimation, magnitude production, or fractionation, play a dominant role. S.S. Stevens [1, 2] introduced the idea that subjects are able to directly report a numerical value which represents the sensation magnitude experienced. Following his approach, the numerals assigned can be taken at face value, i.e. they possess all the mathematical properties of the numbers they signify. Only recently, theories analyzing the foundation of Stevens approach [3, 4] have detailed which basic empirical conditions have to be fulfilled in order to meet this far-reaching assumption, and to relate numerals and numbers in a meaningful way. In the present investigation, these fundamental conditions were evaluated using loudness fractionations of 1 kHz-tones. The subjects task was to adaptively adjust the loudness of a tone so that it reached a certain pre-specified fraction of the loudness of a reference tone. Results of the first experiment suggest, that listeners are able to make such adjustments on a ratio-scale level. It was not possible, however, to interpret the nominal fractions used in the task as true, scientific numbers. Thus, Stevens fundamental assumption that a subject can directly assess the sensation magnitude a stimulus elicits did not hold. The second experiment investigated the possibility of establishing a well-defined transformation function proposed by [4] that relates the overt numerals to the latent mathematical numbers. First results suggest that this is not possible for all of the subjects.\n",
    "s Stevens, S.S., \"The direct estimation of sensory magnitudes - loudness\", American Journal of Psychology, 69:1-25, 1956. Stevens, S.S., Psychophysics: Introduction to ist perceptual, neural, and social prospects, Wiley, New York, 1975. Narens, L., \"A theory of ratio magnitude estimation\", Journal of Mathematical Psychology, 40:109:129, 1996. Luce, R.D., \"A psychophysical theory of intensity proportions, joint presentations, and matches\", Psychological Review, 109(3):520-532, 2002.\n",
    ""
   ]
  },
  "martens03_aqs": {
   "authors": [
    [
     "William L.",
     "Martens"
    ],
    [
     "Nick",
     "Zacharov"
    ]
   ],
   "title": "Spatial distribution of reflections affects auditory quality and character of speech sounds located in a virtual acoustic environment",
   "original": "aqs3_091",
   "page_count": 6,
   "order": 15,
   "p1": "91",
   "pn": "96",
   "abstract": [
    "This study examined the significant multidimensional perceptual differences that exist between speech samples that were spatially processed using a virtual acoustic simulation with varying spatial and temporal distribution of reflections. The experiments reported here were designed to explore the stimulus similarity structure (i.e., the perceptual space) associated with a set of spatialized speech samples, reproduced via headphones under controlled conditions. The indirect sound simulation allowed the temporal distribution of reflections to be held constant while varying spatial distribution, so that the relative contribution of these two aspects of the indirect sound could be determined. Furthermore, an attempt was made to identify the perceptual dimensions that characterize the set of experimental stimuli via direct attribute ratings and binary choices. Finally, the auditory quality of the stimuli was investigated via a pairwise preference choice task completed by 75 individual listeners.\n",
    ""
   ]
  },
  "larsson03_aqs": {
   "authors": [
    [
     "Pontus",
     "Larsson"
    ],
    [
     "Daniel",
     "Västfjäll"
    ],
    [
     "Mendel",
     "Kleiner"
    ]
   ],
   "title": "On the quality of experience: A multi-modal approach to perceptual ego-motion and sensed presence in virtual environments",
   "original": "aqs3_097",
   "page_count": 4,
   "order": 16,
   "p1": "97",
   "pn": "100",
   "abstract": [
    "The current paper presents research on the quality of experience in virtual environments related to the European research project POEMS (Perceptually oriented ego-motion simulation). The objective of the POEMS project is to design a lean and elegant virtual reality system - using concurrent auditory, visual and vibrational cues - allowing for improved spatial presence as well as convincing simulation of egomotion without actually moving the observer.\n",
    ""
   ]
  },
  "silzle03_aqs": {
   "authors": [
    [
     "Andreas",
     "Silzle"
    ]
   ],
   "title": "Quality of head-related transfer functions - Some practical remarks",
   "original": "aqs3_101",
   "page_count": 8,
   "order": 17,
   "p1": "101",
   "pn": "108",
   "abstract": [
    "This paper starts with a short summary about previous work done in the field of head-related transfer function (HRTF) measurement and processing. Afterwards a new method to find and optimize HRTFs is explained. The main idea is to use expert listeners to select and tune the HRTFs with the help of real-time interaction adjustment of all parameters under test. Afterwards a listening test validates the previous results. Additionally several practical remarks regarding HRTF measurement and available HRTF sets are given. A possible scheme for the post processing is presented.\n",
    ""
   ]
  },
  "braasch03_aqs": {
   "authors": [
    [
     "Jonas",
     "Braasch"
    ]
   ],
   "title": "On the acoustical quality of free-reed organ pipes",
   "original": "aqs3_109",
   "page_count": 8,
   "order": 18,
   "p1": "109",
   "pn": "116",
   "abstract": [
    "Free-reed organ pipes were introduced at the end of the 18th century and soon became popular across Europe, especially in Germany and Switzerland. As opposed to striking-reed pipes (bound- or beating-reed pipes) the reed in free-reed pipes does not beat against the shallot, an orifice in the reed, when it is played. Instead it swings freely through a perforated rectangular plate of brass, like in reed organs or accordions. Stops with free-reed pipes were often termed Clarinet, Cor anglais, Bassoon or Aeoline. They were appreciated for having a \"mellow, round and agreeable sound\" (Lehr, 1912), whereas the sound of striking-reed pipes was often considered to be somewhat \"hard, rattling, clanking in sound and having most of the time something nasal\" (Hackel and Topp, 1993). In the 1920s, free-reed pipes were abandoned with the beginning of the \"Orgelbewegung\", a German movement trying to restore the ideal of the organ sound during the age of Bach. The promoters of this movement considered free-reed pipes as being \"too mellow\", \"pappy\" and \"sluggish\" (Adelung, 1955; Ellerhorst, 1936; Mahrenholz, 1968). Nowadays, free-reed pipes have gained popularity again and are considered frequently when building new organs.\n",
    "To investigate how the verbal descriptions are related to physical properties of free-reed pipes, the attack transients and stationary sounds of three free-reed organ stops were previously measured throughout the whole frequency range of the stop and compared to the measurements of striking-reed stops and flue stops (Braasch and Ahrens, 2000). As the results show, the attack transients of free-reed pipes differ in a number of parameters, e.g, the rise time of free-reed pipes is shorter than the rise time of striking-reed pipes, but in the same order of the rise time of the diapason pipes. A psychoacoustical test was conducted, revealing that parameters other than rise time, namely different initial delays of the partials and the presence of the chiff in case of the diapason pipe, lead to the perception of a longer attack duration of the free-reed pipe compared to the diapason pipe.\n",
    "In contrast to striking-reed pipes and flue pipes, free-reed pipes display a shift in the fundamental frequency during the attack phase. This shift is typically an upward movement from the initial frequency to the final frequency. This upward movement probably leads to the typical sound of free-reed instruments and contributes most likely to the negative judgments that were often made about these stops, especially, when the pipes were not carefully tuned.\n",
    "Another reason why free-reed pipes fell out of fashion is due to their frequency stability with changes in room temperature. Typically, they fall out of tune with the flue pipes every time the temperature changes in the church. A few historic free-reed organ pipes, however, were built differently and these pipes detune with changes in temperature in a more similar way to flue pipes.\n",
    ""
   ]
  },
  "schroeter03_aqs": {
   "authors": [
    [
     "Juergen",
     "Schroeter"
    ],
    [
     "Eric",
     "Cosatto"
    ],
    [
     "Hans Peter",
     "Graf"
    ],
    [
     "Joern",
     "Ostermann"
    ]
   ],
   "title": "From audio-only to audio and video Text-to-Speech",
   "original": "aqs3_117",
   "page_count": 0,
   "order": 19,
   "p1": "117",
   "pn": "",
   "abstract": [
    "Assessing the quality of Text-to-Speech systems is a complex problem.  Adding face synthesis - the animation of a talking head and its rendering to video -  to a TTS system makes evaluation even more difficult.\n",
    "This paper reports on progress made with the AT&T  sample-based Visual TTS (VTTS) system. Our system incorporates unit-selection synthesis (now well known  from Audio TTS) and a moderate-size recorded database of video segments that are modified and concatenated to  render the desired output.\n",
    "The higher the quality of a VTTS system, the more important it is to carefully evaluate all algorithmic choices. Naturally, subjective testing, although time consuming and expensive, has to be the ultimate measure. However, we used objective measures for quality assessment during the development phase of our system. For example, we found that accuracy and timeliness of lip closures and protrusions, turning points (where a speakers mouth changes direction from opening to closing), and overall smoothness of the articulation are very critical for achieving high quality.\n",
    "At the workshop, we will give an overview of the architecture and the evaluation of the AT&T VTTS system. This system passes the Turing test of being \"as good as recorded\"  for a significant fraction of all test sentences.\n",
    ""
   ]
  },
  "jokisch03_aqs": {
   "authors": [
    [
     "O.",
     "Jokisch"
    ],
    [
     "Rüdiger",
     "Hoffmann"
    ],
    [
     "M.",
     "Eichner"
    ],
    [
     "S.",
     "Werner"
    ],
    [
     "H.",
     "Kruschke"
    ],
    [
     "Ulrich",
     "Kordon"
    ]
   ],
   "title": "The influence of the TTS system configuration on the perceived quality of synthesized speech",
   "original": "aqs3_118",
   "page_count": 8,
   "order": 20,
   "p1": "118",
   "pn": "125",
   "abstract": [
    "The overall auditory quality of the speech signal produced by a text-to-speech (TTS) system depends on different factors which may be ascribed to different components of the synthesis system. During the development of the Dresden Speech Synthesizer DRESS, the authors investigated the influence of different system components separately. The results of these investigations are summarized and updated in this paper.\n",
    "In a recent application study, the authors were forced to select and to adapt system components for achieving a total system footprint less than 1 Megabyte (MB). The resulting scaleable low-resource system was denoted as microDRESS. The auditory comparison of microDRESS to the baseline system DRESS implies that the inventory coding has the most essential influence on both, system size and auditory quality. For the applied ADPCM coding scheme, the measured degradation of approximately one category on the mean opinion scale (MOS) is caused less by the coding algorithm itself but mainly by the limitation to telephone bandwidth.\n",
    "Allowing more system resources, there are interesting options for the TTS system configuration to achieve best-possible overall quality which are discussed in the paper.\n",
    ""
   ]
  },
  "rajman03_aqs": {
   "authors": [
    [
     "Martin",
     "Rajman"
    ],
    [
     "Andréa",
     "Rajman"
    ],
    [
     "Florian",
     "Seydoux"
    ],
    [
     "Alex",
     "Trutnev"
    ]
   ],
   "title": "Assessing the usability of a dialogue management system designed in the framework of a rapid dialogue prototyping methodology",
   "original": "aqs3_126",
   "page_count": 8,
   "order": 21,
   "p1": "126",
   "pn": "133",
   "abstract": [
    "The goal of this contribution is to present how the notion of dialogue management evaluation has been integrated in the rapid dialogue prototyping methodology we have designed and experimented in the framework of the InfoVox project.\n",
    "We first describe the proposed rapid dialogue prototyping methodology, decomposed into 5 consecutive main steps: (1) producing the task model; (2) deriving the initial dialogue model; (3) using a Wizard-of-Oz experiment to instantiate the initial dialogue model; (4) using an internal field test to refine the dialogue model; and (5) using an external field test to evaluate the final dialogue model.\n",
    "In a second part, we more specifically focus on evaluation. We first describe the integration of various evaluation aspects in the design steps corresponding to the internal and external field tests. Then, we more specifically concentrate on system usability assessment: we first describe the retrospective trend and correlation analyses that have been integrated in the field tests and then show how the obtained evaluation data can also be used in a more prospective way to derive useful hints for better dialogue design (prospective correlation analysis). All the presented conclusions are systematically illustrated by the concrete results obtained during the experiments that have been carried out in the InfoVox project.\n",
    ""
   ]
  },
  "pellegrini03_aqs": {
   "authors": [
    [
     "Christine S.",
     "Pellegrini"
    ]
   ],
   "title": "Quality evaluation of bochum restaurant information system: A spoken dialogue system",
   "original": "aqs3_134",
   "page_count": 5,
   "order": 22,
   "p1": "134",
   "pn": "138",
   "abstract": [
    "BoRIS, the Bochumer Restaurant-Information-System, is a spoken dialogue system that returns information about restaurants via telephone. This paper describes an auditory test in which different components of the dialogue system can be changed. Configurations are arranged with different features of the systems components. All configurations are assessed by subjects. Further, technical parameters are collected, e.g. the dialogues length, or expert-based parameters, such as transaction success.\n",
    "Correlations can be found between the features of the systems components, the technical data, and the assessment by the subjects. The results of this test will be discussed. It is conceivable that these results can be used to improve similar interactive dialogue systems.\n",
    ""
   ]
  },
  "hartikainen03_aqs": {
   "authors": [
    [
     "Elviira",
     "Hartikainen"
    ],
    [
     "Péter",
     "Boda"
    ]
   ],
   "title": "Results and observations from the evaluation of a telephony-based conversational information retrieval system",
   "original": "aqs3_139",
   "page_count": 6,
   "order": 23,
   "p1": "139",
   "pn": "144",
   "abstract": [
    "This paper presents the observations and results from the evaluation of the Program Guide Information System (PGIS), which was built as the CATCH-2004 Helsinki demonstrator under the European Unions 5th Framework Research Programme [1]. The technical implementation is the outcome of the integration of several technologies, including Automatic Speech Recognition and Natural Language Understanding. The paper gives an overview of the architecture and the technical implementation of the system. To achieve a high quality conversational interface implementation, the developed system was tested in several rounds. Both objective and subjective tests were run in an iterative manner: after each test cycle the collected data was analysed and used to improve the overall system and the individual modules performance further. Users opinions about the usability of the system were taken into account in tuning the user interface, i.e. modifying system prompting, dialogue flow, feedback mechanism, etc. The methodology of the evaluation perspectives is introduced and the main results and observations of the test runs are presented in more details.\n",
    "",
    "",
    "CATCH-2004, 5th Framework European Union IST Project (2000-2002): http://www.catch2004.org\n",
    ""
   ]
  },
  "hempel03_aqs": {
   "authors": [
    [
     "Thomas",
     "Hempel"
    ]
   ],
   "title": "Parallels in the concepts of sound design and usability engineering",
   "original": "aqs3_145",
   "page_count": 4,
   "order": 24,
   "p1": "145",
   "pn": "148",
   "abstract": [
    "Usability engineering for products is an increasing sales argument for industrial and consumer products. Products and services are designed for target-group adequate usability. But usability is no single-value concept. In contrast, EN ISO 9241 points out that it is influenced by several moderators, e.g., efficiency, context of use and others. Although standardized questionnaires have been developed to obtain quantitative data from usability tests, it nevertheless remains a qualitative concept - which is clearly accepted in the Human Factors world.\n",
    "Such qualitative approach would not be accepted in many other disciplines. But although since in multimodal applications of the future it is important to increase the quality of the interaction on the level of each single modality, the resulting overall usability will be a major selling point in order to provide a product or service that meets the needs of potential customers.\n",
    "It is the aim of the author to sensitize engineers and researchers in the field of usability engineering and sound design for each other's field. Thus, the author gives examples of a typical usability engineering and sound design process used in the industry. Parallels in the work of usability engineers and sound designers are pointed out, suggesting that a good sound designer in\n",
    ""
   ]
  }
 },
 "sessions": [
  {
   "title": "Papers",
   "papers": [
    "blauert03_aqs",
    "bramslw03_aqs",
    "hastings03_aqs",
    "vastfjall03_aqs",
    "werner03_aqs",
    "dresler03_aqs",
    "isabelle03_aqs",
    "gros03_aqs",
    "hammer03_aqs",
    "hoene03_aqs",
    "raake03_aqs",
    "ellermeier03_aqs",
    "dahlquist03_aqs",
    "zimmer03_aqs",
    "martens03_aqs",
    "larsson03_aqs",
    "silzle03_aqs",
    "braasch03_aqs",
    "schroeter03_aqs",
    "jokisch03_aqs",
    "rajman03_aqs",
    "pellegrini03_aqs",
    "hartikainen03_aqs",
    "hempel03_aqs"
   ]
  }
 ]
}