{
 "series": "Blizzard",
 "title": "The Blizzard Challenge 2014",
 "location": "Singapore, Singapore",
 "startDate": "19/09/2014",
 "endDate": "19/09/2014",
 "conf": "Blizzard",
 "name": "blizzard_2014",
 "year": "2014",
 "SIG": "SynSIG",
 "title1": "The Blizzard Challenge 2014",
 "booklet": "intro.pdf",
 "date": "19 September 2014",
 "month": 9,
 "day": 19,
 "now": 1714329259812603,
 "papers": {
  "prahallad14_blizzard": {
   "authors": [
    [
     "Kishore",
     "Prahallad"
    ],
    [
     "Anandaswarup",
     "Vadapalli"
    ],
    [
     "Santosh",
     "Kesiraju"
    ],
    [
     "Hema A",
     "Murthy"
    ],
    [
     "Swaran",
     "Lata"
    ],
    [
     "T.",
     "Nagarajan"
    ],
    [
     "Mahadeva",
     "Prasanna"
    ],
    [
     "Hemath",
     "Patil"
    ],
    [
     "Anil Kumar",
     "Sao"
    ],
    [
     "Simon",
     "King"
    ],
    [
     "Alan W",
     "Black"
    ],
    [
     "Keiichi",
     "Tokuda"
    ]
   ],
   "title": "The Blizzard Challenge 2014",
   "original": "01",
   "order": 1,
   "page_count": 14,
   "abstract": [
    "The Blizzard challenge 2014 was the tenth annual Blizzard challenge organized by the following group of institutions : IIIT Hyderabad, IIT Madras, DAIICT, SSN College of Engineering, IIT Mandi and IIT Guwahati with support and collaboration from DeitY, Government of India. This paper describes the tasks in the Blizzard challenge 2014. The tasks consisted of data from six Indian languages : Assamese, Gujarati, Hindi, Rajasthani, Tamil and Telugu. Seven participants from around the world used the speech data provided as well as the corresponding text transcriptions in UTF-8, to build synthetic voices, which were then evaluated by means of listening tests.\n"
   ],
   "p1": 1,
   "pn": 14,
   "doi": "10.21437/Blizzard.2014-1",
   "url": "blizzard_2014/prahallad14_blizzard.html"
  },
  "chen14_blizzard": {
   "authors": [
    [
     "Ling-Hui",
     "Chen"
    ],
    [
     "Zhen-Hua",
     "Ling"
    ],
    [
     "Yi-Qing",
     "Zu"
    ],
    [
     "Run-Qiang",
     "Yan"
    ],
    [
     "Yuan",
     "Jiang"
    ],
    [
     "Xian-Jun",
     "Xia"
    ],
    [
     "Ying",
     "Wang"
    ]
   ],
   "title": "The USTC System for Blizzard Challenge 2014",
   "original": "02",
   "order": 6,
   "page_count": 6,
   "abstract": [
    "This paper introduces the speech synthesis system developed by USTC for Blizzard Challenge 2014. Six Indian languages were evaluated this year, including Assamese, Gujarati, Hindi, Rajasthani, Tamil and Telugu. Two tasks were built for these languages: the mono-lingual task (IH1 hub task) and the multi-lingual task (IH2 spoken task). We submitted entries to both tasks in all languages. We submitted two entries for evaluation: the primary entry and the secondary entry. In our primary entry, a hidden Markov model (HMM)-based unit selection system was built for Hindi language and HMM-based parametric speech synthesis systems were built for the remaining five languages. In the secondary entry, only an HMM-based parametric speech synthesis system was built for Hindi language. The evaluation results show the effectiveness of our submitted systems.\n"
   ],
   "p1": 39,
   "pn": 44,
   "doi": "10.21437/Blizzard.2014-6",
   "url": "blizzard_2014/chen14_blizzard.html"
  },
  "chalamandaris14_blizzard": {
   "authors": [
    [
     "Aimilios",
     "Chalamandaris"
    ],
    [
     "Pirros",
     "Tsiakoulis"
    ],
    [
     "Sotiris",
     "Karabetsos"
    ],
    [
     "Spyros",
     "Raptis"
    ]
   ],
   "title": "The ILSP / INNOETICS Text-to-Speech System for the Blizzard Challenge 2014",
   "original": "03",
   "order": 7,
   "page_count": 5,
   "abstract": [
    "This paper describes the Speech Synthesis System entry for the Blizzard Challenge 2014 for INNOETICS and ILSP, along with the corresponding results and their analysis. We provide a description of the underlying system and techniques used in our TTS platform, as well as significant information about the voice building process. Based on the obtained results from the listening experiments, we attempt an evaluation of our system and the underlying methods. As this year’s challenge included only Indian languages, we attempt to make a comparison with last year’s results where the Blizzard Challenge introduced for the first time an Indian languages experimental hub. In the final section we provide a brief overview of our system’s performance for the last three Blizzard Challenges, aiming mainly to identify its overall evolution.\n"
   ],
   "p1": 45,
   "pn": 49,
   "doi": "10.21437/Blizzard.2014-7",
   "url": "blizzard_2014/chalamandaris14_blizzard.html"
  },
  "sawada14_blizzard": {
   "authors": [
    [
     "Kei",
     "Sawada"
    ],
    [
     "Shinji",
     "Takaki"
    ],
    [
     "Kei",
     "Hashimoto"
    ],
    [
     "Keiichiro",
     "Oura"
    ],
    [
     "Keiichi",
     "Tokuda"
    ]
   ],
   "title": "Overview of NITECH HMM-based text-to-speech system for Blizzard Challenge 2014",
   "original": "04",
   "order": 5,
   "page_count": 6,
   "abstract": [
    "This paper describes a hidden Markov model based text-to-speech (TTS) system developed at the Nagoya Institute of Technology (NITECH) for Blizzard Challenge 2014. The tasks of Blizzard Challenge 2014 are speech synthesis of six Indian languages and multilingual speech synthesis, i.e., Indian language and English. Only Indian language speech data and text are provided as training data. We focused on constructing a TTS system without the phoneme information and phoneset of the target Indian languages. The proposed method is able to construct sentences written in a language with a space between words. The results of a large-scale subjectivity evaluation are discussed.\n"
   ],
   "p1": 33,
   "pn": 38,
   "doi": "10.21437/Blizzard.2014-5",
   "url": "blizzard_2014/sawada14_blizzard.html"
  },
  "krishnan14_blizzard": {
   "authors": [
    [
     "Raghava",
     "Krishnan"
    ],
    [
     "Aswin Shanmugam",
     "Subramanian"
    ],
    [
     "Anusha",
     "Prakash"
    ],
    [
     "G R",
     "Kasthuri"
    ],
    [
     "Hema A",
     "Murthy"
    ]
   ],
   "title": "IIT Madras's Submission to the Blizzard Challenge 2014",
   "original": "05",
   "order": 2,
   "page_count": 6,
   "abstract": [
    "This paper details the work done by IIT Madras team for the Blizzard Challenge 2014. Two sets of tasks were given - the Hub tasks and the Spoke tasks. The details of the efforts put in to complete the Hub tasks have been presented in this paper. 2-3 hours of speech data along with text in utf-8 format were given. Two text to speech synthesis (TTS) systems - Unit selection synthesis (USS) and Hidden Markov Model based speech synthesis systems (HTS), were submitted for every language, except Assamese. Systems “I” are the primary systems and system “H” are the secondary systems. Syllables and phones were used as the basic units in USS and HTS systems, respectively. Techniques to develop letter to sound rules, predict prosodic phrase breaks, and perform syllable-level and phoneme-level segmentation have been described. To build speech synthesis systems for six Indian languages, a unified framework based on the common phone set and the common question set was used.\n",
    "Modifications made to the system, post-submission of synthetic speech to the Blizzard Challenge, have also been briefly described.\n"
   ],
   "p1": 15,
   "pn": 20,
   "doi": "10.21437/Blizzard.2014-2",
   "url": "blizzard_2014/krishnan14_blizzard.html"
  },
  "rajaram14_blizzard": {
   "authors": [
    [
     "B S R",
     "Rajaram"
    ],
    [
     "H R",
     "Shiva Kumar"
    ],
    [
     "A G",
     "Ramakrishnan"
    ]
   ],
   "title": "MILE TTS for Tamil for blizzard challenge 2014",
   "original": "06",
   "order": 3,
   "page_count": 7,
   "abstract": [
    "Our participation in the Blizzard Challenge 2014 is only for the Tamil language. We have a unit selection based concatenative speech synthesis system. Sentence level viterbi search is used to select the reliable speech units among a set of candidate units. The given RD (reading), SUS (semantically unpredictable sentences) and ML (multi‐lingual) test sentences are synthesized using the corpus made available for the participants. The listening test results reported by the blizzard evaluation team are discussed. The letter code for MILE TTS is “J”.\n"
   ],
   "p1": 21,
   "pn": 27,
   "doi": "10.21437/Blizzard.2014-3",
   "url": "blizzard_2014/rajaram14_blizzard.html"
  },
  "suni14_blizzard": {
   "authors": [
    [
     "Antti",
     "Suni"
    ],
    [
     "Tuomo",
     "Raitio"
    ],
    [
     "Dhananjaya",
     "Gowda"
    ],
    [
     "Reima",
     "Karhila"
    ],
    [
     "Matt",
     "Gibson"
    ],
    [
     "Oliver",
     "Watts"
    ]
   ],
   "title": "The Simple4All entry to the Blizzard Challenge 2014",
   "original": "07",
   "order": 4,
   "page_count": 5,
   "abstract": [
    "We describe the synthetic voices entered into the 2014 Blizzard Challenge by the SIMPLE4ALL consortium. The 2014 Blizzard Challenge presents an opportunity to test and benchmark some of the tools we have been developing to address the problem of how to produce systems in arbitrary new  with minimal annotated data and language-specific expertise on the part of the system builders. We here explain how our tools were used to address these problems on the different tasks of the challenge, and provide some discussion of the evaluation results. Several additions to the system used to build voices for the previous Challenge are described: naive alphabetisation, unsupervised syllabification, and glottal flow pulse prediction using deep neural networks.\n"
   ],
   "p1": 28,
   "pn": 32,
   "doi": "10.21437/Blizzard.2014-4",
   "url": "blizzard_2014/suni14_blizzard.html"
  }
 },
 "sessions": [
  {
   "title": "Summary of results",
   "papers": [
    "prahallad14_blizzard"
   ]
  },
  {
   "title": "System Presentations 1",
   "papers": [
    "krishnan14_blizzard",
    "rajaram14_blizzard"
   ]
  },
  {
   "title": "System Presentations 2",
   "papers": [
    "suni14_blizzard",
    "sawada14_blizzard",
    "chen14_blizzard",
    "chalamandaris14_blizzard"
   ]
  }
 ],
 "doi": "10.21437/Blizzard.2014"
}
