{
 "series": "DiSS",
 "title": "Disfluency in Spontaneous Speech (DiSS) Workshop 2023",
 "location": "Bielefeld, Germany",
 "startDate": "28/8/2023",
 "endDate": "30/8/2023",
 "URL": "https://www.uni-bielefeld.de/fakultaeten/linguistik-literaturwissenschaft/forschung/fachbereich/phonetik/diss-workshop23/index.xml",
 "chair": "Chairs: Simon Betz, Bogdan Ludusan and Petra Wagner",
 "conf": "DiSS",
 "year": "2023",
 "name": "diss_2023",
 "SIG": "",
 "title1": "Disfluency in Spontaneous Speech",
 "title2": "(DiSS) Workshop 2023",
 "booklet": "intro.pdf",
 "date": "28-30 August 2023",
 "papers": {
  "crible23_diss": {
   "authors": [
    [
     "Ludivine",
     "Crible"
    ]
   ],
   "title": "Discourse markers and filled pauses: how disfluent are they?",
   "original": "invited01",
   "page_count": 1,
   "order": 1,
   "p1": 1,
   "pn": 1,
   "abstract": [
    "Discourse markers such as you know or well have been considered signs of poor language performance (\"fillers\", \"smallwords\") for a long time. Those days are over. The large body of corpus-based and, more recently, psycholinguistic research into their behavior has highlighted the many benefits they present for production and comprehension, showing in particular their discourse-structuring and forewarning effects. It remains that (some) discourse markers have a special connection with disfluencies and are often perceived as such. A similar ambivalence has been found for filled pauses (uh, uhm), either treated as symptoms or signals, or even as words in their own right. Discourse markers and filled pauses indeed share several characteristics, which makes them prone to navigate the continuum between fluency and disfluency. The question thus arises: how disfluent are they? In this talk, I will explore the fluency-disfluency continuum and answer this question through a cognitive-functional perspective supported by corpus-based and experimental evidence on English and French data.\n"
   ]
  },
  "trouvain23_diss": {
   "authors": [
    [
     "Jürgen",
     "Trouvain"
    ]
   ],
   "title": "More than UH and UM – A phonetician's view on fillers in speech",
   "original": "invited02",
   "page_count": 1,
   "order": 2,
   "p1": 2,
   "pn": 2,
   "abstract": [
    "Studies on disfluencies in spontaneous speech very often focus on non-lexical fillers which are usually denoted as UH, and if applicable UM (or similar spellings) — depending on whether the filler syllable consists of a single vowel or a vowel plus nasal consonant. It seems rather usual to consider UH and UM as homogeneous building blocks, as for instance in annotation of an imaginary disfluency like \"I bring here some UH really astonishing news\". In the majority of studies, including descriptive, corpus analytical and experimental studies, the phonetic substance of fillers remains ignored. However, it is the phonetic set-up of the filler and its phonetic context that determines its perception. For instance, there are varying degrees of perceptual salience: some filler realisations can be so volatile that they slip the attention of listeners (including corpus annotators), while other instances of fillers can be extremely prominent so that they can dominate the entire message (sometimes in experimental studies). Usually, it is not considered whether UH and UM is produced within the fluent articulatory stream, i.e. without any pause around, or whether a pause is present before and/or after the filler. The pause context can have a substantial impact on the perception of filler syllables, e.g. by a shortening effect in fluent stretches of articulation. It can be assumed that in those cases coarticulation is at work as well, making the flow of syllables much less interruptive for the listener and less effortful to produce for the speaker. A closer look at vowel quality reveals that UH and UM show much more variation than just the schwa-like central vowel and that is obviously language-dependent. For instance, Spanish tend to have a fronted vowel for UH, whereas UH in English shows a more open vowel quality than in German, and French more roundedness than UH in other languages. The usage of a non-modal voice quality such as creaky voice with irregular vocal fold vibrations can be observed quite often in fillers. Although infrequently described and annotated, the different forms of glottalization have a substantial effect on the fundamental frequency and the intensity of the fillers and thus to the perception of pitch and loudness and its interpretation as salient. It remains open for the moment whether creaky voice in fillers has a direct link to specific functions of this filler such as signalling doubt. In summary, it is argued that it might be important to take phonetic variation into account, a variation that goes far beyond the simple distinction in UH and UM. In this talk examples from various languages, such as German, English, Spanish, Portuguese and Bulgarian, and across speech modes will be given, including speech from second language learners, disfluent speakers, and simultaneous interpreters.\n"
   ]
  },
  "cantarutti23_diss": {
   "authors": [
    [
     "Marina",
     "Cantarutti"
    ],
    [
     "Richard",
     "Ogden"
    ],
    [
     "Pavel",
     "Šturm"
    ],
    [
     "Jürgen",
     "Trouvain"
    ]
   ],
   "title": "Laughing in interaction: How phonetic details can coordinate action sequences",
   "original": "02",
   "page_count": 5,
   "order": 10,
   "p1": 38,
   "pn": 42,
   "abstract": [
    "The natural home of laughter is in interaction. In this paper, we explore cases of laughter as a joint production, and examine the phonetic resources available to the interactants to manage the temporal coordination of their laughter. We show that participants in spoken interaction can make use of the rhythmic and 'intonational' affordances of laughter to manage aspects of its unfolding in time, and its relation to subsequent talk. We thus approach laughter dialogically and consider how participants in interaction treat one another’s laughter moment-by-moment.\n"
   ],
   "doi": "10.21437/DiSS.2023-8"
  },
  "bona23_diss": {
   "authors": [
    [
     "Judit",
     "Bóna"
    ],
    [
     "Ágnes",
     "Hámori"
    ]
   ],
   "title": "Filled pauses in child-adult conversations: Data from 5- and 9-year old Hungarian children",
   "original": "03",
   "page_count": 4,
   "order": 14,
   "p1": 58,
   "pn": 61,
   "abstract": [
    "In this study, we investigate the use of filled pauses in the speech of children aged 5 to 9 during their conversations with adults. We also analyzed the frequency, form and duration of filled pauses and whether they occur at the beginning of turns or within turns. Results show that 5-year-olds produce longer filled pauses than 9-year-olds, and they produce them more frequently. In both age groups, the use of filled pauses in turn-starting was common, allowing the child to take the turn even when the preparation for speech production is not yet fully complete.\n"
   ],
   "doi": "10.21437/DiSS.2023-12"
  },
  "silbervarod23_diss": {
   "authors": [
    [
     "Vered",
     "Silber-Varod"
    ],
    [
     "Oliver",
     "Niebuhr"
    ],
    [
     "Loredana",
     "Schettino"
    ],
    [
     "Plinio A.",
     "Barbosa"
    ]
   ],
   "title": "Cultural differences of gaps and overlapping speech in political interviews",
   "original": "05",
   "page_count": 5,
   "order": 3,
   "p1": 3,
   "pn": 7,
   "abstract": [
    "This cross-language study aims to examine both expected and unexpected communication phenomena of silence intervals and overlapping speech events, respectively. Specifically, we investigate these interaction patterns in relation to speakers' self-pauses, considering their relative frequency and duration. Our research holds significance in offering cross-linguistic insights, which we accomplish by analyzing the behavior of politicians and TV hosts during political interview panels in four languages: Brazilian Portuguese, German, Hebrew, and Italian. Our findings reveal linguistic (and potentially cultural) differences in the timing of turn taking in the interviews. Notably, Israeli and Italian politicians exhibit quicker responses and comments compared to their counterparts in German and Brazilian Portuguese languages, who demonstrate a tendency for larger gaps before a turn is taken. Moreover, Hebrew and Italian speakers engage in more frequent overlapping speech, interrupting their interlocutors' turns, in contrast to German and Brazilian Portuguese speakers. Building upon these results, we propose silence-based definitions for two conversational styles: \"high involvement\" languages and \"high considerateness\" languages (Tannen, 1994), also conceptualized as \"word cultures\" and \"silence cultures\" by Agliati et al. (2005).\n"
   ],
   "doi": "10.21437/DiSS.2023-1"
  },
  "bakti23_diss": {
   "authors": [
    [
     "Mária",
     "Bakti"
    ],
    [
     "Judit",
     "Bóna"
    ]
   ],
   "title": "Silent pauses and disfluencies in consecutively interpreted Hungarian speech",
   "original": "06",
   "page_count": 4,
   "order": 15,
   "p1": 62,
   "pn": 65,
   "abstract": [
    "Research into fluency in interpreted target language texts has received considerable research attention in Interpreting Studies for two reasons: first, fluency plays a key role in the evaluation of interpreter performance in training and by the target audience, and, second, it contributes to a better understanding of the covert processes of speech planning during interpreting. The aim of this paper is to map the frequency of occurrence of silent pauses, filled pauses and lengthenings in the consecutively interpreted Hungarian target language output of interpreter trainees. As part of a longitudinal study, recordings were made of the students' consecutive interpreting performance at the end of the second, third and fourth semesters of a 4-semester master’s program in translation and interpreting. Our results indicate that there were no significant changes in the frequency of occurrence of disfluencies in the target language output of students in the recordings made at different stages of interpreter training. However, the average duration of filled pauses in the interpreted target language texts decreased significantly as students progressed in their training.\n"
   ],
   "doi": "10.21437/DiSS.2023-13"
  },
  "peltonen23_diss": {
   "authors": [
    [
     "Pauliina",
     "Peltonen"
    ],
    [
     "Loulou",
     "Kosmala"
    ],
    [
     "Sandra",
     "Götz"
    ],
    [
     "Pekka",
     "Lintunen"
    ]
   ],
   "title": "The interplay between speech fluency and gesture in L1 Finnish and L2 English task-based interactions",
   "original": "07",
   "page_count": 5,
   "order": 4,
   "p1": 8,
   "pn": 12,
   "abstract": [
    "In second language (L2) fluency research, (dis)fluencies are often examined from monologue speech without reference to the speakers' visual-gestural behavior or first language (L1) data. However, research on L1 and L2 gestures has revealed an intricate relationship between gestures and (dis)fluency, underscoring the need for more research on the topic. Extending these two lines of research, this pilot study examines the interplay between speech fluency and gesture in L1 Finnish and L2 English task-based interactions (N = 8). The data were collected as part of a larger project. The fluency-related features (fluencemes) examined in the present study included silent and filled pauses, prolongations, and four repair features. The functional gesture types included referential (deictic and representational) and pragmatic (discursive, interactive, and thinking) gestures. The gestures were also coded for the degree of overlap (full, partial, or no overlap) with fluencemes. Our results showed that the gestures and fluencemes were more frequently produced in the L2 than in the L1, but the distributions of gesture and fluenceme types were relatively similar across L1 and L2 interactions. The majority of gestures did not overlap with fluencemes, corroborating previous findings. The findings have implications for L2 speech fluency and gesture research.\n"
   ],
   "doi": "10.21437/DiSS.2023-2"
  },
  "paschen23_diss": {
   "authors": [
    [
     "Ludger",
     "Paschen"
    ]
   ],
   "title": "Filled pauses and false starts do not reliably preface longer or more complex utterances across typologically diverse languages",
   "original": "08",
   "page_count": 5,
   "order": 5,
   "p1": 13,
   "pn": 17,
   "abstract": [
    "Disfluencies such as fillers and false starts provide a window into the cognitive processes underlying speech planning. One of the reasons for the occurrence of disfluencies is increased processing load due to the size or complexity of an upcoming utterance. Previous research indicates that disfluencies correlate with an above-average size of following utterances. This paper tests this hypothesis by comparing the size of inter-pausal units that follow a disfluency with those that do not, based on a sample of 51 diverse languages from a language documentation corpus. Results suggest that the presence of disfluencies has little to no effect on the size or complexity of upcoming utterances, be they measured in phonological or morphological terms. A discussion of potential alternative explanations is offered.\n"
   ],
   "doi": "10.21437/DiSS.2023-3"
  },
  "duran23_diss": {
   "authors": [
    [
     "Daniel",
     "Duran"
    ],
    [
     "Stefanie",
     "Jannedy"
    ]
   ],
   "title": "Register differences in ÄH–ÄHM filler particles?",
   "original": "09",
   "page_count": 5,
   "order": 12,
   "p1": 48,
   "pn": 52,
   "abstract": [
    "We present an analysis of register variation (i.e. conventionalized and socially recurring linguistic patterns of intra-individual speech behaviour) of filler particles in German spontaneous speech in contrasting situated interactions. In this study, we analyse intra- and inter-individual differences in the use of lexical type of filler particles and their phonetic realizations. Data was elicited with a novel method where participants talk to a video-taped interlocutor in a simulated tele-conference. This set-up allows us to systematically and consistently manipulate the experimental condition while eliciting laboratory induced differences in fine phonetic detail. We find evidence for register differences but also a high inter-individual variability.\n"
   ],
   "doi": "10.21437/DiSS.2023-10"
  },
  "sacks23_diss": {
   "authors": [
    [
     "Dan",
     "Sacks"
    ],
    [
     "Gideon E.",
     "Anholt"
    ]
   ],
   "title": "Preliminary thoughts on the role of disfluencies in psychotherapy skill acquisition",
   "original": "10",
   "page_count": 5,
   "order": 8,
   "p1": 28,
   "pn": 32,
   "abstract": [
    "Psychotherapy is widely recognized as an effective treatment for various mental disorders, and therapists undergo extensive training to obtain qualifications. However, research suggests that therapists' performance does not improve over time despite ongoing education and training. The lack of a reliable measure of skill proficiency in psychotherapy may be a contributing factor, hindering the development of effective training methods. Traditional measures of speed and accuracy are inadequate for assessing skill automatization in psychotherapy. To address this issue, we propose a new method for evaluating skill acquisition in psychotherapy using verbal disfluencies measures. Verbal disfluencies have shown promise in assessing skill development in other fields, such as public speaking and marketing. We argue that changes in patterns of verbal disfluencies can provide valuable insights into the automatization of skills in psychotherapy.\n"
   ],
   "doi": "10.21437/DiSS.2023-6"
  },
  "niculescu23_diss": {
   "authors": [
    [
     "Oana",
     "Niculescu"
    ],
    [
     "Maria",
     "Candea"
    ]
   ],
   "title": "Exploring (dis)fluency patterns of identical repetitions in Romanian spontaneous speech",
   "original": "11",
   "page_count": 5,
   "order": 16,
   "p1": 66,
   "pn": 70,
   "abstract": [
    "This paper offers a preliminary analysis of identical repetitions in terms of frequency, distribution and temporal patterns in Romanian spontaneous speech. The study in carried out on a recently developed Romanian speech corpus suited for analyses at the interface between phonetics and laboratory phonology. Six hours of addressed monologues from six adult native speakers (3F/3M) were examined, resulting in 737 repetitions as immediate repeats, with 69% of the data pertaining to male speakers and 31% to female speakers. Our research questions revolve around the complex interplay between identical repetitions (IRs), silent pauses (#) and filler particles (FPs). The results show both cross-linguistic similarities and differences in terms of distribution and duration patterns of IRs, individualizing Romanian in the context of both Romance and Germanic languages. An important contribution of this current study is that it broadens our understanding of (dis)fluencies based on a lesser-documented European language.\n"
   ],
   "doi": "10.21437/DiSS.2023-14"
  },
  "ludusan23_diss": {
   "authors": [
    [
     "Bogdan",
     "Ludusan"
    ]
   ],
   "title": "The usefulness of phonetically-motivated features for automatic laughter detection",
   "original": "13",
   "page_count": 5,
   "order": 9,
   "p1": 33,
   "pn": 37,
   "abstract": [
    "The acoustic characteristics of laughter have been extensively investigated in speech sciences. However, despite the ability of several acoustic cues to discriminate between laughter and speech, the degree to which these are used in automatic systems varies. We analyze here the usefulness of four prosodic features: intensity, fundamental frequency, cepstral peak prominence (describing voice quality) and modulation spectrum (characterizing rhythm) for the automatic detection of laughter. We tested four machine learning algorithms on features extracted at the syllable-level, considering also their derivative values. The results showed that using a few highly discriminating features returns a similar or better performance than that of systems employing a larger feature set or more complex learning algorithms. Moreover, a feature importance analysis revealed that the voice quality and rhythm-related measurements, less commonly used in automatic laughter detection systems, are better at discriminating between laughter and speech than traditional ones, such as intensity and fundamental frequency.\n"
   ],
   "doi": "10.21437/DiSS.2023-7"
  },
  "mazzocconi23_diss": {
   "authors": [
    [
     "Chiara",
     "Mazzocconi"
    ],
    [
     "Benjamin",
     "O'Brien"
    ],
    [
     "Thierry",
     "Chaminade"
    ]
   ],
   "title": "How do you laugh in an fMRI scanner? Laughter distribution, mimicry and acoustic analysis",
   "original": "14",
   "page_count": 5,
   "order": 11,
   "p1": 43,
   "pn": 47,
   "abstract": [
    "The current study analyses laughter distribution, pragmatic use, and acoustic features in a multimodal conversation corpus, where one of the interlocutor had brain activity recorded with functional MRI. Particular focus is on the analysis of mimicking and non-mimicking laughter, as we hypothesized that the former might involve different neural pathways in comparison to latter, and a spectrotemporal modulation analysis was selected to evaluate the acoustic differences between them. The goals of our investigation are (1) to validate the corpus as ecological in terms of laughter production prior to evaluating neurophysiological correlates of laughter production and perception in conversational interactions, (2) to compare mimicking and non-mimicking laughter in terms of acoustic features, and (3) to evaluate which features need to be taken in account for our forthcoming analysis of fMRI data. Despite the unconventional recording conditions, laughter production and use results are comparable to those observed in face-to-face interactions. Mimicking laughter has significantly increased temporal modulations in comparison to non-mimicking laughter, however, no differences are observed in the spectral modulation domain. Our findings suggest that mimicking laughter might be related to different underpinning neuro-psychological processes on which we plan on gaining insight through future neural-correlate analysis.\n"
   ],
   "doi": "10.21437/DiSS.2023-9"
  },
  "belz23_diss": {
   "authors": [
    [
     "Malte",
     "Belz"
    ],
    [
     "Miriam",
     "Müller"
    ],
    [
     "Christine",
     "Mooshammer"
    ]
   ],
   "title": "How consistent are non-native speakers in their usage of filler particles when talking to native speakers?",
   "original": "15",
   "page_count": 5,
   "order": 13,
   "p1": 53,
   "pn": 57,
   "abstract": [
    "This paper investigates the intra-individual consistency in the production of filler particle frequencies and forms. The data consist of five non-native (L2) mid to high proficient speakers of German with English as first language. Each L2 speaker converses with five different German native (L1) speakers in task-based dialogues. The results show that the L2 speakers are rather consistent in the use of FP frequencies and forms across the five dialogues, with no obvious alignment for static measures such as mean FP frequency or the proportion of vocalic-nasal and nasal FP forms. When tracing their relative FP frequencies over the course of the dialogue, some L2 speakers show convergence to L1, while others remain persistent. The data thus partly undergird the speaker-specificity of filler particles. It remains open whether observed convergence between L1 and L2 speakers in this data is due to alignment or happening coincidentally.\n"
   ],
   "doi": "10.21437/DiSS.2023-11"
  },
  "schettino23_diss": {
   "authors": [
    [
     "Loredana",
     "Schettino"
    ],
    [
     "Robert",
     "Eklund"
    ]
   ],
   "title": "Prolongation in Italian",
   "original": "16",
   "page_count": 5,
   "order": 19,
   "p1": 81,
   "pn": 85,
   "abstract": [
    "This study follows the framework set by the strand of corpus studies aimed at investigating and unveiling the role of prolongations as linguistic elements by comparing their use in different languages, ranging from Germanic languages (Swedish, American English, German) to Tok Pisin, Chinese Mandarin, Hungarian and Hebrew, and provides evidence on the use of prolongation in a Romance language, namely Italian. The analysis is conducted on different speech styles, i.e., descriptive informal dialogic speech as well as informative monologic speech, and concerns the distributional characterisations of prolongation phenomena, their segmental and durational traits also considering the comparison with another type of voiced speech management phenomena, that is non-verbal vocalisations. The main results show that in the considered Italian data speakers use prolongations more frequently than non-verbal vocalisations and the latter are generally longer, which argues for the fact that these two voiced phenomena are differently involved in speech management. Then, the distributional and segmental features of prolongations in Italian as compared to other languages support the idea that prolongations, as linguistic elements, are subjected, to a certain extent, to the phonotactic constraints of languages.\n"
   ],
   "doi": "10.21437/DiSS.2023-17"
  },
  "schettino23b_diss": {
   "authors": [
    [
     "Loredana",
     "Schettino"
    ],
    [
     "Marta",
     "Maffia"
    ],
    [
     "Rosa",
     "De Micco"
    ],
    [
     "Alessandro",
     "Tessitore"
    ]
   ],
   "title": "Disfluency and speech management in Italian patients with early-stage Parkinson's Disease",
   "original": "17",
   "page_count": 5,
   "order": 7,
   "p1": 23,
   "pn": 27,
   "abstract": [
    "Parkinsonian speech has often been described as \"disfluent\". However, the specific nature of disrupted speech in Parkinson’s Disease (PD) patients has not been well observed. Considering that pauses, fillers, repetitions and self-repairs are commonly used in spontaneous speech for managing and monitoring the own speech production, this study aims at investigating the characteristics of disfluency phenomena patterns in early-stage PD subjects. To reach this goal, the monological speech of 18 PD patients and 18 age- and sex-matched healthy subjects, all Italian native speakers, was annotated distinguishing between Forward-Looking Disfluencies, such as silent pauses, lexical and non-verbal fillers and prolongations, through which message delivery is suspended for planning, and Backward-Looking Disfluencies, such as repetitions, insertions, deletions and substitutions, used by the speaker to edit something already uttered. Pathological and healthy speech samples were compared with reference to four parameters: the number and frequency of disfluencies; their specific functions; the syntactic positioning of the items; the duration of silent pauses, filled pauses and lengthening. Results highlight the relevance of investigating the specific uses, types and characteristics of disfluency phenomena rather than just considering their frequency of occurrence to gain insight into the features of Parkinsonian speech, even at a very early stage.\n"
   ],
   "doi": "10.21437/DiSS.2023-5"
  },
  "williams23_diss": {
   "authors": [
    [
     "Simon",
     "Williams"
    ],
    [
     "Claire",
     "Lancaster"
    ],
    [
     "Clea",
     "Tanner"
    ]
   ],
   "title": "Inhibitory Control and the production of disfluencies in speakers with Alzheimer’s Disease",
   "original": "18",
   "page_count": 5,
   "order": 6,
   "p1": 18,
   "pn": 22,
   "abstract": [
    "This paper presents preliminary findings from a longitudinal study that investigates the ability of speakers diagnosed with Alzheimer's Disease (AD) to manage distractions and the same speakers' production of hesitations in semi-spontaneous speech. Previous research has found that two kinds of hesitation: silent pauses and reformulations, are significantly influenced by inhibitory control in healthy second language learners. Silent pauses are also well-known linguistic markers of disease progression in people living with AD and may evidence a speaker's production problems, whereas reformulations promote the joint discourse. Inhibitory control is therefore associated with disfluencies that are personal and social. It was hypothesised that first language speakers with a diagnosis of AD would make fewer reformulations and produce more silent pauses relative to healthy individuals. Data that included a Stroop task, a two-minute monologue, and a two-minute category fluency task were collected and analysed from 11 participants with AD and 13 healthy Controls. In AD participants, only the number of silent pauses correlated with the Stroop task, while reformulations correlated with the MoCA, and silent pause duration with the MoCA and category fluency task, suggesting that the effects of disease-related cognitive decline rather than competing information were responsible for the lack of fluency.\n"
   ],
   "doi": "10.21437/DiSS.2023-4"
  },
  "wu23_diss": {
   "authors": [
    [
     "Yaru",
     "Wu"
    ],
    [
     "Ivana",
     "Didirková"
    ],
    [
     "Anne-Catherine",
     "Simon"
    ]
   ],
   "title": "Disfluencies in continuous speech in French: Prosodic parameters of filled pauses and vowel lengthening",
   "original": "19",
   "page_count": 5,
   "order": 18,
   "p1": 76,
   "pn": 80,
   "abstract": [
    "This study examines prosodic parameters in two types of disfluencies, vowel lengthenings, and filled pauses. We analyzed approximately 2.5 hours of continuous speech representing 11 different speech genres, including prepared, semi-prepared, and unprepared speech. Mean fundamental frequency (f0) and pitch resets were analyzed to compare the prosodic correlates of disfluent (e.g., lengthenings, filled pauses) syllables with their surrounding fluent syllables as a function of the degree of speech preparation. The results show that the average fundamental frequency is lower in filled pauses and disfluent vowel lengthenings than in fluent speech. Furthermore, filled pauses are produced with a lower f0 than vowel lengthening. Larger pitch resets are observed between disfluent units and their preceding contexts, and both filled pauses and prolongations depend on the degree of preparation of the discourse. The duration of vowel lengthening tends to be longer than that of filled pauses.\n"
   ],
   "doi": "10.21437/DiSS.2023-16"
  },
  "jabeen23_diss": {
   "authors": [
    [
     "Farhat",
     "Jabeen"
    ],
    [
     "Petra",
     "Wagner"
    ]
   ],
   "title": "Variability in hesitations in Punjabi semi-spontaneous narrative speech: An automatic clustering based analysis",
   "original": "20",
   "page_count": 5,
   "order": 17,
   "p1": 71,
   "pn": 75,
   "abstract": [
    "This research offers a first analysis of hesitations in Punjabi, an under-researched language, in conjunction with a cross-linguistic comparison. We show speaker related variation in the frequency of hesitations in Punjabi. Variability was also observed in the form of filled pauses which comprised vowels or vowel-consonant sequences with nasals or obstruents. The vowels in filled pauses differed based on their segmental context and individual speakers. Automatic clustering showed that (lexicalized) filled pauses were grouped by F0 register, instead of F0 contour. These results (1) have cross-linguistic significance and (2) provide insights for modeling hesitations in speech technological systems.\n"
   ],
   "doi": "10.21437/DiSS.2023-15"
  }
 },
 "sessions": [
  {
   "title": "Keynote: Ludivine Crible",
   "papers": [
    "crible23_diss"
   ]
  },
  {
   "title": "Keynote: Jürgen Trouvain",
   "papers": [
    "trouvain23_diss"
   ]
  },
  {
   "title": "Crosslinguistic Studies",
   "papers": [
    "silbervarod23_diss",
    "peltonen23_diss",
    "paschen23_diss"
   ]
  },
  {
   "title": "Clinical Aspects",
   "papers": [
    "williams23_diss",
    "schettino23b_diss",
    "sacks23_diss"
   ]
  },
  {
   "title": "Laughter",
   "papers": [
    "ludusan23_diss",
    "cantarutti23_diss",
    "mazzocconi23_diss"
   ]
  },
  {
   "title": "Fillers",
   "papers": [
    "duran23_diss",
    "belz23_diss",
    "bona23_diss"
   ]
  },
  {
   "title": "Disfluency in Various Languages",
   "papers": [
    "bakti23_diss",
    "niculescu23_diss",
    "jabeen23_diss"
   ]
  },
  {
   "title": "Lengthening",
   "papers": [
    "wu23_diss",
    "schettino23_diss"
   ]
  }
 ],
 "doi": "10.21437/DiSS.2023"
}