{
 "title": "ITRW on Disfluency in Spontaneous Speech (DiSS 2001)",
 "location": "Edinburgh, Scotland, UK",
 "startDate": "29/8/2001",
 "endDate": "31/8/2001",
 "conf": "DiSS",
 "year": "2001",
 "name": "diss_2001",
 "series": "DiSS",
 "SIG": "",
 "title1": "ITRW on Disfluency in Spontaneous Speech",
 "title2": "(DiSS 2001)",
 "date": "29-31 August 2001",
 "papers": {
  "rodriguez01_diss": {
   "authors": [
    [
     "L. J.",
     "Rodríguez"
    ],
    [
     "I.",
     "Torres"
    ],
    [
     "A.",
     "Varona"
    ]
   ],
   "title": "Annotation and analysis of disfluencies in a spontaneous speech corpus in Spanish",
   "original": "dis1_001",
   "page_count": 4,
   "order": 1,
   "p1": "1",
   "pn": "4",
   "abstract": [
    "A new database consisting of 227 dialogues in Spanish was annotated with disfluencies. Then a detailed analysis of the annotations was carried out. The database had been recorded according to the well known Wizard of Oz paradigm. Seventy-five speakers were given each one three different scenarios to make queries about timetables, prices and other conditions of train travels between two spanish cities. The notion of disfluency was relaxed to include any acoustic, lexical or syntactic feature that distinguises spontaneous from read speech. A specific XML annotation scheme was developed. A simple text editor was used to insert marks, and a specific parser was implemented to find errors in annotations. The analysis of annotations revealed that disfluencies were not uniformly distributed among either user turns or speakers. Most disfluencies were grouped into certain user turns, especially the first one. On the other hand, some speakers were remarkably more prone to hesitate, repeat or correct fragments of speech than others.\n",
    ""
   ]
  },
  "eklund01_diss": {
   "authors": [
    [
     "Robert",
     "Eklund"
    ]
   ],
   "title": "Prolongations: A dark horse in the disfluency stable",
   "original": "dis1_005",
   "page_count": 4,
   "order": 2,
   "p1": "5",
   "pn": "8",
   "abstract": [
    "This paper studies a specific type of disfluency, viz. segment prolongation (PR), i.e., the \"stretching out\" of speech sounds as a means of hesitation. It is shown that the occurrence of PRs varies as a function of phone type, position in the word, lexical factors and word class, and that PRs are subject to phonotactic constraints in Swedish. A comparison between Swedish and Tok Pisin suggests that there are language specific traits associated with PR production.\n",
    ""
   ]
  },
  "howell01_diss": {
   "authors": [
    [
     "Peter",
     "Howell"
    ],
    [
     "James",
     "Au-Yeung"
    ]
   ],
   "title": "Application of EXPLAN theory to spontaneous speech control",
   "original": "dis1_009",
   "page_count": 5,
   "order": 3,
   "p1": "9",
   "pn": "12",
   "abstract": [
    "Problems for theories that explain speech errors by a monitoring process are discussed. EXPLAN theory is based on a proposal about planning and execution time, not on how errors arise. This theory is outlined and support from characteristics of fluency failure and altered feedback studies given.\n",
    ""
   ]
  },
  "vasic01_diss": {
   "authors": [
    [
     "Nada",
     "Vasic"
    ],
    [
     "Frank",
     "Wijnen"
    ]
   ],
   "title": "Stuttering and speech monitoring",
   "original": "dis1_013",
   "page_count": 4,
   "order": 4,
   "p1": "13",
   "pn": "16",
   "abstract": [
    "In this paper, we would like to argue that stuttering represents inadequate monitoring of the speech production process. The model we are proposing is the vicious circle hypothesis. The stuttering speaker has a malfunctioning monitor whose three parameters, namely focus, effort, and threshold are inappropriately set.\n",
    "In order to test our hypothesis, we tested 20 stuttering individuals in a dual task situation. The experiment consisted of three conditions: baseline where semi-spontansous speech was elicited and two dual-task conditions. First dual task was speaking and playiong a computer game at the same time where the processing resources were taken away from monitoring. The second dual task waqs designed to shift the monitor's focus away from habitual monitoring. Subjects were asked to monitor for a particular word in their speech. The preliminary results for our expeiment show that in the dual task condition the number of disfluencies decreased in relation to the number of words, which, in turn supports our prediction that distraction has a positive effect on fluency in the case of stuttering individuals.\n",
    ""
   ]
  },
  "yoshida01_diss": {
   "authors": [
    [
     "Michiko",
     "Yoshida"
    ]
   ],
   "title": "Repeated phoneme effect in Japanese speech errors",
   "original": "dis1_017",
   "page_count": 4,
   "order": 5,
   "p1": "17",
   "pn": "20",
   "abstract": [
    "Analyses of errors in the natural speech of Dutch, German, and English have shown that involuntary rearrangements of phonemes (e.g., left hemisphere heft lemisphere) are more likely to occur when the two words involved in the error have the same phoneme before or after the phoneme on which the error occurred (e.g., /E/ in left hemisphere) [1, 2]. A study by Dell (1984) has revealed that phoneme repetition could also contribute to experimentally induced speech errors in English [3]. The present study explored the effect of repeated phonemes in Japanese speech errors by means of two errorinducing experiments. Analyses of subjects errors showed that a sequence of syllables that share the same phoneme was more error-prone than one with a variety of phonemes, suggesting that phoneme repetition could contribute to Japanese speech errors. These results are consistent with the view that the repeated phoneme effect is common to all speakers regardless of language.\n",
    ""
   ]
  },
  "nooteboom01_diss": {
   "authors": [
    [
     "Sieb G.",
     "Nooteboom"
    ]
   ],
   "title": "Different sources of lexical bias and overt self-corrections",
   "original": "dis1_021",
   "page_count": 4,
   "order": 6,
   "p1": "21",
   "pn": "24",
   "abstract": [
    "In this paper it is argued, on the basis of a quantitative analysis of spontaneous speech errors and their corrections in Dutch, that the mechanism leading to lexical bias in speech errors cannot be same as that leading to overt self-corrections. Although spontaneous speech errors show a strong lexical bias, overt self-corrections do not. Lexical bias strongly increases with dissimilarity between target phoneme and source phoneme No such effect is found in overt selfcorrections. Several possible sources of these differences are discussed.\n",
    ""
   ]
  },
  "den01_diss": {
   "authors": [
    [
     "Yasuharu",
     "Den"
    ]
   ],
   "title": "Are word repetitions really intended by the speaker?",
   "original": "dis1_025",
   "page_count": 4,
   "order": 7,
   "p1": "25",
   "pn": "28",
   "abstract": [
    "This paper compares, using our Japanese data, word repetitions with error repairs in terms of their temporal structures in order to examine whether or not the prolongation of first tokens in word repetitions, observed by Den and Clark (2000), is really an effect of the speakers strategy. Analyses of 10 task-oriented Japanese dialogues reveal a difference between word repetitions and error repairs for the data involving cut-off in first tokens; in both types of disfluencies, the final phoneme of the first token is considerably prolonged, but the degree of the prolongation is much greater in word repetitions than in error repairs. These results support our view that prolonged first tokens in word repetitions are a product of a process under the speakers control or intention.\n",
    ""
   ]
  },
  "seyfeddinipur01_diss": {
   "authors": [
    [
     "Mandana",
     "Seyfeddinipur"
    ],
    [
     "Sotaro",
     "Kita"
    ]
   ],
   "title": "Gesture as an indicator of early error detection inself-monitoring of speech",
   "original": "dis1_029",
   "page_count": 4,
   "order": 8,
   "p1": "29",
   "pn": "32",
   "abstract": [
    "There is a theoretical controversy regarding when the selfmonitoring process interrupts the speech stream. One view holds that the speech stream is interrupted as soon as an error is detected. Another view holds that, even after an error is detected, the speaker does not interrupt immediately but continues speaking and at the same time plans the upcoming repair. We address this question by observing speech-accompanying gestures at the moment of speech disfluency. The results show that the concurrent gestural movements are typically stopped on average 240 ms before speech is stopped. In other words, the gesture suspension foreshadows the speech suspension. The gestural foreshadowing shows that the speaker must know early on that he is going to suspend speech. The gestural indication of an upcoming speech suspension suggests that the speaker does not interrupt speech at the very moment s/he detects an error. This result supports the hypothesis on speech monitoring stating that the speaker continues to talk after error detection and at the same time plans the upcoming repair.\n",
    ""
   ]
  },
  "abouhaidar01_diss": {
   "authors": [
    [
     "Laura",
     "Abou-Haidar"
    ]
   ],
   "title": "Pauses in speech by French speakers with Down Syndrome",
   "original": "dis1_033",
   "page_count": 4,
   "order": 9,
   "p1": "33",
   "pn": "36",
   "abstract": [
    "A better understanding of the control mechanisms of speech in verbal interaction is very important for the evaluation of the pragmatic competence of a mentally deficient speaker. This study focuses on pauses in the oral production of a Speaker with Down syndrome involved in a conversation : it brings to light the temporal compensation mechanisms which allow the speaker to go beyond the distortions of the segmental level. It confirms the important role of prosody in the success of a conversation, particularly with a speaker who has a handicap which disrupts language structure. Down Syndrome is a condition characterised by an overall delay in cognitive, social, linguistic and motor development. At the oral production level, it leads to deficits in segmental and supra-segmental speech patterning. The goal of this study is to bring elements of response to the following question : is the pragmatic function of language preserved in spite of significant distortions of the motor functions of the phonatory organs ? The description of the management of pauses by a speaker with Down syndrome involved in a conversation makes it possible to clarify this subject, while taking into account the various functions which are specific to them beyond the respiratory function : their role in encoding, in the delimitation of syntactic boundaries, and in the regulation of speaking turns, among others.\n",
    "This study allowed us to define criteria which make it possible to characterise the oral production of a Speaker with Down syndrome. These elements relate to the variation of the frequency and the length of pauses. The results obtained are the following:\n",
    "a high frequency of occurrence of pauses in the production of the trisomic speaker a frequency of occurrence of \"mixed pauses\", of which the majority have very long lengths, this element revealing a lack of ease and disfluency on the production level; a significant recourse to false-starts, hesitation, repetition and lengthening, to mark sound pauses; a considerable number of very long pauses pauses; a relatively high number of pauses located at the boundaries of or within syntagms, with rather long lengths of intra-syntagmatic uses;\n",
    "We furthermore noted a rarity of long phonic sequences in the speaker with Down syndrome, these sequences seldom exceeding 2000 ms.\n",
    "In spite of these results, it is important to note that we have defined parameters which show that the speaker with Down syndrome integrated rules relating to the management of pauses in verbal interaction.\n",
    ""
   ]
  },
  "hokkanen01_diss": {
   "authors": [
    [
     "Tapio",
     "Hokkanen"
    ]
   ],
   "title": "Prosodic marking of self-repairs",
   "original": "dis1_037",
   "page_count": 3,
   "order": 10,
   "p1": "37",
   "pn": "40",
   "abstract": [
    "Slip studies predominantly focus on either structural or semantic properties of the errors. Since most analyses have been based on pen-and-paper collections, i.e., on-line notes, it is quite understandable that suprasegmental of errors have remained a neglected area. The present prosodic analysis is based on acoustical measurements of 307 self-repairs. Each repair has been measured with the Praat program. In order to make the measurements psychoacoustically relevant and comparable across speakers, the changes in F0 are expressed in terms of semitones. In general, speakers repair slightly less than three quarters of the errors they commit whereas one quarter remains either totally undetected or at least without a repair. With respect to prosodic marking, it appears that the proportion of marked repairs in the present data is significantly larger than in previous studies: approximately two thirds of self-repairs are marked with remarkably higher pitch (>+3ST), and a total of 96.7 per cent with a somewhat heigthened pitch. It is concluded that alternations of fundamental frequency are utilized in marking self-initiated repairs.\n",
    ""
   ]
  },
  "duez01_diss": {
   "authors": [
    [
     "Danielle",
     "Duez"
    ]
   ],
   "title": "Acoustico-phonetic characteristics of filled pauses in spontaneous Frenchspeech: preliminary results",
   "original": "dis1_041",
   "page_count": 4,
   "order": 11,
   "p1": "41",
   "pn": "44",
   "abstract": [
    "In the current analysis we examined the acoustic and phonetic characteristics of filled pauses in spontaneous French speech and their relationship to the prosody of the surrounding context. Two main results emerged : 1) There was no effect of the duration of filled pauses or their sentence location on their F0 patterns or on the differences between the highest and lowest values. 2) There was no relationship between peak-F0 values and the F0 values of filled-pause onsets, but the F0 values of filled-pause onsets and the F0-values of non-marked breath-group onsets were highly similar. The F0 values of filled-pause onsets seem to be stable within the same speakers speech. They are speaker-dependent and strongly linked to the physiological, absolute aspects of speech production. It is assumed that filled-pause onset may be used by listeners as a reference for evaluating the speakers pitch range.\n",
    ""
   ]
  },
  "kohler01_diss": {
   "authors": [
    [
     "Klaus J.",
     "Kohler"
    ],
    [
     "Benno",
     "Peters"
    ],
    [
     "Thomas",
     "Wesener"
    ]
   ],
   "title": "Interruption glottalization in German spontaneous speech",
   "original": "dis1_045",
   "page_count": 4,
   "order": 12,
   "p1": "45",
   "pn": "48",
   "abstract": [
    "This paper analyzes the occurrence of phonetic interruption cues at points of syntactic irregularities (false starts and truncations) in a large annotated corpus of German dialogues and compares interruption glottalization with laryngealization in terminal low phrase-final prosodies. Glottalization (including glottal stop) predominantly marks word fragments, whereas non-verbal insertions, e.g. breathing, tend to be word-external interruption cues. Laryngealization (excluding glottal stop) predominantly signals terminal phrase boundaries in turn-final positions. Individual speakers differ a great deal as to the distribution of these phenomena.\n",
    ""
   ]
  },
  "nenova01_diss": {
   "authors": [
    [
     "Nikolinka",
     "Nenova"
    ],
    [
     "Gina",
     "Joue"
    ],
    [
     "Ronan",
     "Reilly"
    ],
    [
     "Julie",
     "Carson-Berndsen"
    ]
   ],
   "title": "Sound and function regularities in interjections",
   "original": "dis1_049",
   "page_count": 4,
   "order": 13,
   "p1": "49",
   "pn": "52",
   "abstract": [
    "This paper investigates the relation between the sound patterns of interjections and their functional realisation in the discourse process. It considers whether certain interjection functions tend to have particular sound distributions. In order to address these questions a classification scheme for American English nonlexical interjections in terms of discourse markers is also presented.\n",
    ""
   ]
  },
  "shillcock01_diss": {
   "authors": [
    [
     "Richard",
     "Shillcock"
    ],
    [
     "Simon",
     "Kirby"
    ],
    [
     "Scott",
     "McDonald"
    ],
    [
     "Chris",
     "Brew"
    ]
   ],
   "title": "Filled pauses and their status in the mental lexicon",
   "original": "dis1_053",
   "page_count": 4,
   "order": 14,
   "p1": "53",
   "pn": "56",
   "abstract": [
    "We report a study of the relationship between form and meaning in the most frequent monosyllabic words in the lexicon of English. There is a small but significant correlation between the phonological distance and the semantic distance between each pair of words. To this extent, words that have similar meanings tend to sound similar. Words differ as to the size of this meaning-form correlation in their relationship with all of the other words. When the words are ranked according to the size of this correlation we find that the words which appear towards the top of the ranking are the communicatively important words. When we look at the position in the ranking of the speech editing terms, such as er, oh and um, we find that they are at the very top of the ranking. We argue that this position reflects the communicative importance of these items, and that it therefore makes sense to treat them as a proper part of the mental lexicon.\n",
    ""
   ]
  },
  "gosy01_diss": {
   "authors": [
    [
     "Mária",
     "Gósy"
    ]
   ],
   "title": "The double function of disfluency phenomenain spontaneous speech",
   "original": "dis1_057",
   "page_count": 4,
   "order": 15,
   "p1": "57",
   "pn": "60",
   "abstract": [
    "Disfluency in spontaneous speech is the outcome of a speakers indecision about what to say next. The listener, however, is continuously adapted to both the language signals and the types of disfluency of the heard text. What is in the background of this adaptation process?\n",
    "This paper analyses the types and characteristics of the disfluency phenomena of a 78-minute spontaneous speech sample (produced by 10 adults). The authors intention is to explain the characteristics of disharmony between speech planning and articulation within the speech production process. In order to explain the hypothesized double function of disfluency in terms of perceptual necessity from the listeners side various experiments have been carried out.\n",
    "Three different samples of spontaneous speech have been selected for experimental purposes. Three groups of listeners (altogether 60 university students) participated in the experiments. One of the groups had to detect the instances of disfluency in the texts marking them on a paper sheet. The subjects of the other group listened to the same texts and then wrote down their contents. The pauses and hesitations were then eliminated from the texts. The third group of the subjects had the same comprehension task as the previous one had.\n",
    "Results show that (i) instances of disfluency are consequences of the speakers speech planning processes, (ii) their reasons and occurrences are unconsciously known by the listener as well, (iii) disfluency phenomena are relatively well predicted, (iv) the listeners need pauses and hesitations in order to comprehend the heard texts successfully.\n",
    ""
   ]
  },
  "bailey01_diss": {
   "authors": [
    [
     "Karl G. D.",
     "Bailey"
    ],
    [
     "Fernanda",
     "Ferreira"
    ]
   ],
   "title": "Do non-word disfluencies affect syntactic parsing?",
   "original": "dis1_061",
   "page_count": 4,
   "order": 16,
   "p1": "61",
   "pn": "64",
   "abstract": [
    "Although disfluencies such as uh are generally not treated as linguistic items, our results suggest that they can affect syntactic parsing. Using a grammaticality judgment task, we demonstrate that disfluencies are able to affect the syntactic parse of a sentence in two ways. First, disfluencies can make syntactic reanalysis more difficult by coming between an ambiguous constituent and a disambiguating item. Second, the pattern of disfluencies in spontaneous speech may be used by the listener to guide the parse of a sentence. Thus, although disfluencies have often been viewed as pragmatic phenomena, they can affect the language comprehension by influencing its parsing procedures.\n",
    ""
   ]
  },
  "mcallister01_diss": {
   "authors": [
    [
     "Jan",
     "McAllister"
    ],
    [
     "Susan",
     "Cato-Symonds"
    ],
    [
     "Blake",
     "Johnson"
    ]
   ],
   "title": "Listeners' ERP responses to false starts and repetitions inspontaneous speech",
   "original": "dis1_065",
   "page_count": 4,
   "order": 17,
   "p1": "65",
   "pn": "68",
   "abstract": [
    "Hindle [1] suggested that false starts and repetitions should be handled differently in a computational account of the processing of the two kinds of disfluency, and there is behavioural evidence that the human sentence processing mechanism likewise honours this distinction [2]. The same dichotomy was also evident in the electrophysiological data reported here. False starts and repetitions were identified in a corpus of spontaneous speech. Control items for the false starts were prepared by excising the reparanda to yield apparently fluent items. Continuous EEG was recorded while subjects listened to items containing the false starts, fluent false start controls, and first and second tokens of repetitions. Compared with identical words in their fluent controls, the false starts elicited a positive response similar to the P600 which is reported for syntactically anomalous words [3, 4, 5]. By contrast, second tokens of repetitions in general resulted in increased amplitude of the N400 [6]; yet, when the same repetitions were excised from context and presented listfashion, they elicited the positive-going response which has been reported by other researchers [7].\n",
    ""
   ]
  },
  "debaisieux01_diss": {
   "authors": [
    [
     "Jeanne-Marie",
     "Debaisieux"
    ],
    [
     "José",
     "Deulofeu"
    ]
   ],
   "title": "Grammatically unacceptable utterances are communicatively accepted bynative speakers, why are they?",
   "original": "dis1_069",
   "page_count": 4,
   "order": 18,
   "p1": "69",
   "pn": "72",
   "abstract": [
    "This paper aims at redefining the generally accepted notion of unfinished or elliptic sentence, which appears to be crucial in defining in turn the notion of fluency itself. It will be shown that a large part of utterances which a regularly trained linguist would consider as unacceptable and revealing some kind of disfluency of the speaker who produced them, are in fact fully accepted by the participants of a regular verbal interaction. This apparent contradiction will be explained by the fact that linguists base their judgments of well formedness of the utterances on their grammatical structure, whereas speakers interact basically by means of communicative units, which are not necessarily made up of grammatically well formed parts.\n",
    ""
   ]
  },
  "spilker01_diss": {
   "authors": [
    [
     "Jörg",
     "Spilker"
    ],
    [
     "Anton",
     "Batliner"
    ],
    [
     "Elmar",
     "Nöth"
    ]
   ],
   "title": "How to repair speech repairs in an end-to-end system",
   "original": "dis1_073",
   "page_count": 4,
   "order": 19,
   "p1": "73",
   "pn": "76",
   "abstract": [
    "If automatic speech processing wants to deal with spontaneous speech, it has to deal with disfluencies in general and speech repairs in particular as well. The paper describes the processing of speech repairs in the VERBMOBIL system and discusses the special requirements of real-time systems. With respect to this criterion, the VERBMOBIL approach and its results are compared to other work. All these results are based more or less on the evaluation of a stand alone process, not integrated in a speech system. The ultimate goal is, of course, the use and the evaluation of the impact of such a repair process in a real-time, end-to-end system. An evaluation method based on this idea is presented and some preliminary results are given.\n",
    ""
   ]
  },
  "hutchinson01_diss": {
   "authors": [
    [
     "Ben",
     "Hutchinson"
    ],
    [
     "Cécile",
     "Pereira"
    ]
   ],
   "title": "Um, one large pizza. A preliminary study of disfluency modelling for improving ASR",
   "original": "dis1_077",
   "page_count": 4,
   "order": 20,
   "p1": "77",
   "pn": "80",
   "abstract": [
    "A corpus of spontaneous telephone transactions between call centre operators of a pizza company and its customers is examined for disfluencies (fillers and speech repairs) with the aim of improving automatic speech recognition. From this, a subset of the customer orders is selected as a test set. An architecture is presented which allows filled pauses and repairs to be detected and corrected. A language repair module removes fillers and reparanda and transforms utterances containing them into fluent utterances. An experiment on filled pauses using this module and architecture is then described. A speech recognition grammar for recognising fluent speech is used to provide a baseline. This grammar is then enriched with filled pauses, based on their placement in relation to syntactic boundaries. Evaluation is done at the level of understanding, using a metric on feature structures. Initial results indicate that incorporating filled pauses at syntactic boundaries improves the recognition results for spontaneous continuous speech containing disfluencies.\n",
    ""
   ]
  },
  "rieger01_diss": {
   "authors": [
    [
     "Caroline L.",
     "Rieger"
    ]
   ],
   "title": "Idiosyncratic fillers in the speech of bilinguals",
   "original": "dis1_081",
   "page_count": 4,
   "order": 21,
   "p1": "81",
   "pn": "84",
   "abstract": [
    "This paper introduces a never before described strategy used by bilinguals to fill hesitation pauses. This strategy proved so unique that it was given the name idiosyncratic filler. It describes a filler type that is produced unusually often by one individual when hesitating. It is usually a particular lexical filler that is used as often as or more often than all other lexical fillers combined. Idiosyncratic fillers are as flexible as, but more prestigious than quasi-lexical fillers and they are used by bilinguals in their non-native language as an overgeneralization and to avoid the incessant production of uhs and uhms.\n",
    ""
   ]
  },
  "wengelin01_diss": {
   "authors": [
    [
     "Asa",
     "Wengelin"
    ]
   ],
   "title": "Disfluencies in writing - are they like in speaking?",
   "original": "dis1_085",
   "page_count": 4,
   "order": 22,
   "p1": "85",
   "pn": "88",
   "abstract": [
    "This paper presents a study of disfluencies in written language production. Texts from ten university students are compared to data from people who almost never use writing, namely adult dyslexics and to texts from people who communicate in writing under real-time constraints every day, namely deaf whose main use of writing is text telephone conversations. This paper investigates which types of disfluencies occur in writing, where they occur and their durations. Further, this paper investigates how different text types and the specific characteristics of deaf and dyslexic writers influence the distribution of disfluencies. The results are discussed in relation to earlier work on disfluencies in speaking.\n",
    ""
   ]
  },
  "watanabe01_diss": {
   "authors": [
    [
     "Michiko",
     "Watanabe"
    ]
   ],
   "title": "The usage of fillers at discourse segment boundaries injapanese lecture-style monologues",
   "original": "dis1_089",
   "page_count": 4,
   "order": 23,
   "p1": "89",
   "pn": "92",
   "abstract": [
    "We examined whether fillers (filled pauses) in a Japanese lecture appeared more frequently after discourse segment boundaries (DSB) than after other sentence boundaries. Contrary to our hypothesis that fillers occur more often after DSB than after other sentence boundaries, the frequency of fillers in the first phrase after DSB did not differ statistically from that after other sentence boundaries. The location of fillers in the first phrase after DSB and after other boundaries did not show any clear difference, either. However, the types of fillers at the initial position of the first phrase after two kinds of boundaries were different; sentence initial eto appeared exclusively at DSB. This result indicates that sentence initial eto may help highlighting DSB, but not other types of fillers. Other kinds of fillers (e, ma, ano, sono) seem to be mainly concerned with planning units of the utterance that are smaller than a sentence.\n",
    ""
   ]
  },
  "lickley01_diss": {
   "authors": [
    [
     "Robin J.",
     "Lickley"
    ]
   ],
   "title": "Dialogue moves and disfluency rates",
   "original": "dis1_093",
   "page_count": 4,
   "order": 24,
   "p1": "93",
   "pn": "96",
   "abstract": [
    "Many factors conspire to cause speakers to produce hesitations and self-repairs in dialogue. It has been noted that disfluency rates vary between corpora, with different overall dialogue tasks and with different modalities (e.g. humancomputer vs. human-human) and between speakers, where they play different roles within a given dialogue.\n",
    "In this paper, we attempt to account for some of these results by examining the interaction between rates of different types of disfluency and types of utterance (dialogue moves) within one corpus of human-human task oriented dialogues.\n",
    "We find both that overall disfluency rate varies by dialogue move type, with moves which require more planning producing more disfluency, and that the distribution of disfluency types varies between move types, most notably with complex and negative responses to questions producing more filled pauses than positive replies and other moves.\n",
    "This work helps us to understand how dialogue structure can account for differences in disfluency rates between and within speech corpora and has implications for research in speech production and perception, discourse studies, dialogue management and automatic speech recognition.\n",
    ""
   ]
  },
  "bard01_diss": {
   "authors": [
    [
     "Ellen G.",
     "Bard"
    ],
    [
     "Robin J.",
     "Lickley"
    ],
    [
     "Matthew P.",
     "Aylett"
    ]
   ],
   "title": "Is disfluency just difficulty?",
   "original": "dis1_097",
   "page_count": 4,
   "order": 25,
   "p1": "97",
   "pn": "100",
   "abstract": [
    "The question addressed by this paper is whether disfluency resembles Inter-Move Interval, a measure of reaction time in conversation, in displaying effects of the overall difficulty of conducting a coherent conversation. Five sources of difficulty are considered as potential causes of disfluency: planning and producing an utterance, comprehending the prior utterance, performing a communicative task, order effects, and interpersonal factors. A multiple regression analysis on simple disfluencies in the HCRC Map Task Corpus shows that planning and production make the major independent contribution to predicting the rate of disfluencies, with interpersonal variables and position in dialogue also contributing significantly. Notably, comprehension variables did not affect either the total rate of disfluency or the rate of individual kinds of disfluencies.\n",
    ""
   ]
  }
 },
 "sessions": [
  {
   "title": "Annotation and Disfluency Types",
   "papers": [
    "rodriguez01_diss",
    "eklund01_diss"
   ]
  },
  {
   "title": "Production",
   "papers": [
    "howell01_diss",
    "vasic01_diss",
    "yoshida01_diss",
    "nooteboom01_diss",
    "den01_diss",
    "seyfeddinipur01_diss",
    "abouhaidar01_diss"
   ]
  },
  {
   "title": "Prosody and Phonetics",
   "papers": [
    "hokkanen01_diss",
    "duez01_diss",
    "kohler01_diss",
    "nenova01_diss",
    "shillcock01_diss"
   ]
  },
  {
   "title": "Human Perception and Comprehension",
   "papers": [
    "gosy01_diss",
    "bailey01_diss",
    "mcallister01_diss",
    "debaisieux01_diss"
   ]
  },
  {
   "title": "Computational Linguistics and ASR",
   "papers": [
    "spilker01_diss",
    "hutchinson01_diss"
   ]
  },
  {
   "title": "Disfluency as a General Cognitive Phenomenon",
   "papers": [
    "rieger01_diss",
    "wengelin01_diss",
    "watanabe01_diss",
    "lickley01_diss",
    "bard01_diss"
   ]
  }
 ]
}