{
 "title": "Evidence-based Voice and Speech Rehabilitation in Head and Neck Cancer",
 "location": "Amsterdam, The Netherlands",
 "startDate": "15/5/2008",
 "endDate": "16/5/2008",
 "conf": "EVSR",
 "year": "2008",
 "name": "evsr_2008",
 "series": "",
 "SIG": "",
 "title1": "Evidence-based Voice and Speech Rehabilitation in Head and Neck Cancer",
 "date": "15-16 May 2008",
 "papers": {
  "asbrooks08_evsr": {
   "authors": [
    [
     "Corina J. van",
     "As-Brooks"
    ]
   ],
   "title": "Acoustic analyses of postlaryngectomy voice and their perceptual relevance",
   "original": "evsr_008",
   "page_count": 7,
   "order": 1,
   "p1": "8",
   "pn": "14",
   "abstract": [
    "Despite the fact that perceptual evaluations are considered the ‘gold standard’ for evaluation of voice quality, there are some drawbacks. They are time-consuming and remain subjective. Hence the use of acoustic measures is interesting. This article describes some common pitfalls of acoustic analyses, the outcomes of acoustic analyses in tracheoesophageal speakers, and their perceptual relevance.\n",
    ""
   ]
  },
  "eysholdt08_evsr": {
   "authors": [
    [
     "Ulrich",
     "Eysholdt"
    ],
    [
     "M.",
     "Schuster"
    ],
    [
     "J.",
     "Lohscheller"
    ],
    [
     "F.",
     "Rosanowski"
    ]
   ],
   "title": "Objective evaluation of TE substitute voice and speech",
   "original": "evsr_015",
   "page_count": 4,
   "order": 2,
   "p1": "15",
   "pn": "18",
   "abstract": [
    "Three studies are presented which aim at rater-independent methods to evaluate voice quality, speech intelligibility and the benefit of rehabilitation of the patients: (1) real time endoscopy of the vibrating PE segment, (2) quantification of speech intelligibility by means of a computerized speech recognition system and (3) rating of the laryngectomees’ quality-of-life in relation to his substitute voice.\n",
    ""
   ]
  },
  "searl08_evsr": {
   "authors": [
    [
     "Jeff",
     "Searl"
    ]
   ],
   "title": "Articulatory aerodynamics, contact pressures and sense of effort during tracheoesophageal speech",
   "original": "evsr_019",
   "page_count": 22,
   "order": 3,
   "p1": "19",
   "pn": "40",
   "abstract": [
    "Objectives: The purposes of this study were to: 1) describe sense of effort (SOE) associated with speech, oral air pressure (Po), articulatory contact pressure (ACP), and subneoglottal pressure (Psub) in tracheoesophageal (TE) speech, and 2) evaluate the relationships between these measures. The intent was to inform about articulatory alterations in TE speech with a future goal of guiding therapeutic interventions that serve to balance the physical demands of producing intelligible TE speech with the perceived work of generating the speech.\n",
    "Patients/Materials and Methods: Thirty four TE speakers provided ratings of SOE. ACP, Po and Psub were measured during production of alveolar consonants.\n",
    "Results: Po, ACP, Psub, and SOE were higher than what is reported for nonlaryngectomized speakers. The primary locations identified by subjects as having increased SOE were the lips and tongue, followed by the brain (i.e., cognitive effort), voice, and lungs. Individuals who reported elevated SOE had higher ACP and Po than those who did not report an increase in SOE. SOE, ACP and Po were all moderately to strongly correlated with each other.\n",
    "Conclusions: More than half of the TE speakers reported elevated SOE. ACP, and also Po appear to be possible physiologic correlates of internal SOE. These parameters could serve a useful therapeutic function as feedback to individuals with a goal of optimizing physical effort while maintaining the perceptual integrity of the consonants being produced.\n",
    "Keywords: oral pressure, contact pressure, articulation, effort\n",
    ""
   ]
  },
  "jongmans08_evsr": {
   "authors": [
    [
     "Petra",
     "Jongmans"
    ],
    [
     "Maya van",
     "Rossum"
    ],
    [
     "Corina J. van",
     "As-Brooks"
    ],
    [
     "Frans",
     "Hilgers"
    ],
    [
     "Louis",
     "Pols"
    ]
   ],
   "title": "An evidence-based rehabilitation program for tracheoesophageal speakers",
   "original": "evsr_041",
   "page_count": 20,
   "order": 4,
   "p1": "41",
   "pn": "60",
   "abstract": [
    "Objectives: to develop an evidence-based therapy program aimed at improving tracheoesophageal speech intelligibility. The therapy program is based on particular problems found for TE speakers in a previous study as performed by the authors.\n",
    "Patients/Materials and Methods: 9 male laryngectomized individuals were included in the study. Seven had had a total laryngectomy, one had had a PM flap and one a gastric pull-up. Mean age was 64;9 years and mean time after TLE was 5;6 years. A therapy program was developed based on the most common difficulties of TE speakers found in literature and on a previous perception experiment of the authors. Where possible, therapy techniques were based on evidence-based research. TE speakers participated in a nine-session therapy program spread over five weeks. Several pre and post tests were used to measure the effect of the therapy program: the speakers were asked to read out speech material, both before and after the therapy program, including almost all levels of speech: phoneme level, word level, sentence level and spontaneous speech. Different types of raters were used for each of the different tests. Naïve, inexperienced listeners rated spontaneous speech in a semantic scaling experiment; naïve, but experienced raters (phoneticians) rated phoneme and sentence level; experienced listeners, well known with TE speech, rated phoneme level. Questionnaires were filled out by the speakers themselves and a close relative. A Voice Handicap Index was also used, but will not be discussed here.\n",
    "Results: Scores improved for fricatives in initial position, and for the voicedvoiceless distinction. For medial position, all manners of articulation, except the approximant /l/ improved, as well as the voiced-voiceless distinction. Sentence intelligibility also improved. The questionnaires show that speakers are more positive about their own speech post therapy. The scores for the semantic scaling experiment did not improve. However, the semantic scale results on articulation and intelligibility did improve.\n",
    "Conclusions: Although already effective in its present set-up, some extension of this 5-week rehabilitation program is necessary to ensure an optimal progression from phoneme level to spontaneous speech level.\n",
    "Keywords: TE speech production, evidence-based therapy\n",
    ""
   ]
  },
  "eadie08_evsr": {
   "authors": [
    [
     "Tanya L.",
     "Eadie"
    ]
   ],
   "title": "Quality of life after total laryngectomy",
   "original": "evsr_061",
   "page_count": 29,
   "order": 5,
   "p1": "61",
   "pn": "89",
   "abstract": [
    "Objectives: To use the framework proposed by the International Classification of Functioning, Disability and Health (ICF) to review outcomes related to quality of life (QOL) after total laryngectomy.\n",
    "Patients/Materials and Methods: Results from papers published on QOL after total laryngectomy were organized according to the ICF framework. Outcomes were summarized relative to the contribution of disease and treatment-related factors, those related to changes in body functions and structures, activities, and participation, and those related to contextual factors such as family and social support, and personal variables such as coping strategies, age, and gender.\n",
    "Results: QOL after total laryngectomy is multidimensional. Outcomes are affected by management of the airway (stoma), success of alaryngeal speech and communication, and swallowing. Factors related to treatment (absence or presence of radiation or chemotherapy), those related to one’s environment (family and social support), and/or person (depression, coping strategies, age, and gender) are interactive and also predict outcomes. Longitudinal studies that include psychosocial variables are lacking.\n",
    "Conclusions: The type of instrument used to assess quality of life, time after diagnosis, and study design must be considered when interpreting QOL postlaryngectomy. There is a continued need to perform multi-center, prospective studies to increase levels of evidence after treatment for advanced laryngeal cancer to ensure the most beneficial treatment for each individual is pursued.\n",
    "Keywords: quality of life, total laryngectomy, International Classification of Functioning, Disability, and Health (ICF)\n",
    ""
   ]
  },
  "doyle08_evsr": {
   "authors": [
    [
     "Philip C.",
     "Doyle"
    ]
   ],
   "title": "Oral and oropharyngeal cancer: speech outcomes and the need to monitor change over time",
   "original": "evsr_090",
   "page_count": 25,
   "order": 6,
   "p1": "90",
   "pn": "114",
   "abstract": [
    "Objectives: Despite the long history of surgery as the primary treatment for cancer of the oropharyngeal structures, a relative paucity of information on speech outcomes currently exists. While the importance of this voice and speech performance is clearly identified as an essential outcome along with chewing and swallowing, there remains inconsistency in how outcomes for speech are obtained and interpreted. It is clear that surgical treatment for oral and oropharyngeal tumors and subsequent reconstruction has a direct influence on the integrity of the human vocal tract. As a result, surgery and reconstruction holds the significant potential for alteration of signal transmission characteristics of the vocal tract. This presentation provides a brief summary of existing data on outcomes and serves to raise several questions related to a need for research. Further, preliminary data obtained in our laboratory using established methodology to assess the acoustic structure of English vowels in individuals who have undergone surgery for oral cancer is presented for consideration.\n",
    "Patients/Materials and Methods: Following a cursory review of the literature, results from a preliminary study of 11 participants (3 women, 8 men) who had received surgery for treatment of oral cancer are presented. All participants had undergone surgery for oral tumors and received subsequent reconstruction using a radial free forearm flap. A group of age- and gender-matched control participants were also studied. All participants produced multiple productions of 10 English vowels consistent with methods outlined by Peterson and Barney (1952); formant frequencies were then determined via spectrographic analysis.\n",
    "Results: Data obtained revealed remarkable similarity across the speaker groups for values obtained for formants 1, 2, and 3 (F1, F2, and F3). When proportional relationships between F1 and F2 were compared, no differences between surgical and control participants were identified. Overall, and in the presence of substantial surgical reconstruction, these 11 surgical participants appear capable of modifying their vocal tracts so as to adequately code the basic and essential acoustic requirements for the 10 vowels studied.\n",
    "Conclusions: These preliminary findings demonstrate that traditional and fundamental methods of vocal tract assessment, namely determination of formant frequencies through acoustic analysis, can serve as a valuable index of postsurgical vocal tract function and signal transmission. These acoustic data represent one specific measure of vocal tract transmission characteristics that could be exploited in additional analyses of the postsurgical system. The lack of significant differences between these groups does not, however, suggest that the speaker groups are equivalent with respect to overall speech production capabilities. The current data provide an initial step toward establishing standardized methods of post-treatment speech evaluation.\n",
    "Key words: oral cancer, oropharyngeal cancer, vocal tract, speech acoustics, speech rehabilitation\n",
    ""
   ]
  },
  "labaere08_evsr": {
   "authors": [
    [
     "Annelies",
     "Labaere"
    ],
    [
     "Jan",
     "Vanderwegen"
    ],
    [
     "Frans",
     "Debruyne"
    ]
   ],
   "title": "Tracheoesophageal speech with manual versus automatic stoma occlusion: a multidimensional comparison",
   "original": "evsr_115",
   "page_count": 8,
   "order": 7,
   "p1": "115",
   "pn": "122",
   "abstract": [
    "Objectives: The objective of this study was to make a qualitative comparison between tracheoesophageal speech with manual stoma occlusion and handsfree tracheoesophageal speech with the Provox FreeHands device.\n",
    "Patients/Materials and Methods: Both manual and handsfree tracheoesophageal speech were compared in 13 patients who were regular users of Provox FreeHands for at least four months. Evaluation of speech material consisted of objective analysis using the KayPentax CSL, perceptual ratings by a group of experienced listeners and patients own perceptual judgment. In addition, data concerning user-friendliness, additional values and inconveniences of the FreeHands device were gathered using questionnaires. The Voice Handicap Index (VHI) was used to evaluate the relation between voice related QOL and method of stoma occlusion. Therefore a control group of TE-speakers, who did not use handsfree speech, was selected.\n",
    "Results: Objective analysis revealed significant differences (p< 0.05) for parameters fluency (i.e. the number of syllables produced on one intake of breath) and maximal phonation time, to the detriment of handsfree speech. There were no significant differences found for the dynamic characteristics Perceptual judgments of running speech were rated higher in the manual occlusion condition for most patients, but there were interrater differences. Subjective impressions showed that the majority of patients preferred handsfree speech to manual stoma occlusion, noticeably for voice quality, fatigability, attractiveness and feelings of self-confidence. Major inconveniences of handsfree speech were a significantly decreased duration of sticker adhesion, the occurrence of disturbing noises and the need for continued effort. The VHI scores were significantly higher in the group of handsfree speakers compared to the control group.\n",
    "Conclusions: This clinical study showed that in selected patients the Provox FreeHands shows important subjective benefits. Improvements however are necessary to make the device a useful rehabilitation device for a larger group of laryngectomized patients.\n",
    "Keywords: tracheoesophageal speech, handsfree speech, automatic tracheostoma valve\n",
    ""
   ]
  },
  "engstrom08_evsr": {
   "authors": [
    [
     "Therese",
     "Engström"
    ],
    [
     "Alexander",
     "Ahlberg"
    ],
    [
     "Polymnia",
     "Nikolaidis"
    ],
    [
     "Karin Lundgren",
     "Gunnarsson"
    ],
    [
     "Lena",
     "Sharp"
    ],
    [
     "Göran",
     "Laurell"
    ]
   ],
   "title": "Early rehabilitation of head and neck cancer patients at Karolinska university hospital",
   "original": "evsr_123",
   "page_count": 3,
   "order": 8,
   "p1": "123",
   "pn": "125",
   "abstract": [
    "Objectives: To describe a clinical pathway for early rehabilitation of head and neck cancer patients.\n",
    "Method: A clinical pathway has been developed at Karolinska University Hospital to improve rehabilitation for patients with head and neck cancer receiving radiotherapy (RT) or a combination of RT and surgery. For many years the clinical pathway for these patients has included consultations with dentists, dental hygienists, dieticians, social workers, nurses and physicians before, during and after RT. Since three years, the patients are also seen by a speech language pathologist and physiotherapist for assessment and information before and after RT. The aim is to start the rehabilitation process early, before the initiation of RT and with that to reduce the risk of complications such as dysphagia, trismus and voice and speech impairment. Emphasis is put on giving patients information about treatment side-effects, improving patient involvement and self-care. The patients receive a physical training program with exercises aiming to maintain tongue and laryngeal motility, jaw opening, swallowing and shoulder function. These exercises should be performed on a daily basis during and after the RTperiod. Altogether 257 patients have been included in the intervention group. In an on-going study data is collected from medical hospital files, individual assessments and patient questionnaires (EORTC QLQ-C 30, EORTC QLQ-H&N 35, HADS and a study specific questionnaire) at baseline and at six-month follow-up. Data from the intervention group will be compared with data from a control group.\n",
    "Keywords: rehabilitation\n",
    ""
   ]
  }
 },
 "sessions": [
  {
   "title": "Papers",
   "papers": [
    "asbrooks08_evsr",
    "eysholdt08_evsr",
    "searl08_evsr",
    "jongmans08_evsr",
    "eadie08_evsr",
    "doyle08_evsr",
    "labaere08_evsr",
    "engstrom08_evsr"
   ]
  }
 ]
}