{
 "title": "4th ITRW on Experimental Linguistics",
 "location": "Paris, France",
 "startDate": "25/5/2011",
 "endDate": "27/5/2011",
 "conf": "ExLing",
 "year": "2011",
 "name": "exling_2011",
 "series": "ExLing",
 "SIG": "",
 "title1": "4th ITRW on Experimental Linguistics",
 "date": "25-27 May 2011",
 "booklet": "exling_2011.pdf",
 "papers": {
  "xu11_exling": {
   "authors": [
    [
     "Yi",
     "Xu"
    ]
   ],
   "title": "Functions and mechanisms in linguistic research - lessons from speech prosody",
   "original": "el11_001",
   "page_count": 10,
   "order": 1,
   "p1": "1",
   "pn": "10",
   "abstract": [
    "Human speech, as a collection of complex phenomena, can be explored from many different angles, and interesting data can be generated with various approaches. However, if we aim to substantially improve our understanding of speech, it is advantageous to focus on the communicative functions and the mechanisms that enable these functions. This paper uses prosodic phenomena in speech as examples to illustrate the necessity as well as potential benefits of such function- and mechanism-oriented approaches.\n",
    "Index Terms. communicative function, mechanism, speech prosody\n",
    ""
   ]
  },
  "ankerstein11_exling": {
   "authors": [
    [
     "Carrie A.",
     "Ankerstein"
    ]
   ],
   "title": "Qualitatively similar automatic semantic priming in native nnd non-native speakers",
   "original": "el11_011",
   "page_count": 4,
   "order": 2,
   "p1": "11",
   "pn": "14",
   "abstract": [
    "Qualitative and quantitative differences in semantic priming for native and nonnative speaker groups were explored using a primed lexical decision task. In addition to response time data, coefficient of variance (CV) for response times was used to investigate quantitative differences in lexical processing between groups. Segalowitz and Segalowitz (1993) argued that differences in CV indicate processing differences. For example, lexical access via automatic routes results in lower CVs, and lexical access via attentional routes results in higher CVs. The current study replicates findings for automatic semantic priming in non-native speakers and contributes behavioural data for the argument that priming in a non-native speaker group can be qualitatively similar to that in native speakers.\n",
    "Index Terms. priming, second language acquisition, coefficient of variance, automaticity\n",
    ""
   ]
  },
  "bahadr11_exling": {
   "authors": [
    [
     "Gözde",
     "Bahadır"
    ],
    [
     "Maria",
     "Polinsky"
    ]
   ],
   "title": "Structural priming and the phrasal/clausal distinction: the case of concealed questions",
   "original": "el11_015",
   "page_count": 4,
   "order": 3,
   "p1": "15",
   "pn": "18",
   "abstract": [
    "This paper investigates whether structural priming is sensitive to the phrasal vs. clausal nature of the constructions it tests. To that end, we examine NPs that receive a question-like interpretation when embedded under certain predicates. These NPs are known as \"concealed question (CQ) NPs\". We first report the results of a pilot study that establishes co-occurrence patterns of the target embedding predicates. We then present two structural priming studies of which CQ NPs with \"overt embedded questions\", \"embedded wh-questions\" and \"embedded declaratives\". Both written sentence completion tasks demonstrate structural priming, which turns out to be sensitive to the phrase-clause distinction.\n",
    "Index Terms. structural priming, concealed questions, embedded clauses, interrogative, declarative\n",
    ""
   ]
  },
  "banreti11_exling": {
   "authors": [
    [
     "Zoltán",
     "Bánréti"
    ],
    [
     "Éva",
     "Mészáros"
    ]
   ],
   "title": "Syntactic recursion and theory-of-mind reasoning in agrammatic aphasia",
   "original": "el11_019",
   "page_count": 4,
   "order": 4,
   "p1": "19",
   "pn": "22",
   "abstract": [
    "This study investigates how aphasic impairment impinges on recursivity of language and theory-of-mind inferences. Results of linguistic tests showed that in Broca's aphasia syntactic recursion is substituted for theory-of-mind inferences on the base that linguistic system and theory- of- mind type reasoning interact with one recursion modul in human mind.\n",
    "Index Terms. syntactic recursion, theory of mind, aphasia\n",
    ""
   ]
  },
  "banreti11b_exling": {
   "authors": [
    [
     "Zoltán",
     "Bánréti"
    ],
    [
     "Éva",
     "Mészáros"
    ],
    [
     "Ildikó",
     "Hoffmann"
    ],
    [
     "Zita",
     "Őrley"
    ]
   ],
   "title": "Recursion in language, theory-of-mind inference and arithmetic: aphasia and Alzheimer's disease",
   "original": "el11_023",
   "page_count": 4,
   "order": 5,
   "p1": "23",
   "pn": "26",
   "abstract": [
    "We found a variety of dissociations among the linguistic and non-linguistic operations tested. In the case of Hungarian speaking patients with a medium-serious AD, syntactic recursion is relatively unimpaired, as opposed to their limited ability to tackle theory-of-mind and arithmetical recursion. Conversely, we found limited syntactic recursion but normal theory-of-mind inferences and recursive arithmetical operations in Hungarian speaking agrammatic aphasics. We argue for a model that posits a module of recursive operations in the human mind that is shared by linguistic, theory-of-mind, and arithmetical performance.\n",
    "Index Terms. recursion, mind, aphasia, Alzheimer disease\n",
    ""
   ]
  },
  "toplu11_exling": {
   "authors": [
    [
     "Ayşe Betül",
     "Toplu"
    ],
    [
     "Deniz",
     "Zeyrek"
    ]
   ],
   "title": "Linguistic and non-linguistic investigation of motion events",
   "original": "el11_027",
   "page_count": 4,
   "order": 6,
   "p1": "27",
   "pn": "30",
   "abstract": [
    "The verb-framed vs. satellite-framed language dichotomy (Talmy, 1985) is the most common framework used in the crosslinguistic investigation of motion event expressions. According to the classification, French is a verb-framed language, it integrates the path of motion into the main verb and uses a separate component to express the manner of motion. On the other hand, English, a satellite-framed language, gives the manner information in the main verb and expresses the path of motion with a separate component. The present study uses this dichotomy to see whether the motion event expressions patterns of these two typologically different languages (French and English) are also reflected in their motion event categorisations or not.\n",
    "Index Terms. motion events, typology, language and cognition\n",
    ""
   ]
  },
  "blochowiak11_exling": {
   "authors": [
    [
     "Joanna",
     "Blochowiak"
    ],
    [
     "Gözde",
     "Bahadır"
    ]
   ],
   "title": "Semantic priming at the sentence level: causal vs. purposive <i>because</i>",
   "original": "el11_031",
   "page_count": 4,
   "order": 7,
   "p1": "31",
   "pn": "34",
   "abstract": [
    "In the present study we use the property of some linguistic items to express more than one meaning in order to investigate whether there is semantic priming at the sentence level. To test such a priming effect we use the connective because that can express a causal or purposive relation. If there is a priming effect, then participants will be expected to use causal because following causal primes and purposive because following purposive primes more frequently. The preliminary results do not reveal a clear priming effect but a slight trend toward priming, which we will continue to investigate increasing the number of participants.\n",
    "Index Terms. semantic priming, pragmatic relationships, connective because, causal because, purposive because\n",
    ""
   ]
  },
  "bonitz11_exling": {
   "authors": [
    [
     "Petra-Kristin",
     "Bonitz"
    ],
    [
     "Anke",
     "Holler"
    ]
   ],
   "title": "Subject gaps in German coordinative structures - empirical evidence for a gradient phenomenon",
   "original": "el11_035",
   "page_count": 4,
   "order": 8,
   "p1": "35",
   "pn": "38",
   "abstract": [
    "In this article we investigate German complex clauses containing a subject gap using the empirical method of Magnitude Estimation. We will present evidence for the fact that subject gaps in coordinative structures can be characterized by (i) gradience and (ii) regional distinctiveness. Against the background of the recent critical discussion of Magnitude Estimation (e.g. Featherston 2008), we show that this method qualifies to test hierarchical graduation of acceptability.\n",
    "Index Terms. magnitude estimation, ellipsis, coordination, gradience, descriptive grammar of German\n",
    ""
   ]
  },
  "botinis11_exling": {
   "authors": [
    [
     "Antonis",
     "Botinis"
    ],
    [
     "Aikaterini",
     "Bakakou-Orphanou"
    ],
    [
     "Anthi",
     "Chaida"
    ]
   ],
   "title": "Prosody and quantifier semantics in Greek",
   "original": "el11_039",
   "page_count": 4,
   "order": 9,
   "p1": "39",
   "pn": "42",
   "abstract": [
    "This study investigates prosody and semantic specification in Greek with reference to affirmative and negative sentence quantifier functions. A production and a perception experiment were carried out, the results of which indicate: (1) The negative interpretation of the word ['liɣa] (few) is produced with focus on the quantifier, whereas the positive one with focus on the preceding verb. (2) The word in focus has an enlarged tonal range associated with the stressed syllable, while the material out of focus is tonally compressed. (3) The stressed syllable of the word in focus, especially the vowel, is significantly longer. (4) The affirmative and negative functions of the quantifier had high identification rates, indicating a one-to-one production and perception relation.\n",
    "Index Terms. prosody, intonation, quantifiers, Greek.\n",
    ""
   ]
  },
  "botinis11b_exling": {
   "authors": [
    [
     "Antonis",
     "Botinis"
    ],
    [
     "Anthi",
     "Chaida"
    ],
    [
     "Evgenia",
     "Magoula"
    ]
   ],
   "title": "Phonology and phonetics of Greek palatalisation",
   "original": "el11_043",
   "page_count": 4,
   "order": 10,
   "p1": "43",
   "pn": "46",
   "abstract": [
    "The present investigation examines palatal production as well as the relation of phonology and phonetics in Greek. In accordance with one production experiment, the results indicate: (1) palatal productions that surface from one underlying segment are significantly longer than palatal productions that surface from two underlying segments, (2) palatal productions are voice assimilated with the preceding stop and fricative consonant production and, (3), the locus frequencies of male palatal productions are in the area of 1800-2000 Hz.\n",
    "Index Terms. acoustics, phonology, phonetics, palatalisation, Greek\n",
    ""
   ]
  },
  "boulademareuil11_exling": {
   "authors": [
    [
     "Philippe",
     "Boula de Mareüil"
    ],
    [
     "Alice",
     "Bardiaux"
    ]
   ],
   "title": "Perception of French, Belgian and Swiss accents by French and Belgian listeners",
   "original": "el11_047",
   "page_count": 4,
   "order": 11,
   "p1": "47",
   "pn": "50",
   "abstract": [
    "This article addresses the perceptual identification of French regional accents by listeners from the Paris region and Belgium. It is based on the geographical localisation of about thirty speakers from seven French-speaking areas: Vendee (West of France), Languedoc (South of France), Alsace (East of France), Romand Switzerland, East, Centre and West of Belgium. Contrary to the speakes' age bracket (older or younger than 60) and speaking style (read or spontaneous speech), listeners' region of origin and speakers' degree of accentedness (also rated by the listeners) have a major effect. Confusions are frequent among the Belgian areas, but taken as a whole, the Belgian accent is remarkably well identified, especially by Belgian listeners. The Southern accent remains identified best.\n",
    "Index Terms. perceptual dialectology, regional variation, French accents.\n",
    ""
   ]
  },
  "camargo11_exling": {
   "authors": [
    [
     "Zuleica Antonia de",
     "Camargo"
    ],
    [
     "Sandra",
     "Madureira"
    ],
    [
     "Luiz Carlos",
     "Rusilo"
    ]
   ],
   "title": "Evaluating speech samples designed for the Voice Profile Analysis Scheme for Brazilian Portuguese (BP-VPAS)",
   "original": "el11_051",
   "page_count": 4,
   "order": 12,
   "p1": "51",
   "pn": "54",
   "abstract": [
    "The present study aims at evaluating a corpus designed for voice quality settings analysis (Laver, 1980). It addresses the role of keyspeech segments for the identification of voice quality settings. The corpus, recorded by 60 speakers, contained repetitions of 10 keyspeech sentences, and semi-spontaneous speech samples. These samples were evaluated by two expert subjects according to the BP-VPAS Profile (Camargo, Madureira, 2008). These data were analyzed by means of an artificial neural network and statistically by multiple regression analysis. The data reinforce the importance of the description of voice quality based on the phonetic model and the relevant role of keyspeech segments.\n",
    "Index Terms. voice quality; auditory perception, phonetics, evaluation; corpus\n",
    ""
   ]
  },
  "chanethom11_exling": {
   "authors": [
    [
     "Vincent",
     "Chanethom"
    ]
   ],
   "title": "Dynamic differences in child bilinguals' production of diphthongs",
   "original": "el11_055",
   "page_count": 4,
   "order": 13,
   "p1": "55",
   "pn": "58",
   "abstract": [
    "This paper examines the cross-linguistic phonetic interactions in the production of diphthongs by French-English bilingual children. The study aims to investigate (1) whether English diphthongs (e.g. /aɪ/ as in bye) and Frence tautosyllabic vowel-glide combinations (e.g. /aj/ as in baille) have different phonetic implementations, and if so, (2) whether bilingual children maintain two separate categories. Using SSANOVA to compare formant contours, the results showed distinct phonetic patterns for each category. The results also indicated that bilingual children with a reduced amount of input in French show overlapping acoustic properties.\n",
    "Index Terms. Bilingualism, diphthongs, SSANOVA, language acquisition.\n",
    ""
   ]
  },
  "chernigovskaya11_exling": {
   "authors": [
    [
     "Tatiana",
     "Chernigovskaya"
    ],
    [
     "Kira",
     "Gor"
    ],
    [
     "Galina",
     "Kataeva"
    ],
    [
     "Alexander",
     "Korotkov"
    ],
    [
     "Maxim",
     "Kireev"
    ],
    [
     "Kristina",
     "Memetova"
    ],
    [
     "Svyatoslav",
     "Medvedev"
    ]
   ],
   "title": "Processing Russian inflectional morphology: a PET study of verb generation",
   "original": "el11_059",
   "page_count": 4,
   "order": 14,
   "p1": "59",
   "pn": "62",
   "abstract": [
    "For many years, acquisition of verbal morphology has been an issue of much debate within linguistic theory, research on first and second language acquisition, mental grammar representation, and cognitive processing. The proponents of the Dual Mechanism account claim that regularly inflected forms are computed by a ruleprocessing system, while morphologically irregular forms are processed in associative memory. The opposite Single Mechanism account claims that both regular and irregular forms are processed in associative memory. In the present PET study significant rCBF increase in the anterior cingulate gyrus of the left hemisphere (24 BA) was shown for regular verb generation.This may support the rule-based (de)compositional account.\n",
    "Index Terms. inflectional morphology, anterior cingulate cortex, error detection system.\n",
    ""
   ]
  },
  "russo11_exling": {
   "authors": [
    [
     "Domenico Di",
     "Russo"
    ]
   ],
   "title": "The terminal contour of Italian semi-spontaneous instructions",
   "original": "el11_063",
   "page_count": 4,
   "order": 15,
   "p1": "63",
   "pn": "66",
   "abstract": [
    "This article aims to analyze the intonative features of instructions in semispontaneous Italian, with particular regard to their terminal contour, in order to understand which is its semantic importance and, from this point of view, what is the nature of relation between intonation and modality.\n",
    "Index Terms. instruction, intonation, modality, semantics, terminal contour\n",
    ""
   ]
  },
  "dubasova11_exling": {
   "authors": [
    [
     "Anzhelika",
     "Dubasova"
    ]
   ],
   "title": "Models or strategies? on the perception of ambiguous words",
   "original": "el11_067",
   "page_count": 4,
   "order": 16,
   "p1": "67",
   "pn": "70",
   "abstract": [
    "Models of lexical ambiguity resolution differ mainly with respect to the role played by context in lexical access. In my paper I focus on two opposing views: those of autonomous access models (non-context-oriented) and selective access models (context-oriented). I analyse two types of situations of: a. the activation of a wrong meaning of an ambiguous word unpredictable from both models and b. humour based on puns. Proceeding from my analysis I propose to include \"negative\" factors (those leading to errors) and consider existing models as strategies, consequently, treating unsuccessful lexical ambiguity resolution as the influence of \"negative\" factors or as a selection of the wrong strategy.\n",
    "Index Terms. lexical ambiguity, ambiguity resolution, meaning selection\n",
    ""
   ]
  },
  "fecher11_exling": {
   "authors": [
    [
     "Natalie",
     "Fecher"
    ]
   ],
   "title": "Spectral properties of fricatives: a forensic approach",
   "original": "el11_071",
   "page_count": 4,
   "order": 17,
   "p1": "71",
   "pn": "74",
   "abstract": [
    "This paper reports on the acoustic-phonetic analysis of the voiceless fricatives /s, ʃ, f, ʘ/ taken from high-quality recordings of six native British English speakers reading phonetically controlled stimuli under various face disguise conditions. Speech samples were extracted from an audio-visual 'face cover' corpus that was collected for the purpose of investigating multimodal speech and speaker recognition in a forensic context. Findings are discussed with regard to constraints in speech production and acoustic damping effects caused by certain mask materials.\n",
    "Index Terms. forensic phonetics, acoustics, fricatives, spectral moments\n",
    ""
   ]
  },
  "galantomos11_exling": {
   "authors": [
    [
     "Ioannis",
     "Galantomos"
    ]
   ],
   "title": "Vocabulary learning strategies among advanced Turkish learners",
   "original": "el11_075",
   "page_count": 4,
   "order": 18,
   "p1": "75",
   "pn": "78",
   "abstract": [
    "The goal of this paper is to examine the vocabulary learning strategies used by Turkish learners at an advanced level. Current research suggests that vocabulary is an important component of language proficiency. Nevertheless, for a long period of time it was a neglected aspect during foreign language teaching and learning. Vocabulary learning strategies play a crucial role in vocabulary acquisition. In order to investigate the vocabulary learning strategies used by advanced Turkish learners of Greek origin, we conducted a small-scale experiment. Our results indicate a preference for strategies of formal vocabulary learning and practicing over spontaneous vocabulary learning strategies and self-initiated independent vocabulary learning.\n",
    "Index Terms. foreign language learning, Turkish as a foreign language, vocabulary learning strategies\n",
    ""
   ]
  },
  "guillamon11_exling": {
   "authors": [
    [
     "Pilar Mompeán",
     "Guillamón"
    ]
   ],
   "title": "Vowel-colour associations in non-synesthetes: a study with Spanish and Arabic participants",
   "original": "el11_079",
   "page_count": 4,
   "order": 19,
   "p1": "79",
   "pn": "82",
   "abstract": [
    "The present paper aims at contributing to the field of sound symbolism and, more specifically, to the association between sounds and colours as established by nonsynesthetes. A study based on a forced-choice task performed by Spanish and Arabic speakers is presented. The study asks participants to listen to primary cardinal vowels and choose from a range of colours the one considered most suitable for the sound. The data gathered reinforce previous results that non-synesthetic participants are able to significantly associate vowel sounds and colours at a better than chance degree. However, results seem to go against the general idea that the associations are cross-linguistic, although the phenomenon itself seems to be.\n",
    "Index Terms. cardinal vowels, colours, synesthesia, synesthetic symbolism\n",
    ""
   ]
  },
  "hofferberth11_exling": {
   "authors": [
    [
     "Nina Jeanette",
     "Hofferberth"
    ]
   ],
   "title": "The tip-of-the-tongue phenomenon: search strategy and resolution during word finding difficulties",
   "original": "el11_083",
   "page_count": 4,
   "order": 20,
   "p1": "83",
   "pn": "86",
   "abstract": [
    "A tip-of-the-tongue (TOT) experience refers to the state in which a speaker is temporally unable to retrieve a word from memory, while being sure that he knows the word. The recovered partial information can consist of competing items that resemble the target word phonologically or semantically and could give rise to competition or conflict during attempts to resolve the TOT. A question that has been discussed recently is whether phonologically similar words block or facilitate lexical retrieval. A study at Frankfurt University (cf. Hofferberth 2008) found that participants preferred searching for their intended word by a semantic search strategy instead of a phonological one.\n",
    "Index Terms. speech production, lexical access, word finding failures, blocking, incomplete activation\n",
    ""
   ]
  },
  "karpava11_exling": {
   "authors": [
    [
     "Sviatlana",
     "Karpava"
    ]
   ],
   "title": "L2 Greek morphological agreement",
   "original": "el11_087",
   "page_count": 4,
   "order": 21,
   "p1": "87",
   "pn": "90",
   "abstract": [
    "The present study investigates morphological agreement in L2 Greek verbal and nominal domains by L1 Russian, Bulgarian, and Turkish speakers, with various features such as person, number, gender, and case involved, following Tsimpli et al. 2005. Russian, Bulgarian, and Greek are similar in terms of phi-feature agreement, but different from Turkish. A further distinction will be made for the L2 Greek, between Standard Modern Greek and Cypriot Greek. The analysis of the oral interviews shows that gender, an uninterpretable feature that lacks semantic content (Tsimpli 2004, Franceshina 2001), was the most problematic feature for non-native speakers of Greek, both in the verbal and in the nominal domain. L2 learners either relied on phonological agreement or used the default neuter gender.\n",
    "Index Terms. L2 acquisition, morphological agreement, (un)interpretable features, cross-linguistic interference\n",
    "s\n",
    "Franceschina, F. 2001. Against an L2 morphological deficit as an explanation for the differences between native and non-native grammars. EUROSLA Yearbook 1, 143-158.\n",
    "Tsimpli, I.M., Sorace, A., Heycock, C, Filiaci, F. 2004. First language attrition and syntactic subjects: A study of Greek and Italian near-native speakers of English. International Journal of Bilingualism 8, 257-277.\n",
    ""
   ]
  },
  "kim11_exling": {
   "authors": [
    [
     "Meesook",
     "Kim"
    ]
   ],
   "title": "Perceptual and lexical priming of syntactic construction in young children",
   "original": "el11_091",
   "page_count": 4,
   "order": 22,
   "p1": "91",
   "pn": "94",
   "abstract": [
    "Two experiments are reported to investigate the roles of perceptual priming and lexical priming in Korean children's production of passive sentences. Experiment 1 examined whether manipulations of focal attention could affect Korean children's linguistic choices regarding subject role assignment, by using so-called fish film (Tomlin, 1997). 5-year-olds and 6-year-olds were not able to produce passives even when a patient was perceptually primed by a flashing arrow. Experiment 2 examined lexical priming effects in children's production of passives. 5-year-olds and 6-year-olds were more likely to use passive sentences if a patient has been verbally primed by the experimenter. These results indicate that young children's production of passive voice is more likely to be affected by linguistic cues than perceptual salience.\n",
    "Index Terms. focal attention, language acquisition, lexical priming, passives, perceptual priming\n",
    ""
   ]
  },
  "martin11_exling": {
   "authors": [
    [
     "Philippe",
     "Martin"
    ]
   ],
   "title": "Time selected multiple algorithms for reliable <i>f</i><sub>0</sub> tracking in difficult recording conditions",
   "original": "el11_095",
   "page_count": 4,
   "order": 23,
   "p1": "95",
   "pn": "98",
   "abstract": [
    "Prosodic data mining in large spontaneous speech corpora often requires acoustic analysis of recordings done in poor conditions. The most detrimental pertain to the absence first harmonic in voiced segments and the presence of echo. In such cases it is very difficult to separate inter vocalic consonantal voicing from echo, or recover F0 from remaining harmonics. To address these problems, 10 different pitch tracking algorithms were implemented in the software program WinPitch, in order to allow an expert user, guided by an underlying displayed narrow band spectrogram, to select manually the appropriate process to deliver a satisfactory F0 curve for a selected time segment.\n",
    "Index Terms. intonation, fundamental frequency, spontaneous speech, speech corpus\n",
    ""
   ]
  },
  "mendousse11_exling": {
   "authors": [
    [
     "Kevin",
     "Mendousse"
    ]
   ],
   "title": "Towards a mental representation of vowel height in SSBE speakers",
   "original": "el11_099",
   "page_count": 4,
   "order": 24,
   "p1": "99",
   "pn": "102",
   "abstract": [
    "Vigorous debate in phonetics and phonology has focused on the cognitive foundation of distinctive feature theory, as well as on the definition of features themselves. In particular, we show that, although the motor-acoustic feature of vowel height has long been the object of close scrutiny, research on the vertical representation of vowels in the phonology of English remains inconclusive. By drawing on Sapir's work on phonetic symbolism, this paper empirically investigates the intuitive understanding that SSBE speakers have of their own vowel space. It argues that their implicit knowledge of vowel height differences is best accounted for in terms of a three-tiered vertical axis.\n",
    "Index Terms. phonetic symbolism, phonological perception, vowel height\n",
    ""
   ]
  },
  "mykhaylyk11_exling": {
   "authors": [
    [
     "Roksolana",
     "Mykhaylyk"
    ]
   ],
   "title": "Prosodic patterns in child speech",
   "original": "el11_103",
   "page_count": 4,
   "order": 25,
   "p1": "103",
   "pn": "106",
   "abstract": [
    "This paper presents an experimental study contributing to the issue of prosodysyntax- semantics interaction in child speech. The data from 12 3-4-year-old children acquiring Ukrainian have been analyzed in order to establish main prosodic patterns associated with different semantic types of SVO and SOV sentences. The results show that the children are mostly adult-like in the prosodic realization of post-verbal object pronouns, but often apply non-adult-like prosodic contours to the sentences with contextually-dependent object NPs.\n",
    "Index Terms. pitch, prosodic contour, scrambling, Ukrainian\n",
    ""
   ]
  },
  "nikolaenkova11_exling": {
   "authors": [
    [
     "Olga",
     "Nikolaenkova"
    ]
   ],
   "title": "Tonal and syntactic correlates of focus perception in Greek and Russian",
   "original": "el11_107",
   "page_count": 4,
   "order": 26,
   "p1": "107",
   "pn": "110",
   "abstract": [
    "The present paper reports on the way word order and tonal slope influence focus perception in Russian and Greek declaratives. Perception experiment was carried out in order to identify the impact falling tone slope and word order change have on focus identification. The speech material included manipulated stimuli with 5 and 3 different falling tone slopes for Russian and Greek respectively and involved 6 different word orders. The results of the perception test indicate that: (1) slope manipulation is a reliable focus indicator; (2) word order change is not sufficient for focus identification; (3) no major cross-language contrasts were observed.\n",
    "Index Terms. focus, perception, tonal slope, Russian, Greek\n",
    ""
   ]
  },
  "nirgianaki11_exling": {
   "authors": [
    [
     "Elina",
     "Nirgianaki"
    ],
    [
     "Ougour",
     "Chasan"
    ],
    [
     "Evgenia",
     "Magoula"
    ]
   ],
   "title": "Production of Greek and Turkish vowels by bilingual speakers",
   "original": "el11_111",
   "page_count": 4,
   "order": 27,
   "p1": "111",
   "pn": "114",
   "abstract": [
    "The present study examines the acoustic vowel space of Greek and Turkish vowels produced by bilingual speakers. The results are presented for both languages' vowels production by bilingual speakers, as well as compared with the vowels production by monolingual speakers. It is revealed that the acoustic space of the Greek vowels produced by bilingual speakers is larger than the acoustic space of their Turkish vowels, mainly due to the lower and more front position of the point vowels [a] and [i], respectively. Moreover, the acoustic space of the Greek vowels produced by bilingual speakers is smaller than the one of the Greek vowels produced by monolingual speakers. On the contrary, the acoustic space of the Turkish vowels produced by bilingual speakers is larger than the one of the Turkish vowels produced by monolinguals.\n",
    "Index Terms. Greek, Turkish, bilinguals, vowels, formants\n",
    ""
   ]
  },
  "rusilo11_exling": {
   "authors": [
    [
     "Luiz Carlos",
     "Rusilo"
    ],
    [
     "Zuleica Antonia de",
     "Camargo"
    ],
    [
     "Sandra",
     "Madureira"
    ]
   ],
   "title": "The validity of some acoustic measures to predict voice quality settings: trends between acoustic and perceptual correlates of voice quality",
   "original": "el11_115",
   "page_count": 4,
   "order": 28,
   "p1": "115",
   "pn": "118",
   "abstract": [
    "The present study aims at investigating the power of acoustic measures to predict voice quality settings detected perceptually. The corpus was composed by speech samples recorded by 60 subjects. The audio samples were analyzed in PRAAT by means of the SG Expression Evaluator Script (Barbosa, 2009), which extracts f0 and f0 first derivate, intensity, spectral tilt and long-term average spectrum measures. The same samples were perceptually evaluated by means of the Voice Profile Analysis Scheme for Brazilian Portuguese (BP-VPAS). The methodological procedures made it possible to identify the clusters related to the acoustic measures group and that of the perceptual judgement results (cluster analysis) as well as to correlate these two groups (canonic correlation analysis).\n",
    "Index Terms. speech acoustics, voice quality, perception, statistical analysis\n",
    ""
   ]
  },
  "sang11_exling": {
   "authors": [
    [
     "Yumei",
     "Sang"
    ]
   ],
   "title": "Lexical stress in modern Halh Mongolian",
   "original": "el11_119",
   "page_count": 4,
   "order": 29,
   "p1": "119",
   "pn": "122",
   "abstract": [
    "The purpose of this paper is to study lexical stress in Mongolian and its place of realization. Words and short declarative sentences are analyzed. We observe certain regularity in the rising of F0 on the most prominent syllables. We also show that duration is used as a correlate of stress in the sense that long vowels are privileged to receive stress: the stress falls on the syllable which contains a long vowel whatever its place within a word. In the case there is no long vowel, the stress falls on the second syllable. (Stress design here lexical stress).\n",
    "Index Terms. Speech, prosody, stress, Mongolian, Halh\n",
    ""
   ]
  },
  "sloos11_exling": {
   "authors": [
    [
     "Marjoleine",
     "Sloos"
    ]
   ],
   "title": "Pretonic schwa reduction in dutch: frequency effects interact with phonotactics",
   "original": "el11_123",
   "page_count": 4,
   "order": 30,
   "p1": "123",
   "pn": "126",
   "abstract": [
    "Word frequency plays a role in reduction processes: high-frequency words undergo more reduction than low-frequency words. Pretonic schwa reduction in Dutch is susceptible to frequency effects in this way, but the well-formedness of the cluster that remains after schwa deletion also plays a role. An experiment shows that cluster well-formedness and frequency effects in fact interact with each other. This suggests that phonological models should incorporate both lexical as well a grammatical information.\n",
    "Index Terms. Frequency effects, phonotactics, pretonic schwa, reduction\n",
    ""
   ]
  },
  "soroli11_exling": {
   "authors": [
    [
     "Efstathia",
     "Soroli"
    ]
   ],
   "title": "Typology and spatial cognition in English, French and Greek: evidence from eye-tracking",
   "original": "el11_127",
   "page_count": 4,
   "order": 31,
   "p1": "127",
   "pn": "130",
   "abstract": [
    "Languages encode space in strikingly different ways (Talmy, 2000): Satellite-framed languages (e.g., English) lexicalize Manner in verb roots and express Path in satellites, whereas Verb-framed languages (e.g., French) lexicalize Path in verb roots, leaving Manner implicit or peripheral; other languages present parallel systems in which both Verb- and Satellite-framed structures are available (e.g., Greek). The present study investigates how speakers of three typologically different languages, English, French and Greek, performed a production task and allocated their visual attention while exploring and describing visual scenes involving motion events. The findings show that participants' verbalizations and eye-movement fixations differed substantially as a function of language-specific factors, arguing that typological constraints have a clear impact not only on linguistic but also on non-linguistic behaviours.\n",
    "Index Terms. spatial cognition, language typology, production, eye-tracking method\n",
    ""
   ]
  },
  "thompson11_exling": {
   "authors": [
    [
     "Ellen",
     "Thompson"
    ],
    [
     "Javier",
     "Collado"
    ],
    [
     "Maria",
     "Omana"
    ],
    [
     "Amanda",
     "Yousuf-Little"
    ]
   ],
   "title": "The processing of asymmetric and symmetric sentential conjunction",
   "original": "el11_131",
   "page_count": 4,
   "order": 32,
   "p1": "131",
   "pn": "134",
   "abstract": [
    "In this study, we examine the predictions for processing of a syntactically articulated theory of the distinction among different interpretations of clausal 'and'. Bjorkman (2010) claims that symmetric 'and' interpretations involve coordination of CPs; these are logical interpretations. Asymmetric interpretations of 'and' involve conjunction of TPs; these are temporal and causal. If the processor is guided by structural considerations, we predict a possible two-way split in the processing costs of these structures. Therefore, this research examines the processing time involved in sentences interpreted as: (i) temporal, (ii) causal, and (iii) logical, versus the distinctions of (i) asymmetric (TP structure), and (ii) symmetric (CP structure). We find that structures involving symmetric 'and' involve longer processing times than those of asymmetric, causal 'and', and although the processing times of structures with logical 'and' are longer than those with temporal 'and', this distinction does not approach statistical significance.\n",
    "Index Terms. coordination, conjunction, processing time\n",
    ""
   ]
  },
  "todd11_exling": {
   "authors": [
    [
     "Richard",
     "Todd"
    ]
   ],
   "title": "Identifications of speaker-ethnicity: attribution accuracy in changeable settings",
   "original": "el11_135",
   "page_count": 4,
   "order": 33,
   "p1": "135",
   "pn": "138",
   "abstract": [
    "Several studies have considered the auditory identification of foreign-accented/nonnative speech. Here, a finer-grained alternative to the traditional definition of nativeness is used. The approach eliminates the shortcomings of selecting 'native' speech based on the usual criterion of birthplace alone, yet accommodates complexities which arise when dealing with speakers from countries which are historically diverse, ethnically. Using the foregoing construct, this study examines the potential for listeners to accurately group different speaker-types, with respect their ethnicity, in low/high quality transmission conditions. The findings of the Ethnic Group Attribution (EGA) task confirms overall human competence. The large number of participants (n=120) brings added generalisability to smaller-scale studies. It furthermore, allows a better understanding of contextualised performance, gender-wise.\n",
    "Index Terms. Ethnic Group Attribution (EGA), Ethnicity, Nativeness, Identification, Perception\n",
    ""
   ]
  },
  "torrens11_exling": {
   "authors": [
    [
     "Vicenç",
     "Torrens"
    ]
   ],
   "title": "Participle agreement and clitic omission",
   "original": "el11_139",
   "page_count": 4,
   "order": 34,
   "p1": "139",
   "pn": "142",
   "abstract": [
    "Object clitic omission has been considered to be a general feature of child grammar. In this paper we show that while omission is high in young Catalan..speaking children, it is very low in Spanish-speaking children. This difference can be attributed to the availability of participle agreement when objects cliticise. I present a research where we test, through a grammaticality judgement task, the sensitivity of Catalan and Spanish children to participle agreement and find a statistically significant difference between the two languages.\n",
    "Index Terms. clitics, omission, participle agreement\n",
    ""
   ]
  },
  "tripolitou11_exling": {
   "authors": [
    [
     "Maria",
     "Tripolitou"
    ],
    [
     "Anthi",
     "Chaida"
    ]
   ],
   "title": "High functioning autism and prosody of sentence types in Greek: a case study",
   "original": "el11_143",
   "page_count": 4,
   "order": 35,
   "p1": "143",
   "pn": "146",
   "abstract": [
    "The study focuses on the prosodic characteristics of sentence types in Greek, based on data by an adult with high functioning autism (HFA). It investigates the effects of the disorder on tonal and temporal features of 2 basic sentence types. A production experiment was carried out, based on SVO sentences produced as statements and polar questions, with no other difference than their prosodic realisation. The HFA findings were compared to relevant findings for normal speech and showed: (a) very similar tonal patterns, (b) more expanded tonal, and (c) longer utterances.\n",
    "Index Terms. prosody, intonation, sentence types, high functioning autism, Greek\n",
    ""
   ]
  },
  "utekhin11_exling": {
   "authors": [
    [
     "Ilya",
     "Utekhin"
    ],
    [
     "Tatiana",
     "Chernigovskaya"
    ]
   ],
   "title": "Metacommunicative devices in spoken discourse as part of processing distributed cognitive tasks",
   "original": "el11_147",
   "page_count": 4,
   "order": 36,
   "p1": "147",
   "pn": "150",
   "abstract": [
    "Types of utterances that belong to meta-levels of activity have been singled out in spoken task-focused dialogues between subjects accomplishing a matching task with no visual contact. The types include activity management and planning, global and local (e.g. signals of activity phase); explicit evaluation of the state of joint project, of one's own state or partner's state; retrospective references and accounts, meta-communicative utterances for conversation management; backchannel response: \"continuers\"; collaborative completion, echoic quotation; repair (self-repair, other-repair); meta-linguistic utterances; meta-communicative utterances having to do with rapport, etiquette, joking, etc. Differences between normal and schizophrenic subjects have been shown in meta-communicative activity supposed to be linked to the management of distributed cognition and creation of shared representations of reality.\n",
    "Index Terms. conversation, interaction, matching task, metacommunication\n",
    ""
   ]
  },
  "vercherand11_exling": {
   "authors": [
    [
     "Géraldine",
     "Vercherand"
    ]
   ],
   "title": "Perceptual level of intonation in whispered voice",
   "original": "el11_151",
   "page_count": 4,
   "order": 37,
   "p1": "151",
   "pn": "154",
   "abstract": [
    "In this paper, I propose to analyze the prosodic realization of two modalities (declarative and interrogative) through perception study of whispered voice in French. I present results of two modality identification tasks. Results of identification test based on natural stimuli show a good identification rate of the modality. The values of the duration of final syllable seem to be the main acoustic cue that is relevant in the identification of modality. I present also the results of modality identification task based on re-synthesized stimuli allowing to control the role played by duration parameter. Results of this second experiment show modality identification depends on perceptual level of the duration.\n",
    "Index Terms. whispered speech, intonation, perception, acoustic parameters\n",
    ""
   ]
  }
 },
 "sessions": [
  {
   "title": "Keynote Paper",
   "papers": [
    "xu11_exling"
   ]
  },
  {
   "title": "Regular Papers",
   "papers": [
    "ankerstein11_exling",
    "bahadr11_exling",
    "banreti11_exling",
    "banreti11b_exling",
    "toplu11_exling",
    "blochowiak11_exling",
    "bonitz11_exling",
    "botinis11_exling",
    "botinis11b_exling",
    "boulademareuil11_exling",
    "camargo11_exling",
    "chanethom11_exling",
    "chernigovskaya11_exling",
    "russo11_exling",
    "dubasova11_exling",
    "fecher11_exling",
    "galantomos11_exling",
    "guillamon11_exling",
    "hofferberth11_exling",
    "karpava11_exling",
    "kim11_exling",
    "martin11_exling",
    "mendousse11_exling",
    "mykhaylyk11_exling",
    "nikolaenkova11_exling",
    "nirgianaki11_exling",
    "rusilo11_exling",
    "sang11_exling",
    "sloos11_exling",
    "soroli11_exling",
    "thompson11_exling",
    "todd11_exling",
    "torrens11_exling",
    "tripolitou11_exling",
    "utekhin11_exling",
    "vercherand11_exling"
   ]
  }
 ]
}