{
 "title": "3rd ITRW on Experimental Linguistics",
 "location": "Athens, Greece",
 "startDate": "25/8/2010",
 "endDate": "27/8/2010",
 "conf": "ExLing",
 "year": "2010",
 "name": "exling_2010",
 "series": "ExLing",
 "SIG": "",
 "title1": "3rd ITRW on Experimental Linguistics",
 "date": "25-27 August 2010",
 "booklet": "exling_2010.pdf",
 "papers": {
  "agapitou10_exling": {
   "authors": [
    [
     "Paraskevi",
     "Agapitou"
    ],
    [
     "Ioannis",
     "Galantomos"
    ],
    [
     "Georgia",
     "Andreou"
    ]
   ],
   "title": "Language difficulties in children with attention deficit hyperactivity disorder",
   "original": "el10_001",
   "page_count": 4,
   "order": 1,
   "p1": "1",
   "pn": "4",
   "abstract": [
    "In this study we review the relevant literature regarding the connection of Attention deficit hyperactivity disorder (ADHD) with language disorders. Special emphasis is given to the evolution of language disorders in relation with ADHD, because both of them appear during preschool age and influence in a crucial manner the acquisition of basic learning readiness skills. The review of a considerable body of literature indicates that the co morbidity of ADHD with language difficulties worsens children's behaviour problems at preschool age and affects their socialization and academic performance. Hence, it is concluded that a proper and valid diagnosis of ADHD and language difficulties plus combined and suitable interventions will reduce the amount and quality of ADHD symptoms.\n",
    "",
    "",
    "Index Terms. ADHD, language difficulties, behaviour\n",
    ""
   ]
  },
  "alexandris10_exling": {
   "authors": [
    [
     "Christina",
     "Alexandris"
    ]
   ],
   "title": "Human-computer interaction systems and elderly users: linguistic specifications for prosodic modelling",
   "original": "el10_005",
   "page_count": 4,
   "order": 2,
   "p1": "5",
   "pn": "8",
   "abstract": [
    "The present linguistic specifications and language-independent parameters for prosodic modelling aim to provide a general framework for facilitating both the construction and the evaluation processes of the Dialog Interface of Human- Computer Interaction Systems in Service for the Elderly and the related prosodic modelling. The proposed specifications target to the features of Comprehensibility and User-friendliness in the spoken output and the overall safety, efficiency and reliability of the System's performance.\n",
    "",
    "",
    "Index Terms. comprehensibility, user friendliness, prosodic emphasis, speed rate\n",
    ""
   ]
  },
  "alonso10_exling": {
   "authors": [
    [
     "Pilar",
     "Alonso"
    ]
   ],
   "title": "Importing mental patterns of coherence as a comprehension strategy: a case study of errors in reference assignment",
   "original": "el10_009",
   "page_count": 4,
   "order": 3,
   "p1": "9",
   "pn": "12",
   "abstract": [
    "This paper addresses the interface between structural coherence, which builds on the formal and conceptual conventions of discourse, and cognitive coherence, which develops around the internal and external aspects of communication (Pasquier and Chaib-draa 2005). More specifically, the focus is on the cognitive coherence strategies set forth by discourse receivers when they encounter comprehension problems, especially those caused by non-standard uses in structural coherence. Drawing from studies on coherence and comprehension (Giora 1997; Wilson and Matsui 2000; Hobbs 2004), the paper discusses a case study which shows how error in reference assignment may encourage readers to import mental patterns of coherence, external to the discourse, as a repair strategy, thus prioritizing structural adjacency and their search for relevance over comprehension.\n",
    "",
    "",
    "Index Terms. Coherence, comprehension, topic construction, adjacency, relevance\n",
    ""
   ]
  },
  "blochowiak10_exling": {
   "authors": [
    [
     "Joanna",
     "Blochowiak"
    ],
    [
     "Jacques",
     "Moeschler"
    ],
    [
     "Thomas",
     "Castelain"
    ]
   ],
   "title": "The impact of order and aspect in processing of causally linked sentences",
   "original": "el10_013",
   "page_count": 4,
   "order": 4,
   "p1": "13",
   "pn": "16",
   "abstract": [
    "This paper presents experimental studies that investigate two issues related to the expression of causality in French: (i) what is the impact of order (cause-consequence vs. consequence-cause) in the processing of causally linked sentences without connectives and (ii) how, if at all, the aspectual distinction influences the nature of causal relations and their processing. Our hypothesis is that the consequence-cause order is processed faster, as it is the order imposed by the paradigmatic causal connective parce que (because). The differences in reading time confirmed our hypothesis for weakly associated causes and consequences. The experiments also showed that the aspectual contrast between events and states affects the nature of causal relation itself and plays a considerable role in the processing of causality.\n",
    "",
    "",
    "Index Terms. causality, order, aspect, event, state\n",
    ""
   ]
  },
  "castro10_exling": {
   "authors": [
    [
     "Luciana",
     "Castro"
    ],
    [
     "Ben",
     "Serridge"
    ],
    [
     "João",
     "Moraes"
    ],
    [
     "Myrian",
     "Freitas"
    ]
   ],
   "title": "The prosody of the TV news speaking style in Brazilian Portuguese",
   "original": "el10_017",
   "page_count": 4,
   "order": 5,
   "p1": "17",
   "pn": "20",
   "abstract": [
    "This study characterizes the prosodic structure of the TV news speaking style in Brazil and compares it to the speech of interview subjects on a television talk show. Fifteen distinct metrics, designed to characterize both temporal and melodic characteristics of speech, were evaluated on the two speaking styles. The results of the analysis show that the TV news speaking style is characterized by a lack of filled pauses, a fast speaking rate, few and short silent pauses, and a high percentage of dynamic tones. However, the only metric for which the difference in speaking styles was shown to be statistically significant was the intra-vocalic mean melodic movement.\n",
    "",
    "",
    "Index Terms. prosody, TV news, speaking styles, professional speech.\n",
    ""
   ]
  },
  "chaida10_exling": {
   "authors": [
    [
     "Anthi",
     "Chaida"
    ]
   ],
   "title": "Perceptual cues for sentence intonation in Greek",
   "original": "el10_021",
   "page_count": 4,
   "order": 6,
   "p1": "21",
   "pn": "24",
   "abstract": [
    "This is a study of intonational cues for the perception of statements and polar questions in Greek. A two-part experiment was conducted with synthetic stimuli with manipulated intonation targets in stress groups, from statement to question and vice versa. According to the results, the critical perceptual cue is the boundary tone, which led listeners to identify stimuli as the reverse sentence type (81-100%). However, the perception of intonational contrasts may be based on holistic contours.\n",
    "",
    "",
    "Index Terms. perception, intonation, prosody, sentence types, Greek.\n",
    ""
   ]
  },
  "chaida10b_exling": {
   "authors": [
    [
     "Anthi",
     "Chaida"
    ],
    [
     "Elina",
     "Nirgianaki"
    ],
    [
     "Eleni",
     "Panaretou"
    ]
   ],
   "title": "Text punctuation and prosody in Greek",
   "original": "el10_025",
   "page_count": 4,
   "order": 7,
   "p1": "25",
   "pn": "28",
   "abstract": [
    "A production experiment was carried out, in order to investigate text punctuation, including standard as well as ungrammatical (communicative) punctuation marks, and prosody relations. It is shown that punctuation is directly related to the duration of pauses, leading to the following structure: question mark>exclamation mark>full stop> colon>comma> ellipsis. Pitch resetting occurs in all cases, except for commas and ellipses, and gender differences seem to be significant. Ungrammatical punctuation is more prominently marked by both temporal and tonal means.\n",
    "",
    "",
    "Index Terms. prosody, discourse, punctuation, pauses, F0, Greek\n",
    ""
   ]
  },
  "dapolito10_exling": {
   "authors": [
    [
     "Sonia",
     "d'Apolito"
    ]
   ],
   "title": "Coarticulation of consonant clusters in Italian learners of French",
   "original": "el10_029",
   "page_count": 4,
   "order": 8,
   "p1": "29",
   "pn": "32",
   "abstract": [
    "The present study focuses on how Italian learners of French as L2 coarticulate French heterosyllabic sibilant sequences and how speech rate influences the production of these non-native sequences. As in Italian consonant sequences are less frequent than in French and very rarely appear across word boundary, the hypothesis is that a different degree of coarticulation is found in clusters produced by French, as reported in the literature, and by Italian learners of French. First results appear to confirm our expectations. A small degree of coarticulation characterises clusters produced by Italian, especially in comparison to what has been observed for French natives even if at a fast speech rate some cases of place assimilation are observed.\n",
    "",
    "",
    "Index Terms. place assimilation, speech rate, L2.\n",
    ""
   ]
  },
  "camargo10_exling": {
   "authors": [
    [
     "Zuleica Antonia de",
     "Camargo"
    ],
    [
     "Sandra",
     "Madureira"
    ]
   ],
   "title": "The acoustic analysis of speech samples designed for the voice profile analysis scheme for Brazilian Portuguese (BP-VPAS): long-term F0 and intensity measures",
   "original": "el10_033",
   "page_count": 4,
   "order": 9,
   "p1": "33",
   "pn": "36",
   "abstract": [
    "The present study aims at describing voice quality settings by means of long-term, f0 and intensity analysis of samples which integrate the material developed with the purpose of introducing the Voice Profile Analysis Scheme-VPAS in the Brazilian Portuguese context (BP-VPAS). The voice quality database was recorded in a radio studio. The audio samples were analyzed by means of the SG Expression Evaluator, a script developed by Barbosa (2009), which automatically extracts fundamental frequency (f0) and its first derivate (df0), intensity, spectral tilt (SpTt) and Long-Term Average Spectrum (LTAS). These measures have been statistically analyzed by means of multiple and non-linear regression tests. The results contemplate the correlations between perceived voice quality settings and f0 and intensity long-term acoustic measures.\n",
    "",
    "",
    "Index Terms. Voice Quality; Phonetics; Speech Acoustics; Auditory Perception; Speech Production Measures\n",
    ""
   ]
  },
  "drouahamdani10_exling": {
   "authors": [
    [
     "Ghania",
     "Droua-Hamdani"
    ],
    [
     "Sid Ahmed",
     "Selouani"
    ],
    [
     "Malika",
     "Boudraa"
    ],
    [
     "Wladyslaw",
     "Cichocki"
    ]
   ],
   "title": "Algerian Arabic rhythm classification",
   "original": "el10_037",
   "page_count": 4,
   "order": 10,
   "p1": "37",
   "pn": "40",
   "abstract": [
    "This paper investigates speech timing in Modern Standard Arabic (MSA) of Algerian speakers in order to situate their Arabic language between stressed-timed and syllable-timed languages. We extracted first all duration measurements from recordings taken from sound voice bank ALGASD (ALGerian Arabic Speech Database) and after computed durations with using recently interesting rhythmic approaches.\n",
    "",
    "",
    "Index Terms. duration, rhythm, Algerian speakers, Arabic language.\n",
    ""
   ]
  },
  "fourakis10_exling": {
   "authors": [
    [
     "Marios",
     "Fourakis"
    ],
    [
     "Heather",
     "Karlsson"
    ],
    [
     "Christie",
     "Tilkens"
    ],
    [
     "Lawrence",
     "Shriberg"
    ]
   ],
   "title": "Acoustic correlates of nasopharyngeal resonance",
   "original": "el10_041",
   "page_count": 4,
   "order": 11,
   "p1": "41",
   "pn": "44",
   "abstract": [
    "Measurements of F1 and F2 were made for the four corner vowels produced by typically-developing adolescents and adolescents with Fragile X and Down syndromes. The two high vowels were produced with lower F2 frequencies by the Fragile X and Down syndrome groups than the group of typically developing persons. This is consistent with a hypothesized backing of the tongue.\n",
    "",
    "",
    "Index Terms. F1, F2, corner vowels, Fragile X, Down syndrome\n",
    ""
   ]
  },
  "fox10_exling": {
   "authors": [
    [
     "Robert Allen",
     "Fox"
    ],
    [
     "Ewa",
     "Jacewicz"
    ]
   ],
   "title": "Dialect and generational differences in vowel space areas",
   "original": "el10_045",
   "page_count": 4,
   "order": 12,
   "p1": "45",
   "pn": "48",
   "abstract": [
    "We address methodological issues in calculating the size of the working vowel space area. Although corner vowels are most commonly used in determining its size, we show that this approach may severely underestimate the actual working space. The vowel spaces determined using the large vowels set provided insight into subtle differences between dialects and among age groups. Three approaches were tested which were based on the number of vowels used, formant measurement location and the way boundary lines were drawn.\n",
    "",
    "",
    "Index Terms. vowel, vowel space, formants, dialect\n",
    ""
   ]
  },
  "fujio10_exling": {
   "authors": [
    [
     "Misa",
     "Fujio"
    ]
   ],
   "title": "How to incorporate qualitative analysis into experimental research: why Japanese students studying in the UK did not improve their fluency?",
   "original": "el10_049",
   "page_count": 4,
   "order": 13,
   "p1": "49",
   "pn": "52",
   "abstract": [
    "This study investigated the longitudinal improvement in fluency of three Japanese participants who studied at a graduate school in the UK. In addition to quantitative analysis of videotaped conversations focusing on core components of fluency, such as speech rates, dysfluency markers and pauses, qualitative analysis, including protocol analysis and journal analysis, were also employed to discuss why they did not improve in fluency as originally expected. The analyses revealed that these participants did not have as many chances to communicate with native speakers as originally expected, and that a sociocultural factor of being excessively afraid of making mistakes might be a reason that prevented their natural improvement.\n",
    "",
    "",
    "Index Terms. fluency, speech rates, dysfluency markers, pauses, sociocultural elements\n",
    ""
   ]
  },
  "galantomos10_exling": {
   "authors": [
    [
     "Ioannis",
     "Galantomos"
    ],
    [
     "Georgia",
     "Andreou"
    ],
    [
     "Fotini",
     "Anastassiou"
    ]
   ],
   "title": "Evaluating languages functions in a trilingual setting",
   "original": "el10_053",
   "page_count": 4,
   "order": 14,
   "p1": "53",
   "pn": "56",
   "abstract": [
    "The aim of this research was to investigate the language functions of trilinguals that live in Greece. This study consisted of personal interviews conducted at a State Evening School in Volos in January 2010 and the participants were between 19 and 24 years old. They were all male and they came from immigrant families of Albanian origin. The study aimed to locate the instances that each one of the languages - L1 Albanian, L2 Greek, L3 English - is used and to record the reasons that make the students use each one of their languages.\n",
    "",
    "",
    "Index Terms. trilinguals, language functions, attitudes, immigrants.\n",
    ""
   ]
  },
  "hatzivasiliou10_exling": {
   "authors": [
    [
     "Thalia",
     "Hatzivasiliou"
    ],
    [
     "Marianna",
     "Hatzopoulou"
    ]
   ],
   "title": "Production of inflectional morphology in a child with moderate hearing impairment",
   "original": "el10_057",
   "page_count": 4,
   "order": 15,
   "p1": "57",
   "pn": "60",
   "abstract": [
    "The present study explores the production of bound morphemes in the speech of a nine-year old Greek child with moderate hearing impairment (HI). Data were obtained through the child's responses to subtests from the Diagnostic Verbal IQ Test (DVIQ, Stavrakaki et al. 2000) and samples of her speech. The analysis concerned the inflection of nouns, adjectives and verbs. The results showed that, even though the morphological features of names and verbs were marked correctly in the majority of utterances, errors were still observed in the child's speech. These errors concerned mainly the marking of the plural number in nouns and the perfective aspect in verbs.\n",
    "",
    "",
    "Index Terms. hearing impairment, morphology, bound morphemes\n",
    ""
   ]
  },
  "henriques10_exling": {
   "authors": [
    [
     "Isabel",
     "Henriques"
    ]
   ],
   "title": "How learning to read and write influences the dialectal traits in -sc clusters",
   "original": "el10_061",
   "page_count": 4,
   "order": 16,
   "p1": "61",
   "pn": "64",
   "abstract": [
    "Words written with the initial graphic sequences “es+C” and “ex+C” raise many problematic questions to the phonology of European Portuguese since the production of these sequences is changing (Delgado Martins et al, 1996:302). This paper focuses on the analysis of how the speakers produce and segment these –sC clusters and on the variables that might affect these tasks. Therefore, we conducted a study to perceive what might influence the speakers' phonological knowledge.\n",
    "",
    "",
    "Index Terms. phonological knowledge, orthographic knowledge, dialectal traits, variation and change\n",
    ""
   ]
  },
  "garcia10_exling": {
   "authors": [
    [
     "Francisco Javier Bucio",
     "García"
    ]
   ],
   "title": "Tarascan dialectal and generational differences around aspirated stops",
   "original": "el10_065",
   "page_count": 4,
   "order": 17,
   "p1": "65",
   "pn": "68",
   "abstract": [
    "The Tarascan or phurépecha language contrasts aspirated stops from non-aspirated word initially, but this contrast was hardly heard in Hiwatzio, a lake dialect (Friedrich 1971:177). We measured the length of the aspirated feature following stops and vowels /i a u/'s formants F1 and F2 so as to identify differences among subjects. The results show that adult men speakers from a mountain dialect make an aspiration shorter than men from a lake dialect. The opposite pattern applies for women belong to the same dialects. Regarding generational differences, a young man from a lake dialect does a shorter aspiration than the older men do and a young girl's F1 and F2 of /i, a, u/ tend to be higher than older women.\n",
    "",
    "",
    "Index Terms. tarascan, aspirated, generational, dialectal differences.\n",
    ""
   ]
  },
  "kainada10_exling": {
   "authors": [
    [
     "Evia",
     "Kainada"
    ]
   ],
   "title": "Boundary-related durations in modern Greek",
   "original": "el10_068",
   "page_count": 5,
   "order": 18,
   "p1": "68",
   "pn": "72",
   "abstract": [
    "This paper investigates the influence of prosodic boundary strength on the temporal organisation of speech. It tests whether Modern Greek (MG) exhibits pre- and postboundary lengthening, and whether the lengthening effect decays gradually the further away from the boundary, or is attracted to stressed syllables, even if those are not in the proximity of the boundary. It is shown that MG exhibits pre-boundary lengthening, which is at its strongest on the pre-boundary syllable, followed in strength by the stressed syllable, and is least pronounced on the intervening unstressed syllables. No clear post-boundary lengthening effects were identified.\n",
    "",
    "",
    "Index Terms. prosodic structure, pre- and post-boundary lengthening, Modern Greek\n",
    ""
   ]
  },
  "kambanaros10_exling": {
   "authors": [
    [
     "Maria",
     "Kambanaros"
    ],
    [
     "Kleanthes K.",
     "Grohmann"
    ],
    [
     "Eleni",
     "Theodorou"
    ]
   ],
   "title": "Action and object naming in mono- and bilingual children with language impairment",
   "original": "el10_073",
   "page_count": 4,
   "order": 19,
   "p1": "73",
   "pn": "76",
   "abstract": [
    "Specific Language Impairment (SLI) is a severe limitation in language ability in the absence of other factors that typically accompany language problems (e.g., hearing impairment, low non-verbal IQ, neurological damage). SLI is the most common and most studied type of developmental language disorder, yet research comparing biand monolingual development is surprisingly lacking, leaving potential implications of bilingualism for children with language disabilities an under-explored area. It is known that monolingual children with SLI are less accurate at naming pictures of objects than age-matched peers with typical language development (TLD), strongly suggesting that difficulties with lexical access are related to a breakdown at the level of the phonological word form, which the present study clearly support.\n",
    "",
    "",
    "Index Terms. Cypriot Greek, mono- and bilingual first language acquisition\n",
    ""
   ]
  },
  "kapatsinski10_exling": {
   "authors": [
    [
     "Vsevolod",
     "Kapatsinski"
    ],
    [
     "Lamia Haddad",
     "Johnston"
    ]
   ],
   "title": "Is that a <i>bnik</i> i see? testing phonotactics using word-picture matching",
   "original": "el10_077",
   "page_count": 4,
   "order": 20,
   "p1": "77",
   "pn": "80",
   "abstract": [
    "Phonotactic knowledge is typically tested using metalinguistic wordlikeness judgment tasks. We introduce a new method for testing phonotactics, where subjects are asked to match a set of pictures of novel objects with a larger set of pseudowords, only some of which are phonotactically legal. The subjects tend to pick the pseudowords that are phonotactically legal in their language and leave the illegal ones unassigned. We compare the results of the word-picture matching to a traditional rating task and show that the two tasks produce somewhat different results despite sharing some (25%) of the variance. We argue for methodological pluralism in the study of phonotactics.\n",
    "",
    "",
    "Index Terms. phonotactics, word-picture matching, rating.\n",
    ""
   ]
  },
  "karpava10_exling": {
   "authors": [
    [
     "Sviatlana",
     "Karpava"
    ],
    [
     "Kleanthes K.",
     "Grohmann"
    ]
   ],
   "title": "Embedded aspect in L2 acquisition: evidence from L1-Russian learners of Greek",
   "original": "el10_081",
   "page_count": 4,
   "order": 21,
   "p1": "81",
   "pn": "84",
   "abstract": [
    "This work investigates first-language (L1) influence on second-language (L2) acquisition of embedded aspect, comparing participants with homogeneous L1 background (Russian) in Greece (L2 Standard Modern Greek) and Cyprus (L2 Cypriot Greek), where verb complementation takes a finite form instead of an infinitival as in Russian. The focus of the experimental study is on those embedded sentential environments which allow only perfective aspect in Greek but either perfective or imperfective in Russian. The findings are taken to support the Full Transfer/Full Access Hypothesis, according to which aspect is part of Universal Grammar; L2 learners can reach native-like attainment due to access to UG, while at the initial stage of L2 acquisition transfer from L1 into L2 takes place.\n",
    "",
    "",
    "Index Terms. acquisition, cross-linguistic interference, embedded aspect, imperfective, perfective\n",
    ""
   ]
  },
  "kliper10_exling": {
   "authors": [
    [
     "Roi",
     "Kliper"
    ],
    [
     "Yonatan",
     "Vaizman"
    ],
    [
     "Daphna",
     "Weinshall"
    ],
    [
     "Shirley",
     "Portuguese"
    ]
   ],
   "title": "Evidence for depression and schizophrenia in speech prosody",
   "original": "el10_085",
   "page_count": 4,
   "order": 22,
   "p1": "85",
   "pn": "88",
   "abstract": [
    "We developed automatic computational tools for the monitoring of pathological mental states – including characterization, detection, and classification. We show that simple temporal domain features of speech may be used to correctly classify up to 80% of the speakers in a two-way classification task. We further show that some features strongly correlate with certain diagnostic evaluation scales, suggesting the contribution of such acoustic speech properties to the perception of an apparent mental condition.\n",
    "",
    "",
    "Index Terms. Speech analysis, Schizophrenia, Depression.\n",
    ""
   ]
  },
  "lazarou10_exling": {
   "authors": [
    [
     "Evaggelia",
     "Lazarou"
    ],
    [
     "Marianna",
     "Hatzopoulou"
    ]
   ],
   "title": "The effect of cochlear implants on phonological acquisition",
   "original": "el10_089",
   "page_count": 4,
   "order": 23,
   "p1": "89",
   "pn": "92",
   "abstract": [
    "The aim of the present study was to compare the phonological errors that occur in the speech of two 12-year-old Greek children with profound hearing loss. The first child used a cochlear implant (CI) and the second one used hearing aids (HA). The children's phonological development has been assessed using the Phonetic and Phonological Development Test (PPDT), (Levandi et al. 1995)1. In alignment with previous studies, the child with HA made more phonological errors than the child with CI, even though some unexpected findings were observed regarding the phonological processes used by both children.\n",
    "",
    "",
    "Index Terms. Phonological errors, cochlear implants\n",
    ""
   ]
  },
  "lehtinen10_exling": {
   "authors": [
    [
     "Mari",
     "Lehtinen"
    ]
   ],
   "title": "Observations on the prosodic characteristics of Finnish-speaking youngsters with Asperger syndrome",
   "original": "el10_093",
   "page_count": 4,
   "order": 24,
   "p1": "93",
   "pn": "96",
   "abstract": [
    "This paper presents some preliminary results of a post doctoral research project directed towards the prosodic and nonverbal deficiencies of French- and Finnishspeaking youngsters with Asperger Syndrome. More precisely, the paper is focussed on the salient prosodic features that characterise the speech of the Finnishspeaking informants of the project. The term ‘prosody' is conceived here in a large sense, encompassing also such paralinguistic features as breathiness, creak, nasalization and whisper (Couper-Kuhlen 2000). The data consists of audiovisual recordings of two neuropsychiatric group therapy sessions where two different groups of 11–13-year-old boys discuss with two therapists and with each other. Methodologically, the study is based on Conversation Analysis and, more precisely, on the interactional approach to the study of prosody.\n",
    "",
    "",
    "Index Terms. Asperger Syndrome, prosody, interaction, conversation analysis\n",
    ""
   ]
  },
  "leivada10_exling": {
   "authors": [
    [
     "Evelina",
     "Leivada"
    ],
    [
     "Paraskevi",
     "Mavroudi"
    ],
    [
     "Anna",
     "Epistithiou"
    ]
   ],
   "title": "Metalanguage or bidialectism? acquisition of clitic placement by Hellenic Greeks, Greek Cypriots and binationals in the diglossic context of Cyprus",
   "original": "el10_097",
   "page_count": 4,
   "order": 25,
   "p1": "97",
   "pn": "100",
   "abstract": [
    "Acquisition of object clitics is one of the more investigated aspects of the largely understudied variety of Modern Greek spoken in the Republic of Cyprus. Previous studies on the acquisition of clitics in Cypriot Greek usually acknowledge that the linguistic reality in Cyprus involves a state of diglossia, where the sociolinguistically ‘high' Standard Modern Greek co-exists with the ‘low' Cypriot Greek. Acquisition of clitic placement in simple declaratives is here approached through a picture-based elicitation task by testing both varieties in three populations residing in Cyprus — Greek Cypriots, Hellenic Greeks, and binationals — so as to examine implications for bidialectism and its connections with enhanced metalinguistic abilities.\n",
    "",
    "",
    "Index Terms. acquisition, clitic placement, Cypriot Greek, diglossia, metalanguage\n",
    ""
   ]
  },
  "li10_exling": {
   "authors": [
    [
     "Bin",
     "Li"
    ],
    [
     "Ratree",
     "Wayland"
    ],
    [
     "Caicai",
     "Zhang"
    ]
   ],
   "title": "Contextual information in (non-)native speech perception in noise",
   "original": "el10_101",
   "page_count": 4,
   "order": 26,
   "p1": "101",
   "pn": "104",
   "abstract": [
    "Non-native listeners' perception of speech has been shown to be more adversely affected by interference from background noise than native speakers. This study focused on effects of different levels of linguistic information on speech perception in noise. We examined roles of phonetic and contextual cues in sentence perception in babble noise by Chinese learners and native speakers of English. Our sentences varied in degrees of syntactic and semantic acceptability. Results revealed similar patterns of perception in the performance of listener groups. Secondly, listeners benefited more from certain sentence types under different listening conditions.\n",
    "",
    "",
    "Index Terms. speech perception in noise, ESL/EFL learners, sentence perception\n",
    ""
   ]
  },
  "madureira10_exling": {
   "authors": [
    [
     "Sandra",
     "Madureira"
    ],
    [
     "Zuleica Antonia de",
     "Camargo"
    ]
   ],
   "title": "Exploring sound symbolism in the investigation of speech expressivity",
   "original": "el10_105",
   "page_count": 4,
   "order": 27,
   "p1": "105",
   "pn": "108",
   "abstract": [
    "The objective of this paper is to examine specific uses of sound symbolism concerning segmental and prosodic properties. The typology developed by Hilton et al (2004) is taken as reference. The corpus of this work is a poem recorded by a professional actor. A research methodology comprising prosodic perceptual analysis, prosodic acoustic analysis and affective states evaluation tests is proposed. The results indicate the speaking strategies used by the actor have been found to make use of three types of sound symbolism (synesthesic, imitative and metalinguistic). Correlations among acoustic properties, perceived affective states and text meaning production demonstrate productive use of sound symbolism and corroborate the discussion on the direct links between sound and meaning.\n",
    "",
    "",
    "Index Terms. speech expressivity, sound symbolism, acoustic and perceptual cues\n",
    ""
   ]
  },
  "martin10_exling": {
   "authors": [
    [
     "Philippe",
     "Martin"
    ]
   ],
   "title": "A dynamic view of the prosodic structure: the example of French",
   "original": "el10_109",
   "page_count": 4,
   "order": 28,
   "p1": "109",
   "pn": "112",
   "abstract": [
    "The sentence prosodic structure is traditionally viewed globally in intonation phonology, taking into account all the prosodic events at once from the beginning to the end, without explicitly integrating the fact that these events occur one after the other in a time sequence. Indeed, whereas the speaker can achieve some planning ahead while reading a written text, it is barely the case for the listener, who has to process the sequence of syllabic units perceived one by one along the time scale. It is suggested here that prosodic events are used as acoustic signals triggering partial processing and storage of the already perceived syllables, followed by a concatenation of linguistic units (normally stress groups) already stored. This paper looks in some details into the mechanism of this decoding process, focusing on the role of prosodic events in the specific case of French.\n",
    "",
    "",
    "Index Terms. Prosodic structure, French, Fo contour, cognitive process\n",
    ""
   ]
  },
  "mavroudi10_exling": {
   "authors": [
    [
     "Paraskevi",
     "Mavroudi"
    ],
    [
     "Evelina",
     "Leivada"
    ],
    [
     "Anna",
     "Epistithiou"
    ]
   ],
   "title": "Acquisition of lightverbhood: evidence from Cypriot Greek",
   "original": "el10_113",
   "page_count": 4,
   "order": 29,
   "p1": "113",
   "pn": "116",
   "abstract": [
    "This experiment investigates the acquisition of (true) light verb constructions (in the sense of Kearns 1988/2002) as well as other constructions that involve a light verb in Cypriot Greek. Focusing on the acquisition of the light verb kamno ‘do/make’, this study aims to identify (i) whether light verb constructions are more frequent in Cypriot Greek than in Standard Modern Greek, (ii) what the age of acquisition is for true light verb constructions, and (iii) how sensitive to (light verb) priming children of different ages are in a picture-based elicitation task; in addition, this research tests whether adults can be sensitive enough to priming so as to reproduce light verb constructions that are inexistent in Cypriot Greek.\n",
    "",
    "",
    "Index Terms. acquisition, Cypriot Greek, lightverbhood, priming\n",
    ""
   ]
  },
  "muller10_exling": {
   "authors": [
    [
     "Daniela",
     "Müller"
    ]
   ],
   "title": "Phonetic factors influencing /l/-rhoticisation in Greek",
   "original": "el10_117",
   "page_count": 4,
   "order": 30,
   "p1": "117",
   "pn": "120",
   "abstract": [
    "This study investigates phonetic factors – vocalic/consonantal context, duration, stress - favouring rhotic perception of the lateral approximant in Greek. Nonsense words containing the lateral in different lengths in both intervocalic and internal coda position, alongside similar words containing a rhotic, were presented to Greek listeners for categorisation as /l/ or /r/. Results showed that laterals were perceived as rhotics if they matched the rhotic in duration. Rhotics, on the other hand, were only perceived as laterals if they were articulated as an approximant rather than as a tap.\n",
    "",
    "",
    "Index Terms. laterals, rhotics, perception, sound change\n",
    ""
   ]
  },
  "nikolaenkova10_exling": {
   "authors": [
    [
     "Olga",
     "Nikolaenkova"
    ]
   ],
   "title": "Perception of “tonal focus” in Greek",
   "original": "el10_121",
   "page_count": 4,
   "order": 31,
   "p1": "121",
   "pn": "124",
   "abstract": [
    "The present paper reports on the way tonal correlates of focus impact its identification in Greek simple declaratives. The material was based on 4 utterances with different focus placement. Manipulation of the F0 contour and duration of the original utterances resulted in a list of 18 utterances, repeated 10 times each, and presented randomly to each of 10 informants. The informants were asked to indicate what part of each utterance bore focus. The results showed that: (1) F0 is the most reliable parameter for focus perception, especially the rate of tonal rise/fall, (2) duration expansion is not sufficient for focus perception, and (3) combining F0 and duration affects successful focus identification.\n",
    "",
    "",
    "Index Terms. Greek, focus, tonal structure, tonal movement, perception\n",
    ""
   ]
  },
  "nirgianaki10_exling": {
   "authors": [
    [
     "Elina",
     "Nirgianaki"
    ],
    [
     "Anthi",
     "Chaida"
    ],
    [
     "Marios",
     "Fourakis"
    ]
   ],
   "title": "Acoustic structure of fricative consonants in Greek",
   "original": "el10_125",
   "page_count": 4,
   "order": 32,
   "p1": "125",
   "pn": "128",
   "abstract": [
    "The present study examines the temporal and spectral characteristics of Greek fricatives (duration and spectral moments, i.e. mean, variance, skewness, kurtosis) as distinctive cues for their place of articulation. The effects of voicing, speaker's gender and post-fricative vowel on both duration and spectral moments are also investigated. The results indicate that noise duration does not distinguish fricatives in terms of place of articulation. However, voiceless fricatives have longer durations than voiced ones. Spectral moments distinguish fricatives in terms of place of articulation, except for the labiodental from dental place.\n",
    "",
    "",
    "Index Terms. Greek, fricatives, duration, spectral moments\n",
    ""
   ]
  },
  "oh10_exling": {
   "authors": [
    [
     "Sunyoung",
     "Oh"
    ]
   ],
   "title": "The IPA training on the pronunciation of difficult English words for Cantonese speakers",
   "original": "el10_129",
   "page_count": 4,
   "order": 33,
   "p1": "129",
   "pn": "132",
   "abstract": [
    "This study examined English pronunciation by Cantonese speakers in Hong Kong with the International Phonetic Alphabet (IPA) to see how the application of IPA can be used in language education. Twenty university students, divided into two groups, one with the IPA training and the other without the training, were asked to read 30 English words (5 controls) that contain challenging sounds (e.g., liaison, knead) with and without the IPA transcriptions. Words were divided into three categories - difficult vowels, silent sounds, and ambiguous sounds. Results showed that the pronunciations by the IPA trained group improved greatly for all categories when IPA was provided; however, the response time was longer compared to the non-trained group. No significant improvement was found in the non-trained group though the pronunciation of the words with silent sounds improved with the IPA. The study suggests that the IPA training can be an alternative way to assist ESL learners to have access to proper English pronunciations when resources are limited.\n",
    "",
    "",
    "Index Terms. Phonetic alphabet, pronunciation, second language acquisition, English, Cantonese\n",
    ""
   ]
  },
  "oliveira10_exling": {
   "authors": [
    [
     "Catarina",
     "Oliveira"
    ],
    [
     "António",
     "Teixeira"
    ],
    [
     "Paula",
     "Martins"
    ]
   ],
   "title": "Towards an articulatory characterization of european portuguese /l/",
   "original": "el10_133",
   "page_count": 4,
   "order": 34,
   "p1": "133",
   "pn": "136",
   "abstract": [
    "Based on EMA data, this study investigates timing and magnitude properties of lingual gestures involved in the production of European Portuguese /l/ in onset and coda positions. Syllable position effects were found: coordination pattern for syllable-initial /l/ is distinct from those observed for syllable-final /l/; the tongue dorsum is more retracted in the syllable-final /l/; /l/s in coda showed, for one of the speakers, a reduction in magnitude of the tongue tip gesture.\n",
    "",
    "",
    "Index Terms. (European) Portuguese /l/, EMA, clear/dark allophony\n",
    ""
   ]
  },
  "paradowski10_exling": {
   "authors": [
    [
     "Michaŀ B.",
     "Paradowski"
    ]
   ],
   "title": "A complexity science perspective on language spread",
   "original": "el10_137",
   "page_count": 4,
   "order": 35,
   "p1": "137",
   "pn": "140",
   "abstract": [
    "Linguistic creativity is a manifestation of innovativeness. Investigating the diffusion of linguistic innovation requires an interdisciplinary approach, pooling competences from sciences humanistic, social, and strict (in particular mathematics and computational methods). The initial results will be presented of an empirical project analysing the social spread of neologisms in a microblogging site.\n",
    "",
    "",
    "Index Terms. linguistic creativity, neologisms, innovation diffusion, social networks\n",
    ""
   ]
  },
  "pavlou10_exling": {
   "authors": [
    [
     "Natalia",
     "Pavlou"
    ]
   ],
   "title": "<i>inda mbu, nambu</i> or <i>ine ti pu</i>? acquiring complex structures in Cypriot Greek",
   "original": "el10_141",
   "page_count": 4,
   "order": 36,
   "p1": "141",
   "pn": "144",
   "abstract": [
    "The current study investigates the hypothesis that certain Cypriot Greek (CG) whphrases show similar paths of acquisition with cleft sentences based on syntactic complexity. That is, wh-phrases of the inda (mbu)-type in CG can be decomposed in an abstract way as clefts, giving ine ti pu ‘what is it that’. Targeting a comparison between these two structures, wh-questions with inda (mbu) along with subject- and object-clefts were included in a production elicitation experiment given to children aged 2;7-6;4. The preliminary results raise several issues ranging from syntactic complexities and movement difficulties in the two structures to sociolinguistic factors and implications for the possible diglossic situation in the Greek Cypriot community.\n",
    "",
    "",
    "Index Terms. acquisition, diglossia, clefts, wh-questions\n",
    ""
   ]
  },
  "peltola10_exling": {
   "authors": [
    [
     "Maija S.",
     "Peltola"
    ],
    [
     "Henna",
     "Tamminen"
    ],
    [
     "Laura",
     "Salonen"
    ],
    [
     "Heidi",
     "Toivonen"
    ],
    [
     "Teija",
     "Kujala"
    ],
    [
     "Risto",
     "Näätänen"
    ]
   ],
   "title": "Two languages – one brain",
   "original": "el10_145",
   "page_count": 4,
   "order": 37,
   "p1": "145",
   "pn": "148",
   "abstract": [
    "Studies on bilingual speech processing have implied that bilinguals may either have two separate or one intertwined system. These findings have been obtained by multiple methods using various types of bilinguals. Our study compared monolinguals and two types of bilinguals. We used the same methods for all groups, i.e., we measured attentive identification scores and preattentive discrimination. Our results show that bilinguals process speech sounds differently from monolinguals, and more importantly, that there is a difference between the two types of bilinguals. We suggest that dominant bilinguals have two separate phonological systems, while balanced bilinguals have one uniform system.\n",
    "",
    "",
    "Index Terms. speech perception, bilingualism, mismatch negativity\n",
    ""
   ]
  },
  "roberts10_exling": {
   "authors": [
    [
     "Lisa",
     "Roberts"
    ]
   ],
   "title": "Real and acted responses of distress: an auditory and acoustic analysis of extreme stress and emotion",
   "original": "el10_149",
   "page_count": 4,
   "order": 38,
   "p1": "149",
   "pn": "152",
   "abstract": [
    "The study explores vocal responses of distress in authentic and acted forensic situations. Data is drawn from an archive of forensic recordings and comparable scenarios involving actors. The material is subject to acoustic and auditory-phonetic analyses. Results are presented on parameters including fundamental frequency (F0), tempo, intensity, and vowel quality. Findings show that victims and actors in distress generally demonstrate an increase in F0 and intensity overall, an increase in variability of F0 and intensity, and a decrease in tempo. Actors' distress responses differ from those from real victims in vowel quality and their exaggerated increase in F0.\n",
    "",
    "",
    "Index Terms. forensic phonetics, distress speech, acted responses\n",
    ""
   ]
  },
  "roberts10b_exling": {
   "authors": [
    [
     "Lisa",
     "Roberts"
    ],
    [
     "Peter",
     "French"
    ]
   ],
   "title": "How context affects perception: judging distress and linguistic content in forensic audio recordings",
   "original": "el10_153",
   "page_count": 4,
   "order": 39,
   "p1": "153",
   "pn": "156",
   "abstract": [
    "In order to assess the role of context on the perception of speech sounds, extracts of speech material from authentic forensic cases were played to two groups of listeners (experienced vs inexperienced forensic phoneticians) in two conditions (with and without sequential context). Listeners were asked to categorise each extract according to a four-way scale of perceptible distress and rate each extract according to a five-point scale of perceptible linguistic content. Findings show that extracts played without context are perceived as reflecting higher degrees of distress and lower levels of linguistic content. Experienced phoneticians performed more consistently as a group and were less prone to changing their responses across the two conditions.\n",
    "",
    "",
    "Index Terms. perception, distress, forensic, context, linguistic content\n",
    ""
   ]
  },
  "savino10_exling": {
   "authors": [
    [
     "Michelina",
     "Savino"
    ]
   ],
   "title": "Intonational strategies for backchanneling in Italian Map Task dialogues",
   "original": "el10_157",
   "page_count": 4,
   "order": 40,
   "p1": "157",
   "pn": "160",
   "abstract": [
    "This paper investigates intonational strategies for backchanneling in Bari Italian task-oriented dialogues. Results show that whilst giving feedback, listeners indicate their intention to take the floor or not by using a falling or rising intonation contour respectively. However, this general tendency can be reversed if added paralinguistic meanings are conveyed.\n",
    "Keywords: Backchannels, Prosody, Italian language, Map Task dialogues\n",
    ""
   ]
  },
  "shukla10_exling": {
   "authors": [
    [
     "Sunil R.",
     "Shukla"
    ]
   ],
   "title": "Improving intelligibility of synthesized speech in noise with emphasized prosody",
   "original": "el10_161",
   "page_count": 4,
   "order": 41,
   "p1": "161",
   "pn": "164",
   "abstract": [
    "The performance of current high quality concatenative text-to-speech (TTS) systems is limited under noisy environments. This paper investigates whether or not the intelligibility of synthesized speech in noise can be improved by emphasizing the prosody. Additionally, the paper presents a method that can effectively emphasize the prosody of units in existing TTS databases. The circular linear prediction (CLP) model is combined with the constant-pitch transform (CPT) to perform pitch and duration modifications to concatenative TTS units with little impact to the subjective quality. Test utterances are generated using the method and compared to reference utterances synthesized by a high quality TTS engine. The subjective test results demonstrate a preference for emphasized prosody in the majority of the test cases.\n",
    "",
    "",
    "Index Terms. TTS, speech synthesis, linear prediction, prosody, noisy speech\n",
    ""
   ]
  },
  "silva10_exling": {
   "authors": [
    [
     "Cláudia",
     "Silva"
    ]
   ],
   "title": "There is more to chat discourse than written conversation",
   "original": "el10_165",
   "page_count": 4,
   "order": 42,
   "p1": "165",
   "pn": "168",
   "abstract": [
    "In this paper, we aim at comparing some deviations from standard writing present in Portuguese and English informal chats in order to reflect on the linguistic knowledge that lies beneath these innovative spellings: phonetic, phonological or orthographic.\n",
    "",
    "",
    "Index Terms. chats, spelling, deviations, phonetic and phonological knowledge\n",
    ""
   ]
  },
  "sisinni10_exling": {
   "authors": [
    [
     "Bianca",
     "Sisinni"
    ],
    [
     "Mirko",
     "Grimaldi"
    ],
    [
     "Elisa",
     "Tundo"
    ],
    [
     "Andrea",
     "Calabrese"
    ]
   ],
   "title": "Visual attention during L1 and L2 sounds perception: an eye-tracking study",
   "original": "el10_169",
   "page_count": 4,
   "order": 43,
   "p1": "169",
   "pn": "172",
   "abstract": [
    "Visual information affects speech perception as demonstrated by the McGurk effect (McGurk & McDonald, 1976): when audio /ba/ is dubbed with a visual /ga/, what is perceived is /da/. This study aims at observing how visual information, intended as articulatory orofacial movements, is processed by eye, i.e., if gaze is related to articulatory information processing. The results indicate that visual attentional resources seem to be higher during multisensory (AV) than unisensory (A; V) presentation. Probably, higher visual attentional resources are needed to integrate inputs coming from different sources. Moreover, audiovisual speech perception seems to be similar across languages (e.g., Chen & Massaro, 2004) and not language-specific (Ghazanfar et al., 2005).\n",
    "",
    "",
    "Index Terms. Audiovisual speech, multisensory integration, native and non-native perception\n",
    ""
   ]
  },
  "szabo10_exling": {
   "authors": [
    [
     "Eszter",
     "Szabó"
    ]
   ],
   "title": "Pause ratio effect in emotion ascribing",
   "original": "el10_173",
   "page_count": 4,
   "order": 44,
   "p1": "173",
   "pn": "176",
   "abstract": [
    "In this study we investigated how pause length and pause ratio influence listeners in ascribing emotional states to the speaker, if nothing but the length of the pauses changes. We did this by taking emotionally neutral speech samples and manipulating the length of pauses. Our results show that the same speech samples were perceived to be happier, more positive, more heated, and concurrently less sad, less disgusted and less scared when pauses were shorter.\n",
    "",
    "",
    "Index Terms. emotion, speech, pause ratio\n",
    ""
   ]
  },
  "sousa10_exling": {
   "authors": [
    [
     "Lílian Teixeira de",
     "Sousa"
    ]
   ],
   "title": "Prosodic evidences to sentential negation in Brazilian portuguese",
   "original": "el10_177",
   "page_count": 4,
   "order": 45,
   "p1": "177",
   "pn": "180",
   "abstract": [
    "Brazilian Portuguese (BP) permits at least three kinds of sentential negation - Neg1 (Não VP), Neg2 (Não VP Não) and Neg3 (VP Não). The theme of this paper is the nature of this variation. We will try to demonstrate that at least in some contexts Neg2 exhibit properties associated with presupposed denial, reflecting fundamental differences in relation to canonical negation (Neg1). Some contexts show the incompatibility of Neg2 and Neg1. We believe this incompatibility can be explained by presupposition and scope. The aim of this paper is try to show the relation between the negation structures in BP and the pragmatic content.\n",
    "",
    "",
    "Index Terms. Negation, Brazilian Portuguese, pragmatic, prosody\n",
    ""
   ]
  },
  "themistocleous10_exling": {
   "authors": [
    [
     "Charalambos",
     "Themistocleous"
    ],
    [
     "Stelios",
     "Kyriacou"
    ]
   ],
   "title": "Focus prominence and tonal alignment in Athenian and Cypriot Greek",
   "original": "el10_181",
   "page_count": 4,
   "order": 46,
   "p1": "181",
   "pn": "184",
   "abstract": [
    "This study examines the effects of focus prominence production on tonal alignment in Athenian Greek and Cypriot Greek. Information focus has been elicited by using a Wh-Question in utterances with varying number of syllable constituents —from twelve syllables to eighteen— following the constituent under focus prominence. The results indicate significant effects of speech variety on the alignment of tonal targets; utterance length on the other hand showed poor effects on tonal alignment.\n",
    "",
    "",
    "Index Terms. focus, intonation, Athenian Greek, Cypriot Greek\n",
    ""
   ]
  },
  "theodorou10_exling": {
   "authors": [
    [
     "Eleni",
     "Theodorou"
    ],
    [
     "Kleanthes K.",
     "Grohmann"
    ]
   ],
   "title": "Narratives in Cypriot Greek mono- and bilingual children with SLI",
   "original": "el10_185",
   "page_count": 4,
   "order": 47,
   "p1": "185",
   "pn": "188",
   "abstract": [
    "Narrative ability is one of the most promising ways to assess communicative competence in children: Coordination of lexical, morphosyntactic, phonological, and pragmatic elements is needed to produce narrations. Narratives might even serve as a diagnostic tool for Specific Language Impairment, since children with Specific Language Impairment are reported to have difficulties producing (oral) narratives. Different approaches are available for narrative analysis. In the present study, the Renfrew Bus Story Test was used to investigate narrative ability in mono- and bilingual children aged between 5 and 10 years with typical and impaired language development acquiring Cypriot Greek. The findings suggest that narratives can indeed be a useful tool to identify and assess language-impaired children.\n",
    "",
    "",
    "Index Terms. Cypriot Greek, mono- and bilingual first language acquisition, narrative ability, Renfrew Bus Story Test, Specific Language Impairment\n",
    ""
   ]
  },
  "todaka10_exling": {
   "authors": [
    [
     "Yuichi",
     "Todaka"
    ]
   ],
   "title": "English communication skills for prospective English teachers in Japan",
   "original": "el10_189",
   "page_count": 4,
   "order": 48,
   "p1": "189",
   "pn": "192",
   "abstract": [
    "The objectives of this study are twofold: (1) to promote necessary English oral skills; and (2) to provide prospective English teachers with a necessary roadmap towards achieving competency in English oral communication skills. Prospective English teachers at 11 Japanese universities participated, and we tested our text materials in terms of the degree of motivation, and of the progress on their English oral communication skills. Based upon the obtained results, our text materials helped our participants improve their motivation towards English study and their English oral communication skills. Various modifications that have to be made to the text materials for our next project were also found, however.\n",
    "",
    "",
    "Index Terms. listening, speaking, motivation, self-assessment checklist\n",
    ""
   ]
  },
  "twist10_exling": {
   "authors": [
    [
     "Alina",
     "Twist"
    ]
   ],
   "title": "Morphological productivity in Maltese verbs",
   "original": "el10_193",
   "page_count": 4,
   "order": 49,
   "p1": "193",
   "pn": "196",
   "abstract": [
    "This paper describes an experiment that was designed to determine the morphological productivity of two possible verb formation strategies in Maltese: root and pattern on the one hand, and suffixation on the other. Native Maltese speakers created novel words in response to nonce stimuli. The stimuli ranged from phonotactically and prosodically acceptable, but non-existent nonce forms to those that contained segments and/or prosodic patterns typically found in English or Italian, but not native Maltese words. The results show that speakers are able to utilize both non-concatenative and concatenative strategies of word formation.\n",
    "",
    "",
    "Index Terms. Maltese, morphological productivity, psycholinguistics, borrowing\n",
    ""
   ]
  }
 },
 "sessions": [
  {
   "title": "Papers",
   "papers": [
    "agapitou10_exling",
    "alexandris10_exling",
    "alonso10_exling",
    "blochowiak10_exling",
    "castro10_exling",
    "chaida10_exling",
    "chaida10b_exling",
    "dapolito10_exling",
    "camargo10_exling",
    "drouahamdani10_exling",
    "fourakis10_exling",
    "fox10_exling",
    "fujio10_exling",
    "galantomos10_exling",
    "hatzivasiliou10_exling",
    "henriques10_exling",
    "garcia10_exling",
    "kainada10_exling",
    "kambanaros10_exling",
    "kapatsinski10_exling",
    "karpava10_exling",
    "kliper10_exling",
    "lazarou10_exling",
    "lehtinen10_exling",
    "leivada10_exling",
    "li10_exling",
    "madureira10_exling",
    "martin10_exling",
    "mavroudi10_exling",
    "muller10_exling",
    "nikolaenkova10_exling",
    "nirgianaki10_exling",
    "oh10_exling",
    "oliveira10_exling",
    "paradowski10_exling",
    "pavlou10_exling",
    "peltola10_exling",
    "roberts10_exling",
    "roberts10b_exling",
    "savino10_exling",
    "shukla10_exling",
    "silva10_exling",
    "sisinni10_exling",
    "szabo10_exling",
    "sousa10_exling",
    "themistocleous10_exling",
    "theodorou10_exling",
    "todaka10_exling",
    "twist10_exling"
   ]
  }
 ]
}