{
 "title": "2nd ITRW on Experimental Linguistics",
 "location": "Athens, Greece",
 "startDate": "25/8/2008",
 "endDate": "27/8/2008",
 "conf": "ExLing",
 "year": "2008",
 "name": "exling_2008",
 "series": "ExLing",
 "SIG": "",
 "title1": "2nd ITRW on Experimental Linguistics",
 "date": "25-27 August 2008",
 "booklet": "exling_2008.pdf",
 "papers": {
  "alagozlu08_exling": {
   "authors": [
    [
     "Nuray",
     "Alagözlü"
    ]
   ],
   "title": "Discourse markers and L2 listening: do computers make a difference in L2 listening comprehension?",
   "original": "exl8_001",
   "page_count": 4,
   "order": 1,
   "p1": "1",
   "pn": "4",
   "abstract": [
    "This study explores whether discourse markers play a role in L2 listening comprehension and whether software programs make a difference in L2 listening comprehension. Two groups of approximately 25 freshman students listened to two versions of three different talks with and without higher order discourse markers. The talks were delivered by a native speaker, a non-native speaker and by a software listening program (NaturalReader© 7.0). The scorings, compared using the Mann- Whitney U test, indicate that discourse markers play a significant role only in native speaker speech (p<0,05). It is seen that the highest mean of comprehension is found in the talks delivered by the native speaker. Computers ranked second in providing more comprehensive talks.\n",
    ""
   ]
  },
  "alexandris08_exling": {
   "authors": [
    [
     "Christina",
     "Alexandris"
    ]
   ],
   "title": "Word category and prosodic emphasis in dialog modules of speech technology applications",
   "original": "exl8_005",
   "page_count": 4,
   "order": 2,
   "p1": "5",
   "pn": "8",
   "abstract": [
    "The prosodic behavior of word categories in Modern Greek is observed in relation to two keyword-based Speech Technology applications, namely for a Speech Recognition system in the healthcare domain for task-oriented dialogs intended for senior citizens and for the prosodic modelling of utterances produced by a Conversational Agent in a dialog system for consumer complaints. Word categories are evaluated and classified in the two applications, in respect to the types of words contained in each category, their relation to keywords and their effect on the user.\n",
    ""
   ]
  },
  "alghamdi08_exling": {
   "authors": [
    [
     "Mansour",
     "Alghamdi"
    ],
    [
     "Fayez",
     "Alhargan"
    ],
    [
     "Mohamed",
     "Alkanhal"
    ],
    [
     "Ashraf",
     "Alkhairy"
    ],
    [
     "Munir",
     "Eldesouki"
    ],
    [
     "Ammar",
     "Alenazi"
    ]
   ],
   "title": "Saudi accented Arabic voice bank",
   "original": "exl8_009",
   "page_count": 4,
   "order": 3,
   "p1": "9",
   "pn": "12",
   "abstract": [
    "The aim of this paper is to present an Arabic speech database that represents Arabic native speakers from all the cities of Saudi Arabia. The database is called the Saudi Accented Arabic Voice Bank (SAAVB). Preparing the prompt sheets, selecting the right speakers and transcribing their speech are some of the challenges that faced the project team. The procedures that met these challenges are highlighted. In the project, 1033 speakers speak in Modern Standard Arabic with a Saudi accent. The SAAVB content was analyzed and the results are illustrated. The content was verified internally by the project team and externally by IBM Cairo and can be used to train speech engines such as automatic speech recognition and speaker verification systems.\n",
    ""
   ]
  },
  "alshammari08_exling": {
   "authors": [
    [
     "Eiman Tamah",
     "AlShammari"
    ],
    [
     "Jessica",
     "Lin"
    ]
   ],
   "title": "A new Arabic stemming algorithm",
   "original": "exl8_013",
   "page_count": 4,
   "order": 4,
   "p1": "13",
   "pn": "16",
   "abstract": [
    "Text processing is a vital step in the information retrieval process, text mining, and natural language processing. It includes several stages, such as normalization, stop word removal, and stemming. Stemming is the process of reducing the lexicon to its root. Due to the different structures and rules in languages, the task of stemming is language-dependent. This research introduces a new stemming algorithm for the Arabic Language. Arabic is one of the most complex languages, both spoken and written. However, it is also one of the most common languages in the world. It is the base from which many other languages are derived. Despite the wide usage of the language, technology and development for Arabic has been limited. The main reason lies within the formulation rules of Arabic, as Arabic language exhibits a very complicated morphological structure. Existing Arabic stemmers suffer from high stemming error-rates. They blindly stem all the words and perform poorly, especially with compound words, proper nouns and foreign Arabized words. The main cause of this problem is the stemmer’s lack of knowledge of the word lexical category (i.e. noun, verb, proposition, etc.) This paper presents a new stemming algorithm that relies on Arabic language morphology and Arabic language syntax. The automated addition to the syntactic knowledge reduced both stemming error and stemming cost. Additionally, the new Algorithm automatically creates it is own list of proper nouns, and compound words based on the processed corpus.\n",
    ""
   ]
  },
  "andreou08_exling": {
   "authors": [
    [
     "Georgia",
     "Andreou"
    ],
    [
     "Ioannis",
     "Galantomos"
    ]
   ],
   "title": "Neurolinguistic aspects of metaphor theory",
   "original": "exl8_017",
   "page_count": 4,
   "order": 5,
   "p1": "17",
   "pn": "20",
   "abstract": [
    "The goal of this paper is to examine the neural aspect of metaphor. The neural theory of language stems from the cognitive linguistic research and is an effort to comprehend the way neural circuits affect and shape language and thought. Within this framework it is suggested that metaphor serves as the medium through which cultural, abstract and theoretical concepts are acquired. On the other hand, it is believed that conceptual metaphors are ensembles of neurons located in different parts of the brain and connected by larger neural groups.\n",
    ""
   ]
  },
  "anufryk08_exling": {
   "authors": [
    [
     "Volha",
     "Anufryk"
    ],
    [
     "Matthias",
     "Jilka"
    ],
    [
     "Grzegorz",
     "Dogil"
    ]
   ],
   "title": "Prosodic variation in L2: a case of Germans speaking English",
   "original": "exl8_021",
   "page_count": 4,
   "order": 6,
   "p1": "21",
   "pn": "24",
   "abstract": [
    "The present study investigates prosodic variation as realized by L2 speakers of varying pronunciation ability in comparison with native speakers of English. The results demonstrate the distribution of the rising contours on both the phonological (ToBI frequencies) and phonetic (values for six parameters of the F0 curve) levels. The rising contours and pitch accents have a wider distribution in German productions, and are therefore closer to the German prosodic pattern, as opposed to the native realizations. Another peculiarity concerns the F0 peak frequency parameter in L*H accents as realized by the below-average informants. Their values are significantly different from those of the native and average speakers. Further phonetic differences are to be tested for consistency effects on the subsequent research stages.\n",
    ""
   ]
  },
  "arnold08_exling": {
   "authors": [
    [
     "Denis",
     "Arnold"
    ],
    [
     "Petra",
     "Wagner"
    ]
   ],
   "title": "The influence of top-down expectations on the perception of syllable prominence",
   "original": "exl8_025",
   "page_count": 4,
   "order": 7,
   "p1": "25",
   "pn": "28",
   "abstract": [
    "In our study we use the experimental framework of priming to manipulate our subjects‘ expectations of syllable prominence in sentences with a well-defined syntactic and phonological structure. It shows that it is possible to prime prominence patterns and that priming leads to significant differences in the judgment of syllable prominence.\n",
    ""
   ]
  },
  "arts08_exling": {
   "authors": [
    [
     "Anja",
     "Arts"
    ],
    [
     "Alfons",
     "Maes"
    ],
    [
     "Leo",
     "Noordman"
    ],
    [
     "Carel",
     "Jansen"
    ]
   ],
   "title": "Overspecification in action-oriented discourse: task importance affects the production of overspecifications and overspecifications increase identification efficiency in perception",
   "original": "exl8_029",
   "page_count": 4,
   "order": 8,
   "p1": "29",
   "pn": "32",
   "abstract": [
    "This paper discusses the effect of overspecified reference as a communicative strategy in action-oriented discourse. In a perception and a production experiment, based on identical instructive environments, participants were asked to identify an object after reading a minimally specified or overspecified expression, or to produce a referential expression in a low-importance or a high-importance context. Overspecification shows to be a pervasive instructive production strategy, which mostly affects the addressee’s identification task in a positive way.\n",
    ""
   ]
  },
  "augurzky08_exling": {
   "authors": [
    [
     "Petra",
     "Augurzky"
    ]
   ],
   "title": "Prosodic phrasing in German sentence production: optimal length vs. argument structure",
   "original": "exl8_033",
   "page_count": 4,
   "order": 9,
   "p1": "33",
   "pn": "36",
   "abstract": [
    "In the last few decades, language research has been characterized by an increasing interest in the role of prosody in sentence processing. Besides signalling disambiguation, prosodic phrasing has been shown to be sensitive to balancing demands. The present experiment examined the interaction of both domains in the production of DP1-DP2-V constructions in German. Acoustic analyses indicate that the need to signal argument structure is mediated by prosodic balance: A general tendency of grouping arguments together with their respective heads was observed, which was increased in saliency when prosodic balance supported such a phrasing.\n",
    ""
   ]
  },
  "baumotte08_exling": {
   "authors": [
    [
     "Henrike",
     "Baumotte"
    ],
    [
     "Grzegorz",
     "Dogil"
    ]
   ],
   "title": "Coarticulation in non-native speakers of English: /.lv/-sequences in non-proficient vs. proficient learners",
   "original": "exl8_037",
   "page_count": 4,
   "order": 10,
   "p1": "37",
   "pn": "40",
   "abstract": [
    "This is an acoustic study of the production of English /l/ by Standard German speakers. Previous research categorized these speakers as either non-proficient or proficient with regard to their phonetic abilities. Coarticulation differences might be one of several reasons for less proficient speakers not to be able to overcome their foreign accent. The pattern of consonantal velarization influences the degree of /.lV/-coarticulation within the group of L2 speakers. Significant F2 and Fv values for non-proficient vs. proficient speakers suggest that proficiency can be characterized due to English stimuli being articulated with more active tongue dorsum control (more velarization) which does not appear as such in German language.\n",
    ""
   ]
  },
  "botinis08_exling": {
   "authors": [
    [
     "Antonis",
     "Botinis"
    ],
    [
     "Marios",
     "Fourakis"
    ],
    [
     "Olga",
     "Nikolaenkova"
    ]
   ],
   "title": "Rhythm and stress intervals in Greek and Russian",
   "original": "exl8_041",
   "page_count": 4,
   "order": 11,
   "p1": "41",
   "pn": "44",
   "abstract": [
    "This paper presents the results of a pilot study of stress interval durations in Greek and Russian. Native speakers of each language were recorded producing utterances in which the number of syllables between stressed syllables varied. The results showed a noticeable tendency towards isochrony in Greek but not in Russian, according to which there is an inverse relation between the number of syllables and syllabic durations in produced utterances. Second, lexical stress has a lengthening effect in Greek but hardly in Russian, while focus has no effect in either language.\n",
    ""
   ]
  },
  "boucher08_exling": {
   "authors": [
    [
     "Victor J.",
     "Boucher"
    ],
    [
     "Annie C.",
     "Gilbert"
    ]
   ],
   "title": "Investigations of speech segmentation: addressing the writing bias in language research",
   "original": "exl8_045",
   "page_count": 4,
   "order": 12,
   "p1": "45",
   "pn": "48",
   "abstract": [
    "We address the problem of defining universal processes of speech segmentation in view of criticisms that conceptual linguistic units derive from western writing. A synthesis of our recent experimental studies is presented bearing on processes of serial-order and rhythmic grouping. First, on how serial-order operates, we use EMG and speech-motion data to show that \"consonant-vowel\" orders reflect contractionrelaxation cycles (not separate segments). Second, on how sequences of sounds come to form units in language learning, we discuss behavioural data suggesting a link between rhythm groups in speech and grouping effects on memory of speech sounds. Preliminary EEG data is then presented to substantiate the view of an online parsing of rhythm groups with effects on memory traces of lexemes.\n",
    ""
   ]
  },
  "camposastorkiza08_exling": {
   "authors": [
    [
     "Rebeka",
     "Campos-Astorkiza"
    ]
   ],
   "title": "Two sources of voicing neutralization in Lithuanian",
   "original": "exl8_049",
   "page_count": 4,
   "order": 13,
   "p1": "49",
   "pn": "52",
   "abstract": [
    "This study compares two processes that result in voicing neutralization in Lithuanian: regressive voicing assimilation in obstruent clusters and final devoicing of obstruents. Acoustic data is analyzed to assess the behaviour of three acoustic cues to obstruent voicing (i.e. closure and preceding vowel duration and voicing during closure) in both neutralizing environments. The results show that, although both processes result in incomplete voicing neutralization, they use the acoustic cues differently. This suggests that final devoicing and voicing assimilation have different acoustic realizations, supporting their analysis as two different processes.\n",
    ""
   ]
  },
  "cantoni08_exling": {
   "authors": [
    [
     "Maria",
     "Cantoni"
    ]
   ],
   "title": "Stress assignment in Brazilian Portuguese: a usage-based approach",
   "original": "exl8_053",
   "page_count": 4,
   "order": 14,
   "p1": "53",
   "pn": "56",
   "abstract": [
    "The major debate on primary stress assignment in Brazilian Portuguese (BP) concerns whether it is lexically given or predictable by a set of principles. This paper presents a contribution to this debate by suggesting a usage-based approach to stress assignment in BP. It is argued that stress assignment is better accounted for as the result of generalizations over exemplars, and these generalizations are responsible for the main tendencies regarding stress assignment in the language.\n",
    ""
   ]
  },
  "castro08_exling": {
   "authors": [
    [
     "Luciana",
     "Castro"
    ],
    [
     "João Antônio de",
     "Moraes"
    ]
   ],
   "title": "The temporal structure of professional speaking styles in Brazilian Portuguese",
   "original": "exl8_057",
   "page_count": 4,
   "order": 15,
   "p1": "57",
   "pn": "60",
   "abstract": [
    "This study describes the temporal organization of speech collected from politicians, religious leaders and television news anchors, individuals for whom speech represents an essential component of their professional identity. Analysis of duration measurements of the recorded speech suggests that the temporal differences observed between the speaking styles are statistically significant.\n",
    ""
   ]
  },
  "chaida08_exling": {
   "authors": [
    [
     "Anthi",
     "Chaida"
    ]
   ],
   "title": "Prosodic perception of sentence types in Greek",
   "original": "exl8_061",
   "page_count": 4,
   "order": 16,
   "p1": "61",
   "pn": "64",
   "abstract": [
    "This study examines the relation between prosody and sentence-type perception in Greek, through a perceptual experiment using synthetic hum sound analogs of statements, polar/wh-questions and commands. The results indicate that sentence types may be partially identified through prosody. The identification rates were not very high, due to the nature of the synthetic stumuli. Wh-questions were easily perceived, while for the other sentence types falling boundary tones seem to be misleading.\n",
    ""
   ]
  },
  "chentir08_exling": {
   "authors": [
    [
     "Amina",
     "Chentir"
    ],
    [
     "Mhania",
     "Guerti"
    ],
    [
     "Daniel",
     "Hirst"
    ]
   ],
   "title": "Classification by discriminant analysis of the energy in view of the detection of accentuated syllable in standard Arabic",
   "original": "exl8_065",
   "page_count": 4,
   "order": 17,
   "p1": "65",
   "pn": "68",
   "abstract": [
    "In this work, we exploited the acoustic parameter energy to a classification by a discriminant analysis to detect the primary accent syllables of type [CV] where [C] is a consonant and [V] a vowel, in Standard Arabic words. Generally, the three acoustic parameters used in prosody are: the fundamental, the duration and the energy, as well as the localization of the prominent syllable in final or initial position have an influence on the perception of the lexical accent in Arabic. A percentage of detection equal to 78% of the accentuated syllable shows the efficiency of such an approach that will be able to come to reinforce the methods based on the criteria of the fundamental, in the goal to improve the existing systems of synthesis and recognition in Standard Arabic.\n",
    ""
   ]
  },
  "chu08_exling": {
   "authors": [
    [
     "Man-ni",
     "Chu"
    ],
    [
     "Carlos",
     "Gussenhoven"
    ],
    [
     "Roeland van",
     "Hout"
    ]
   ],
   "title": "The identification of the place of articulation in coda stops as a function of the preceding vowel: a cross-linguistic study",
   "original": "exl8_069",
   "page_count": 4,
   "order": 18,
   "p1": "69",
   "pn": "72",
   "abstract": [
    "Three groups of listeners, one with a /p,t,k/ stop system in the syllable coda (Dutch), one with /p,k,?/ (ChaoShan) and one with / p,t,k,?/ (ZhangQuan) were asked to identify the final C in CVC-stimuli as one of the consonants [p,t,k,?]. Identification was affected by the nature of the coda C and the V. The identification of the bilabial stop significantly increases after /i/, that of the velar stop after /-a/ and that of the alveolar stop after /u/.\n",
    ""
   ]
  },
  "correia08_exling": {
   "authors": [
    [
     "Deolinda",
     "Correia"
    ],
    [
     "Isabel Hub",
     "Faria"
    ],
    [
     "Paula",
     "Luegi"
    ]
   ],
   "title": "Reading mathematical exercises: preliminary results",
   "original": "exl8_073",
   "page_count": 4,
   "order": 19,
   "p1": "73",
   "pn": "76",
   "abstract": [
    "This research on reading comprehension is concerned with linguistic complexity processing and solving of mathematical exercises by 95 Portuguese students aged 9 to 15 years, attending one of the three basic school levels. Exercises were selected from the full set of national examinations (from 2000 till 2007), covering different mathematical areas. Experimental task was to present subjects with an exercise text followed by a possible result which they had to evaluate as a good or bad answer. Preliminary results indicate that although the extension of the exercise text and of the answer influences the time spent reading and solving the problem, it does not necessarily make the resolution of the exercise harder.\n",
    ""
   ]
  },
  "ouden08_exling": {
   "authors": [
    [
     "Hanny den",
     "Ouden"
    ],
    [
     "Carel van",
     "Wijk"
    ]
   ],
   "title": "Prosody in read aloud text: relation with information status, content type and boundary strength",
   "original": "exl8_077",
   "page_count": 4,
   "order": 20,
   "p1": "77",
   "pn": "80",
   "abstract": [
    "In two short stories three text characteristics have been implemented independent of each other: information status, content type, and boundary strength. Thus, each characteristic could be assessed for its unique effect on prosody. Both stories were read aloud by ten speakers. No effects were found for pitch range and articulation rate, but pause duration did vary systematically with each of the text characteristics. Effects ranged from small for information status to moderate for content type, and large for boundary strength.\n",
    ""
   ]
  },
  "fale08_exling": {
   "authors": [
    [
     "Isabel",
     "Falé"
    ]
   ],
   "title": "Imperatives in European Portuguese: a perception approach",
   "original": "exl8_081",
   "page_count": 4,
   "order": 21,
   "p1": "81",
   "pn": "84",
   "abstract": [
    "In European Portuguese (EP), intonation has a grammatical function. In the available research in EP intonation, production imperatives are said to have an F0 risingfalling contour of large amplitude and are described as having an intonation contour similar to wh-questions, although they present rhythmic differences (Viana, 1987). A possible increase in pitch span was also reported. Two perception experiments were developed to identify sound-sequence features of imperative intonation prototype. The results showed that the major intonation distinction between declaratives and imperatives in EP was related both with local events, that determine utterance contour shape, namely F0 movements, and global events that locate F0 levels.\n",
    ""
   ]
  },
  "fale08b_exling": {
   "authors": [
    [
     "Isabel",
     "Falé"
    ],
    [
     "Isabel Hub",
     "Faria"
    ]
   ],
   "title": "Nasometric values for European Portuguese: preliminary results",
   "original": "exl8_085",
   "page_count": 4,
   "order": 22,
   "p1": "85",
   "pn": "88",
   "abstract": [
    "Nasal sounds frequencies in European Portuguese represent 21% of Português Fundamental corpus sounds (Nascimento et al. 1987), revealing how nasality plays an important role in this language and how a speech problem affecting nasality can interfere severely in one’s speech intelligibility. In order to obtain the first standard nasometric values for European Portuguese we developed two tests (syllable repetition and text reading) and collected data from 25 adults. Preliminary results showed that: oral stimuli achieved an average nasalance score of 10%; syllables with nasal consonant and nasal vowel achieved 77% and the reading passages with nasal saturation presented an average score of 44%. Considering these results, we acknowledge the existence of three different levels of normal nasality.\n",
    ""
   ]
  },
  "faria08_exling": {
   "authors": [
    [
     "Isabel Hub",
     "Faria"
    ],
    [
     "Paula",
     "Luegi"
    ]
   ],
   "title": "Priming effect on word reading and recall",
   "original": "exl8_089",
   "page_count": 4,
   "order": 23,
   "p1": "89",
   "pn": "92",
   "abstract": [
    "This study focuses on priming as a function of exposure to bimodal stimuli of European Portuguese screen centred single words and isolated pictures inserted at the screen’s right upper corner, with four kinds of word-picture relation. The eye movements of 18 Portuguese native university students were registered while reading four sets of ten word-picture pairs, and their respective oral recall lists of words or pictures were kept. The results reveal a higher phonological priming effect when recalling words. Results are discussed taking into consideration the eye movements’ behaviour values (number and duration of fixations, and number of transitions between word and picture).\n",
    ""
   ]
  },
  "fernandezparra08_exling": {
   "authors": [
    [
     "María",
     "Fernández-Parra"
    ]
   ],
   "title": "Formulaic expressions in language technology",
   "original": "exl8_093",
   "page_count": 4,
   "order": 24,
   "p1": "93",
   "pn": "96",
   "abstract": [
    "Little attention has been given to the treatment of formulaic expressions in language technology during the past few decades, although such expressions are in fact extremely common both in conversation and in written discourse. Computer- Assisted Translation (CAT) tools are currently the most widely used language technology tools among professional translators. In this paper, I intend to determine the usefulness of such tools in the treatment of formulaic expressions. In particular, the aim is to evaluate the performance of Trados (2007 version), the leader in the CAT-tools market, in the treatment of such expressions, compared to the treatment of terms and ordinary translation units, by examining the performance of selected components in the identification and translation of formulaic expressions.\n",
    ""
   ]
  },
  "giordano08_exling": {
   "authors": [
    [
     "Rosa",
     "Giordano"
    ]
   ],
   "title": "Continuation tunes in two central varieties of Italian: phonetic patterns and phonological issues",
   "original": "exl8_097",
   "page_count": 4,
   "order": 25,
   "p1": "97",
   "pn": "100",
   "abstract": [
    "This paper presents the phonetic analysis of the intonational patterns conveying the pragmatic contents of continuation and/or marking syntactic relations in Rome and Perugia Italian: data show the type and the distribution of accents and boundaries occurring in spontaneous task-oriented dialogues. Results imply considerations about issues concerning systemic, phonotactic and realizational aspects of the intonational system of Italian: the co-presence of accents and boundaries marking continuation contents; their distribution in the intonation group; the phonetic features correlated, in Italian, to phonological contrast and to phonetic variation.\n",
    ""
   ]
  },
  "hansakunbuntheung08_exling": {
   "authors": [
    [
     "Chatchawarn",
     "Hansakunbuntheung"
    ],
    [
     "Hiroaki",
     "Kato"
    ],
    [
     "Yoshinori",
     "Sagisaka"
    ]
   ],
   "title": "Model-based duration analysis on English natives and Thai learners",
   "original": "exl8_101",
   "page_count": 4,
   "order": 26,
   "p1": "101",
   "pn": "104",
   "abstract": [
    "This paper presents a model-based statistical duration analysis on the comparison between English natives and Thai-native English learners. The analyses were carried out to characterize non-native’s duration control on (1) control differences between natives and learners and on (2) the relationship between the duration characteristics and learners’ background reflecting English experiences. The analyses showed lower speech rate and strong influence of the first language characteristics in beginner’s speech and gradual improvements according to their English experiences quantitatively.\n",
    ""
   ]
  },
  "hemeren08_exling": {
   "authors": [
    [
     "Paul E.",
     "Hemeren"
    ],
    [
     "Sofia",
     "Kasviki"
    ],
    [
     "Barbara",
     "Gawronska"
    ]
   ],
   "title": "Lexicalization of natural actions and cross-linguistic stability",
   "original": "exl8_105",
   "page_count": 4,
   "order": 27,
   "p1": "105",
   "pn": "108",
   "abstract": [
    "To what extent do Modern Greek, Polish, Swedish and American English similarly lexicalize action concepts, and how similar are the semantic associations between verbs denoting natural actions? Previous results indicate cross-linguistic stability between American English, Swedish, and Polish in verbs denoting basic human body movement, mouth movements, and sound production. The research reported here extends the cross-linguistic comparison to include Greek, which, unlike Polish, American English and Swedish, is a path-language. We used action imagery criteria to obtain lists of verbs from native Greek speakers. The data were analyzed by using multidimensional scaling, and the results were compared to those previously obtained.\n",
    ""
   ]
  },
  "herrero08_exling": {
   "authors": [
    [
     "Begoña Payá",
     "Herrero"
    ]
   ],
   "title": "deep and raspy or \"high and squeaky\": a cross-linguistic study of voice perception and voice labeling",
   "original": "exl8_109",
   "page_count": 4,
   "order": 28,
   "p1": "109",
   "pn": "112",
   "abstract": [
    "Vocal correlates for identity markers were sought by interviewing 60 candidates of three nationalities and by analysing their average pitch, intensity, speech rate and speech length. National differences were found in pitch and specially speech rate but no clear vocal correlates for the personality parameter of introversion/extroversion were found. An analysis of the voice labels given by the candidates showed that there are common voice stereotypes for sexy voices and unpleasant voices, despite some minor national differences in the use of labels such as sweet or nasal. Finally, a perception test proved that there is a high-interrater consistency in judgements about voice and personality and that basic emotions and attitudes are well recognised, irrespectively of the language knowledge.\n",
    ""
   ]
  },
  "jannedy08_exling": {
   "authors": [
    [
     "Stefanie",
     "Jannedy"
    ]
   ],
   "title": "The effect of focus on lexical tones in Vietnamese",
   "original": "exl8_113",
   "page_count": 4,
   "order": 29,
   "p1": "113",
   "pn": "116",
   "abstract": [
    "We investigated the effect of focus on the formation of f0 in two of the six tones of the Hà N.i dialect of Vietnamese. This dialect contrasts six lexical tones, has no tone-sandhi, the language does not have focus markers and uses prosody exclusively to express pragmatic contrasts (Jannedy, 2007) by means of intonational emphasis in ways similar to English or German. To tease out the effect of focus on the duration and f0 of the level tone ngang and the rising tone s.c, identical short SVO-type utterances were elicited with a question-answer paradigm under three focus conditions (subject-, verb-, and object focus). Results indicate that the tone especially under subject- and verb- but also object focus shows an f0-excursion for the ngang tone and a scoop and sharp rise for s.c. Duration of the focused syllable also increases.\n",
    ""
   ]
  },
  "kalimeris08_exling": {
   "authors": [
    [
     "Constandinos",
     "Kalimeris"
    ],
    [
     "Stelios",
     "Bakamidis"
    ]
   ],
   "title": "MORPHEMIA: a semi-supervised algorithm for the segmentation of modern Greek words into morphemes",
   "original": "exl8_117",
   "page_count": 4,
   "order": 30,
   "p1": "117",
   "pn": "120",
   "abstract": [
    "The present paper reports on MORPHEMIA, a semi-supervised machine-learning algorithm designed to segment Modern Greek (MG) words into morphemes. The algorithm segments its input iteratively. During its first iteration, the algorithm uses its a priori linguistic knowledge. At the end of each successful iteration, the algorithm extracts new morphological knowledge which is utilised during its next iteration. Thus, with each successful iteration, the algorithm segments an increasing amount of its input data. The algorithm uses a metric to decide whether a given extracted piece of morphological knowledge will improve its performance and only accepts it if it will. Thus, its output gradually improves in quality. MORPHEMIA terminates its operation when new knowledge can no longer be extracted from its input data.\n",
    ""
   ]
  },
  "kinoshita08_exling": {
   "authors": [
    [
     "Naoko",
     "Kinoshita"
    ]
   ],
   "title": "The acquisition of temporal categorical perception by Japanese second language learners",
   "original": "exl8_121",
   "page_count": 4,
   "order": 31,
   "p1": "121",
   "pn": "124",
   "abstract": [
    "This study reports research into the development of perception of special mora categories by Korean learners of Japanese as a second language. First, a test which measured boundary width and the boundary point of distinction between singletons and special mora was used to establish participants’ categorical perception across four levels of proficiency. Then a two year longitudinal study followed the development of 14 learners, during which time the same test was administered three times. The results demonstrated: 1) that the special mora perceptual categories of second language learners developed in some areas, but not in others and 2) that there was a categorization of the special mora over time.\n",
    ""
   ]
  },
  "kocjancic08_exling": {
   "authors": [
    [
     "Tanja",
     "Kocjancic"
    ]
   ],
   "title": "Tongue movements and syllable onset complexity: ultrasound study",
   "original": "exl8_125",
   "page_count": 4,
   "order": 32,
   "p1": "125",
   "pn": "128",
   "abstract": [
    "In this study ultrasound was used to investigate tongue movements in syllables with different number and type of onset consonants. Ultrasound recordings provided the information of the distance the tongue travels over a target, and audio recordings of the time needed. The speed of the tongue’s travel was calculated from the two measurements. Results of ten speakers have shown that both duration and distance travelled increase with an increased number of onset segments, but that distance travelled is additionally influenced by the type of the segment, as is speed. Duration also seemed to be the least speaker-dependant of the three parameters.\n",
    ""
   ]
  },
  "lehtinen08_exling": {
   "authors": [
    [
     "Mari",
     "Lehtinen"
    ]
   ],
   "title": "The prosodic and nonverbal deficiencies of French- and Finnish-speaking persons with Asperger syndrome",
   "original": "exl8_129",
   "page_count": 4,
   "order": 33,
   "p1": "129",
   "pn": "132",
   "abstract": [
    "This paper briefly presents a research project directed towards the prosodic and nonverbal deficiencies of French- and Finnish-speaking persons with Asperger Syndrome (AS). AS is a form of high-functioning autism and it is characterized e.g. by qualitative impairment in social interaction and by stereotyped and restricted patterns of activities and interests. Though persons afflicted with AS generally have no significant delay in language acquisition, and their speech typically lacks significant abnormalities, the language use and the prosody of persons with AS is often atypical: people with AS often have a limited range of intonation, their speech may be overly fast, jerky or loud, and they also typically have abnormal nonverbal behaviours (such as eye contact, facial expressions, postures and gestures).\n",
    ""
   ]
  },
  "lengeris08_exling": {
   "authors": [
    [
     "Angelos",
     "Lengeris"
    ]
   ],
   "title": "The effectiveness of auditory phonetic training on Greek native speakers² perception and production of southern British English vowels",
   "original": "exl8_133",
   "page_count": 4,
   "order": 34,
   "p1": "133",
   "pn": "136",
   "abstract": [
    "This study investigated the effectiveness of auditory phonetic training on Greek native speakers’ perception and production of Southern British English vowels. The trainees identified and produced English bVt words before and after receiving five sessions of High Variability Phonetic Training (multiple speakers in multiple contexts). All of the trainees improved in their overall identification of English vowels. A perception experiment showed that their post-training productions were more accurately identified by native English speakers than their pre-training productions. Taken together, the results demonstrate that speakers of a language with a simple 5-vowel system (viz. Greek) can improve in both perceiving and producing the vowels of a language with a complex system (viz. English) via intensive laboratory training.\n",
    ""
   ]
  },
  "lewandowski08_exling": {
   "authors": [
    [
     "Natalie",
     "Lewandowski"
    ],
    [
     "Travis",
     "Wade"
    ],
    [
     "Grzegorz",
     "Dogil"
    ]
   ],
   "title": "Phonetic convergence and language talent within native-nonnative interactions",
   "original": "exl8_137",
   "page_count": 4,
   "order": 35,
   "p1": "137",
   "pn": "140",
   "abstract": [
    "The notion of phonetic convergence covers all adaptations in articulatory and acoustic features towards those of a communicative partner, or in other terms an increase in segmental and suprasegmental similarity between them (Pardo 2006). Up until now most of the experiments on convergence were designed for monolingual dyads, with very few investigations of convergence in native-nonnative interactions in a foreign language learning environment. We tried to analyze the convergent behavior of nonnative speakers of English in dialog with native speakers and the persistence of the effect in relation to their rated phonetic talent. In this paper we present first results for a global measurement of convergence - the comparison of amplitude envelope signals.\n",
    ""
   ]
  },
  "liu08_exling": {
   "authors": [
    [
     "Hsiu-Tan",
     "Liu"
    ],
    [
     "Chin-Hsing",
     "Tseng"
    ],
    [
     "Chun-Jung",
     "Liu"
    ]
   ],
   "title": "A comparison of Taiwanese sign language and manually coded Chinese: word length and short-term memory capacity",
   "original": "exl8_141",
   "page_count": 4,
   "order": 36,
   "p1": "141",
   "pn": "144",
   "abstract": [
    "Taiwanese Sign Language (TSL) is the natural language among deaf communities in Taiwan. Manually Coded Chinese (MCC) is the official instructional language. Previous studies have shown that the deaf students have great difficulty in comprehending stories in MCC, plausibly due to greater word length in MCC, which in turn may impair recall of MCC words. In Study I, deaf and hearing signers produced signs for 100 words in both MCC and TSL, and the word length was calculated for each sign pairs. It was found that MCC words were greater in length than the TSL words, whether produced by a hearing or a deaf signer. In Study II, the short-term memory capacity in the deaf signers was compared between word lists in TSL and in MCC. The participants were 44 senior high students in the deaf school and 20 deaf adults. The results showed that for deaf students and adults, the shortterm memory capacity was inferior for the MCC list than for the TSL list, confirming our hypothesis.\n",
    ""
   ]
  },
  "loui08_exling": {
   "authors": [
    [
     "Sofia",
     "Loui"
    ],
    [
     "Silvia P.",
     "Gennari"
    ]
   ],
   "title": "The role of animacy in the production of greek relative clauses",
   "original": "exl8_145",
   "page_count": 4,
   "order": 37,
   "p1": "145",
   "pn": "148",
   "abstract": [
    "This paper examines the effects of animacy on relative clauses production in Greek. Previous studies in English suggest that animacy influences structure preferences in main and relative clauses: animate entities are typically made the subject of the verb and this tendency often results in passive structures. In the present experiment, Greek speakers were presented with pictures depicting actions with an animate and an inanimate participant or two animate participants and they were asked to write answers to questions about the inanimate or the animate patients of these actions. The results were then compared to the results obtained in English and Spanish. Results suggest that animacy does not play a critical role in determining Greek structures, as it does in English, indicating that language-specific constraints play a role in production mechanisms to a greater extent than conceptual factors such as animacy.\n",
    ""
   ]
  },
  "loukina08_exling": {
   "authors": [
    [
     "Anastassia",
     "Loukina"
    ]
   ],
   "title": "Acoustic model of stress in standard Greek and Greek dialects",
   "original": "exl8_149",
   "page_count": 4,
   "order": 38,
   "p1": "149",
   "pn": "152",
   "abstract": [
    "The paper compares acoustic models which predict the position of stress in bisyllabic words in Greek varieties. It is shown that while in Thessalian Greek ratios of peak amplitude and F1 are the best predictors of stress, in Athenian and Cypriot Greek these are ratios of durations and f0. Furthermore in Cypriot Greek morphological category of the token affects the acoustic prominence of the stressed vowel.\n",
    ""
   ]
  },
  "mahmoodzade08_exling": {
   "authors": [
    [
     "Zahra",
     "Mahmoodzade"
    ],
    [
     "Mahmoud",
     "Bijankhan"
    ]
   ],
   "title": "Using F2 transition parameters in distinguishing Persian affricates from homorganic consonants",
   "original": "exl8_153",
   "page_count": 4,
   "order": 39,
   "p1": "153",
   "pn": "156",
   "abstract": [
    "F2 transition parameters including F2 onset and offset frequency and locus equations have been studied for Persian affricates /dZ, tS/ and homorganic dental plosives /d, t/ and post alveolar fricatives /Z, S/. The F2 offset frequencies hierarchy is follow: post alveolar fricatives> affricates> dental plosives. This parameter makes a significant difference among mentioned consonants; however it does not show voiced- unvoiced contrast. F2 onset does not provide regular results and locus equations coefficients do not show a significant difference between affricates and homorganic consonants. [Phonetic symbols are in SAMPA notation.]\n",
    ""
   ]
  },
  "martin08_exling": {
   "authors": [
    [
     "Philippe",
     "Martin"
    ]
   ],
   "title": "Intonation of parentheses in spontaneous French sentences",
   "original": "exl8_157",
   "page_count": 4,
   "order": 40,
   "p1": "157",
   "pn": "160",
   "abstract": [
    "Traditionally, parentheses have been described by phoneticians as speech segments with lower intensity, restrained pitch variation and speech rate faster than the rest of the sentence. This iconic coding may be found in some examples of read (prepared) speech, but spontaneous speech data tend to show that specific prosodic mechanisms do exist to either 1) integrate the syntactic parenthesis into the overall prosodic structure of the sentence or 2) isolate it with an independent prosodic structure. The realizations chosen by speakers appear to be dictated by the interaction of semantic, syntactic and prosodic markers to ensure the parentheses will be identified as such by listeners.\n",
    ""
   ]
  },
  "masuda08_exling": {
   "authors": [
    [
     "Hinako",
     "Masuda"
    ],
    [
     "Takayuki",
     "Arai"
    ]
   ],
   "title": "Perception of consonant clusters in Japanese native speakers: influence of foreign language learning",
   "original": "exl8_161",
   "page_count": 4,
   "order": 41,
   "p1": "161",
   "pn": "164",
   "abstract": [
    "Previous research on the perception of consonant clusters by Japanese native speakers has revealed that they are highly likely to perceive a vowel between the two consonants even if there are no vowels inserted (Dupoux et al. 1999). The present study further investigates this issue but by dividing the group of Japanese native speakers into two groups: Japanese-English bilinguals and Japanese monolinguals. This study aims to look into the influence of language learning experience on the perception of foreign sounds. Results of the perception test revealed that bilinguals made less error than monolinguals in identifying pseudowords with and without consonant cluster.\n",
    ""
   ]
  },
  "mitterer08_exling": {
   "authors": [
    [
     "Holger",
     "Mitterer"
    ]
   ],
   "title": "How are words reduced in spontaneous speech?",
   "original": "exl8_165",
   "page_count": 4,
   "order": 42,
   "p1": "165",
   "pn": "168",
   "abstract": [
    "Words are reduced in spontaneous speech. If reductions are constrained by functional (i.e., perception and production) constraints, they should not be arbitrary. This hypothesis was tested by examing the pronunciations of high- to mid-frequency words in a Dutch and a German spontaneous speech corpus. In logistic-regression models the \"reduction likelihood\" of a phoneme was predicted by fixed-effect predictors such as position within the word, word length, word frequency, and stress, as well as random effects such as phoneme identity and word. The models for Dutch and German show many communalities. This is in line with the assumption that similar functional constraints influence reductions in both languages.\n",
    ""
   ]
  },
  "mompean08_exling": {
   "authors": [
    [
     "Jose A.",
     "Mompean"
    ]
   ],
   "title": "Phonological free variation in English: an empirical study",
   "original": "exl8_169",
   "page_count": 4,
   "order": 43,
   "p1": "169",
   "pn": "172",
   "abstract": [
    "This paper presents the results of a corpus-based study of ten words exhibiting phonological free variation in their phonemic or accentual makeup. The study uses data from the News archives of the BBC Learning English website. The rates of use of the variants for each lexical item are given and discussed.\n",
    ""
   ]
  },
  "moosmuller08_exling": {
   "authors": [
    [
     "Sylvia",
     "Moosmüller"
    ]
   ],
   "title": "Interaction of phonetics, phonology, and sociophonology - illustrated by the vowels of standard Austrian German",
   "original": "exl8_173",
   "page_count": 4,
   "order": 44,
   "p1": "173",
   "pn": "176",
   "abstract": [
    "Standard Austrian German, which distinguishes eight front vowels, exploits two front constriction locations for distinguishing these vowels, a pre-palatal and a palatal one. However, the pre-palatal location is acoustically unstable, and, consequently, phonologically undesirable. The existence of a sound change which neutralizes the /i/ and /./ vowels in a first step and shifts the constriction location of the remaining /i/ towards the palatal region in a second step is investigated.\n",
    ""
   ]
  },
  "ouamour08_exling": {
   "authors": [
    [
     "Siham",
     "Ouamour"
    ],
    [
     "Mhania",
     "Guerti"
    ],
    [
     "Halim",
     "Sayoud"
    ]
   ],
   "title": "PENS: a confidence parameter estimating the number of speakers",
   "original": "exl8_177",
   "page_count": 4,
   "order": 45,
   "p1": "177",
   "pn": "180",
   "abstract": [
    "Is it possible to know how many speakers are speaking simultaneously in case of speech overlap? If the human brain, creation not yet mastered, manages to do it and even to understand the mixed speech meaning, it is not yet the case for the existing automatic systems. For this task, we propose a new method able to estimate the number of speakers in a mixture of speech signals. The algorithm developed here is based on the computation of the statistical characteristic of the 7th Mel coefficient extracted by spectral analysis from the speech signal. This algorithm using a confidence parameter, which we called PENS, is tested on seven different sets of the ORATOR database, which contain seven multi-speaker files each. Results show that PENS parameter permits us to make a good discrimination, without any ambiguity, between a mono-speaker signal (only one speaker is speaking) and a mixed-speakers signal (several speakers are speaking simultaneously). Moreover, it permits us to estimate, in case of mixed speech signals, the number of speakers with a good precision, especially when the number of speakers is less than four.\n",
    ""
   ]
  },
  "paraskevas08_exling": {
   "authors": [
    [
     "Ioannis",
     "Paraskevas"
    ],
    [
     "Maria",
     "Rangoussi"
    ]
   ],
   "title": "Phoneme classification using the Hartley phase spectrum",
   "original": "exl8_181",
   "page_count": 4,
   "order": 46,
   "p1": "181",
   "pn": "184",
   "abstract": [
    "The phase of a signal conveys critical information for signal interpretation. However, signal phase extraction is not a straightforward process, mainly due to the discontinuities appearing in the phase spectrum. Previously, it was shown that for the application of audio classification, in case features of the processed phase spectrum are combined with magnitude related features they provide higher classification score compared to the case where features are extracted only from the signals’ magnitude content. Moreover, it was shown that the Hartley Phase Spectrum encapsulates the phase content of the signals more efficiently compared to its Fourier counterpart. In this work, the importance of phase and the properties of the Hartley Phase Spectrum are demonstrated for the application of phoneme classification.\n",
    ""
   ]
  },
  "pastuszeklipinska08_exling": {
   "authors": [
    [
     "Barbara",
     "Pastuszek-Lipiñska"
    ]
   ],
   "title": "The influence of music education and training on SLA",
   "original": "exl8_185",
   "page_count": 4,
   "order": 47,
   "p1": "185",
   "pn": "188",
   "abstract": [
    "Although music education is one of the human activities that requires the integration of all human senses and the involvement of all cognitive processes: sensory, perceptual, and cognitive learning, memory, emotion, and auditory and motor processes, music has tended to figure only marginally in an approach to secondlanguage acquisition. To explore the extent to which music education influences second-language acquisition musicians and non-musicians were asked to reproduce thrice-repeated sentences in six languages. Musicians outperformed non-musicians in the study. From the results, it appears that the influence of musical expertise extends beyond music processing to speech processing.\n",
    ""
   ]
  },
  "russo08_exling": {
   "authors": [
    [
     "Michela",
     "Russo"
    ]
   ],
   "title": "Rhythmic analysis and quantitative measures: the essence of rhythm as temporal patterning",
   "original": "exl8_189",
   "page_count": 4,
   "order": 48,
   "p1": "189",
   "pn": "192",
   "abstract": [
    "A comparison of Standard Italian and Southern Italian dialects is carried out using acoustic measures related to structural properties: Vowel-interval and consonantal inter-vowel-interval durations are used to obtain rhythmic measures based on a number of approach. Italian is usually considered to be ‘syllable-timed’. The structural features found in the dialects offer support for a divergence from the traditional assumption of syllable-timing. Rhythm measures are calculated according to Ramus at al. 1999, Grabe-Low 2002, Barry et al. 2003, Russo-Barry to appear. In agreement with predictions derived from phonological observation, the results of the measures show a ‘rhythm plot’ in which the ‘Pairwise Variability Indices (PVIs) place the Italian dialect speakers nearer to the stress-timed’ languages than traditional typology statements would lead one to expect .\n",
    ""
   ]
  },
  "sadeghi08_exling": {
   "authors": [
    [
     "Vahid",
     "Sadeghi"
    ]
   ],
   "title": "Compensatory lengthening in Persian: the timing of non-modal phonation",
   "original": "exl8_193",
   "page_count": 4,
   "order": 49,
   "p1": "193",
   "pn": "196",
   "abstract": [
    "Persian has CVGC (or CVCG) sequences (G, a glottal consonant; /h/ or /?/) which become reduced in certain occurrences, with the perceptual effect of the loss of the glottal consonant. The purpose of this study is to provide an acoustic description of the sequences in reduced forms. A production study examined three acoustic measurements of phonation types: H1-H2, H1-F1, and f0. The measurements were made at 15 ms time intervals throughout the vowel to determine the time course of phonation effect. Results indicate that G is realized as breathiness in CVhC (or CVCh) and laryngealization in CV?C (or CVC?), and that such non-modal voice qualities spread onto half of the portion of the preceding vowels.\n",
    ""
   ]
  },
  "serridge08_exling": {
   "authors": [
    [
     "Ben",
     "Serridge"
    ],
    [
     "Luciana",
     "Castro"
    ]
   ],
   "title": "Faster time-aligned phonetic transcriptions through partial automation",
   "original": "exl8_197",
   "page_count": 4,
   "order": 50,
   "p1": "197",
   "pn": "200",
   "abstract": [
    "A semi-automatic process for generating time-aligned transcriptions of speech data at the word and phone level is described. At each stage in the process, segment durations are estimated to generate approximate boundary markers, which are then corrected by hand. Corrections at one level are taken into account in the generation of boundaries for the next level, such that the error is reduced at each successive stage. A test implementation based on Praat was applied to a corpus of Brazilian Portuguese and a comparison against a fully manual process revealed a reduction of 54% in the time required to generate phonetic transcriptions and an average error of 21 ms in the time-alignment of phonetic boundaries.\n",
    ""
   ]
  },
  "sheppard08_exling": {
   "authors": [
    [
     "Chris",
     "Sheppard"
    ]
   ],
   "title": "The effects of the acoustic properties of second language vowel production on pronunciation evaluation",
   "original": "exl8_201",
   "page_count": 4,
   "order": 51,
   "p1": "201",
   "pn": "204",
   "abstract": [
    "This study examines the acoustic characteristics which native speakers use as cues when judging speech samples. 17 words produced by 98 (15 native speakers and 83 Japanese learners of English) were collected and evaluated. Following this, the first three formants for each vowel produced were measured and used as independent variables in stepwise multiple regression analyses to explain variance in the evaluations. The results demonstrated that the formants did explain variance in evaluation in many but not all of the words (r² = 0.0 to .36).\n",
    ""
   ]
  },
  "silva08_exling": {
   "authors": [
    [
     "Thais Cristófaro",
     "Silva"
    ],
    [
     "Christina Abreu",
     "Gomes"
    ]
   ],
   "title": "Frequency effects in language acquisition: a case study of plural forms in Brazilian Portuguese",
   "original": "exl8_205",
   "page_count": 4,
   "order": 52,
   "p1": "205",
   "pn": "208",
   "abstract": [
    "This paper discusses the acquisition of plural forms of words that end in a back glide in Brazilian Portuguese and may take two plural forms: either -s (the regular suffix) or the suffix -is. Fourty children were presented to picture cards containing words ending in a back glide and were asked to identify what they saw. Children’s answers presented the suffix -is for the vast majority of words rather than the regular plural suffix -s. Our results indicate that children abstract schemas rather than acquire default rules. The -is suffix has a very high frequency rate for words that end in a back glide which yields to the establishment of robust schemas. We argue that the plural suffix -is is adopted by children due to frequency effects which foments a very robust schema and enhances productivity.\n",
    ""
   ]
  },
  "sonu08_exling": {
   "authors": [
    [
     "Mee",
     "Sonu"
    ]
   ],
   "title": "Factors influencing perceptual attainment of Japanese geminate consonants by Korean learners of Japanese",
   "original": "exl8_209",
   "page_count": 4,
   "order": 53,
   "p1": "209",
   "pn": "212",
   "abstract": [
    "Two experiments were carried out to determine the perceptual mechanism which distinguishes geminate consonants of Japanese by Korean learners of Japanese. The first investigated the categorical perception of Japanese geminate consonants. In this experiment, we carried out a listening test to measure perceptual characteristics by Korean learners. The second was an interview of Korean learners on their learning strategies. The experimental results showed that some Korean learners concentrated on the overall rhythmic organization of geminate consonants, the same strategy as Japanese native speakers which had been denied in Min (1987, 2007).\n",
    ""
   ]
  },
  "todaka08_exling": {
   "authors": [
    [
     "Yuichi",
     "Todaka"
    ]
   ],
   "title": "Receptive and productive skills of English /l/ and /r/ by Japanese college students in relation to their motivation",
   "original": "exl8_213",
   "page_count": 4,
   "order": 54,
   "p1": "213",
   "pn": "216",
   "abstract": [
    "The objectives of the present study were threefold: (1) the effects of training in /r/-/l/ perceptual identification on /r/-/l/ production; (2) the effects of training in /r/-/l/ production on /r/-/l/ perceptual identification; and (3) the effects of perceptual and production training on learners’ motivation to study English. Results indicate that both the perceptual and the production training sessions resulted in improving not only the intended skill but both the receptive and productive skills. Thus, both receptive or productive skill sessions can be used to promote Japanese college EFL learners English oral communication skills. Nevertheless, the motivation questionnaire shows (1) the importance for teachers to encourage their students to self-study for improving receptive skill and (2) the significance for teachers to understand the efficacy of output practice in small groups to help their students gain confidence in productive skill.\n",
    ""
   ]
  },
  "tsubaki08_exling": {
   "authors": [
    [
     "Hajime",
     "Tsubaki"
    ],
    [
     "Keiji",
     "Yasuda"
    ],
    [
     "Hirofumi",
     "Yamamoto"
    ],
    [
     "Yoshinori",
     "Sagisaka"
    ]
   ],
   "title": "Objective evaluation of second language learner²s translation proficiency using statistical translation measures",
   "original": "exl8_217",
   "page_count": 4,
   "order": 55,
   "p1": "217",
   "pn": "220",
   "abstract": [
    "For objective evaluation of the second language learner’s translation proficiency, we tested two measures commonly used in statistical machine translation. One is word n-gram probability of a target language to measure likelihood of translated sentences as a target language. The other one is translation probabilities from source language sentences to target language sentences to measure translation accuracies between these sentences. The subjective proficiency scores of Japanese learners were compared with these objective measures extracted from English sentences translated by them. Statistical analysis showed no correlation of word n-gram probabilities but high correlation of translation probabilities which suggests the usefulness for objective evaluation of learner’s translation proficiency.\n",
    ""
   ]
  },
  "wagner08_exling": {
   "authors": [
    [
     "Agnieszka",
     "Wagner"
    ]
   ],
   "title": "Automatic labeling of prosody",
   "original": "exl8_221",
   "page_count": 4,
   "order": 56,
   "p1": "221",
   "pn": "224",
   "abstract": [
    "The paper proposes a framework for automatic prosody labeling. The labeling involves detection of the location of accented syllables and phrase boundaries, and recognition of pitch accent and boundary tone types. A number of classification models are designed to perform these tasks on the basis of small vectors of acoustic features. The models achieve high accuracy and their performance is comparable to the results reported in other studies on automatic prosody labeling and to interlabeler consistency in manual labeling of prosody.\n",
    ""
   ]
  },
  "weber08_exling": {
   "authors": [
    [
     "Andrea",
     "Weber"
    ],
    [
     "Alissa",
     "Melinger"
    ]
   ],
   "title": "Name dominance in spoken word recognition is (not) modulated by expectations: evidence from synonyms",
   "original": "exl8_225",
   "page_count": 4,
   "order": 57,
   "p1": "225",
   "pn": "228",
   "abstract": [
    "Two German eye-tracking experiments tested whether top-down expectations interact with acoustically-driven word-recognition processes. Competitor objects with two synonymous names were paired with target objects whose names shared word onsets with either the dominant or the non-dominant name of the competitor. Non-dominant names of competitor objects were either introduced before the test session or not. Eye-movements were monitored while participants heard instructions to click on target objects. Results demonstrate dominant and non-dominant competitor names were considered for recognition, regardless of top-down expectations, though dominant names were always activated more strongly.\n",
    ""
   ]
  },
  "weirich08_exling": {
   "authors": [
    [
     "Melanie",
     "Weirich"
    ]
   ],
   "title": "Vocal stereotypes",
   "original": "exl8_229",
   "page_count": 4,
   "order": 58,
   "p1": "229",
   "pn": "232",
   "abstract": [
    "German speakers receive different ratings in their perceived vocal attractiveness and personality characteristics. An experiment was conducted to evaluate the perceived personality attributions of 32 German listeners and find acoustic cues that correlate to these attributions. The attributed opposition pairs on which the speakers were judged were reduced by a cluster analysis to two factors: dominance (e.g. \"confident\", \"competent\") and benevolence (e.g. \"sensitive\", \"helpful\"). The acoustic investigation of the voices of 4 male speakers revealed the impact of several acoustic parameters on the ratings. Among others, the harmonics-to-noise ratio (HNR) and breathy vocal onsets were most important for high ratings on benevolence. High ratings on dominance showed strong correlations to low mean F0 and strong glottal impulses.\n",
    ""
   ]
  },
  "wollermann08_exling": {
   "authors": [
    [
     "Charlotte",
     "Wollermann"
    ],
    [
     "Bernhard",
     "Schröder"
    ]
   ],
   "title": "Does uncertainty effect the case of exhaustive interpretation?",
   "original": "exl8_233",
   "page_count": 4,
   "order": 59,
   "p1": "233",
   "pn": "236",
   "abstract": [
    "We present an experimental study investigating the role of intonation as prosodic indicator of uncertainty as well as question-answering congruity for the exhaustive interpretation of answers. We vary intonation for expressing intended (un)certainty and also the type of question. Interpretation is tested by using pictures illustrating (non-)exhaustivity in order to avoid that the subjects' linguistic awareness is focussed on the tested question.\n",
    ""
   ]
  },
  "wrembel08_exling": {
   "authors": [
    [
     "Magdalena",
     "Wrembel"
    ],
    [
     "Karolina",
     "Rataj"
    ]
   ],
   "title": "sounds like a rainbow - sound-colour mappings in vowel perception",
   "original": "exl8_237",
   "page_count": 4,
   "order": 60,
   "p1": "237",
   "pn": "240",
   "abstract": [
    "The paper reports on an experiment conducted to investigate the nature of speech sound perception in terms of cross-modal mappings between vowel sound stimuli and colour spectrum associations. The study is based on the assumptions stemming from research on synaesthesia, sound symbolism and non-modularity of human perception. The findings indicate that vowel-sound mappings appear non-arbitrary in non-synaesthetic perception and follow the general tendencies in which bright colours are associated with prominent high-pitched sounds, whereas dark colours are attributed to lower-pitched tones. The results may have implications for L2 pronunciation pedagogy in that they may enhance the effectiveness of L2 phonological acquisition.\n",
    ""
   ]
  },
  "themistocleous08_exling": {
   "authors": [
    [
     "Charalabos",
     "Themistocleous"
    ]
   ],
   "title": "Focus effects on syllable duration in Cypriot Greek",
   "original": "exl8_241",
   "page_count": 4,
   "order": 61,
   "p1": "241",
   "pn": "244",
   "abstract": [
    "The present experimental study examined the effects of focus on the duration of stressed syllable onset and rhyme in words found in prefocal, focal, post focal and neutral position. The main results generated indicate a significant effect of focus position on the segmental duration. Additionally, word final lengthening was demonstrated, whereas no word initial lengthening effects were observed. Furthermore, the results showed rightward lengthening effects\n",
    ""
   ]
  }
 },
 "sessions": [
  {
   "title": "Papers",
   "papers": [
    "alagozlu08_exling",
    "alexandris08_exling",
    "alghamdi08_exling",
    "alshammari08_exling",
    "andreou08_exling",
    "anufryk08_exling",
    "arnold08_exling",
    "arts08_exling",
    "augurzky08_exling",
    "baumotte08_exling",
    "botinis08_exling",
    "boucher08_exling",
    "camposastorkiza08_exling",
    "cantoni08_exling",
    "castro08_exling",
    "chaida08_exling",
    "chentir08_exling",
    "chu08_exling",
    "correia08_exling",
    "ouden08_exling",
    "fale08_exling",
    "fale08b_exling",
    "faria08_exling",
    "fernandezparra08_exling",
    "giordano08_exling",
    "hansakunbuntheung08_exling",
    "hemeren08_exling",
    "herrero08_exling",
    "jannedy08_exling",
    "kalimeris08_exling",
    "kinoshita08_exling",
    "kocjancic08_exling",
    "lehtinen08_exling",
    "lengeris08_exling",
    "lewandowski08_exling",
    "liu08_exling",
    "loui08_exling",
    "loukina08_exling",
    "mahmoodzade08_exling",
    "martin08_exling",
    "masuda08_exling",
    "mitterer08_exling",
    "mompean08_exling",
    "moosmuller08_exling",
    "ouamour08_exling",
    "paraskevas08_exling",
    "pastuszeklipinska08_exling",
    "russo08_exling",
    "sadeghi08_exling",
    "serridge08_exling",
    "sheppard08_exling",
    "silva08_exling",
    "sonu08_exling",
    "todaka08_exling",
    "tsubaki08_exling",
    "wagner08_exling",
    "weber08_exling",
    "weirich08_exling",
    "wollermann08_exling",
    "wrembel08_exling",
    "themistocleous08_exling"
   ]
  }
 ]
}