{
 "title": "First ITRW on Experimental Linguistics",
 "location": "Athens, Greece",
 "startDate": "28/8/2006",
 "endDate": "30/8/2006",
 "conf": "ExLing",
 "year": "2006",
 "name": "exling_2006",
 "series": "ExLing",
 "SIG": "",
 "title1": "First ITRW on Experimental Linguistics",
 "date": "28-30 August 2006",
 "papers": {
  "alexiadou06_exling": {
   "authors": [
    [
     "Artemis",
     "Alexiadou"
    ]
   ],
   "title": "On the properties of VSO and VOS orders in Greek and Italian: a study on the syntax information structure interface",
   "original": "exl6_001",
   "page_count": 8,
   "order": 1,
   "p1": "1",
   "pn": "8",
   "abstract": [
    "This paper deals with word order variation that relates to patterns of information structure. The empirical focus of the paper is a comparison of Italian and Greek word order patterns. The paper will address, however, issues of word order typology in general. The main line of argumentation is one according to which syntax directly reflects information structure, and variation is explained on the basis different movement parameters.\n",
    ""
   ]
  },
  "caplan06_exling": {
   "authors": [
    [
     "David N.",
     "Caplan"
    ]
   ],
   "title": "Neurolinguistics",
   "original": "exl6_009",
   "page_count": 8,
   "order": 2,
   "p1": "9",
   "pn": "16",
   "abstract": [
    "Neurolinguistics studies the relation of language processes to the brain. It is well established that the critical brain regions for language include the perisylvian association cortex, lateralized to the left in most right-handed individuals. It is becoming increasingly clear that other brain regions are part of one or more complex systems that support language operations. Evidence regarding the more detailed organization of the brain for specific language operations is accruing rapidly, due to functional neuroimaging, but has not clearly established whether specific language operations are invariantly localized, distributed over large areas, or show individual differences in their neural substrate.\n",
    ""
   ]
  },
  "clements06_exling": {
   "authors": [
    [
     "George N.",
     "Clements"
    ],
    [
     "Rachid",
     "Ridouane"
    ]
   ],
   "title": "Quantal phonetics and distinctive features",
   "original": "exl6_017",
   "page_count": 8,
   "order": 3,
   "p1": "17",
   "pn": "24",
   "abstract": [
    "This paper reviews some of the basic premises of Quantal-Enhancement Theory as developed by K. N. Stevens and his colleagues. Quantal theory seeks to explain why some articulatory and acoustic dimensions are favored over others in distinctive feature contrasts across languages. In this paper, after a review of basic concepts, a protocol for quantal feature definitions is proposed and problems in the interpretation of vowel features are discussed.\n",
    ""
   ]
  },
  "govokhina06_exling": {
   "authors": [
    [
     "Oxana",
     "Govokhina"
    ],
    [
     "Gérard",
     "Bailly"
    ],
    [
     "Gaspard",
     "Breton"
    ],
    [
     "Paul",
     "Bagshaw"
    ]
   ],
   "title": "A new trainable trajectory formation system for facial animation",
   "original": "exl6_025",
   "page_count": 8,
   "order": 4,
   "p1": "25",
   "pn": "32",
   "abstract": [
    "A new trainable trajectory formation system for facial animation is here proposed that dissociates parametric spaces and methods for movement planning and execution. Movement planning is achieved by HMM-based trajectory formation. Movement execution is performed by concatenation of multi-represented diphones. Movement planning ensures that the essential visual characteristics of visemes are reached (lip closing for bilabials, rounding and opening for palatal fricatives, etc) and that appropriate coarticulation is planned. Movement execution grafts phonetic details and idiosyncratic articulatory strategies (dissymetries, importance of jaw movements, etc) to the planned gestural score.\n",
    ""
   ]
  },
  "kewleyport06_exling": {
   "authors": [
    [
     "Diane",
     "Kewley-Port"
    ]
   ],
   "title": "Topics in speech perception",
   "original": "exl6_033",
   "page_count": 8,
   "order": 5,
   "p1": "33",
   "pn": "40",
   "abstract": [
    "The study of speech perception over the past 60 years has tried to determine the human processes that underlie the rapid understanding of fluent speech. A first step was to determine the units of speech that could be experimentally manipulated. Years of examining the acoustic properties associated with phonemes led to theories such as the Motor Theory which postulate larger units that integrate vowel and consonant information. Current approaches find better support for the syllable as the most robust and coherent unit of speech. A complete theory of speech perception should systematically map how speech acoustic information is processed bottom-up through the peripheral and central auditory system, as well as how linguistic knowledge interacts top-down with the acoustic-phonetic information to extract meaning.\n",
    ""
   ]
  },
  "papafragou06_exling": {
   "authors": [
    [
     "Anna",
     "Papafragou"
    ]
   ],
   "title": "Spatial representations in language and thought",
   "original": "exl6_041",
   "page_count": 4,
   "order": 6,
   "p1": "41",
   "pn": "44",
   "abstract": [
    "The linguistic expression of space draws from and is constrained by basic, probably universal, elements of perceptual/cognitive structure. Nevertheless, there are considerable cross-linguistic differences in how these fundamental space concepts are segmented and packaged into sentences. This cross-linguistic variation has led to the question whether the language one speaks could affect the way one thinks about space - hence whether speakers of different languages differ in the way they see the world. This chapter addresses this question through a series of cross-linguistic experiments comparing the linguistic and non-linguistic representation of motion and space in both adults and children. Taken together, the experiments reveal remarkable similarities in the way space is perceived, remembered and categorized despite differences in how spatial scenes are encoded cross-linguistically.\n",
    ""
   ]
  },
  "perkell06_exling": {
   "authors": [
    [
     "Joseph S.",
     "Perkell"
    ]
   ],
   "title": "Sensorimotor control of speech production: models and data",
   "original": "exl6_045",
   "page_count": 8,
   "order": 7,
   "p1": "45",
   "pn": "52",
   "abstract": [
    "A theoretical, model-based overview of speech production is described in which the goals of phonemic speech movements are in auditory and somatosensory domains and the movements are controlled by a combination of feedback and feedforward mechanisms. Examples of experimental results are presented that provide support for the overview.\n",
    ""
   ]
  },
  "schiller06_exling": {
   "authors": [
    [
     "Niels O.",
     "Schiller"
    ]
   ],
   "title": "Phonological encoding in speech production",
   "original": "exl6_053",
   "page_count": 8,
   "order": 8,
   "p1": "53",
   "pn": "60",
   "abstract": [
    "Language production comprises conceptual, grammatical, and word form encoding as well as articulation. This paper focuses on word form or phonological encoding. Phonological encoding in speech production can be subdivided into a number of sub-processes such as segmental, metrical, and syllabic encoding. Each of these processes is briefly described and illustrated with examples from my own research. Special attention is paid to time course issues introducing behavioural and electrophysiological research methods such as LRPs and ERPs. It is concluded that phonological encoding is an incremental planning process taking into account segmental, metrical, and syllabic encoding.\n",
    ""
   ]
  },
  "abelin06_exling": {
   "authors": [
    [
     "Åsa",
     "Abelin"
    ]
   ],
   "title": "Experiments in investigating sound symbolism and onomatopoeia",
   "original": "exl6_061",
   "page_count": 4,
   "order": 9,
   "p1": "61",
   "pn": "64",
   "abstract": [
    "The area of sound symbolism and onomatopoeia is an interesting area for studying the production and interpretation of neologisms in language. One question is whether neologisms are created haphazardly or governed by rules. Another question is how this can be studied. Of the approximately 60 000 words in the Swedish lexicon 1 500 have been judged to be sound symbolic (Abelin 1999). These were analyzed in terms of phonesthemes, (i. e. sound symbolic morpheme strings) which were subjected to various experiments in order to evaluate their psychological reality in production and understanding. In test 1 nonsense words were constructed according to the results of the preliminary analysis of phonesthemes and then interpreted by subjects. In test 2 subjects were instructed to create new words for some given, sense related, domains. In test 3 subjects were to interpret these neologisms. Test 4 was a lexical decision experiment on onomatopoeic, sound symbolic and arbitrary words. The results of the first three tests show that the phonesthemes are productive, to different degrees, in both production and understanding. The results of the lexical decision test do not show perceptual productivity. The methods are presented and discussed.\n",
    ""
   ]
  },
  "alexandris06_exling": {
   "authors": [
    [
     "Christina",
     "Alexandris"
    ],
    [
     "Stavroula-Evita",
     "Fotinea"
    ]
   ],
   "title": "Prosodic emphasis versus word order in Greek instructive texts",
   "original": "exl6_065",
   "page_count": 4,
   "order": 10,
   "p1": "65",
   "pn": "68",
   "abstract": [
    "In Greek instructive texts, the production of clear and precise instructions is achieved by both prosodic modelling (Alexandris, Fotinea & Efthimiou, 2005) and morphosyntactic strategies (Alexandris, 2005). In the set of experiments performed in the present study, we attempt to determine whether prosodic modelling or whether morphosyntactic strategies, namely word order, constitutes the most crucial factor in the production of Greek spoken instructions most clearly and correctly understood by the receiver. In the present set of experiments, emphasis will be given in respect to utterances containing temporal expressions. The set of experiments performed in the present study involves the contrastive comparison and evaluation of 36 written and spoken utterances containing the temporal expressions, placed in different syntactic positions.\n",
    ""
   ]
  },
  "alexopoulou06_exling": {
   "authors": [
    [
     "Theodora",
     "Alexopoulou"
    ],
    [
     "Frank",
     "Keller"
    ]
   ],
   "title": "Gradience and parametric variation",
   "original": "exl6_069",
   "page_count": 4,
   "order": 11,
   "p1": "69",
   "pn": "72",
   "abstract": [
    "The paper assesses the consequences of gradience for approaches to variation based on the Principles and Parameters model. In particular, the discussion focuses on recent crosslinguistic results obtained through magnitude estimation, a methodology particularly suited to the study of gradient acceptability/grammaticality. Results on superiority and relativised minimality effects in questions are discussed in the light of current theoretical assumptions regarding the locus of crosslinguistic variation.\n",
    ""
   ]
  },
  "astruc06_exling": {
   "authors": [
    [
     "Lluïsa",
     "Astruc"
    ],
    [
     "Pilar",
     "Prieto"
    ]
   ],
   "title": "Stress and accent: acoustic correlates of metrical prominence in Catalan",
   "original": "exl6_073",
   "page_count": 4,
   "order": 12,
   "p1": "73",
   "pn": "76",
   "abstract": [
    "This study examines the phonetic correlates of stress and accent in Catalan, analyzing syllable duration, spectral balance, vowel quality, and overall intensity in two stress [stressed, unstressed] and in two accent conditions [accented, unaccented]. Catalan reveals systematic phonetic differences between accent and stress, consistent with previous work on Dutch, English, and Spanish (Slujter & van Heuven 1996a, 1996b; Campbell & Beckman 1997, Ortega-Llebaría & Prieto 2006). Duration, spectral balance, and vowel quality are reliable acoustic correlates of stress, while accent is acoustically marked by overall intensity and pitch. Duration, at least in Catalan, is not a reliable indicator of accent since accentual lengthening was found only in speakers who produced some accents with a wider pitch range.\n",
    "s Campbell, N. and Beckman, M. 1997. Stress, prominence and spectral tilt. In Botinis, A.; Kouroupetroglou, G; and G. Crayiannis (eds.), Intonation: theory, models and applications. Proc. of and ESCA Workshop, Athens, Greece. Ortega-Llebaria, M. and Prieto, P. 2006. Stress and accent in Catalan and Spanish: patterns of duration, vowel quality, overall intensity, and spectral balance. Proc. Speech Prosody. Dresden, Germany. 337-340. Sluijter, A. and van Heuven, V. 1996a. Spectral balance as an acoustic correlate of linguistic stress. Journal of the Acoustical Society of America 100 (4). 2471-2485. Sluijter, A. and van Heuven, V. 1996b. Acoustic correlates of linguistic stress and accent in Dutch and American English. Proc. of ICSL, 96. Philadelphia: Applied Science and Engineering Laboratories, Alfred I duPont Institue, 630-633.\n",
    ""
   ]
  },
  "awad06_exling": {
   "authors": [
    [
     "Zahra",
     "Awad"
    ]
   ],
   "title": "Word etymology in monolingual and bilingual dictionaries: lexicographers² versus EFL learners² perspectives",
   "original": "exl6_077",
   "page_count": 4,
   "order": 13,
   "p1": "77",
   "pn": "80",
   "abstract": [
    "This paper deals with the treatment of word etymology in monolingual and bilingual dictionaries. It also investigates EFL learners' attitudes towards the importance of etymology for understanding the meaning of the words they look up in dictionaries. The data were collected through tasks of looking up Arabic loan words in English in monolingual and bilingual dictionaries. The results indicate that most monolingual and bilingual dictionaries do not provide information on word etymology. They also show that most Arab EFL learners find etymology helpful in understanding the meaning of English words of Arabic origin.\n",
    ""
   ]
  },
  "baltazani06_exling": {
   "authors": [
    [
     "Mary",
     "Baltazani"
    ]
   ],
   "title": "Characteristics of pre-nuclear pitch accents in statements and yes-no questions in Greek",
   "original": "exl6_081",
   "page_count": 4,
   "order": 14,
   "p1": "81",
   "pn": "84",
   "abstract": [
    "In this paper I present the results of a production experiment testing the hypothesis that L*+H pre-nuclear pitch accents are indistinguishable in statements and questions in Greek. Results show that the L and the H tones of the L*+H pitch accent have different patterns of alignment in polar and in statements. These results suggest that the pitch accents are realized differently in the two utterance types under investigation. It remains to be explored, through perception experiments, whether the phonetic differences that were found are salient enough for listeners to distinguish between statements and questions. If they are, then the prenuclear pitch accents in statements and those in polar questions belong to different phonological categories.\n",
    ""
   ]
  },
  "barberia06_exling": {
   "authors": [
    [
     "Irene",
     "Barberia"
    ]
   ],
   "title": "Effects of VV-sequence deletion across word boundaries in Spanish",
   "original": "exl6_085",
   "page_count": 4,
   "order": 15,
   "p1": "85",
   "pn": "88",
   "abstract": [
    "Spanish does not allow vowel deletion in unstressed syllables the way languages like English do. However, it may occur in contexts of VV-sequences across word boundaries, under durational reduction in connected speech. This paper explores the effects of vowel deletion on the perception of [-high] vowel sequences on 8 native speakers of Peninsular Spanish. The results are then compared to the speakers production of those sequences. This double experiment suggests that, although matching between perception and production does not correlate, production cues are relevant to the perception of the words containing tautosyllabic vowels. Likewise, it is claimed that perceptual cues influence the production of vowel sequences, suggesting that perceptual distinctiveness is relevant to the understanding of acoustic and articulatory preferences.\n",
    ""
   ]
  },
  "botinis06_exling": {
   "authors": [
    [
     "Antonis",
     "Botinis"
    ],
    [
     "Marios",
     "Fourakis"
    ],
    [
     "John W.",
     "Hawks"
    ],
    [
     "Ioanna",
     "Orfanidou"
    ]
   ],
   "title": "Production and perception of greek vowels in normal and cerebral palsy speech",
   "original": "exl6_089",
   "page_count": 4,
   "order": 16,
   "p1": "89",
   "pn": "92",
   "abstract": [
    "This study investigates the perceptual consequences and differences in vowel production between cerebral palsy (CP) afflicted Greek speakers and their normal counterparts. Formant (F1 and F2) values for the five vowels of Modern Greek were extracted from productions of both male and female speakers in stressed and unstressed conditions. These same productions were presented to normal hearing Greek speakers for vowel identification. Aggregate vowel spaces constructed from the mean F1 and F2 values reveal that the male CP speakers productions more closely resemble normal female spaces than that of normal males, but has only a slight impact on reducing intelligibility. Unstressed vowel productions from female CP speakers reduced intelligibility most significantly, in particular for the vowel [o]. Significantly greater standard errors around formant means for the CP speakers unstressed vowel productions suggest these speakers have considerably more difficulty in controlling vocal tract shape when using less vocal effort.\n",
    ""
   ]
  },
  "chen06_exling": {
   "authors": [
    [
     "Yiya",
     "Chen"
    ]
   ],
   "title": "Pre-glottal vowels in Shanghai Chinese",
   "original": "exl6_093",
   "page_count": 4,
   "order": 17,
   "p1": "93",
   "pn": "96",
   "abstract": [
    "This study examines the acoustic realization of two complementary sets of vowels in Shanghai Chinese: One appearing in open syllables only (OSVs) and the other in closed syllables with a glottal coda (PGVs). Two factors - consonant onset and prominence level - were controlled to test the null hypothesis that PGVs are reduced realization of the OSVs due to their short duration. Results showed spectral reduction of the PGVs but suggested that PGVs cannot be the reduced realization of OSVs as both onsetless and prominent PGVs failed to be consistently realized with a more expanded acoustic vowel space, which was predicted by the reduction account. We propose that the spectral reduction of the PGVs is an inherent feature of the vowels phonetic implementation.\n",
    ""
   ]
  },
  "clements06b_exling": {
   "authors": [
    [
     "George N.",
     "Clements"
    ],
    [
     "Rachid",
     "Ridouane"
    ]
   ],
   "title": "Distinctive feature enhancement: a review",
   "original": "exl6_097",
   "page_count": 4,
   "order": 18,
   "p1": "97",
   "pn": "100",
   "abstract": [
    "We continue the review of some of the basic premises of Quantal-Enhancement Theory (Stevens 1972, 1989, etc.) initiated in Clements and Ridouane (2006). While Quantal Theory proposes to account for similarities in feature realisation across speakers and languages, Enhancement Theory proposes to account for regular patterns of cross-linguistic variation. In this sense these two theories may be regarded as complementary modules of a more comprehensive feature theory.\n",
    "s Clements, G.N. and R. Ridouane. 2006. Quantal Phonetics and Distinctive Features: a Review. Proceedings of ISCA Tutorial and Research Workshop on Experimental Linguistics, 28-30 August 2006, Athens, Greece Stevens, K. N. 1972. The quantal nature of speech: Evidence from articulatoryacoustic data. In Denes, P.B. and David Jr., E.E. (eds.), Human Communication, A Unified View, 51-66. New York, McGraw-Hill. Stevens, K.N. 1989. On the quantal nature of speech. Journal of Phonetics 17, 3-46\n",
    ""
   ]
  },
  "coimbra06_exling": {
   "authors": [
    [
     "Rosa Lídia",
     "Coimbra"
    ],
    [
     "Helena Margarida",
     "Vaz Duarte"
    ],
    [
     "Lurdes de",
     "Castro Moutinho"
    ]
   ],
   "title": "Where the wine is velvet: verbo-pictorial metaphors in written advertising",
   "original": "exl6_101",
   "page_count": 4,
   "order": 19,
   "p1": "101",
   "pn": "104",
   "abstract": [
    "In this presentation, we intend to approach pictorial metaphors (PM) and verbo-pictorial metaphors (VPM) in written Portuguese advertising, using a corpus of newspaper and magazine advertisements. As theoretical framework, we use the Cognitive Linguistics theory of the multiple spaces and blending by Gilles Fauconnier and Mark Turner (2003) and part of Charles Forcevilles (1996) approach to VPM. The collected corpus is analysed, and the main objective of this study is the presentation of a typology for the diverse ways to establish conceptual blending in VPM (Coimbra, 2000). It is argued that there are at least six categories of VPM.\n",
    ""
   ]
  },
  "cummins06_exling": {
   "authors": [
    [
     "Fred",
     "Cummins"
    ]
   ],
   "title": "Measuring synchronization among speakers reading together",
   "original": "exl6_105",
   "page_count": 4,
   "order": 20,
   "p1": "105",
   "pn": "108",
   "abstract": [
    "It has been demonstrated that speakers are readily able to synchronize with a cospeaker when reading a prepared text together. The means by which a high degree of synchronization is attained are still unknown. We here present a novel measure of synchrony which allows us to follow the time course of synchronization among two speakers, based on the parallel acoustic signals. The method uses traditional framebased cepstral features and a slight variant on standard dynamic time-warping. We develop the method based on a novel corpus of synchronous speech, comparing its estimates of synchronicity with hand estimates. The method out-performs laborious manual estimation, and allows us to now begin to study the dynamics of synchronization among speakers.\n",
    ""
   ]
  },
  "darani06_exling": {
   "authors": [
    [
     "Laya Heidari",
     "Darani"
    ]
   ],
   "title": "Formal features and intonation in Persian speakers² English interlanguage wh-questions",
   "original": "exl6_109",
   "page_count": 4,
   "order": 21,
   "p1": "109",
   "pn": "112",
   "abstract": [
    "The Unitarianist Interface Hypothesis proposed by Lotfi (ms.) concerns only one interface level -the Semantico-Phonetic Form- at which both performance systems can have access to various types of features of a lexical item. This paper hypothesizes the existence of an iconic relationship between formal and phonological features, and the influence of formal features on intonation in Persian speakers' English interlanguage wh-questions. The present study is based on computing t-test procedure on the data obtained from twenty-four Iranian L2 learners of English ageranged between twelve and sixteen. The comparison of the data collected from the syntax and intonation tests before and after the instruction confirms the above hypotheses.\n",
    ""
   ]
  },
  "deyne06_exling": {
   "authors": [
    [
     "Simon De",
     "Deyne"
    ],
    [
     "Sven Van",
     "Lommel"
    ],
    [
     "Gert",
     "Storms"
    ]
   ],
   "title": "The effect of semantic distance in the picture-word interference task",
   "original": "exl6_113",
   "page_count": 4,
   "order": 22,
   "p1": "113",
   "pn": "116",
   "abstract": [
    "First, we investigated whether semantic interference in the picture-word task generalizes from close neighbours to more distant category members. Second, we investigated the operationalisation of semantic distance. The presented work manipulated closely versus distantly related distractor words, and examined to which degree various operationalisations of distance determine semantic interference. Withincategory interference did occur, however depending on the quantity and quality of the semantic relationship. The effect was limited to very similar coordinates or semantic neighbours, and did not occur for less similar category coordinates. Furthermore, the associative implementation of semantic distance was most predictive for the interference effect. The findings provide a better understanding of the different measures of semantic distance as well as the process of semantic interference.\n",
    ""
   ]
  },
  "moraes06_exling": {
   "authors": [
    [
     "João Antônio de",
     "Moraes"
    ]
   ],
   "title": "Melodic contours of yes/no questions in Brazilian Portuguese",
   "original": "exl6_117",
   "page_count": 4,
   "order": 23,
   "p1": "117",
   "pn": "120",
   "abstract": [
    "In this paper I describe four melodic patterns which can occur in the yes/no question, namely: i) the final rise pattern, typical of the unmarked polarity yes/no question, ii) the internal rise pattern, correlated with positive polarity questions, iii) the delayed rise pattern, indicating negative polarity, i.e. the speakers discordance with the sentence propositional content, and iv) the double rise pattern, found in rhetorical yes/no questions and requests. The relevance of phonological representation is discussed on the grounds of auditory tests with synthesized speech.\n",
    ""
   ]
  },
  "dimperio06_exling": {
   "authors": [
    [
     "Mariapaola",
     "d'Imperio"
    ],
    [
     "Roxane",
     "Bertrand"
    ],
    [
     "Albert Di",
     "Cristo"
    ],
    [
     "Cristel",
     "Portes"
    ]
   ],
   "title": "The phonology and phonetics of prenuclear and nuclear accents in French",
   "original": "exl6_121",
   "page_count": 4,
   "order": 24,
   "p1": "121",
   "pn": "124",
   "abstract": [
    "The goal of this paper was to determine whether there is a formal difference between high-ending nuclear (IP-final) and prenuclear accents in French. After transcribing the relevant items, we then compared the different accentual and phrasal categories by analyzing, among the other things, the tonal and temporal characteristics of their tonal targets as well as durational characteristics of the target syllables. The hypothesis tested is that nuclear accents differ from prenuclear ones in terms of formal characteristics of the contour which cannot be explained, for instance, by invoking the presence or absence of an upcoming tone. We show that both alignment and scaling differences can be found between the two accents types, thus motivating a contrastive phonological analysis.\n",
    ""
   ]
  },
  "efstathopoulou06_exling": {
   "authors": [
    [
     "Niki-Pagona",
     "Efstathopoulou"
    ]
   ],
   "title": "The influence of second language learning on speech production by Greek/English bilinguals",
   "original": "exl6_125",
   "page_count": 4,
   "order": 25,
   "p1": "125",
   "pn": "128",
   "abstract": [
    "This study examined 20 Greek/English bilinguals, living in the Vancouver area, Canada. The duration of aspiration for the three voiceless stops (/p/, /t/, /k/) and for the following vowel for a series of Greek and English stimuli were analyzed. Factors such as the Age of Arrival (AOA), Age of Learning (AOL), Length of Residence (LOR), everyday use of Greek and English and self-estimated proficiency in both languages were taken into consideration. A number of English sentences produced by the same speakers were also collected and rated for accentedness by native speakers of English. The degree of accent of the bilingual subjects were also examined along with the data collected. The main focus of the study is to see how the interaction of first language (L1) and second language (L2), if any, is observed concerning VOT (voice onset time) and following vowel duration.\n",
    ""
   ]
  },
  "flouraki06_exling": {
   "authors": [
    [
     "Maria",
     "Flouraki"
    ]
   ],
   "title": "Aspectual composition in modern Greek",
   "original": "exl6_129",
   "page_count": 4,
   "order": 26,
   "p1": "129",
   "pn": "132",
   "abstract": [
    "The rich aspectual system in Modern Greek involves both morphologically expressed grammatical aspect and eventuality types. Particular emphasis is paid to the interaction between grammatical aspect and eventuality types, since it is due to this interaction that the verbal predicate acquires distinct meanings. The main aim of this paper is to explain potential changes in the meaning of the eventualities caused by the interaction with grammatical aspect and provide a formal analysis of this interaction. I propose an analysis within Head-Driven Phrase Structure Grammar (HPSG), using Minimal Recursion Semantics (MRS) for the semantic representations. I argue that grammatical aspect is a function which takes as arguments particular eventualities. When the arguments are different from the required ones, then there are instances of reinterpretations, which are not instances of ungrammaticality. This can be explained with the introduction of subeventual templates, where grammatical aspect combines with eventuality types and selects eventualities or subeventualities appropriate to its selection restrictions, using information that is already there in the denotation of the eventualities.\n",
    ""
   ]
  },
  "folli06_exling": {
   "authors": [
    [
     "Raffaella",
     "Folli"
    ],
    [
     "Elinor",
     "Payne"
    ]
   ],
   "title": "Investigating interfaces: an experimental approach to focus in Sicilian Italian",
   "original": "exl6_133",
   "page_count": 4,
   "order": 27,
   "p1": "133",
   "pn": "136",
   "abstract": [
    "This paper describes an investigation of the syntax-prosody interface in the expression of focus in Sicilian Italian. It finds evidence of a generalised reversal of the articulation of information structure, with new information often preceding old, and of intonational differentiation between focus types.\n",
    ""
   ]
  },
  "gawronska06_exling": {
   "authors": [
    [
     "Barbara",
     "Gawronska"
    ],
    [
     "Olga",
     "Nikolaenkova"
    ],
    [
     "Björn",
     "Erlendsson"
    ]
   ],
   "title": "A corpus based analysis of English, Swedish, Polish, and Russian prepositions",
   "original": "exl6_137",
   "page_count": 4,
   "order": 28,
   "p1": "137",
   "pn": "140",
   "abstract": [
    "In this study, the use of most frequent spatial prepositions in English, Polish, Swedish, and Russian is analyzed. The prepositions and their contexts are extracted from corpora by means of concordance tools. The collostructional strength between the prepositions and the most frequent nouns in the PPs (Gries et al. 2005) is then computed in order to get a more detailed picture of the contexts in which a given preposition is most likely to appear. The results of the investigation are then analysed within the framework of cognitive semantics, especially Croft and Cruse's (2004) taxonomy of construal operations, and Talmys (2005) classification of spatial images.\n",
    ""
   ]
  },
  "gibert06_exling": {
   "authors": [
    [
     "Guillaume",
     "Gibert"
    ],
    [
     "Gérard",
     "Bailly"
    ],
    [
     "Frédéric",
     "Elisei"
    ]
   ],
   "title": "Evaluation of a virtual speech cuer",
   "original": "exl6_141",
   "page_count": 4,
   "order": 29,
   "p1": "141",
   "pn": "144",
   "abstract": [
    "This paper presents the virtual speech cuer built in the context of the ARTUS project aiming at watermarking hand and face gestures of a virtual animated agent in a broadcasted audiovisual sequence. For deaf televiewers that master cued speech, the animated agent can be then incrusted - on demand and at the reception - in the original broadcast as an alternative to subtitling. The paper presents the multimodal textto- speech synthesis system and the first evaluation performed by deaf users.\n",
    ""
   ]
  },
  "gryllia06_exling": {
   "authors": [
    [
     "Stella",
     "Gryllia"
    ]
   ],
   "title": "Broad vs. narrow focus in Greek",
   "original": "exl6_145",
   "page_count": 4,
   "order": 30,
   "p1": "145",
   "pn": "148",
   "abstract": [
    "This paper reports the results of a production and a perception experiment about focus in Greek.\n",
    ""
   ]
  },
  "haussler06_exling": {
   "authors": [
    [
     "Jana",
     "Häussler"
    ],
    [
     "Markus",
     "Bader"
    ]
   ],
   "title": "Incremental interpretation and discourse complexity",
   "original": "exl6_149",
   "page_count": 4,
   "order": 31,
   "p1": "149",
   "pn": "152",
   "abstract": [
    "We will present two self-paced reading studies that provide new evidence on the incrementality of semantic interpretation, in particular with regard to the notion of discourse complexity as introduced by Gibson's distance-based dependency locality theory (DLT; cf. Gibson, 1998, 2000). More specifically, we will focus on the contribution of referential processing on sentence complexity. The experiments compared the processing of simple definite DPs like der Lehrer ('the teacher') and complex DPs containing a possessive NP like Peters Lehrer ('Peter's teacher'). While simple DPs introduce only a single discourse referent, complex DPs introduce two discourse referents and some relation between them. This additional processing effort is reflected by increased reading times.\n",
    "s\n",
    "Gibson, E. 1998. Linguistic complexity: locality of syntactic dependencies. Cognition 68, 1-75 Gibson, E. 2000. The dependency locality theory: A distance-based theory of linguistic complexity. In Marantz, A., Miyashita, Y. and ONeil, W. (eds.) 2000, Image, language, brain. Papers from the first Mind Articulation Project Symposium, 95-126. Cambridge, MIT Press.\n",
    ""
   ]
  },
  "jacewicz06_exling": {
   "authors": [
    [
     "Ewa",
     "Jacewicz"
    ],
    [
     "Robert Allen",
     "Fox"
    ],
    [
     "Lawrence L.",
     "Feth"
    ]
   ],
   "title": "Dynamic auditory representations and phonetic processing: the case of virtual diphthongs",
   "original": "exl6_153",
   "page_count": 4,
   "order": 32,
   "p1": "153",
   "pn": "156",
   "abstract": [
    "Auditory spectral integration in the perception of dynamic acoustic cues in speech was examined experimentally. The potential role of a dynamically changing center of gravity in the perception of diphthongs /ui/ (as in we) and /iu/ (as n you) was verified. Listeners identified the effective frequency changes well, showing that movement of the spectral center of gravity can provide the cues necessary for the identification of dynamic events in speech such as F2 transitions. Most models of vowel perception propose that vowels are identified on the basis of formant peaks. Our results indicate that perception of dynamic events in speech is to a large extent attributable to central auditory processes such as spectral integration.\n",
    ""
   ]
  },
  "joffe06_exling": {
   "authors": [
    [
     "Victoria",
     "Joffe"
    ],
    [
     "Spyridoula",
     "Varlokosta"
    ]
   ],
   "title": "Syntactic abilities in Williams syndrome: how intact is 'intact'?",
   "original": "exl6_157",
   "page_count": 4,
   "order": 33,
   "p1": "157",
   "pn": "160",
   "abstract": [
    "The present paper investigates the syntactic abilities of a group of individuals with Williams Syndrome to explore the debates surrounding the dissociation between language and cognition as well as possible dissociations within the language module in this population. Experimental linguistic measures that assess interpretation of passives, pronouns and reflexives as well as elicitation and comprehension of whquestions were employed. Overall results for the WS group reveal little evidence of the reported spared linguistic abilities in this population thus challenging the idea of a relatively intact language system in WS.\n",
    ""
   ]
  },
  "katsos06_exling": {
   "authors": [
    [
     "Napoleon",
     "Katsos"
    ]
   ],
   "title": "Experimental investigations on implicatures: a window into the semantics/pragmatics interface",
   "original": "exl6_161",
   "page_count": 4,
   "order": 34,
   "p1": "161",
   "pn": "164",
   "abstract": [
    "It is traditionally assumed in the linguistic-pragmatic literature that Scalar Implicatures (A or B >> either A or B but not both; some of the Fs>> at least one but not all of the Fs) are explicitly defeasible, structure-dependent and defeasible in context. We present three off-line studies that demonstrate the psycholinguistic reality of these properties of Scalar Implicatures (henceforth SIs). We then present two on-line text comprehension experiments that investigate the time-course of generating SIs and support a pragmatic account of SIs, according to which SIs are generated only when both structural and contextual constraints license them. We aim to demonstrate how an experimental approach can be informative on core issues in the semantics/ pragmatics literature.\n",
    ""
   ]
  },
  "koo06_exling": {
   "authors": [
    [
     "Hahn",
     "Koo"
    ],
    [
     "Jennifer",
     "Cole"
    ]
   ],
   "title": "On learnability and naturalness as constraints on phonological grammar",
   "original": "exl6_165",
   "page_count": 4,
   "order": 35,
   "p1": "165",
   "pn": "168",
   "abstract": [
    "We report six experiments on learnability of four non-adjacent phonotactic constraints which differ in their attested frequency and phonetic conditioning factors; liquid harmony, liquid disharmony, backness harmony, and backness disharmony. Our results suggest that such phonotactic constraints can be implicitly learned from brief experience and that learnability of a phonological grammar may be independent of its attested frequency and phonetic basis.\n",
    ""
   ]
  },
  "lehtinen06_exling": {
   "authors": [
    [
     "Mari",
     "Lehtinen"
    ]
   ],
   "title": "Prosody and punctuation in <i>the stranger</i> by Albert Camus",
   "original": "exl6_169",
   "page_count": 4,
   "order": 36,
   "p1": "169",
   "pn": "172",
   "abstract": [
    "The aim of this paper is to provide an overview of the results of a study concerning the prosodic interpretation of punctuation. The focus is placed on the two most common punctuation marks, that is to say, full stops and commas. The findings are based on a comparison between The Stranger by Albert Camus the way it is published as a book and the way it is read out by its author in two French radio broadcasts in 1954. My findings suggest that the oral interpretation of the punctuation clearly is subject to a certain code. However, the most interesting findings of this study concern a non-negligible number of cases in which the code is not observed.\n",
    ""
   ]
  },
  "lin06_exling": {
   "authors": [
    [
     "Hsin-Yi",
     "Lin"
    ],
    [
     "Kwock-Ping John",
     "Tse"
    ],
    [
     "Janice",
     "Fon"
    ]
   ],
   "title": "An acoustic study on the paralinguistic prosody in the Politeness talk in Taiwan Mandarin",
   "original": "exl6_173",
   "page_count": 4,
   "order": 37,
   "p1": "173",
   "pn": "176",
   "abstract": [
    "The relationship between the interlocutors is known, in Sociolinguistics and Pragmatics, to be influential on speakers tone of voice. This study examined this phenomenon from acoustical aspects by measuring the duration and pitch of the dialogues made by pairs of talkers. Shorter word duration is found between strangers dialogues and lower pitch register is found in female talkers speech to males. The findings indicate that the prosody of talkers indeed varies with their familiarity with hearers and also with hearers gender.\n",
    ""
   ]
  },
  "lousada06_exling": {
   "authors": [
    [
     "Marisa Lobo",
     "Lousada"
    ],
    [
     "Luis M. T.",
     "Jesus"
    ]
   ],
   "title": "Analysis of stop consonant production in European portuguese",
   "original": "exl6_177",
   "page_count": 4,
   "order": 38,
   "p1": "177",
   "pn": "180",
   "abstract": [
    "This paper investigates acoustic features correlated with voicing (VOT, stop duration, closure duration, release duration, voicing into closure duration, duration of preceding vowel and duration of following vowel) and with the place of articulation (spectral peaks) of stop consonants /p, b, t, d, k, g/. A corpus with these stops in initial, medial and final word position was recorded for six native speakers of European Portuguese.\n",
    ""
   ]
  },
  "macek06_exling": {
   "authors": [
    [
     "Jan",
     "Macek"
    ],
    [
     "Anja",
     "Geumann"
    ],
    [
     "Julie",
     "Carson-Berndsen"
    ]
   ],
   "title": "Towards multilingual articulatory feature recognition with support vector machines",
   "original": "exl6_181",
   "page_count": 4,
   "order": 39,
   "p1": "181",
   "pn": "184",
   "abstract": [
    "We present experiments on mono-lingual and cross-lingual articulatory feature recognition for English and German speech data. Our goal is to investigate to what extent it is possible to derive and reuse articulatory feature recognizers, whether particular features are better suited to this task. Finally whether this goal is practically achievable with the chosen machine learning technique and the selected set of speech signal descriptors.\n",
    ""
   ]
  },
  "martin06_exling": {
   "authors": [
    [
     "Philippe",
     "Martin"
    ]
   ],
   "title": "Prosody, syntax, macrosyntax",
   "original": "exl6_185",
   "page_count": 4,
   "order": 40,
   "p1": "185",
   "pn": "188",
   "abstract": [
    "Most of research work on French intonation has been conducted on prepared speech data (i.e. read speech), with various approaches ranging to purely syntactic (Rossi), Autosegmental-Metrical (Sun and Fougeron) or Phonosyntactic (Martin). This paper examines the bases of the phonosyntactic approach extended to spontaneous (nonprepared) speech data, described syntactically from a macrosyntactic point of view (Blanche-Benveniste, Deulofeu).\n",
    "s Blanche-Benveniste, C., 2002, Approches de la langue parlée en français, Ophrys, Paris. Boulakia, G., Deulofeu, J. and Martin, Ph., 2001, Prosodic features finish off ill-formed utterances, don't they?, Proc. Congreso de Fonetica Experimental, Universidad de Sevilla, España, 5-7 mars 2001. Deulofeu, J., 2003, Lapproche macrosyntaxique en syntaxe: un nouveau modèle de rasoir dOccam contre les notions inutiles, Scolia, n° 16, Publications de lUniversité de Strasbourg. Jun, S-A, and Fougeron, C., 2002. Realizations of Accentual Phrase in French Intonation, Probus 14, 147-172. Martin, Ph., 1987. Prosodic and Rhythmic Structures in French, Linguistics, 25-5, 925-949. Martin, Ph., 2004. Lintonation de la phrase dans les langues romanes: lexception du français, Langue française, mars 2004, 36-55. Rossi, M. 1999. Lintonation le Système du Français: description et modélisation, Ophrys, Paris.\n",
    ""
   ]
  },
  "miltsakaki06_exling": {
   "authors": [
    [
     "Eleni",
     "Miltsakaki"
    ],
    [
     "Paschalia",
     "Patsala"
    ]
   ],
   "title": "Effects of structural prominence on anaphora: the case of relative clauses",
   "original": "exl6_189",
   "page_count": 4,
   "order": 41,
   "p1": "189",
   "pn": "192",
   "abstract": [
    "In this paper we present a corpus study and a sentence completion experiment designed to evaluate the discourse prominence of entities evoked in relative clauses. The corpus study shows a preference for referring expressions after a sentence final relative clause to select a matrix clause entity as their antecedents. In the sentence completion experiment, we evaluated the potential effect of head type (restrictive relative clauses are contrasted with non-restrictives and restrictives with an indefinite head). The experimental data show that the matrix clause subject referent is strongly preferred as an antecedent, thus strengthening the conclusion that entities evoked in relative clauses are less salient than their main clause counterparts. Some remaining issues are discussed.\n",
    ""
   ]
  },
  "ouamour06_exling": {
   "authors": [
    [
     "S.",
     "Ouamour"
    ],
    [
     "M.",
     "Guerti"
    ],
    [
     "H.",
     "Sayoud"
    ]
   ],
   "title": "Speaker based segmentation on broadcast news - on the use of ISI technique",
   "original": "exl6_193",
   "page_count": 4,
   "order": 42,
   "p1": "193",
   "pn": "196",
   "abstract": [
    "In this paper we propose a new segmentation technique called ISI or \"Interlaced Speech Indexing\", developed and implemented for the task of broadcast news indexing. It consists in finding the identity of a well-defined speaker and the moments of his interventions inside an audio document, in order to access rapidly, directly and easily to his speech and then to his talk. Our segmentation procedure is based on an interlaced equidistant segmentation (IES) associated with our new ISI algorithm. This approach uses a speaker identification method based on Second Order Statistical Measures. As SOSM measures, we choose the \"µGc\" one, which is based on the covariance matrix. However, experiments showed that this method needs, at least, a speech length of 2 seconds, which means that the segmentation resolution will be 2 seconds. By combining the SOSM with the new Indexing technique (ISI), we demonstrate that the average segmentation error is reduced to only 0.5 second, which is more accurate and more interesting for real-time applications. Results indicate that this association provides a high resolution and a high tracking performance: the indexing score (percentage of correctly labelled segments) is 95% on TIMIT database and 92.4% on Hub4 Broadcast news 96 database.\n",
    ""
   ]
  },
  "papadopoulou06_exling": {
   "authors": [
    [
     "Zafeiroula",
     "Papadopoulou"
    ]
   ],
   "title": "The residence in the country of the target language and its influence to the writings of Greek learners of French",
   "original": "exl6_197",
   "page_count": 4,
   "order": 43,
   "p1": "197",
   "pn": "200",
   "abstract": [
    "The study of linguistic acquisition implies the study of the contexts where this process evolves. In order to analyze the role of the residence in the country of the target language, we formed two groups of informants (one in Greece, one in France). In order to make this comparison, we chose to analyze the reference to the entities and the temporal reference in the texts collected, and we hoped to show the influence of a residence in France.\n",
    ""
   ]
  },
  "papafragou06b_exling": {
   "authors": [
    [
     "Anna",
     "Papafragou"
    ],
    [
     "Ozge Isik",
     "Ozturk"
    ]
   ],
   "title": "The acquisition of epistemic modality",
   "original": "exl6_201",
   "page_count": 4,
   "order": 44,
   "p1": "201",
   "pn": "204",
   "abstract": [
    "In this paper we try to contribute to the body of knowledge about the acquisition of English epistemic modal verbs (e.g. Mary may/has to be at school). Semantically, these verbs encode possibility or necessity with respect to available evidence. Pragmatically, the use of epistemic modals often gives rise to scalar conversational inferences (Mary may be at school -> Mary doesnt have to be at school). The acquisition of epistemic modals is challenging for children on both these levels. In this paper, we present findings from two studies which were conducted with 5-year-old children and adults. Our findings, unlike previous work, show that 5-yr-olds have mastered epistemic modal semantics, including the notions of necessity and possibility. However, they are still in the process of acquiring epistemic modal pragmatics.\n",
    ""
   ]
  },
  "protopapas06_exling": {
   "authors": [
    [
     "Athanassios",
     "Protopapas"
    ],
    [
     "Spyridoula",
     "Varlokosta"
    ],
    [
     "Alexandra",
     "Economou"
    ],
    [
     "Maria",
     "Kakavoulia"
    ]
   ],
   "title": "Towards empirical dimensions for the classification of aphasic performance",
   "original": "exl6_205",
   "page_count": 4,
   "order": 45,
   "p1": "205",
   "pn": "208",
   "abstract": [
    "We present a study of 13 patients with aphasia, not screened by presumed subtype, showing strong correlations among disparate measures of fluency and measures of receptive and expressive grammatical ability related to verb functional categories. The findings are consistent with a single underlying dimension of severity. We suggest that subtyping be re-examined in light of performance patterns and only accepted when patient clustering is empirically derived and theoretically meaningful.\n",
    ""
   ]
  },
  "rodero06_exling": {
   "authors": [
    [
     "Emma",
     "Rodero"
    ]
   ],
   "title": "Analysis of intonation in news presentation on television",
   "original": "exl6_209",
   "page_count": 4,
   "order": 46,
   "p1": "209",
   "pn": "212",
   "abstract": [
    "The effectiveness on the television communication is sustained on the handling of voice, which is the base of fundamental expression of the audio-visual contents. Consequently, the audience attention to the television message as well as understanding and assimilating of it, will depend on a correct and expressive use of voice. These reasons guarantee the necessity to make an empirical investigation about the prosody form in which the news broadcasters on television use voice. Therefore, the actual communication is based on the results of a study in order to determine the intonation in broadcasters on television.\n",
    ""
   ]
  },
  "rucart06_exling": {
   "authors": [
    [
     "Pierre",
     "Rucart"
    ]
   ],
   "title": "Templates from syntax to morphology: affix ordering in Qafar",
   "original": "exl6_213",
   "page_count": 4,
   "order": 47,
   "p1": "213",
   "pn": "216",
   "abstract": [
    "The functional head suggests that verbs acquire their inflectional properties by moving from one head position to the next in the syntactic derivation. A problem arises as affixes ordering is not sensitive to syntactic properties, as it is the case in Qafar. This Cushitic language exhibits two verbal classes depending on whether verbs can have prefixes. I argue that the hierarchical structure of template corresponds to the syntactic structure. Phonological constraints on templates formation activate adequate syntactic operations. If we assume that templatic domains lie at the interface between syntax and phonology, we account for some issues of affix ordering, that involve no syntactic property.\n",
    ""
   ]
  },
  "seneviratne06_exling": {
   "authors": [
    [
     "Sharmaine",
     "Seneviratne"
    ]
   ],
   "title": "Processing causal and diagnostic uses of <i>so</i>",
   "original": "exl6_217",
   "page_count": 4,
   "order": 48,
   "p1": "217",
   "pn": "220",
   "abstract": [
    "This study compares the processing of causal and diagnostic uses of the connective so. In an experiment measuring reading times, it is shown that diagnostic so constructions, (e.g. Carl has been limping lately. So he was injured in the accident.) take longer to read than causal ones (e.g. Carl didnt wear his seatbelt. So he was injured in the accident.). This difference is reduced in parallel constructions where so is absent. It is proposed that readers are strongly biased towards a default causal reading of so and therefore anticipate a consequence when they encounter so. In diagnostic constructions, since so is followed by an antecedent, processing is more effortful and complex because the default expectation has to be reversed.\n",
    ""
   ]
  },
  "capitaosilva06_exling": {
   "authors": [
    [
     "Susana M.",
     "Capitão Silva"
    ],
    [
     "Luis M. T.",
     "Jesus"
    ],
    [
     "Mário A. L.",
     "Alves"
    ]
   ],
   "title": "Acoustics of speech and environmental sounds",
   "original": "exl6_221",
   "page_count": 4,
   "order": 49,
   "p1": "221",
   "pn": "224",
   "abstract": [
    "In this study we present a preliminary acoustic analysis of environmental sound stimuli, based on Gavers (1993) classification. Results showed similarities between sounds produced by objects with the same type of material and interaction. We also designed an experiment, where the subjects had to propose onomatopoeic representations for environmental sounds. The onomatopoeic representations used by the subjects shared common speech features (manner and place of articulation, and vowels used).\n",
    ""
   ]
  },
  "spinu06_exling": {
   "authors": [
    [
     "Laura",
     "Spinu"
    ]
   ],
   "title": "Romanian palatalized consonants: a perceptual study",
   "original": "exl6_225",
   "page_count": 4,
   "order": 50,
   "p1": "225",
   "pn": "228",
   "abstract": [
    "Most consonants in the Romanian inventory are claimed to have a surface palatalized counterpart carrying functional meaning; it is not clear, however, whether the set of palatalized consonants is represented underlyingly. The present study investigated the perception of palatalized consonants based on two experiments. It was found that native speakers can discriminate between plain and palatalized segments, but sensitivity to palatalization decreases when another morphological cue is present. It was further confirmed that the primary place of articulation affects perceptibility. This situation is intriguing from a representational perspective, since neither phonemic nor allophonic status in the sense of a classical analysis can fully describe the behavior of these consonants.\n",
    ""
   ]
  },
  "suciu06_exling": {
   "authors": [
    [
     "Ioana",
     "Suciu"
    ],
    [
     "Ioannis",
     "Kanellos"
    ],
    [
     "Thierry",
     "Moudenc"
    ]
   ],
   "title": "Formal expressive indiscernibility underlying a prosodic deformation model",
   "original": "exl6_229",
   "page_count": 4,
   "order": 51,
   "p1": "229",
   "pn": "232",
   "abstract": [
    "We are here concerned by the setting up of a model and a formalism for expressive speech synthesis under the paradigm of a corpus-based approach. Our objective is to apply prosodic expressive forms, acquired from natural human-reading recordings, on a new textual matter. We outline a general model for speech expressiveness. Then we deal with some formal aspects of expressive representation. We point out the core transformational aspects and the indiscernibility criteria allowing comparisons between forms. We finish by some interpretational issues of such an approach.\n",
    ""
   ]
  },
  "sysoeva06_exling": {
   "authors": [
    [
     "Anna",
     "Sysoeva"
    ]
   ],
   "title": "What is said and what is implicated: a study with reference to communication in English and Russian",
   "original": "exl6_233",
   "page_count": 4,
   "order": 52,
   "p1": "233",
   "pn": "236",
   "abstract": [
    "The study of cross-cultural differences in the degree of reliance on different types of inferences shows that pragmatic inference contributing to the additional implicated proposition is the only kind of inference that can be preferred or dispreferred for cultural reasons. Defaults and pragmatic inferences contributing to the truth-conditional representation, on the other hand, are not a matter of preference/dispreference. This observation signifies that different types of inferences differ in their functions and processing.\n",
    ""
   ]
  },
  "tsaklidou06_exling": {
   "authors": [
    [
     "Stella",
     "Tsaklidou"
    ],
    [
     "Eleni",
     "Miltsakaki"
    ]
   ],
   "title": "Animacy effects on discourse prominence in Greek complex NPs",
   "original": "exl6_237",
   "page_count": 4,
   "order": 53,
   "p1": "237",
   "pn": "240",
   "abstract": [
    "This paper is concerned with the factors determining the relative salience of entities evoked in Complex NPs. The salience of entities evoked in complex NPs cannot be predicted by current theories of salience which attribute salience to grammatical role (subjects are more salient than non-subjects) or thematic role (agent are more salient than non-agents). A plausible hypothesis might be that, in complex NPs, head nouns are more salient than non-head nouns. Based on a sizable corpus of Greek, we analyze 484 instances of complex NPs. The results of the analysis reveal a semantic hierarchy of salience which predicts the full range of data independently of headedness: Animate Human>Inanimate Concrete Object>Inanimate Abstract Object.\n",
    ""
   ]
  },
  "turney06_exling": {
   "authors": [
    [
     "Edmund",
     "Turney"
    ],
    [
     "Carmen",
     "Pérez Sabater"
    ],
    [
     "Begoña",
     "Montero Fleta"
    ]
   ],
   "title": "Formality and informality in electronic communication",
   "original": "exl6_241",
   "page_count": 4,
   "order": 54,
   "p1": "241",
   "pn": "244",
   "abstract": [
    "Electronic mails have nowadays become the most usual support to exchange information in professional and academic environments. A lot of research on this topic to date has focused on the linguistic characteristics of electronic communication and on the formal and informal features and the orality involved in this form of communication. Most of the studies have referred to group-based asynchronous communication. But the increasing use of e-mails today, even for the most important, confidential and formal purposes is tending to form a new sub-genre of letter-writing. This paper studies the formulae of etiquette and protocol used in e-mails for salutation, opening, pre-closing and closing, and other elements related to formality and provides new insights on these features. Our research is based on the analysis of a corpus of formal and informal messages in an academic environment.\n",
    ""
   ]
  },
  "vazduarte06_exling": {
   "authors": [
    [
     "Helena Margarida",
     "Vaz Duarte"
    ],
    [
     "Rosa Lídia",
     "Coimbra"
    ],
    [
     "Lurdes de",
     "Castro Moutinho"
    ]
   ],
   "title": "All roads lead to advertising: use of proverbs in slogans",
   "original": "exl6_245",
   "page_count": 4,
   "order": 55,
   "p1": "245",
   "pn": "248",
   "abstract": [
    "This paper presents a research on the use of proverbs in written advertising texts from Portuguese press. The analysis focus on the presence of the proverb in the text both changed and unaltered. The different strategies of transformation are presented.\n",
    ""
   ]
  },
  "vogel06_exling": {
   "authors": [
    [
     "Irene",
     "Vogel"
    ],
    [
     "Robin",
     "Aronow-Meredith"
    ]
   ],
   "title": "Perception of complex coda clusters and the role of the SSP",
   "original": "exl6_249",
   "page_count": 4,
   "order": 56,
   "p1": "249",
   "pn": "252",
   "abstract": [
    "Modern Persian permits coda clusters, many of which violate the Sonority Sequencing Principle. In a syllable counting task, Persian speakers consistently perceived clusters in CVCC target items as monosyllabic, whereas English speakers generally perceived clusters existing in English as monosyllabic but those not existing in English as bi-syllabic. Moreover, the latter were perceived as monosyllabic more frequently if they adhered to the SSP than if they did not. In a follow-up experiment, French speakers performed a similar task, related to the clusters of that language. It is anticipated that the French speakers will exhibit similar perceptual behavior demonstrating the influence of the native language when the cluster exists in French, and the influence of the SSP if it does not.\n",
    ""
   ]
  },
  "watanabe06_exling": {
   "authors": [
    [
     "Michiko",
     "Watanabe"
    ],
    [
     "Keikichi",
     "Hirose"
    ],
    [
     "Yasuharu",
     "Den"
    ],
    [
     "Shusaku",
     "Miwa"
    ],
    [
     "Nobuaki",
     "Minematsu"
    ]
   ],
   "title": "Factors influencing ratios of filled pauses at clause boundaries in Japanese",
   "original": "exl6_253",
   "page_count": 4,
   "order": 57,
   "p1": "253",
   "pn": "256",
   "abstract": [
    "Speech disfluencies have been studied as clues to human speech production mechanisms. Major constituents are assumed to be principal units of planning and disfluencies are claimed to occur when speakers have some trouble in planning such units. We tested two hypotheses about the probability of disfluencies by examining the ratios of filled pauses (fillers) at sentence and clause boundaries: 1) the deeper the boundary, the higher the ratio of filled pauses (the boundary hypothesis); 2) the more complex the upcoming constituent, the higher the ratio of filled pauses (the complexity hypothesis). The both hypotheses were supported by filler ratios at clause boundaries, but not by those at sentence boundaries. The results are discussed in light of speech production models.\n",
    ""
   ]
  },
  "yap06_exling": {
   "authors": [
    [
     "Foong Ha",
     "Yap"
    ],
    [
     "Stella Wing Man",
     "Kwan"
    ],
    [
     "Emily Sze Man",
     "Yiu"
    ],
    [
     "Patrick Chun Kau",
     "Chu"
    ],
    [
     "Stella Fat",
     "Wong"
    ]
   ],
   "title": "Assessing aspectual asymmetries in human language processing",
   "original": "exl6_257",
   "page_count": 4,
   "order": 58,
   "p1": "257",
   "pn": "260",
   "abstract": [
    "This paper reports reaction time studies on aspect processing, and highlights that aspectual asymmetries (perfective vs. imperfective facilitation) in terms of reaction time is dependent on verb types.\n",
    ""
   ]
  },
  "port06_exling": {
   "authors": [
    [
     "Robert",
     "Port"
    ]
   ],
   "title": "Toward a rich phonology",
   "original": "exl6_261",
   "page_count": 4,
   "order": 59,
   "p1": "261",
   "pn": "264",
   "abstract": [
    "A radically new conception of linguistic representations is proposed. The claim is that language is stored in memory in the form of large distributions of specific utterances in a rich high-dimensional space, sometimes called exemplar memory. This is the form the brain uses for understanding and creating utterances in real time. In contrast, the abstract, speaker-independent description of language (as modelled by alphabetical orthographies and by linguistic descriptions using phonemes, etc.) exhibits many structures and patterns that comprise a social institution, maintained by speakers over time, and approximating a discrete system made from components. However, these phenomena, shaped by social as well as articulatory and auditory factors, play no clear role in real-time language processing.\n",
    ""
   ]
  }
 },
 "sessions": [
  {
   "title": "Tutorial Papers",
   "papers": [
    "alexiadou06_exling",
    "caplan06_exling",
    "clements06_exling",
    "govokhina06_exling",
    "kewleyport06_exling",
    "papafragou06_exling",
    "perkell06_exling",
    "schiller06_exling"
   ]
  },
  {
   "title": "Experimental Papers",
   "papers": [
    "abelin06_exling",
    "alexandris06_exling",
    "alexopoulou06_exling",
    "astruc06_exling",
    "awad06_exling",
    "baltazani06_exling",
    "barberia06_exling",
    "botinis06_exling",
    "chen06_exling",
    "clements06b_exling",
    "coimbra06_exling",
    "cummins06_exling",
    "darani06_exling",
    "deyne06_exling",
    "moraes06_exling",
    "dimperio06_exling",
    "efstathopoulou06_exling",
    "flouraki06_exling",
    "folli06_exling",
    "gawronska06_exling",
    "gibert06_exling",
    "gryllia06_exling",
    "haussler06_exling",
    "jacewicz06_exling",
    "joffe06_exling",
    "katsos06_exling",
    "koo06_exling",
    "lehtinen06_exling",
    "lin06_exling",
    "lousada06_exling",
    "macek06_exling",
    "martin06_exling",
    "miltsakaki06_exling",
    "ouamour06_exling",
    "papadopoulou06_exling",
    "papafragou06b_exling",
    "protopapas06_exling",
    "rodero06_exling",
    "rucart06_exling",
    "seneviratne06_exling",
    "capitaosilva06_exling",
    "spinu06_exling",
    "suciu06_exling",
    "sysoeva06_exling",
    "tsaklidou06_exling",
    "turney06_exling",
    "vazduarte06_exling",
    "vogel06_exling",
    "watanabe06_exling",
    "yap06_exling",
    "port06_exling"
   ]
  }
 ]
}