{
 "series": "HSCR",
 "title": "Fourth International Workshop on the History of Speech Communication Research (HSCR 2021)",
 "location": "Prague, Czech Republic",
 "startDate": "27/8/2021",
 "endDate": "28/8/2021",
 "URL": "https://hscr2021.ff.cuni.cz/",
 "chair": "Chairs: Jan Volín and Pavel Šturm",
 "intro": "preface.pdf",
 "ISSN": "0940-6832",
 "conf": "HSCR",
 "year": "2021",
 "name": "hscr_2021",
 "SIG": "HSCS",
 "title1": "Fourth International Workshop on the History of Speech Communication Research",
 "title2": "(HSCR 2021)",
 "date": "27-28 August 2021",
 "booklet": "hscr_2021.pdf",
 "papers": {
  "hoskovec21_hscr": {
   "authors": [
    [
     "Tomáš",
     "Hoskovec"
    ]
   ],
   "title": "A history of sound, sign, and meaning: the Prague Centre perspective and prospect",
   "original": "hoskovec",
   "page_count": 6,
   "order": 1,
   "p1": "9",
   "pn": "14",
   "abstract": [
    "Note: full paper but no abstract available"
   ],
   "doi": "10.21437/HSCR.2021-1"
  },
  "ashby21_hscr": {
   "authors": [
    [
     "Michael",
     "Ashby"
    ]
   ],
   "title": "A Prague School psycholinguist in London? The life and career of Frieda Goldman‐Eisler (1907–1982)",
   "original": "ashby",
   "page_count": 10,
   "order": 2,
   "p1": "15",
   "pn": "24",
   "abstract": [
    "This paper sketches the life and work of Frieda Goldman-Eisler, a pioneer of experimental psycholinguistics who worked in the Department of Phonetics at University College London and became the first Professor of Psycholinguistics in the UK. We trace the evolution of her work in the intellectual climate of the 1950s, and assess the likely influence of her colleagues at UCL. We challenge the widely-held assumption that she was influenced by the Prague-circle psychologist Karl Bühler. Drawing on previously unused biographical and archival sources, we give details of her littleknown first marriage and hapless academic record as a postgraduate student in London."
   ],
   "doi": "10.21437/HSCR.2021-2"
  },
  "vlkova21_hscr": {
   "authors": [
    [
     "Markéta",
     "Vlková"
    ]
   ],
   "title": "Between science and art: The speech melodies of Leoš Janáček",
   "original": "vlkova",
   "page_count": 10,
   "order": 3,
   "p1": "25",
   "pn": "33",
   "abstract": [
    "When discussing Leoš Janáček – whether in the field of musicology or among the general public – the topic of speech melodies often arises. What provokes interest is not only the composer’s peculiar activity of listening to human speech and recording its intonation in standard musical notation but also the musical features of such melodies. However, the view of speech melodies has changed over time, and even today, there is no general agreement on how to interpret them. The first generation of Janáček scholars, encouraged by the composer himself, considered these notated extracts to be scientific documents of real sounds which could facilitate the research of spoken language. This view was later criticised by younger musicologists, who emphasized the high level of stylization and subjective qualities of speech melodies, such as the author’s favourite melodic patterns. A third, alternative view has been\nprovided by the writer Milan Kundera. In his essay 'Můj Janáček', he describes Janáček’s activity as a ritual of everydayness, through which the composer searches for the “vanished present” and the “melodic truth”. This paper provides an overview of Janáček’s concept of speech melodies against the background of all three abovementioned approaches. Discussing different categories of speech melodies – namely, 'normal', 'excited', and 'lyrical' ones – it demonstrates Janáček’s scientific ambitions and striving for precision as well as his artistic creativity and a tendency to stylise. Also, especially in light of Kundera’s concept, speech melodies reveal themselves as tools to capture the elusive present."
   ],
   "doi": "10.21437/HSCR.2021-3"
  },
  "gosy21_hscr": {
   "authors": [
    [
     "Mária",
     "Gósy"
    ]
   ],
   "title": "On phonetic transcription: Achievements of creative minds",
   "original": "gosy",
   "page_count": 12,
   "order": 4,
   "p1": "35",
   "pn": "45",
   "abstract": [
    "The attempts to create a phonetic writing system have had a relatively long history of over 500 years. Various inventors worked on establishing a transcription system that reflects the articulation of a language. Beside the well-known names in this field, there are a few Hungarian scientists who contributed to the development of transcription without, alas, leaving a trace for the international body of knowledge. They created both analphabetic and alphabetic writing systems, but the majority of their inventions remained unknown, unused and ineffectual even in Hungary. Looking at these “phonetic scripts”, however, the successors should acknowledge the attempts, thoughts, creativity and results of these people that in a way enrich the history of phonetics. This study introduces these scientists, and places their inventions into a broader context of the history of the transcription of speech."
   ],
   "doi": "10.21437/HSCR.2021-4"
  },
  "braun21_hscr": {
   "authors": [
    [
     "Angelika",
     "Braun"
    ]
   ],
   "title": "Leaving the ivory tower: How real‐life events have impacted phonetics throughout history",
   "original": "braun",
   "page_count": 16,
   "order": 5,
   "p1": "47",
   "pn": "62",
   "abstract": [
    "Academic research has a reputation of being somewhat detached from reality. The metaphor of researchers being confined to the ivory tower, unable to leave it and largely unable to relate to the real world is indicative of this view. However, this view might not always be adequate. This contribution provides a number of counterexamples from the field of phonetics. Several real-world events are discussed which have had a very direct and measurable impact on phonetic research. The first example goes back to the time before phonetics was known as “phonetics”. It concerns the change in attitude towards autopsies that unleashed the curiosity about human anatomy, which permitted the evolution of phonetics in the first place.\n",
    "The other examples are more recent. They are often related to criminal cases in which phoneticians have acted as experts. One example is research on memory for voices, which was prompted by the kidnapping of the Lindbergh baby in 1932. A further example concerns the development of the spectrograph, which was part of the American WW II wartime strategy. The next major event affecting phonetic research was the impeachment trial of Richard M. Nixon, in the course of which a clandestine recording made in the White House had to be authenticated. In 1989, the supertanker 'Exxon Valdez' grounded in Prince William Sound, Alaska. In this case as well as a similar one in Germany, the question of whether the captain was drunk at the time of the incident\nplayed a major role in the court cases. Finally, the various attempts at establishing a German pronunciation standard are reviewed in light of political developments in recent history."
   ],
   "doi": "10.21437/HSCR.2021-5"
  },
  "volin21_hscr": {
   "authors": [
    [
     "Jan",
     "Volín"
    ],
    [
     "Pavel",
     "Šturm"
    ]
   ],
   "title": " Honouring historical facts: The case of intonational downtrends",
   "original": "volin",
   "page_count": 12,
   "order": 6,
   "p1": "63",
   "pn": "73",
   "abstract": [
    "Various researchers of the past are honoured in citations as the very first who described or discovered certain scientifically important phenomena. However, the illusion of “our times being superior to past” causes certain myopia: we often do not go back enough to identify and appreciate the true pioneers. Generally, we tend to underestimate what our ancestors already knew and did, and we overestimate the contribution of our own era. The present paper demonstrates this predicament with the case of intonational downtrends, i.e., gradual lowering of phonologically equivalent melodic targets within an utterance. The first report of the phenomenon is often attributed to K. L. Pike, sometimes even to later intonologists. We, on the other hand,\ndocument much older accounts of intonational downtrends, and offer some tentative explanations as to why the earlier research was ignored."
   ],
   "doi": "10.21437/HSCR.2021-6"
  },
  "trouvain21_hscr": {
   "authors": [
    [
     "Jürgen",
     "Trouvain"
    ]
   ],
   "title": "Aerodynamic voicing constraint in stops: From Wolfgang von Kempelen to John Ohala",
   "original": "trouvain",
   "page_count": 8,
   "order": 7,
   "p1": "75",
   "pn": "81",
   "abstract": [
    "Voicing in stop consonants is restricted by aerodynamical constraints, as illustrated by John Ohala, among others, more than three decades ago. It seems to be unnoticed in modern phonetic research that Wolfgang von Kempelen already described these challenges two centuries earlier. With additional bellows in his speaking machine he offered a mechanical solution for the vocal tract enlargement in stop production to achieve a longer voiced phase. A look back can help to develop a better understanding of the main mechanism for contrasting stops in many languages."
   ],
   "doi": "10.21437/HSCR.2021-7"
  },
  "hoffmann21_hscr": {
   "authors": [
    [
     "Rüdiger",
     "Hoffmann"
    ],
    [
     "Dieter",
     "Mehnert"
    ]
   ],
   "title": "Roots of electronic speech communication in linguistics and engineering: The genesis of the chair of speech communication of the TU Dresden as a case study",
   "original": "hoffmann",
   "page_count": 10,
   "order": 8,
   "p1": "83",
   "pn": "92",
   "abstract": [
    "Speech Communication is an interdisciplinary topic, but in the academic practice it has to be assigned to disciplines like linguistics and phonetics, electrical engineering, etc. In the case of engineering, the interest of the faculties originated in the first years mainly from scientific problems in telecommunication. But around the end of the 1960s, the focus widened to more general aspects of human-human and human-machine communication. The paper investigates how this process advanced at Dresden Technical University (TU) with special respect to external influences, originating from phonetics and communication sciences."
   ],
   "doi": "10.21437/HSCR.2021-8"
  },
  "lopes21_hscr": {
   "authors": [
    [
     "Quintino",
     "Lopes"
    ],
    [
     "George",
     "Brock‐Nannestad"
    ]
   ],
   "title": "Lacerda's chromographs (1930s‐1950s): The circulation and appropriation of knowledge in Europe and the Americas",
   "original": "lopes",
   "page_count": 12,
   "order": 9,
   "p1": "93",
   "pn": "104",
   "abstract": [
    "From the 1930s to the early 1950s, chromography, a technique invented and developed by Armando de Lacerda, constituted an advanced method of investigation in the field of phonetics which overcame the limitations of kymography, the method predominantly used in experimental phonetics laboratories during the period. The new technique was first used by Lacerda in collaboration with Paul Menzerath in Bonn, its use later spreading to Portugal and Brazil. The existence of the most advanced chromographic equipment at the University of Coimbra Experimental Phonetics Laboratory since 1936 explains why Portugal became a global centre for Phonetics research and remained such up until the 1950s, attracting numerous scientists from abroad who, under the supervision of its head, Armando de Lacerda, received specialist training in the use of chromography. Later, the technique was used at the University of Bahia, where Lacerda and Nelson Rossi established the first experimental phonetics laboratory in South America in 1956–57, and where the first work on linguistic geography of Brazil, entitled 'Atlas Prévio dos Falares Baianos', was produced."
   ],
   "doi": "10.21437/HSCR.2021-9"
  }
 },
 "sessions": [
  {
   "title": "Keynote 1",
   "papers": [
    "hoskovec21_hscr"
   ]
  },
  {
   "title": "Regular papers 1",
   "papers": [
    "ashby21_hscr",
    "vlkova21_hscr",
    "gosy21_hscr"
   ]
  },
  {
   "title": "Keynote 2",
   "papers": [
    "braun21_hscr"
   ]
  },
  {
   "title": "Regular papers 2",
   "papers": [
    "volin21_hscr",
    "trouvain21_hscr",
    "hoffmann21_hscr",
    "lopes21_hscr"
   ]
  }
 ],
 "doi": "10.21437/HSCR.2021"
}