{
 "series": "HSCR",
 "title": "Second International Workshop on the History of Speech Communication Research (HSCR 2017)",
 "location": "Helsinki, Finland",
 "startDate": "18/8/2017",
 "endDate": "19/8/2017",
 "URL": "",
 "chair": "Chairs: Martti Vainio, Juraj Šimko and Reijo Aulanko",
 "intro": "hs17_preface.pdf",
 "ISSN": "0940-6832",
 "conf": "HSCR",
 "year": "2017",
 "name": "hscr_2017",
 "SIG": "HSCS",
 "title1": "Second International Workshop on the History of Speech Communication Research",
 "title2": "(HSCR 2017)",
 "date": "18-19 August 2017",
 "booklet": "hscr_2017.pdf",
 "papers": {
  "ashby17_hscr": {
   "authors": [
    [
     "Michael",
     "Ashby"
    ]
   ],
   "title": "The digital history of phonetic science",
   "original": "hs17_ashby",
   "page_count": 9,
   "order": 1,
   "p1": "7",
   "pn": "15",
   "abstract": [
    "This paper looks at the effects of the digital revolution on the activity of researching and writing the history of speech communication research. Examples are given from the author's recent work in which new findings flow from the application of digital methods which may now seem commonplace but have come into use only within the last twenty years. Consideration is then given to the widely-held notion that ‘digital history’ is defined by its use of ‘big data’. It is shown that large corpora such as Google Books and the Internet Archive already benefit our efforts as historians of speech communication research, although we should make efforts to augment those databases, or build specialised databases of our own, with materials which target our requirements more directly. That would in turn entail developing OCR to deal with IPA and other phonetic symbols, and an indication is given of how that can be achieved. In conclusion it is suggested that digital methods radically reduce the cost in time and resources of lines of inquiry which would previously have seemed impracticable, thus changing our perspectives on what can and should be attempted and giving us the freedom to be more adventurous in our investigations. "
   ],
   "doi": "10.21437/HSCR.2017-1"
  },
  "brackhane17_hscr": {
   "authors": [
    [
     "Fabian",
     "Brackhane"
    ],
    [
     "Richard",
     "Sproat"
    ],
    [
     "Jürgen",
     "Trouvain"
    ]
   ],
   "title": "Editing Kempelen's \"Mechanismus der menschlichen Sprache\": Experiences and findings",
   "original": "hs17_brackhanes",
   "page_count": 9,
   "order": 2,
   "p1": "16",
   "pn": "24",
   "abstract": [
    "Wolfgang von Kempelen’s book The Mechanism of Human Speech from 1791 is a famous milestone in the history of speech communication research. It has an enormous relevance for the phonetic sciences and it marks an important turning point for the development of the (mechanical) speech synthesis. So far no English version of this work was available, which excludes many interested researchers. Access to the original versions in German and French is restricted for various reasons. For example the blackletter script of the German version is troublesome for most of today’s readers. We report here on a new edition of Kempelen's book which unites a better readable German version and its English translation. It will now also be in a searchable electronic format and has been enriched with many commentaries, which aid in the understanding of details of the late 18th century that are little known or unknown to many researchers today. "
   ],
   "doi": "10.21437/HSCR.2017-2"
  },
  "brackhane17b_hscr": {
   "authors": [
    [
     "Fabian",
     "Brackhane"
    ],
    [
     "Mária",
     "Gósy"
    ]
   ],
   "title": "Kempelen's speaking machine: experiences with replicas",
   "original": "hs17_brackhaneg",
   "page_count": 10,
   "order": 3,
   "p1": "25",
   "pn": "34",
   "abstract": [
    "There are a number of recent replicas of Wolfgang von Kempelen’s speaking machine. Although all of them are explicitly based on Kempelen’s own description nearly none of them are identical in construction and sound. In this paper we want to illustrate some of these differences and their reasons for five replicas built by ourselves. "
   ],
   "doi": "10.21437/HSCR.2017-3"
  },
  "hoffmann17_hscr": {
   "authors": [
    [
     "Rüdiger",
     "Hoffmann"
    ],
    [
     "Gritta",
     "Gramm"
    ]
   ],
   "title": "The Sennheiser vocoder goes digital - on a German R&D project in the 1970s",
   "original": "hs17_hoffmann",
   "page_count": 10,
   "order": 4,
   "p1": "35",
   "pn": "44",
   "abstract": [
    "In the history of speech technology, the vocoder plays the role of a “guiding fossil”, which introduced the ways to speech analysis and synthesis with electronic means. The general approach is continuously important in contemporary communication systems, but now with digital implementations. This paper describes a research project of Sennheiser electronic from the 1970s, which gives an impressive example for the transition from the classical analog systems to digital, computer-based solutions."
   ],
   "doi": "10.21437/HSCR.2017-4"
  },
  "skrelin17_hscr": {
   "authors": [
    [
     "Pavel A.",
     "Skrelin"
    ],
    [
     "Ulyana E.",
     "Kochetkova"
    ]
   ],
   "title": "Standard French vowel formants vs. characteristic tones of Rousselot: tuning forks technique reconsidered",
   "original": "hs17_skrelin",
   "page_count": 10,
   "order": 5,
   "p1": "45",
   "pn": "54",
   "abstract": [
    " In the current study the historical instrumental method of speech analysis using tuning forks is considered from a new point of view. The set of tuning forks for French oral vowels with the engraved frequency values described by Rousselot in the early 20th century is used in a number of experiments. Firstly, the frequencies of the tuning forks were measured with the use of modern methods of acoustic analysis. The accuracy of their values was proved, which allowed their comparison with modern data on French vowel formant frequencies. Eventually, the perception experiment was conducted to find out modern native speakers’ perception strategies. "
   ],
   "doi": "10.21437/HSCR.2017-5"
  },
  "arai17_hscr": {
   "authors": [
    [
     "Takayuki",
     "Arai"
    ]
   ],
   "title": "Chiba and Kajiyama measured 3D configurations of the human vocal tract and made physical models based on the measurements",
   "original": "hs17_arai",
   "page_count": 6,
   "order": 6,
   "p1": "55",
   "pn": "60",
   "abstract": [
    "In 1930's, Chiba and Kajiyama conducted 3D measurements of the human vocal tract for the first time in history. In this paper, we first reviewed how they measured vocal-tract configurations. They further simplified the vocal-tract configurations and made physical straight models based on the simplifications. In addition to introducing our replicas of the straight models based on their simplifications, we also designed bent models based on their 3D measurements. "
   ],
   "doi": "10.21437/HSCR.2017-6"
  },
  "aalto17_hscr": {
   "authors": [
    [
     "Daniel",
     "Aalto"
    ]
   ],
   "title": "Origins of source filter theory from Mersenne (1636) to Müller (1839)",
   "original": "hs17_aalto",
   "page_count": 7,
   "order": 7,
   "p1": "61",
   "pn": "67",
   "abstract": [
    "Source ﬁlter theory is central in the modern description of speech production. The key concepts underpinning the theory are the sustained oscillation of vocal folds and the vocal tract resonances that modulate the source signal. In this short essay the development of these concepts is superﬁcially followed from early 17th to late 19th century. Marin Mersenne was the ﬁrst to experimentally verify the relationship between the pitch of a sound (of a cord) and its fundamental frequency, published in 1636. By analogy, Mersenne concluded that vocal folds must vibrate with the same frequency as a string with the same pitch. While Mersenne could not explain why several frequencies could be simultaneously present in glottal excitation, Daniel Bernoulli suggested superposition of waves as a solution in 1753, which was further developed by Joseph Fourier. Johannes Müller’s report of excised larynx experiments in 1839 can be considered as the ﬁrst version of source filter theory. Finally, once X-ray imaging during speech production was made possible in 1897, the stage was set for experimental validation of source ﬁlter theory."
   ],
   "doi": "10.21437/HSCR.2017-7"
  },
  "braun17_hscr": {
   "authors": [
    [
     "Angelika",
     "Braun"
    ]
   ],
   "title": "From visible speech to voiceprints - blessing and curse of sound spectrography",
   "original": "hs17_braun",
   "page_count": 11,
   "order": 8,
   "p1": "68",
   "pn": "78",
   "abstract": [
    "Sound spectrography is probably the single most widely used tool in acoustic phonetics today. It was first called 'Visible Speech', thus linking it to Alexander Melville Bell's 1867 publication. At that time, of course, the term only referred to auditory analysis and the iconic documentation thereof. During World War II, sound spectrography as we know it today was developed in the US as part of a war project and was therefore not published until well after the war. A similar device was built in the Soviet Union in the post-war period. Although claims were made on both sides that the device was intended for the benefit of the congenitally deaf, it is quite clear that its primary purpose was in speaker identification. This contribution focuses on the development of the sound spectrograph and outlines its role in (forensic) speaker identification. "
   ],
   "doi": "10.21437/HSCR.2017-8"
  },
  "schellenberg17_hscr": {
   "authors": [
    [
     "Murray",
     "Schellenberg"
    ]
   ],
   "title": "Music, notation and the representation of lexical tone",
   "original": "hs17_schellenberg",
   "page_count": 10,
   "order": 9,
   "p1": "79",
   "pn": "88",
   "abstract": [
    "Music has played a significant role in the study and analysis of lexical tone. This paper presents a brief summary of some of the ways scholars have used and adapted conventions of Western musical notation to further their study of tone. It also examines the possible influence of cultural perceptions of melody on Western perspectives of tone. "
   ],
   "doi": "10.21437/HSCR.2017-9"
  },
  "duran17_hscr": {
   "authors": [
    [
     "Daniel",
     "Duran"
    ]
   ],
   "title": "On the history of computational modelling and simulations in the phonetic sciences",
   "original": "hs17_duran",
   "page_count": 10,
   "order": 10,
   "p1": "95",
   "pn": "98",
   "abstract": [
    "This paper presents a study on the history of simulation studies in phonetics. Precursors to modern computational models are identiﬁed in early mechanical speaking machines. By way of illustration, the historical development is analysed as documented in the proceedings of the International Congress of Phonetic Sciences from 1932 to 2015."
   ],
   "doi": "10.21437/HSCR.2017-10"
  }
 },
 "sessions": [
  {
   "title": "Keynote",
   "papers": [
    "ashby17_hscr"
   ]
  },
  {
   "title": "Regular papers",
   "papers": [
    "brackhane17_hscr",
    "brackhane17b_hscr",
    "hoffmann17_hscr",
    "skrelin17_hscr",
    "arai17_hscr",
    "aalto17_hscr",
    "braun17_hscr",
    "schellenberg17_hscr",
    "duran17_hscr"
   ]
  }
 ],
 "doi": "10.21437/HSCR.2017"
}