{
 "title": "History of Speech Communication Research",
 "location": "Dresden, Germany",
 "startDate": "4/9/2015",
 "endDate": "5/9/2015",
 "conf": "HSCR",
 "year": "2015",
 "name": "hscr_2015",
 "series": "HSCR",
 "SIG": "HSCS",
 "title1": "History of Speech Communication Research",
 "date": "4-5 September 2015",
 "booklet": "hscr_2015.pdf",
 "papers": {
  "ohala15_hscr": {
   "authors": [
    [
     "John J.",
     "Ohala"
    ]
   ],
   "title": "A brief history of experimental phonetics in the 18th and 19th centuries",
   "original": "hs15_013",
   "page_count": 2,
   "order": 1,
   "p1": "13",
   "pn": "14",
   "abstract": [
    "The notion of ‘experimental [any science]’ is based, I think, on two philosophical premises:   1. Our (unaided) senses cannot give us a complete understanding of the world. Our senses are limited and even the impressions we do get from our senses can give us misleading information. Further, the processing that our brain gives to sense data can be defective. And the reasoning powers of the brain – even on imaginary data – can be defective. This much was known and discussed by ancient philosophers, e.g., the Skeptic School in ancient Greece. Many myths and religions were invented to fill gaps in our knowledge of the world.   2. With the advent of the Scientific Revolution around the turn of the 16th to 17th century, there was a new idea: one could overcome the limitations of the senses and reasoning by (a) discovering and devising aids that extended the range of our senses and (b) by formulating hypotheses about what could not be directly detected and then testing such hypotheses using rigorous observation of predicted consequences of the hypotheses and, as far as possible, eliminating or attenuating anticipated sources of error in making and processing such observations. The microscope is an example of the former and Pasteur’s famous experiment with broth in the special retort of his own design is an example of the latter. Experimental phonetics was somewhat late to adopt these views and practices but in the past three centuries it is has come to conform to the practices of normal science. Here I propose to review some of the highlights of this effort in the 18th and 19th centuries, specifically to briefly review the accomplishments of scientists who have pondered the mysteries of speech and made attempts to reveal it physical basis. I give in parentheses their professional background. Ferrein, Antoine (medicine) Kratzenstein, Christian Gottlieb (medicine, physics) von Kempelen, Wolfgang (engineering) Darwin, Erasmus (medicine) Willis, Robert (physics) Chladni, Ernst (physics) Wheatstone, Charles (engineering) Müller, Johannes (medicine) Verner, Karl (language scholar, = linguist) Grassmann, Hermann (polymath: mathematics, linguistics, physics) Bell, Alexander (engineering, physics) Brücke, Ernst (physiology) Czermak, Johan Nepomuk (medicine) Purkynì, J. E. (physiology, psychology) Oakley-Coles, Thomas (medicine) Rousselot, Pierre-Jean (phonetics)\n",
    "One is struck by the fact that almost all of these pioneers in experimental phonetics had backgrounds such as medicine and physics that had already achieved the status of what we would now consider ‘normal science’. Their disciplines had early on embraced the two philosophical premises given above and, moreover, were used to the idea that it is possible to make the unknown known by careful observations and rigorous testing of hypotheses.\n",
    ""
   ]
  },
  "schmitz15_hscr": {
   "authors": [
    [
     "Walter",
     "Schmitz"
    ]
   ],
   "title": "The power of communication. apps as human substitutes in science-fiction films",
   "original": "hs15_015",
   "page_count": 7,
   "order": 2,
   "p1": "15",
   "pn": "21",
   "abstract": [
    "Introduction Inanimate entities being able to speak belongs to the traumatic experiences during modernism’s initial phase around 1800. After all, the preceding century had witnessed the movement of Enlightenment put at the center of knowledge and science man, i.e. the man of reason, able of speech. Thusly Herder had described it in his treatise on the origin of language, a superlative corollary from a number of earlier ideas: Man orders the world by sounds converted into language.   Around 1810, artificial humans emerge even in literature, the latter functioning once more as a seismograph of deep collective fears. The fascination of life being mimicked by mechanics reveals its nocturnal side, its ›Nachtseite‹ (Gotthilf Heinrich Schubert). If man can be replicated, and if such an automaton actually possesses speech, then man himself is subject to renegotiation. He can be replaced, or rather she, for the epitome of this is the female robot Olympia, the talking marionette driving mad the enamored man. The female in the anthropology of sexes around 1800 is the embodiment of Nature, which in the course of history as made by man is only barely sustainable anyway, though at the same time the one sole saving presence. Woman becomes the simulacrum of the horror of man’s final replacement. – In our postmodern times, though, a thing that talks no longer provokes anyone. Not only are humans constantly surrounded by voices to which belongs no human speaker. Technological simulations making themselves useful, announcing the time, answering simple questions, conveying all kinds of information – no panic is caused by this. A talking mirror is no longer a prop out of a fairy tale like, let’s say, Snow White. Technological media of communication, which initially merely transmitted voice-info, have now become voiceproducing. Mankind enters into an interlinking of man and machine that seems to be part of a far-reaching agenda of Human Enhancement, and as such is willingly accepted by many. Man is part of a circular flow of information. No longer subject, neither object, rather to be described as a not-insignificant knot in a far-and-wide-ranging net.\n",
    ""
   ]
  },
  "hoffmann15_hscr": {
   "authors": [
    [
     "Rüdiger",
     "Hoffmann"
    ],
    [
     "Dieter",
     "Mehnert"
    ]
   ],
   "title": "Recent development of the historic acoustic-phonetic collection of the TU Dresden",
   "original": "hs15_022",
   "page_count": 8,
   "order": 3,
   "p1": "22",
   "pn": "29",
   "abstract": [
    "The historic acoustic-phonetic collection (HAPS) of the TU Dresden documents the history of experimental phonetics and speech technology with a re- markably high degree of completeness. Due to some construction work, the col- lection could move to new and improved showrooms in the Barkhausen Building. This paper is a slightly extended version of the welcome speech, presented at the occasion of the re-opening of the collection in the framework of the First Interna- tionalWorkshop on the History of Speech Communication Research (HSCR 2015), a satellite event of the Interspeech, Dresden 2015.\n",
    ""
   ]
  },
  "pettorino15_hscr": {
   "authors": [
    [
     "Massimo",
     "Pettorino"
    ]
   ],
   "title": "The history of talking heads: the trick and the research",
   "original": "hs15_030",
   "page_count": 12,
   "order": 4,
   "p1": "30",
   "pn": "41",
   "abstract": [
    "This study reviews the history of the attempts to build talking statues or talking heads. The study highlights the two paths that have been followed over the centuries: the “voice transport” and the “artificial voice”. The first case was ultimately a trick, because the voice was actually produced by a hidden subject and transported through an artifice to a fake head, so that the voice appeared to come out of the mouth of the statue. The other path, that of research, tried to imitate the human phonation apparatus to produce sequences of sounds in some way similar to those that make up the speech chain. In retracing this long history, I will focus on some examples of the first and second paths. The first, beginning with the oracles of the Chaldean priests and the oracle of Orpheus in the Lesbos island, will lead us to examine the Android built by Albertus Magnus in the 13th century. Its functioning will be explained many years later, in the 17th century, by a German Jesuit priest and scholar, Athanasius Kircher. The other path, aimed at producing a real talking machine, begins in the first century AD in Egypt, through the work of Hero of Alexandria; it then continues in Spain in the 10th century thanks to the ability of an expert manufacturer of hydraulic organs, Gerbert of Aurillac, who became Pope Sylvester II in the year 1000. The statue of Gerbert could produce two distinct sounds thanks to the air escaping by the force of heated water through one of two different cavities. One of the two sounds was quite high in frequency, and was used for an affirmative answer (“etiam”), the other was rather low and was used for a negative answer (“non”). I will then examine the case of the talking heads built by a French abbot, the Abbot Mical, in 1783. An examination of the testimonies regarding this extraordinary automaton will help us reconstruct its history. Which path has led to the production of the present-day synthesized speech? The trick or the research? We will try to answer this question.\n",
    ""
   ]
  },
  "brackhane15_hscr": {
   "authors": [
    [
     "Fabian",
     "Brackhane"
    ]
   ],
   "title": "Kempelen vs. Kratzenstein – researchers on speech synthesis in times of change",
   "original": "hs15_042",
   "page_count": 8,
   "order": 5,
   "p1": "42",
   "pn": "49",
   "abstract": [
    "One was a distinguished natural scientist and engineer, the other a selftaught scientist and vilified as a conman: Christian Gottlieb Kratzenstein (1723– 1795) and Wolfgang von Kempelen (1734–1804). Some of the former’s postulations on human physiology and articulation of speech proved wrong in later years. Most of the latter’s theories are considered applicable even today. The perhaps most contrasting approaches to speech synthesis during the 18th century are linked to their names. There are many essential differences between their approaches which show that these two researchers were not only representatives of different schools of thought, but also representatives of two different scientific eras. A speculative and philosophical approach on the one hand versus an empirical and logical approach on the other hand. Both Kratzenstein and Kempelen published books on their research. But while the “Tentamen” [1] of the physician Kratzenstein remains rather vague and imprecise in its descriptions of vowel production and synthesis, the “Mechanismus” [2] of the engineer Kempelen shows much more precision and correctness in almost every respect of human speech and language. The goal of this paper is to discuss the differences between these two contemporaneous researchers on speech synthesis and to compare their theories with present-days findings.\n",
    "s Kratzenstein, Ch. G.: Tentamen resolvendi problema ab illustri Academia Imperiali scientiarum Petropolitana ad annum 1780 publice propositum. Petersburg. 1781 Kempelen, W.: Wolfgangs von Kempelen k. k. wirklichen Hofraths Mechanismus der menschlichen Sprache nebst Beschreibung seiner sprechenden Maschine. Wien: Degen. 1791.\n",
    ""
   ]
  },
  "berdux15_hscr": {
   "authors": [
    [
     "Silke",
     "Berdux"
    ]
   ],
   "title": "„eine kempelensche sprechmaschine“. new insights in speaking machines in the late 18th and early 19th centuries",
   "original": "hs15_050",
   "page_count": 2,
   "order": 6,
   "p1": "50",
   "pn": "51",
   "abstract": [
    "It was in 1791 that Wolfgang von Kempelen published the Mechanismus der menschlichen Sprache nebst der Beschreibung seiner sprechenden Maschine in Vienna, the last part of which is dedicated to the description of the speaking machine he had worked on for many years. In some parts of his book Kempelen refers to ideas he hadn’t been able to put into practice at that time and asks the readers to further develop the machine.   It was already known that several machines were produced subsequently. For example, Johann Wolfgang von Goethe mentioned in June 1797 in a letter from Jena: “Kempelens Sprechmaschine, welche Hofrat Loder besitzt und die zwar nicht sehr beredt ist, doch aber verschiedne [sic] kindische Worte und Töne ganz artig hervorbringt, ist hier durch einen Tischer [sic] Schreiber, recht gut nachgemacht worden”. In 1806 the well-known medal maker and sculptor Leonhard Posch presented a speaking machine in Berlin. In contemporary sources it is said that it had been built on the basis of Kempelen’s machine and was very similar, but improved. Finally, the British physicist Charles Wheatstone optimized Kempelen’s machine and built an apparatus which he presented in 1826.   Copying the well-known speaking machine in the Deutsches Museum in Munich, often called “the speaking machine by Wolfgang von Kempelen”, was the reason for research about its history, context and attribution which included speaking machines of the late 18th and early 19th centuries. They brought new insights in the speaking machine of Justus Christian Loder mentioned by Goethe, about which little was known, despite the prominence of both the writer and the owner – Loder being a famous doctor of the late 18th and early 19th centuries –, so that its story can be told now. They also brought insights on other unknown speaking machines built on the basis of the one described by Kempelen.   The recent findings show that the interest in speech synthesis, manifested since the mid-18th century in the ideas and works of Erasmus Darwin, Leonhard Euler, Christian Gottlieb Kratzenstein und Abbé Mical, became more common around 1800. There are several persons dealing with this topic – presumably stimulated by the publication of the Mechanismus –, constructing the machine described by Kempelen, improving it and using it for their purposes. Speaking machines can be found in very different contexts showing that the interest in speech synthesis expanded in diverse areas. These include anatomical and physical collections, mechanical experiments becoming part of a Kunstkammer and the partly spectacular presentations of public science.\n",
    ""
   ]
  },
  "korpiun15_hscr": {
   "authors": [
    [
     "Christian",
     "Korpiun"
    ]
   ],
   "title": "Kratzenstein’s vowel resonators – reflections on a revival",
   "original": "hs15_052",
   "page_count": 8,
   "order": 7,
   "p1": "52",
   "pn": "59",
   "abstract": [
    "Introduction. Most commonly, Kratzenstein’s phonetic works are discovered by way of the widespread pattern drawings of his resonators in monographs and essays. They are usually accompanied by terse explanations of the following kind: ‘In 1781, Christian Kratzenstein, a German scientist, was awarded a prize at the Saint Petersburg Academy of Arts for his presentation of five resonators that served to produce the five vowels a, e, i, o and u. Shortly afterwards, Wolfgang von Kempelen constructed a speech machine which was able to produce syllables.’ This is often followed by the mention of Charles Wheatstone, who reportedly experimented with a reproduction of Kempelen’s machine in the first half of the 19th century. These are, in short, the few facts that are commonly disseminated about Kratzenstein and his vowel resonators.\n",
    ""
   ]
  },
  "hoffmann15b_hscr": {
   "authors": [
    [
     "Rüdiger",
     "Hoffmann"
    ]
   ],
   "title": "Voices for toys – first commercial spin-offs in speech synthesis",
   "original": "hs15_060",
   "page_count": 11,
   "order": 8,
   "p1": "60",
   "pn": "70",
   "abstract": [
    "When the collection of phonetic instruments of the Phonetic Institute of the Hamburg University came to the HAPS Dresden in 2005, it included also some small mechanic voices, which can produce single sounds as well as few simple words. These voices are well-known in the phonetic literature as an early attempt to provide hard-hearing people with automatic training tools, following a proposal of the otologist Johannes Kessel in 1899. On the other hand, the phonetic literature never took any notice from the real origin of these interesting pieces. Therefore the author started an investigation some years ago, which guided him not only to the interesting field of mechanical voices in the manufacturing of toys and dolls, but moreover back to the roots of mechanical speech synthesis at the end of the 18th century. This paper gives a rough overview about the recent state of this in- vestigation.\n",
    ""
   ]
  },
  "demolin15_hscr": {
   "authors": [
    [
     "Didier",
     "Demolin"
    ]
   ],
   "title": "The contribution of the kymograph to the description of african languages",
   "original": "hs15_071",
   "page_count": 6,
   "order": 9,
   "p1": "71",
   "pn": "76",
   "abstract": [
    "The kymograph, one of the main devices used in early experimental phonetics, was quickly exploited to describe the sounds of languages in sub-Saharan Africa. By 1926, Doke used this device in its phonetics Zulu, to objectify the description of the main sounds of this language: vowels with epiglottal friction; the difference between aspirated and non-aspirated explosive consonants and consonants he describes as ejectives explosives; the three types alveolar laterals (voiced, voiceless and voiceless lateral); the duration of vowels and the different levels of tones. Doke shows that these are the plots of kymograph which to observe a similarity between the consonant bilabial implosive [ɓ] and clicks. The kymograph plots, presented in Figure 1 show indeed clearly a negative airflow at the release of the implosive and of the dental click contrasting with the positive flow observed after a bilabial explosive consonant.\n",
    ""
   ]
  },
  "gosy15_hscr": {
   "authors": [
    [
     "Mária",
     "Gósy"
    ]
   ],
   "title": "A 75-year-old Hungarian spontaneous speech database",
   "original": "hs15_077",
   "page_count": 10,
   "order": 10,
   "p1": "77",
   "pn": "86",
   "abstract": [
    "The first attempt to develop a large collection of recorded speech material in Hungarian was made by the phonetician Lajos Hegedûs in the 1940s. He wanted to preserve the sounding of the various Hungarian dialects in the country and even outside Hungary with the purpose of analyzing, among other things, the intonation, pauses and rhythm of speech in those dialects. This paper introduces the properties of the Hegedûs Archives on the one hand, and discusses the results of investigations that aimed to compare the speaking strategies of people that could be the great-grandparents of the speakers living now, on the other hand.\n",
    ""
   ]
  },
  "studerjoho15_hscr": {
   "authors": [
    [
     "Dieter",
     "Studer-Joho"
    ]
   ],
   "title": "The early Swiss dialect recording collection “LA” (1924–1927): a description and a work plan for its comprehensive edition",
   "original": "hs15_087",
   "page_count": 8,
   "order": 11,
   "p1": "87",
   "pn": "94",
   "abstract": [
    "Between 1924 and 1927 – and again in 1929 – the Phonogram Archives of the University of Zurich collaborated with Prof. Dr. Wilhelm Doegen of the Lautabteilung der Preussischen Staatsbibliothek zu Berlin in a dialectological recording campaign. Each year, Doegen was invited to travel to Switzerland from Berlin for a few days with his heavy recording equipment to collect a few dozen dialect specimens recorded with speakers from all over Switzerland. Before each recording session suitable speakers were carefully selected – mainly based on dialectological criteria – and were asked to prepare a short text for recitation (usually in their vernacular), which they then delivered into Doegen’s phonograph. All in all, some 225 shellac records could be produced in this fashion, before Doegen fell in disfavour in Berlin and could no longer continue his collaboration with Zurich. While the recordings from the later so-called “LM” campaign in 1929, which were collected in the southern Swiss town of Bellinzona and the northern Italian town of Domodossola, have either already been published or are in the process of being published, the ca. 175 recordings from the 1924–1927 “LA” campaign, collected in Zurich, Bern, Chur, Sion and Brig, respectively, have been published only partially. This paper discusses the possibilities in making this precious Swiss dialectological treasure trove available both to the interested public and to dialectological research.\n",
    ""
   ]
  },
  "sturm15_hscr": {
   "authors": [
    [
     "Pavel",
     "Šturm"
    ]
   ],
   "title": "The Prague historical collection of tuning forks: a surviving replica of the Koenig tonometre",
   "original": "hs15_095",
   "page_count": 11,
   "order": 12,
   "p1": "95",
   "pn": "105",
   "abstract": [
    "Despite the copious advances in acoustic techniques and devices for measuring and displaying acoustic parameters, a steady component of a phonetician’s scientific method remains to be – to this very day – our hearing. This paper therefore focuses on a historical device shared between acoustics and auditory phonetic analysis: Rudolph Koenig’s Grand Tonometre, consisting of more than a hundred tuning forks, which occupies an exceptional position among the vast array of instruments manufactured by Koenig. One copy of the original apparatus survived the Second World War untouched, and is now stationed at the Institute of Phonetics in Prague. The paper describes in detail the Prague collection of tuning forks, with photographs illustrating the device, and provides a commentary on the use of tuning forks in phonetic research of that time. In addition, the intricate history of the Prague tonometre is discussed, pertaining to the efforts of Josef Chlumský, the founder of the Czech phonetics institute, to obtain the device from the French colleagues.\n",
    ""
   ]
  },
  "braun15_hscr": {
   "authors": [
    [
     "Angelika",
     "Braun"
    ]
   ],
   "title": "William Holder – a pioneer of phonetics",
   "original": "hs15_106",
   "page_count": 12,
   "order": 13,
   "p1": "106",
   "pn": "117",
   "abstract": [
    "This paper looks at William Holder's \"Elements of Speech\" [1] from the perspective of modern phonetic and phonological literature. The structure of this presentation, first touching on general linguistic concepts, follows the three principal stages of speech production: respiration/air stream mechanism, phonation, and articulation. Holder's rendition of speech perception is discussed in conjunction with the clinical application of teaching a deaf-mute to speak. Furthermore, the passage on what is today called prosody will be reviewed. The mere fact that this topic is addressed in Holder's work is remarkable since suprasegmentals were not normally an issue at all in 17th century publications on speech. The extent and precision of the description in the \"Elements of Speech\" is truly remarkable. A comparison with the writings of Wolfgang von Kempelen, who is often referred to as the pioneer of modern day phonetic theory, shows that Holder knew much more about speech and hearing than Kempelen even though his writings have received much less attention.\n",
    "",
    "",
    "Holder, William (1669): Elements of Speech. An Essay of Inquiry into the Natural Production of Letters: with An Appendix Concerning Persons Deaf & Dumb. London.\n",
    ""
   ]
  },
  "ashby15_hscr": {
   "authors": [
    [
     "Michael",
     "Ashby"
    ]
   ],
   "title": "Experimental phonetics at University College London before World War I",
   "original": "hs15_118",
   "page_count": 10,
   "order": 14,
   "p1": "118",
   "pn": "127",
   "abstract": [
    "This paper argues that significant research and teaching in experimental phonetics at UCL preceded the establishment of the laboratory in 1912 by almost a decade. The forgotten work of E. R. Edwards [1] combined descriptive and experimental approaches in a pioneering study of Japanese. Recently recovered artefacts, and a close reading of the early publications of Daniel Jones (DJ), reveal a surprising range of equipment and techniques available before the laboratory was founded. In 1909, DJ’s Intonation curves made use of what was arguably the first spoken corpus. It has been possible to locate and digitise the majority of the gramophone records of the corpus, and acoustic analysis confirms that DJ's fo representations are of astonishing accuracy. The view that the earliest phase of experimental phonetics teaching at UCL must have been derivative can be rebutted. On the contrary, it was research-driven, and almost certainly enlivened by demonstrations with relevant apparatus and informed by up-to-date scholarship.\n",
    "",
    "",
    "E. R. Edwards, Étude phonétique de la langue japonaise, Impr. B.G. Teubner, Leipzig, 1903.\n",
    ""
   ]
  },
  "tillmann15_hscr": {
   "authors": [
    [
     "Hans G.",
     "Tillmann"
    ],
    [
     "Jessica",
     "Siddins"
    ]
   ],
   "title": "The \"bonn connection\" and its consequences: Paul Menzerath and Werner Meyer-Eppler's reunification of phonetics and phonology and the emergence of a new phonetic speech science based on Shannon’s mathematical theory of communication",
   "original": "hs15_128",
   "page_count": 12,
   "order": 15,
   "p1": "128",
   "pn": "139",
   "abstract": [
    "1950, only two years after it was founded, the MIT’s Electronic Research Laboratory (ERL) organised the first „Speech Communication Conference“. Surprisingly, among the fourteen very prominent participants there were merely two representatives from the field of phonetic speech research: Paul Menzerath and Werner Meyer-Eppler from Germany; and it was on this very trip to the USA that they first met Claude Shannon of Bell Labs. Upon their return to the University of Bonn they founded the Institut für Phonetik und Kommunikationsforschung1 which completely changed the direction of phonetics into speech communication research by forming a unique collaboration originally based on Shannon’s Mathematical Theory of Communication. We begin with a discussion of how it took another eighty years following the great early successes in speech physiology and subsequent school of early instrumental phonetics from 1850 onwards for the classic phonetic theory of vowels and consonants to finally come crashing down. We then outline how this crisis was overcome by the paradigm shift at the institute in Bonn and describe the consequences for the subsequent development of phonetic theory and its applications. Finally, we demonstrate that – looking back – the eventual collapse of early instrumental phonetics was virtually pre-programmed and could be expected because of the initially successful but in hindsight far to optimistic “simplifying assumptions” made by speech physiologists such as Brücke (1849/1856) and Bell (1865). 1 It should be noted that to L1-speakers of German the term Kommunikation at that time was a strange foreign word and totally incomprehensible; it took a few years before e.g. the verb kommunizieren (‘to communicate’) became a familiar German loan-word.\n",
    ""
   ]
  },
  "aulanko15_hscr": {
   "authors": [
    [
     "Reijo",
     "Aulanko"
    ]
   ],
   "title": "Hugo pipping – a pioneer phonetician at the University of Helsinki",
   "original": "hs15_140",
   "page_count": 8,
   "order": 16,
   "p1": "140",
   "pn": "147",
   "abstract": [
    "Hugo Pipping was the first person to officially function as a phonetics teacher at the University of Helsinki. His most important contribution to Finnish phonetics was the introduction of scientific physiological research methods into the study of speech. Especially, he used the Phonautograph/Sprachzeichner developed by Victor Hensen in Kiel to manually analyse the spectral structure of vowel sounds, mostly the vowels of his native Finland-Swedish language but also those of Finnish. Pipping held the position of \"docent\" of phonetics in Helsinki until 1903, when he was invited to the university of Gothenburg to the position of docent of Nordic languages and phonetics. After four years in Sweden, he returned to Helsinki in 1907, but this time as a professor of Swedish language and literature (later professor of Nordic philology). Pipping retired in 1929, but remained academically active until his death in 1944.\n",
    ""
   ]
  },
  "vilain15_hscr": {
   "authors": [
    [
     "Coriandre",
     "Vilain"
    ],
    [
     "Frédéric",
     "Berthommier"
    ],
    [
     "Louis-Jean",
     "Boë"
    ]
   ],
   "title": "A brief history of articulatory-acoustic vowel representation",
   "original": "hs15_148",
   "page_count": 12,
   "order": 17,
   "p1": "148",
   "pn": "159",
   "abstract": [
    "This paper aims at following the concept of vowel space across history. It shows that even with very poor experimental means, researchers from the 17th century started to organize the vowel systems along perceptual dimensions, either articulatory, by means of proprioceptive introspection, or auditory. With the development of experimental devices, and the increasing knowledge in acoustic and articulatory theories in the 19th century, it is shown how the relationship between the two dimensions tended to tighten. At the mid 20th century, the link between articulatory parameters such as jaw opening, position of the constriction of the tongue, or lip rounding, and the acoustical values of formants was clear. At this period, with the increasing amount of phonological descriptions of the languages of the world, and the power of the computer database analysis allowing extracting universal tendencies, the question of how the vowel systems are organized arose. The paper discusses this important question, focusing on two points: (1) how the auditory constraints shape the positioning of a specific set of vowel within the acoustic space, and (2) how the articulatory constraints shape the maximal extension of the vowel systems, the so-called maximal vowel space (MVS).\n",
    ""
   ]
  },
  "trouvain15_hscr": {
   "authors": [
    [
     "Jürgen",
     "Trouvain"
    ]
   ],
   "title": "Notes on the development of speaking styles over decades – the case of live football commentaries",
   "original": "hs15_160",
   "page_count": 7,
   "order": 18,
   "p1": "160",
   "pn": "166",
   "abstract": [
    "The aim of this paper to retrace the development of speaking styles within the genre 'live football commentary' by exploring several examples of broadcasts for a German audience in a time span of 80 years. It was shown that the affective information is consistently reflected by a pitch rise between one and two octaves during the phases of building up suspense before a goal and with the goal comment often at pitches beyond 400 Hz. Further genre-specific prosodic characteristics include pausing and articulation rate, which can be very different between television and radio broadcasters.\n",
    ""
   ]
  }
 },
 "sessions": [
  {
   "title": "Opening Session",
   "papers": [
    "ohala15_hscr",
    "schmitz15_hscr",
    "hoffmann15_hscr"
   ]
  },
  {
   "title": "Mechanical Speech Synthesis",
   "papers": [
    "pettorino15_hscr",
    "brackhane15_hscr",
    "berdux15_hscr",
    "korpiun15_hscr",
    "hoffmann15b_hscr"
   ]
  },
  {
   "title": "Collections",
   "papers": [
    "demolin15_hscr",
    "gosy15_hscr",
    "studerjoho15_hscr",
    "sturm15_hscr"
   ]
  },
  {
   "title": "Pioneering Work in Phonetics",
   "papers": [
    "braun15_hscr",
    "ashby15_hscr",
    "tillmann15_hscr",
    "aulanko15_hscr",
    "vilain15_hscr",
    "trouvain15_hscr"
   ]
  }
 ]
}