{
 "series": "HSCR",
 "title": "Fifth International Workshop on the History of Speech Communication Research (HSCR 2022)",
 "location": "Porto, Portugal",
 "startDate": "28/5/2022",
 "endDate": "29/5/2022",
 "URL": "https://lacerda120.wordpress.com/",
 "chair": "Chairs: Quintino Lopes, Angelika Braun, Michael Ashby",
 "intro": "preface.pdf",
 "ISSN": "0940-6832",
 "conf": "HSCR",
 "year": "2022",
 "name": "hscr_2022",
 "SIG": "HSCS",
 "title1": "Fifth International Workshop on the History of Speech Communication Research",
 "title2": "(HSCR 2022)",
 "booklet": "hscr_2022.pdf",
 "date": "28-29 May 2022",
 "papers": {
  "almeida22_hscr": {
   "authors": [
    [
     "António",
     "Almeida"
    ]
   ],
   "title": "Armando de Lacerda: Man of science",
   "original": "almeida",
   "page_count": 7,
   "order": 1,
   "p1": "9",
   "pn": "15",
   "abstract": [
    "This contribution to \"Lacerda 120\" is a personal account of a student of Lacerda's who had the privilege to work with him in the years 1966–68. During that time he helped Lacerda to collect data for his vast and last research on Portuguese intonation using tools like the chromograph and the tonogramme desk that Lacerda himself had designed and developed. The auspicious beginnings of Lacerda's scientific career are mentioned and some aspects of his last research work on Portuguese intonation are highlighted."
   ],
   "doi": "10.21437/HSCR.2022-1"
  },
  "braun22_hscr": {
   "authors": [
    [
     "Angelika",
     "Braun"
    ],
    [
     "Bernd",
     "Möbius"
    ]
   ],
   "title": "Armando de Lacerda and his contemporaries: Paul Menzerath",
   "original": "braun",
   "page_count": 12,
   "order": 2,
   "p1": "17",
   "pn": "28",
   "abstract": [
    "Armando de Lacerda was one of the most gifted and most famous experimental phoneticians of his time. His 'Laboratório de Fonética Experimental da Faculdade de Letras de Coimbra' attracted many scholars from all over the world who used the resources at the lab for their own studies. Lacerda also travelled extensively, sharing his expertise with experimental phoneticians all over Europe. This contribution\nfocuses on Lacerda’s ties to Germany and to the phonetics institute at the University of Bonn specifically. A name figuring prominently in this context is that of Paul Menzerath, then head of the Bonn phonetics lab. Not only did the two co-author one of the most famous and widely cited monographs in phonetics – they collaborated extensively for a number of years. Not much is known about Menzerath as a person or about the exact nature of their working relationship, but it seems as if Menzerath was much\nmore of a beneficiary of their collaboration than was acknowledged at the time. Following some biographical remarks on Menzerath, the nature of their collaborative work is explored. Menzerath’s achievements are then discussed from the perspective of modern phonetics. There are indications that Lacerda may not have always received the recognition which he deserved for his ingenuity."
   ],
   "doi": "10.21437/HSCR.2022-2"
  },
  "trouvain22_hscr": {
   "authors": [
    [
     "Jürgen",
     "Trouvain"
    ]
   ],
   "title": "On the early history of the International Congress of Phonetic Sciences: from 1932 to 1938",
   "original": "trouvain",
   "page_count": 10,
   "order": 3,
   "p1": "29",
   "pn": "38",
   "abstract": [
    "The proceedings of the International Congress of Phonetic Sciences (ICPhS) reflect the research in phonetics since 1932. Some important metadata like language of the authors for writing the papers, number of papers, geographical distribution of authors as well as paper format and structure shows substantial differences between the early period in the 1930s and the recent ICPhS meetings. As an example, for a historical research object, the introduction of 'coarticulation' as a core term in\nphonetics was analyzed with a focus on the early phase of ICPhS. This type of research was enabled by a digitization project of ICPhS proceedings at Saarland University."
   ],
   "doi": "10.21437/HSCR.2022-3"
  },
  "ashby22_hscr": {
   "authors": [
    [
     "Michael",
     "Ashby"
    ]
   ],
   "title": "Phonetics laboratory technology, 1930–1960",
   "original": "ashby",
   "page_count": 11,
   "order": 4,
   "p1": "39",
   "pn": "49",
   "abstract": [
    "By 1930 it was already plain that electronic technology offered the best hope for future work on the acoustic speech signal. Thermionic valve development, and corresponding advances in circuit design, were opening up new possibilities, and high-quality sound recording was possible on disc or film. The new did not immediately displace the old, and laboratories often made use of incongruous blends of anachronistic technology. The kymograph, with all its failings, continued in use for speech research after the Second World War, sometimes out of necessity, but sometimes also from choice, and it even found defenders against the new technology into the 1950s. Lacerda’s chromograph needs to be studied in the general context of the development of recording oscillographs. The Lacerda chromograph certainly had advantages, but at the same time lacked the engineering refinements that might have turned it into a widely marketable device."
   ],
   "doi": "10.21437/HSCR.2022-4"
  },
  "gosy22_hscr": {
   "authors": [
    [
     "Mária",
     "Gósy"
    ]
   ],
   "title": "Experimental phonetics in Hungary in the first half of the twentieth century ",
   "original": "gosy",
   "page_count": 11,
   "order": 5,
   "p1": "51",
   "pn": "61",
   "abstract": [
    "The history of Hungarian experimental phonetics shows that our predecessors followed contemporary trends in the field, and quickly adopted the idea of using various devices in studying speech. Their results contributed to laying the foundations of modern phonetics. The first fifty years of the last century saw important advances in speech research both in respect of the study of articulation (e.g., palatography, X-ray studies, kymography, measurements of air flow and lip movements) and speech acoustics (using oscillograms and spectrography). Progress was also made in applied speech research and speech technology. The paper summarizes the most important achievements of Hungarian experimental phonetics in that era showing the wide range of interest of scholars in the field who worked both abroad and in Hungary."
   ],
   "doi": "10.21437/HSCR.2022-5"
  },
  "hoffmann22_hscr": {
   "authors": [
    [
     "Rüdiger",
     "Hoffmann"
    ]
   ],
   "title": "Photography and cinematography at the Hamburg Phonetics Laboratory. Part 1: photography and cinematography of the larynx",
   "original": "hoffmann",
   "page_count": 12,
   "order": 6,
   "p1": "63",
   "pn": "74",
   "abstract": [
    "After the Hamburg Colonial Institute was founded in 1908, the Africanist CARL MEINHOF demanded a phonetics laboratory, which was installed in 1910 and directed by GIULIO PANCONCELLI-CALZIA, who developed this laboratory into an excellent place for research and teaching in experimental phonetics,\napplying the most advanced methods available, among them photography and cinematography. It was renamed Institute of Phonetics in 1962. When it was closed down in 2006/07, its display collection and other historic material were transferred to the historic acoustic-phonetic collection (HAPS) of the TU Dresden. A description of the material objects has in the meantime been published in a printed catalogue\n([25], [27]). What is not widely known, however, is that the collection also includes numerous archival materials, among them many photographic documents. It is the aim of this paper to give an overview of these stocks and their genesis, starting with the history of vocal cord imagery."
   ],
   "doi": "10.21437/HSCR.2022-6"
  },
  "sturm22_hscr": {
   "authors": [
    [
     "Pavel",
     "Šturm"
    ]
   ],
   "title": "The Laboratory of Experimental Phonetics in Prague between 1919 and 1939: research practices and student instruction",
   "original": "sturm",
   "page_count": 11,
   "order": 7,
   "p1": "75",
   "pn": "85",
   "abstract": [
    "The paper examines Prague’s Laboratory of Experimental Phonetics in the 'interwar' period. The research is based on primary resources, most importantly a series of reports of the institute’s founder, Josef Chlumský, who documented the activities occurring in the seminar of experimental phonetics that took place each semester at the university, and a cash book logging every new item that came into the possession of the laboratory. The attending students experimented with speech and the various ways it could be examined instrumentally. It is shown that the laboratory was utilized not only for scientific research but also for demonstration and educational purposes. Several important publications emerged under the auspices of the laboratory that employed experimentation and instrumental measurement. It is argued that this period at the Institute of Phonetics can aptly be depicted as a place and time of abundant and fruitful phonetic research with a strong experimentation ethos that was transferred to the students as well."
   ],
   "doi": "10.21437/HSCR.2022-7"
  },
  "vaxelaire22_hscr": {
   "authors": [
    [
     "Béatrice",
     "Vaxelaire"
    ],
    [
     "Péla",
     "Simon"
    ],
    [
     "Gilbert",
     "Brock"
    ],
    [
     "Jean-Pierre",
     "Zerling"
    ],
    [
     "Fabrice",
     "Hirsch"
    ],
    [
     "Fabrice",
     "Marsac"
    ],
    [
     "Delphine",
     "Charuau"
    ],
    [
     "Rudolph",
     "Sock"
    ]
   ],
   "title": "Studies on speech production at the Phonetics Institute of Strasbourg: a historical perspective on the evolution of basic knowledge",
   "original": "vaxelaire",
   "page_count": 10,
   "order": 8,
   "p1": "87",
   "pn": "96",
   "abstract": [
    "Research works in the field of speech production studies have been carried out at the Phonetics Institute of Strasbourg (IPS) using cineradiography since the 1960s. This contribution will take as a starting point the article entitled \"Histoire du radiocinéma à l'Institut de Phonétique de Strasbourg\" [14] in order to summarise the main milestones in the evolution of this X-ray method at the institute. While [14] privileged the historical perspective of cineradiography, we shall focus here on the history\nof the contributions of these studies to the advancement of fundamental knowledge in the field of speech production, from the 1960s to 2000."
   ],
   "doi": "10.21437/HSCR.2022-8"
  },
  "lopes22_hscr": {
   "authors": [
    [
     "Qunintino",
     "Lopes"
    ]
   ],
   "title": "The Junta de Educação Nacional, Armando de Lacerda and the emergence of experimental phonetics in Portugal",
   "original": "lopes1",
   "page_count": 13,
   "order": 9,
   "p1": "97",
   "pn": "109",
   "abstract": [
    "The work of the Junta de Educação Nacional from its creation in 1929 and the continuation of its work from 1936 by the body which replaced it, the Instituto para a Alta Cultura, meant that during the interwar period Portugal benefited from the existence of an institution for the planning and funding of science, similar to circumstances in other countries in Europe and North America. A number of Portuguese scientists were able to take advantage of scholarships granted by these bodies to study experimental phonetics at some of the most advanced research centres in Europe during the era, among them Armando de Lacerda, who in 1936, with the support of the Instituto para a Alta Cultura, set up the first experimental phonetics laboratory in Portugal, at the University of Coimbra – the Coimbra Phonetics\nLaboratory. The laboratory’s journal, the 'Revista do Laboratório de Fonética Experimental da Faculdade de Letras da Universidade de Coimbra', was published from 1952, and as its editor, Lacerda used it as a vehicle for disseminating the findings of the research carried out at the laboratory. The eight volumes of the 'Revista' which were published contain works by several prominent 20th-century phoneticians, such as Peter Ladefoged, Göran Hammarström and Peter Strevens. Their articles appeared in the journal at an early stage in their careers, indicating that they sought the recognition that the journal, the mouthpiece of the laboratory and its head, both of worldwide renown in the field of phonetics, conferred on them."
   ],
   "doi": "10.21437/HSCR.2022-9"
  },
  "mota22_hscr": {
   "authors": [
    [
     "Jacyra Andrade",
     "Mota"
    ],
    [
     "Josane Moreira de",
     "Oliveira"
    ]
   ],
   "title": "Armando de Lacerda and the first phonetics laboratory in Brazil",
   "original": "mota",
   "page_count": 7,
   "order": 10,
   "p1": "111",
   "pn": "117",
   "abstract": [
    "The text aims to remember Armando de Lacerda’s pursuit in implementing experimental phonetic techniques in various universities, with special emphasis on the establishment, in Brazil, of the 1st Experimental Phonetics Laboratory of South America, in 1956, at the then School of Philosophy of 'Universidade da Bahia', in the city of Salvador. The setting up of this Laboratory was due to the interest of Rector\nEdgard Santos and to the meeting of the Portuguese phonetician Armando de Lacerda with Professor Nelson Rossi, invited to give classes at 'Universidade da Bahia'. Among Armando de Lacerda’s main activities, registered during the six months in which he remained in Bahia, were the presentation of the chromographic method and the introduction to notions of phonetic transcription, with the use of the Lacerda-Hammarström system, as well as dialectal researches in the cities of Juazeiro (Bahia) and Petrolina (Pernambuco). It is important to highlight the legacies from the Phonetics Laboratory, such as the establishment of a Sound Archive and the formation of researchers, which gave rise to Dialectology in Brazil, with the preparation of the first linguistic atlas, 'Atlas prévio dos falares baianos', in 1963. The Phonetics Laboratory, mainly after 1968, began suffering from lack of personnel and funding. In 1986, the installations were prematurely abandoned, after an accident in the physical structure of the building where it was located and which was later destroyed by fire."
   ],
   "doi": "10.21437/HSCR.2022-10"
  },
  "lopes22b_hscr": {
   "authors": [
    [
     "Quintino",
     "Lopes"
    ],
    [
     "Paulo",
     "Lacerda"
    ],
    [
     "Elisabete",
     "Pereira"
    ]
   ],
   "title": "The Lacerda 120 Exhibition",
   "original": "lopes2",
   "page_count": 18,
   "order": 11,
   "p1": "119",
   "pn": "136",
   "abstract": [
    "This year being the 120th anniversary of the birth of Armando de Lacerda (1902–1984), we seek to place the renowned Portuguese phonetician in a broader context, among his peers, assistants and other (newly discovered) actors. From the outset, this was one of the main features of the exhibition. Lacerda is\nportrayed in a number of group photographs taken at the 1st and 3rd International Congresses of Phonetic Sciences held in Amsterdam in 1932 and Ghent in 1938, respectively, which he attended. The exhibition as a whole includes photographs of Giulio Panconcelli-Calzia (1878–1966), Paul Menzerath (1883–1954) and Martin Joos (1907–1978), Lacerda’s mentors, as well as images of some of his disciples and collaborators, such as António Almeida (*1946), Göran Hammarström (1922–2019), María Josefa\nCanellada (1912–1995), Francis Millet Rogers (1914–1989), Sue Nogueira (*1930) and Peter Strevens (1922–1989)."
   ],
   "doi": "10.21437/HSCR.2022-11"
  }
 },
 "sessions": [
  {
   "title": "Keynote",
   "papers": [
    "almeida22_hscr"
   ]
  },
  {
   "title": "Regular papers",
   "papers": [
    "braun22_hscr",
    "trouvain22_hscr",
    "ashby22_hscr",
    "gosy22_hscr",
    "hoffmann22_hscr",
    "sturm22_hscr",
    "vaxelaire22_hscr",
    "lopes22_hscr",
    "mota22_hscr"
   ]
  },
  {
   "title": "Lacerda Archive presentation and Exhibition",
   "papers": [
    "lopes22b_hscr"
   ]
  }
 ],
 "doi": "10.21437/HSCR.2022"
}