{
 "series": "HSCR",
 "title": "Third International Workshop on the History of Speech Communication Research (HSCR 2019)",
 "location": "Vienna, Austria",
 "startDate": "13/09/2019",
 "endDate": "14/09/2019",
 "URL": "https://speech.kfs.oeaw.ac.at/hscr19/",
 "chair": "Chairs: Michael Pucher, Jürgen Trouvain and Carina Lozo",
 "intro": "preface.pdf",
 "ISSN": "0940-6832",
 "conf": "HSCR",
 "year": "2019",
 "name": "hscr_2019",
 "SIG": "HSCS",
 "title1": "Third International Workshop on the History of Speech Communication Research",
 "title2": "(HSCR 2019)",
 "date": "13-14 September 2019",
 "booklet": "hscr_2019.pdf",
 "papers": {
  "hoffmann19_hscr": {
   "authors": [
    [
     "Rüdiger",
     "Hoffmann"
    ]
   ],
   "title": " ''Nothing but a lung, a glottis, and a mouth'' - The long way of speech synthesis",
   "original": "1_hoffmann",
   "page_count": 20,
   "order": 3,
   "p1": "9",
   "pn": "28",
   "abstract": [
    "Speech recognition and speech synthesis have been fascinating research disciplines since a long time, but potential applications suffered from low acceptance mainly due to poor quality. This situation has rapidly changed with the introduction of “virtual assistants” and similar speech-controlled products, and speech technology has arrived at the daily life in the recent decade. This is an opportune moment to look back into the long history of speech synthesis as an engineering discipline, which starts with early heuristic attempts, continues with the elaboration of a scientiﬁc foundation, and culminates with the availability of electronics and computing. It is the aim of this paper, not only to trace this path by selected examples, but also to identify the driving forces which were acting in the different periods of this development. The oral presentation will be illustrated by material from the Historic Acoustic-phonetic Collection (HAPS) of the TU Dresden."
   ],
   "doi": "10.21437/HSCR.2019-3"
  },
  "donhauser19_hscr": {
   "authors": [
    [
     "Peter",
     "Donhauser"
    ]
   ],
   "title": "From speech- and sound research to applications and products",
   "original": "2_donhauser",
   "page_count": 2,
   "order": 13,
   "p1": "29",
   "pn": "29",
   "abstract": [
    "Speech research goes back far to the 18th century (f.i. speech machines by Christian Gottlieb Kratzenstein or the publication by Wolfgang von Kempelen). Many of the research results led to commercial applications. Examples are the Phonautograph by Scott de Martinville (led to the Phonograph) or Ludimar Hermann’s research on vowels (led to ﬁlters of electronic instruments and to speech synthesizers). Research ﬁndings by Helmholtz led to sound synthesis, to the vocoder and numerous recent sound software. Even cochlea implants use the technique of band ﬁlters used in vocoders. 2007 the “Autoklavierspieler” was shown at the Vienna festival “Wien modern”, performing a speech application using a grand piano. There is a signiﬁcant knowledge transfer between sound research, technology, commercial applications and art practices as well."
   ]
  },
  "huber19_hscr": {
   "authors": [
    [
     "Christian",
     "Huber"
    ],
    [
     "Benjamin",
     "Fischer"
    ],
    [
     "Bernhard",
     "Graf"
    ]
   ],
   "title": "Corpus of Austrian dialect recordings from the 20th century - A cooperation project",
   "original": "3_huber",
   "page_count": 10,
   "order": 1,
   "p1": "31",
   "pn": "40",
   "abstract": [
    "The 'Corpus of Austrian Dialect Recordings from the 20th Century' comprises approx. 2450 dialect recordings from the Phonogrammarchiv’s holdings on magnetic tape from 1951 to 1995 from fieldwork by German philologists Eberhard Kranzmayer, Maria Hornung, Werner Bauer, Herbert Tatzreiter and others covering all provinces of Austria as well as linguistic varieties of German spoken in Northern Italy, Hungary, and former Yugoslavia and Czechoslovakia. In a cooperation project of the Phonogrammarchiv, the Research Department “Variation and Change of German in Austria” (both Austrian Academy of Sciences) and the Austrian Science Fund Special Research Programme “German in Austria” (F60) these recordings are now digitized, annotated and analyzed in order to ensure their lasting preservation and utilizability. By digitizing the audio recordings and by enriching and systemizing the metadata in a searchable electronic documentation it will become possible to use these recordings in a wider scientific context. The searchable corpus will further be developed into an online platform and become accessible also to the general public. In this article we will introduce and discuss the corpus, and address various digitization and metadata-related issues from an archival perspective with special attention on encountered real-world questions and problems. "
   ],
   "doi": "10.21437/HSCR.2019-1"
  },
  "draxler19_hscr": {
   "authors": [
    [
     "Christoph",
     "Draxler"
    ],
    [
     "Jürgen",
     "Trouvain"
    ]
   ],
   "title": "On principles of phonetic archiving: From paleo-phonetics to modern speech data managment",
   "original": "4_draxler",
   "page_count": 8,
   "order": 2,
   "p1": "41",
   "pn": "47",
   "abstract": [
    "Repositories and archives play a dual role in phonetics and speech research. Looking forward, they provide current and future accessibility to resources being compiled now. Looking backward, they now provide access to resources compiled in the past. We argue that by adhering to a few general principles early in the process, speech resources can be compiled with little extra effort in such a way that they can easily be deposited in repositories for future accessibility. We further argue that because of the particular nature of phonetics and speech research data, archives and archival units specifically dedicated to this type of data are needed for the long-term preservation of and accessibility to these resources. In this paper we outline these general principles and describe the actors and their responsibilities. Although in theory these principles should be clear, in practice it is a) necessary to remind researchers and focus their attention to the issues of long-term preservation of phonetic research data, and b) for this task we advocate for dedicated institutions linked to the research labs. "
   ],
   "doi": "10.21437/HSCR.2019-2"
  },
  "lozo19_hscr": {
   "authors": [
    [
     "Carina",
     "Lozo"
    ],
    [
     "Jan",
     "Luttenberger"
    ],
    [
     "Michael",
     "Pucher"
    ]
   ],
   "title": "The thought collective behind thirty years of progress in speech systems",
   "original": "5_lozo",
   "page_count": 10,
   "order": 4,
   "p1": "49",
   "pn": "58",
   "abstract": [
    "Speech synthesis as a complex research area draws on several disciplines to further its overall goal, the recreation of human speech. The discourse of the ﬁeld changed over time, as new ideas and possibilities were integrated into synthesis systems and models, reﬂecting the theoretical and technical developments and changes. In this contribution we illustrate and reﬂect this process by means of discourse analysis on the semantic and lexical level. With epistemic concepts adapted from Ludwik Fleck [1] we can identify knowledge as a form of social practice which produces a thought style within the Speech Synthesis Workshop’s (SSW) thought collective. Thought styles surface on the discourse fragments produced by the thought collective manifested in their communication of thoughts. To grasp the thought style of the SSW collective we take a look at the abstracts (N =500) of SSW proceedings from 1990 to 2016. Since the text type abstract forms a relevant part of the participation in the SSW, they have to exhibit accepted expressions of the collective’s thought style in order to gain access to the communication of thoughts. Starting from key models in the ﬁeld, we look at their attribution, frequency of usage and their use as categories for describing speciﬁc systems. We identify these key models as Neural Networks, Hidden Markov Models and Unit Selection speech synthesis. We expect a shift in emphasis of the key terms by the collective over time, as new models and concepts are introduced and adapted to the thought style, thus reshaping it."
   ],
   "doi": "10.21437/HSCR.2019-4"
  },
  "berdux19_hscr": {
   "authors": [
    [
     "Silke",
     "Berdux"
    ],
    [
     "Alexander",
     "Steinbeißer"
    ]
   ],
   "title": "Speaking apparatus now speaking: A project at the Deutsches Museum in Munich",
   "original": "6_berdux",
   "page_count": 10,
   "order": 5,
   "p1": "59",
   "pn": "67",
   "abstract": [
    "This article provides a brief overview of a multi-part project at the Deutsches Museum devoted to the well-known speaking apparatus preserved in its collections. This on-going project comprises a detailed examination and documentation of the apparatus, the construction of a replica and its exploration, as well as the study of the object’s biography, its attribution to Kempelen and its historical contextualisation. "
   ],
   "doi": "10.21437/HSCR.2019-5"
  },
  "brackhane19_hscr": {
   "authors": [
    [
     "Fabian",
     "Brackhane"
    ]
   ],
   "title": "A 'polyglottal' speech synthesis - Modifications for a replica of Kempelen's speaking machine",
   "original": "7_brackhane",
   "page_count": 10,
   "order": 6,
   "p1": "69",
   "pn": "78",
   "abstract": [
    "The speaking machine of WOLFGANG VON KEMPELEN (around 1770) is one of the most popular objects from the early days of phonetic sciences. But although there is a detailed design description by KEMPELEN himself, many details of his synthesis device are puzzling until today due to insufﬁcient description, unusual materials and processing. In particular, this applies for the reed pipe and its reed as the representation of the human glottis. Therefore various constructional variants and materials have been used for that place in replicas, leading to the question whether these differences have a notable impact on the sound characteristics of the speaking machine. In this study, the inﬂuence of different materials and processing of the reed on the sound characteristics of a self-made replica of KEMPELEN’s speaking machine is presented."
   ],
   "doi": "10.21437/HSCR.2019-6"
  },
  "arai19_hscr": {
   "authors": [
    [
     "Takayuki",
     "Arai"
    ]
   ],
   "title": "Sound sources used in speech production research with physical models of the human vocal tract",
   "original": "8_arai",
   "page_count": 6,
   "order": 7,
   "p1": "79",
   "pn": "84",
   "abstract": [
    "In the history of speech production research with physical models of the human vocal tract, various types of sound sources have been tested. In the present study, several sound sources are reviewed, and a set of the reed-type sound source is examined with various combinations of sizes. Ways of applying this reed-type sound source to physical models of the human vocal tract, such as the sliding three-tube model, are discussed. How to design a single device that switches between voiced and unvoiced sounds is also explored. "
   ],
   "doi": "10.21437/HSCR.2019-7"
  },
  "nataraj19_hscr": {
   "authors": [
    [
     "K. S.",
     "Nataraj"
    ],
    [
     "H.",
     "Dasgupta"
    ],
    [
     "P. C.",
     "Pandey"
    ]
   ],
   "title": "Early indirect techniques for estimating the vocal tract area function",
   "original": "9_nataraj",
   "page_count": 10,
   "order": 8,
   "p1": "85",
   "pn": "94",
   "abstract": [
    "Estimation of the vocal tract area function has been an interesting area of research for many decades due to its potential applications in speech coding, speech synthesis, speech recognition, and speech training. Earlier studies using acoustic tube models of the vocal tract showed that the speech spectrum could be estimated from the vocal tract area function. The inverse problem of obtaining the vocal tract area function from the speech spectrum was challenging due to the non-uniqueness of the solution as many area functions could produce the same spectrum. Some innovative and pioneering techniques were proposed to estimate the vocal tract area functions indirectly by using acoustic measurements. These techniques showed that reasonable vocal tract area functions could be obtained from the acoustic data alone and stimulated further research in this area. This paper provides a review of three early techniques for estimating the vocal tract area function: the technique using the acoustic impedance measurement at the lips, the technique using the impulse response measured at the lips, and the technique using linear prediction analysis of the speech signal, followed by a discussion of the applications and limitations of these techniques. "
   ],
   "doi": "10.21437/HSCR.2019-8"
  },
  "lopes19_hscr": {
   "authors": [
    [
     "Quintino",
     "Lopes"
    ],
    [
     "Elisabete",
     "Pereira"
    ]
   ],
   "title": "Armando de Lacerda and experimental phonetics in the inter-war period: Scientific innovation and circulation between Portugal, Germany and Havard",
   "original": "10_lopes",
   "page_count": 10,
   "order": 9,
   "p1": "95",
   "pn": "104",
   "abstract": [
    "In the history of the research on human speech, the work carried out by Armando de Lacerda, a 20th-century Portuguese phonetician, is of great importance. A specialist in Experimental Phonetics at the Phonetics Laboratory in Hamburg and the Institute of Phonetics in Bonn from 1930 to 1933, Lacerda established the first laboratory of Experimental Phonetics in Portugal, in Coimbra in 1936, whose \"splendid technical facilities\", along with the international prestige of its founder and director, attracted countless foreign scientists. In this paper, we highlight the discovery of some important scientific material used at the laboratory, recently unearthed in the reserve collection of the 'Museu da Ciência da Universidade de Coimbra', including documents and instruments, some of them created by Lacerda, whose inventorship deserves recognition."
   ],
   "doi": "10.21437/HSCR.2019-9"
  },
  "jackel19_hscr": {
   "authors": [
    [
     "Rainer",
     "Jäckel"
    ]
   ],
   "title": "Methodological aspects of early experimental phonetics",
   "original": "11_jaeckel",
   "page_count": 8,
   "order": 10,
   "p1": "105",
   "pn": "112",
   "abstract": [
    "The epistemological and methodological implicatures of experimental-phonetic research at the turn of the 19th and 20th centuries and in the following decades form a hitherto underdeveloped topic. The relevance of this focus stems from the innovative nature of experimental phonetics, which first had to assert its right to exist as an independent science in relation to adjacent fields, above all linguistics and psychology of language. Their claim to the field of speech science, which had been occupied for centuries by linguists, was explicitly defined by the early experimental phoneticians through their methods, of which a higher degree of objectivity and reproducibility of the results was expected. The experimental and data-based approaches formed the most important unique selling point of experimental phonetics compared to the treatment of the same subject in the work of linguists and speech psychologists. We want to show as well that the emergence of experimental phonetics is also due to a reorientation within linguistics in the last three decades of the 19th century. "
   ],
   "doi": "10.21437/HSCR.2019-10"
  },
  "ashby19_hscr": {
   "authors": [
    [
     "Micheal",
     "Ashby"
    ]
   ],
   "title": "The acoustic analysis of early speech recordings",
   "original": "12_ashby",
   "page_count": 10,
   "order": 11,
   "p1": "113",
   "pn": "122",
   "abstract": [
    "The shortcomings of early phonographic recording have never been systematically evaluated in relation to the specific acoustic properties of speech. This paper reports preliminary investigations into limitations on the quantitative analysis of recordings which were made prior to the introduction of electrical recording in 1925–1926. Analysis of such early recordings would be valuable in historical sociophonetics, for example, or in the replication of early speech science research which utilized recordings. To provide some foundation for quantitative study, we therefore attempt to determine the characteristics of acoustic recording systems from general considerations, from contemporary analysis and evidence, and from modern spectral analysis of historic recordings. It emerges that major deficiencies in the frequency response achieved with acoustic recording severely hamper spectral analysis (e.g., for vowel formant frequency estimation). Proposed future work will attempt direct measurements on surviving or replicated components of acoustic recording systems. "
   ],
   "doi": "10.21437/HSCR.2019-11"
  },
  "braun19_hscr": {
   "authors": [
    [
     "Angelika",
     "Braun"
    ]
   ],
   "title": "From visible speech to voiceprints - The missing link",
   "original": "13_braun",
   "page_count": 14,
   "order": 12,
   "p1": "123",
   "pn": "136",
   "abstract": [
    "This contribution is a sequel to this author’s presentation at HSCR 17 in Helsinki. At that point, a key report on voiceprint analysis from the time of WWII had not been accessible to the present author. Since then, access has been gained to this paper as well as other as yet unpublished sources. Both document different aspects of military use of the sound spectrograph and yet with somewhat unexpected results. Firstly, there is evidence that the sound spectrograph was not exclusively developed with voice comparison in mind. It was also alleged to serve as an important element in the decryption of German radio messages. Secondly, the early notion of “voiceprints” as outlined in the report in question is vastly different from Lawrence Kersta’s idea of their forensic use, which have so far been assumed to be based on the wartime work."
   ],
   "doi": "10.21437/HSCR.2019-12"
  }
 },
 "sessions": [
  {
   "title": "Regular papers 1",
   "papers": [
    "huber19_hscr",
    "draxler19_hscr"
   ]
  },
  {
   "title": "Keynote 1",
   "papers": [
    "hoffmann19_hscr"
   ]
  },
  {
   "title": "Regular papers 2",
   "papers": [
    "lozo19_hscr",
    "berdux19_hscr",
    "brackhane19_hscr"
   ]
  },
  {
   "title": "Regular papers 3",
   "papers": [
    "arai19_hscr",
    "nataraj19_hscr",
    "lopes19_hscr",
    "jackel19_hscr"
   ]
  },
  {
   "title": "Regular papers 4",
   "papers": [
    "ashby19_hscr",
    "braun19_hscr"
   ]
  },
  {
   "title": "Keynote 2",
   "papers": [
    "donhauser19_hscr"
   ]
  }
 ],
 "doi": "10.21437/HSCR.2019"
}