{
 "title": "InSTIL/ICALL 2004 Symposium on Computer Assisted Learning",
 "location": "Venice, Italy",
 "startDate": "17/6/2004",
 "endDate": "19/6/2004",
 "conf": "ICALL",
 "year": "2004",
 "name": "icall_2004",
 "series": "",
 "SIG": "",
 "title1": "InSTIL/ICALL 2004 Symposium on Computer Assisted Learning",
 "date": "17-19 June 2004",
 "papers": {
  "granstrom04_icall": {
   "authors": [
    [
     "Björn",
     "Granström"
    ]
   ],
   "title": "Towards a virtual language tutor",
   "original": "iic4_001",
   "page_count": 8,
   "order": 1,
   "p1": "paper 001",
   "pn": "",
   "abstract": [
    "In this paper we present some work aiming at creating a virtual language tutor. The ambition is to create a tutor that can be engaged in many aspects of language learning from detailed pronunciation training to conversational practise. Some of the crucial components of such a system are described. An initial implementation of a stress/quantity training tutor for Swedish will be presented.\n",
    ""
   ]
  },
  "gerosa04_icall": {
   "authors": [
    [
     "Matteo",
     "Gerosa"
    ],
    [
     "Diego",
     "Giuliani"
    ]
   ],
   "title": "Preliminary investigations in automatic recognition of English sentences uttered by Italian children",
   "original": "iic4_002",
   "page_count": 4,
   "order": 2,
   "p1": "paper 002",
   "pn": "",
   "abstract": [
    "This paper reports on a initial research activity in the area of non-native children's speech recognition that was carried out by exploiting two children databases, one consisting of speech collected from native English children, the other one consisting of English sentences read by Italian learners of English in the same age range of the native speakers. By exploiting the corpus of native speech a baseline speech recognizer was trained for British English. Recognition results achieved for native speakers were compared with those achieved for Italian children uttering the same English texts. Word error rates achieved for Italian children were 100%-600% higher than those achieved for English children of the same age. Adapting baseline acoustic models by using a small amount of non-native speech from a group of Italian learners of English, resulted in a great improvement in recognition performance on non-native speech.\n",
    ""
   ]
  },
  "neri04_icall": {
   "authors": [
    [
     "Ambra",
     "Neri"
    ],
    [
     "Catia",
     "Cucchiarini"
    ],
    [
     "Helmer",
     "Strik"
    ]
   ],
   "title": "Segmental errors in Dutch as a second language: how to establish priorities for CAPT",
   "original": "iic4_003",
   "page_count": 4,
   "order": 3,
   "p1": "paper 003",
   "pn": "",
   "abstract": [
    "In this paper we report on a study that was carried out to obtain an inventory of segmental errors in the Dutch of adult learners with different mother tongues (L1s). The errors observed were subsequently examined in detail to select a number of errors that should receive priority in Computer Assisted Pronunciation Training (CAPT) for Dutch as L2.\n",
    ""
   ]
  },
  "tillmann04_icall": {
   "authors": [
    [
     "Hans G.",
     "Tillmann"
    ],
    [
     "Hartmut R.",
     "Pfitzinger"
    ]
   ],
   "title": "The development of an advanced SLP-based system for the individual learning and fast training of speaking skills in a new foreign language [planning the graduate college research program \"Chinese for German engineers (and other L1-speakers of German)\"",
   "original": "iic4_004",
   "page_count": 4,
   "order": 4,
   "p1": "paper 004",
   "pn": "",
   "abstract": [
    "This paper describes the organization of a concerted action of German and Chinese phoneticians, IT speech technologists and specialists in the field of foreign language teaching in order to create a new research program which has been proposed by the first author as a so-called graduate college (entitled .Chinesisch fr deutsche Ingenieure und andere L1-Sprecher des Deutschen.) to the Federal Government of Germany.\n",
    "The paper has four parts: We first start by describing the prime goals and conditions of our application-oriented basic research plans for the development of a new SL/T-system (Speech Learning/ Training-system). Then we argue why - in phonetic speech research - the classic paradigm of \"analysis-by-synthesis\" should be replaced by a the programmatic approach which follows the new \"synthesis-by-analysis\"-principle. In the third part we look at certain types of teaching speech acts and teaching dialogs. In the last part we will be trying to consider the fact that such complex approaches of application-oriented basic speech research programs as in our case needs a concerted effort in the collaboration of all relevant disciplines within the field of SLP (including also NLP1), and here we end with the question of how the so-called dilemma of text-to-speech developers can be systematically avoided by practically involving the addressed users of the developed System (engineers and language students) from the very beginning.\n",
    ""
   ]
  },
  "johnson04_icall": {
   "authors": [
    [
     "W. Lewis",
     "Johnson"
    ],
    [
     "Stacy",
     "Marsella"
    ],
    [
     "Nicolaus",
     "Mote"
    ],
    [
     "Hannes",
     "Viljhálmsson"
    ],
    [
     "Shrikanth",
     "Narayanan"
    ],
    [
     "Sunhee",
     "Choi"
    ]
   ],
   "title": "Tactical language training system: supporting the rapid acquisition of foreign language and cultural skills",
   "original": "iic4_005",
   "page_count": 4,
   "order": 5,
   "p1": "paper 005",
   "pn": "",
   "abstract": [
    "The Tactical Language Training System helps learners acquire communicative competence in spoken Arabic and other languages. An intelligent agent coaches learners, assessing their mastery and providing tailored assistance. Learners then perform missions in an interactive story environment, where they communicate with autonomous, animated characters. Our fundamental hypotheses are that such a learning environment will be more engaging and motivating than alternative approaches, and will lead to more rapid skill acquisition.\n",
    ""
   ]
  },
  "brown04_icall": {
   "authors": [
    [
     "Jonathan",
     "Brown"
    ],
    [
     "Maxine",
     "Eskenazi"
    ]
   ],
   "title": "Retrieval of authentic documents for reader-specific lexical practice",
   "original": "iic4_006",
   "page_count": 4,
   "order": 6,
   "p1": "paper 006",
   "pn": "",
   "abstract": [
    "When a teacher gives a reading assignment in todays language learning classrooms, all of the students are almost always reading the same text. Although students have different reading levels, it is impractical for a single teacher to seek out unique texts matched to each students abilities. In this paper, we describe REAP, a system designed to assign each student individualized readings by combining detailed student and curriculum modelling with the large amount of authentic materials on the Web. REAP is designed to be used as an additional resource in teacher-led classes, as well as to be used by reading comprehension researchers for testing hypotheses on how to improve reading skills for L1 as well as L2 learners. Vocabulary acquisition is the primary factor we use in matching texts to a students abilities. The system can also prioritise different criteria during the search. For instance, the system can retrieve documents based solely on the vocabulary terms needed to progress toward the next level, thereby focusing on curriculum. REAP can take into account other goals, such as student interests, special topics decided by the teacher, or an upcoming test, all represented as word histograms. This allows teachers to decide what they want the students to focus on each day.\n",
    "We also describe the contributions of this project, including an open-corpus, authentic-materials approach to reading practice and word-level modelling of norms and student skills. Finally, we describe how learning researchers can use this tool to get fine-grained control over the selection of reading materials, so that they can more easily test a variety of new learning hypotheses.\n",
    ""
   ]
  },
  "demol04_icall": {
   "authors": [
    [
     "M.",
     "Demol"
    ],
    [
     "K.",
     "Struyve"
    ],
    [
     "W.",
     "Verhelst"
    ],
    [
     "H.",
     "Paulussen"
    ],
    [
     "P.",
     "Desmet"
    ],
    [
     "P.",
     "Verhoeve"
    ]
   ],
   "title": "Efficient non-uniform time-scaling of speech with WSOLA for CALL applications",
   "original": "iic4_007",
   "page_count": 4,
   "order": 7,
   "p1": "paper 007",
   "pn": "",
   "abstract": [
    "We consider the applicability of time-scaling for Computer Assisted Language Learning Applications (CALL) and present an efficient algorithm for non-uniform time-scaling. Formal listening tests show a general preference for this non-uniform time-scaling and indicate a dependence of this preference on such factors as the length of the utterance and the desired amount of time-scaling.\n",
    ""
   ]
  },
  "schmidt04_icall": {
   "authors": [
    [
     "Paul",
     "Schmidt"
    ],
    [
     "Sandrine",
     "Garnier"
    ],
    [
     "Mike",
     "Sharwood"
    ],
    [
     "Toni",
     "Badia"
    ],
    [
     "Lourdes",
     "Díaz"
    ],
    [
     "Martí",
     "Quixal"
    ],
    [
     "Ana",
     "Ruggia"
    ],
    [
     "Antonio S.",
     "Valderrabanos"
    ],
    [
     "Alberto J.",
     "Cruz"
    ],
    [
     "Enrique",
     "Torrejon"
    ],
    [
     "Celia",
     "Rico"
    ],
    [
     "Jorge",
     "Jimenez"
    ]
   ],
   "title": "ALLES: 'controlled language tools² and information extraction tools² for CALL applications",
   "original": "iic4_008",
   "page_count": 4,
   "order": 8,
   "p1": "paper 008",
   "pn": "",
   "abstract": [
    "This paper describes how mature NLP that has been successfully applied in the area of controlled language checking can be used to deliver intelligent CALL applications. It describes how an autonomous, longdistance 2nd language learning system for advanced learners can be created. The architecture of the system consists of a web-based multimodal user interface, skillspecific learning tools (reading, listening, speaking and writing tool), and a set of NLP-based evaluation tools. All modules are integrated in a flexible software architecture ensuring a user-friendly environment based on advanced concepts in language didactics. The thrust of the project is to show the potential of NLP for automatic evaluation of students productions.\n",
    ""
   ]
  },
  "kraif04_icall": {
   "authors": [
    [
     "Olivier",
     "Kraif"
    ],
    [
     "Georges",
     "Antoniadis"
    ],
    [
     "Sandra",
     "Echinard"
    ],
    [
     "Mathieu",
     "Loiseau"
    ],
    [
     "Thomas",
     "Lebarbé"
    ],
    [
     "Claude",
     "Ponton"
    ]
   ],
   "title": "NLP tools for CALL: the simpler, the better",
   "original": "iic4_009",
   "page_count": 4,
   "order": 9,
   "p1": "paper 009",
   "pn": "",
   "abstract": [
    "This paper addresses the problem of the implementation of Natural Language Processing (NLP) tools for Computer Assisted Language Learning (CALL). After analyzing why some complex NLP application appear to be inappropriate for CALL, we show, with precise examples, that the more promosing progresses are expected to come from NLP basic processes, as morphological tagging or lemmatization.\n",
    ""
   ]
  },
  "zock04_icall": {
   "authors": [
    [
     "Michael",
     "Zock"
    ],
    [
     "Julien",
     "Quint"
    ]
   ],
   "title": "Converting an electronic dictionary into a drill tutor",
   "original": "iic4_010",
   "page_count": 4,
   "order": 10,
   "p1": "paper 010",
   "pn": "",
   "abstract": [
    "Electronic dictionaries have a potential which has been largely underexploited, in particular with respect to foreign language learning. Adding certain functions to them would considerably extend their usefulness. For example, such enhanced dictionaries could support people in theirs tasks of reading (in a script different than your mother tongue), writing (reveal the word that is on the tip of their tongue), memorising words, or automating basic syntactic structures. We will focus here on this latter aspect. That is, we will show here how to convert an electronic dictionary into a drill tutor or exercice generator, or, more precisely, a goal-driven, template-based sentence generator. The examples given are for learning japanese, yet the approach taken is general enough to allow for accomodation, that is, the computer program could be adapted to other languages, which is precisely our goal.\n",
    ""
   ]
  },
  "maclochlainn04_icall": {
   "authors": [
    [
     "Mícheál",
     "Mac Lochlainn"
    ],
    [
     "Gearóid",
     "Ó Néill"
    ]
   ],
   "title": "Specifying grammatical points",
   "original": "iic4_011",
   "page_count": 2,
   "order": 11,
   "p1": "paper 011",
   "pn": "",
   "abstract": [
    "The system provides a language for the grammarian to specify grammatical points of Irish for use in computer assisted language systems. There is a basic knowledge base, which can be used in the specification of other grammatical points. Included are predefined entities, functions and the provision for defining the rules. The rules, together with the other information, are used to form the basis of a quasi-natural language explanation. Information on pronunciation as well as a facility to record phrases is provided. The dictionary \"An Foclóir Beag\" forms part of the knowledge base. The student can use the rules for explanation, suggestions for the correct form and verification. The language is interpreted.\n",
    ""
   ]
  },
  "mote04_icall": {
   "authors": [
    [
     "Nicolaus",
     "Mote"
    ],
    [
     "Lewis",
     "Johnson"
    ],
    [
     "Abhinav",
     "Sethy"
    ],
    [
     "Jorge",
     "Silva"
    ],
    [
     "Shrikanth",
     "Narayanan"
    ]
   ],
   "title": "Tactical language detection and modeling of learner speech errors: the case of Arabic tactical language training for american English speakers",
   "original": "iic4_012",
   "page_count": 4,
   "order": 12,
   "p1": "paper 012",
   "pn": "",
   "abstract": [
    "The Tactical Language Training System (TLTS) is a speech-enabled computer learning environment designed to teach Arabic spoken communication to American English speakers (and is described in a companion paper(Johnson et al, 2004)). This paper elaborates upon the modeling and detection of learner speech errors along multiple levels of linguistic details ranging from segmental to lexico-semantic aspects. Detecting learner errors enables providing tailored pedagogical feedback in TLTS.\n",
    ""
   ]
  },
  "vitanova04_icall": {
   "authors": [
    [
     "Irena",
     "Vitanova"
    ]
   ],
   "title": "Evaluating integrated NLP in foreign language learning: technology meets pedagogy",
   "original": "iic4_013",
   "page_count": 4,
   "order": 13,
   "p1": "paper 013",
   "pn": "",
   "abstract": [
    "In this paper I would like to present the pedagogical perspective upon a 3-year research project with direct implications for the field of Foreign Language Teaching (FLT), and English for Professional Purposes (ESP) in particular.\n",
    "As a project in Computer Science, the basic aim of LARFLAST (Learning Foreign Language Scientific Terminology, Copernicus98 Joint Research Project 1998-2001) was to investigate the integration of several innovative software components into a harmonized environment for learning English financial terminology. In order to ensure the pedagogical relevance of the work, user involvement and endorsement of the research prototype were sought at every stage of the project.\n",
    "The working bench consisted of the following resources: 1) a training corpus of texts for selfstudy 2) a collection of additional relevant texts, gathered by an intelligent Web-agent 3) a terminology testing section of exercises in the popular CALL formats, including a NLP component 4) online financial dictionaries 5) GenWeb, generating dynamic web pages, intended as immersive contexts for the learners, making use of the capabilities provided by web browsers.\n",
    "LARFLAST studied and integrated language technologies like semantic analysis, information retrieval and elements of natural language generation.\n",
    "The paper discusses the difficult negotiation process between user requirements, pedagogical rationale and the specificity of technological problems that participants sought to solve and subsequent work, trying to cope with some of the problems.\n",
    ""
   ]
  },
  "greene04_icall": {
   "authors": [
    [
     "Cara",
     "Greene"
    ],
    [
     "Katrina",
     "Keogh"
    ],
    [
     "Thomas",
     "Koller"
    ],
    [
     "Joachim",
     "Wagner"
    ],
    [
     "Monica",
     "Ward"
    ],
    [
     "Josef van",
     "Genabith"
    ]
   ],
   "title": "Using NLP technology in CALL",
   "original": "iic4_014",
   "page_count": 4,
   "order": 14,
   "p1": "paper 014",
   "pn": "",
   "abstract": [
    "This paper outlines the research and guiding research principles of the (I)CALL group at Dublin City University, Ireland. Our research activities include the development of (I)CALL systems targeted at a variety of user groups including advanced Romance language learners, intermediate to advanced German learners, primary and secondary school students as well as students with L1 learning disabilities requiring a variety of system types which cater to individual user needs and abilities. Suitable CL/NLP technology is incorporated where appropriate for the learner.\n",
    ""
   ]
  },
  "fortmann04_icall": {
   "authors": [
    [
     "Christian",
     "Fortmann"
    ],
    [
     "Martin",
     "Forst"
    ]
   ],
   "title": "An LFG grammar checker for CALL",
   "original": "iic4_015",
   "page_count": 4,
   "order": 15,
   "p1": "paper 015",
   "pn": "",
   "abstract": [
    "In this paper we present the possibilities of modifying an existing broad-coverage LFG for German in such a way that it can be used as a grammar checker in L2 learning that not only states whether or not the learner's input is grammatical, but also provides crucial information necessary for generating helpful feedback as to what has to be corrected. The necessary modifications, which consist basically in anticipating malrules, are exemplified with a number of notorious systematic errors L2 learners of German typically commit, such as the non-compliance of constraints on verb placement, the use of pragmatically inadequate constituent orders and agreement violations. At present, the modified grammar covers the most frequent error types of L2 learners. However, more corpus work is needed for extension and evaluation.\n",
    ""
   ]
  },
  "hincks04_icall": {
   "authors": [
    [
     "Rebecca",
     "Hincks"
    ]
   ],
   "title": "Processing the prosody of oral presentations",
   "original": "iic4_016",
   "page_count": 4,
   "order": 16,
   "p1": "paper 016",
   "pn": "",
   "abstract": [
    "Standard advice to people preparing to speak in public is to use a \"lively\" voice. A lively voice is described as one that varies in intonation, rhythm and loudness: qualities that can be analyzed using speech analysis software. This paper reports on a study analyzing pitch variation as a measure of speaker liveliness. A potential application of this approach for analysis would be for rehearsing or assessing the prosody of oral presentations. While public speaking can be intimidating even to native speakers, second language users are especially challenged, particularly when it comes to using their voices in a prosodically engaging manner.\n",
    "The material is a database of audio recordings of twenty 10-minute student oral presentations, where all speakers were college-age Swedes studying Technical English. The speech has been processed using the analysis software WaveSurfer for pitch extraction. Speaker liveliness has been measured as the standard deviation from the mean fundamental frequency over 10-second periods of speech. The standard deviations have been normalized (by division with the mean frequency) to obtain a value termed the pitch dynamism quotient (PDQ). Mean values (for ten minutes of speech) of PDQ per speaker range from a low of 0.11 to a high of 0.235. Individual values for 10-second segments range from lows of 0.06 to highs of 0.36.\n",
    ""
   ]
  },
  "ishida04_icall": {
   "authors": [
    [
     "Akira",
     "Ishida"
    ]
   ],
   "title": "Measuring the appropriateness of laxical tones in bisyllabic Chinese words",
   "original": "iic4_017",
   "page_count": 4,
   "order": 17,
   "p1": "paper 017",
   "pn": "",
   "abstract": [
    "A method to classify Mandarin Chinese bisyllabic words based on the appropriateness of their tones was developed. Overall classification accuracy was approximately 86 percent. Depending on the tone combination, accuracy ranged from 64 to 100 percent. The proposed method might assist non-native learners acquiring tone pronunciation skills.\n",
    ""
   ]
  },
  "handley04_icall": {
   "authors": [
    [
     "Zöe",
     "Handley"
    ],
    [
     "Marie-Josée",
     "Hamel"
    ]
   ],
   "title": "Investigating the requirements of speech synthesis for CALL with a view to developing a benchmark",
   "original": "iic4_018",
   "page_count": 4,
   "order": 18,
   "p1": "paper 018",
   "pn": "",
   "abstract": [
    "The evaluation of speech synthesis for CALL is particularly important because speech synthesisers developed for other purposes are being re-used. Yet, very few formal evaluations of speech synthesis for CALL have been conducted. One potential reason for the neglect of evaluation is that it is expensive in terms of both time and resources, for which it competes with further technology development. In order to achieve a balance between technology development and evaluation, benchmarking, is commonly used in the evaluation of speech and language technologies. The ultimate goal of our research is the development of a benchmark for the evaluation of speech synthesis for CALL. The first stage in the development of such a benchmark is to establish the requirements of the application. This is the goal of this paper.\n",
    ""
   ]
  },
  "menzel04_icall": {
   "authors": [
    [
     "Wolfgang",
     "Menzel"
    ]
   ],
   "title": "Errors, intentions, and explanations: feedback generation for language tutoring systems",
   "original": "iic4_019",
   "page_count": 8,
   "order": 19,
   "p1": "paper 019",
   "pn": "",
   "abstract": [
    "Abstract This paper tries to adopt intentions as an additional dynamic source of knowledge, which can be used to bias the feedback generation components of a tutoring system for foreign language learning. By doing so, it departs from the common similarity-based approach, which derives the plausibility of an error diagnosis from the effort needed to transform the student's solution into the next best interpretation which can be established by the system. Given the limited knowledge of a tutoring system, this popular approach might lead to misguiding or even confusing explanations, especially in cases where alternative explanations would have been possible, but the system was not able to identify them properly or even needed to resort to arbitrary selections. The paper investigates two different options for integrating dynamically changing contextual expectations into the diagnostic analysis of erroneous utterances.\n",
    ""
   ]
  },
  "bender04_icall": {
   "authors": [
    [
     "Emily M.",
     "Bender"
    ],
    [
     "Dan",
     "Flickinger"
    ],
    [
     "Stephan",
     "Oepen"
    ],
    [
     "Annemarie",
     "Walsh"
    ],
    [
     "Timothy",
     "Baldwin"
    ]
   ],
   "title": "Arboretum: using a precision grammar for grammar checking in CALL",
   "original": "iic4_020",
   "page_count": 4,
   "order": 20,
   "p1": "paper 020",
   "pn": "",
   "abstract": [
    "We present a tutorial system for language learners, using a computational grammar augmented with mal-rules for analysis, error diagnosis, and semantics-centered generation of corrected forms. Corrections are produced using a novel strategy of aligned generation.\n",
    ""
   ]
  },
  "zamoranomansilla04_icall": {
   "authors": [
    [
     "Juan Rafael",
     "Zamorano Mansilla"
    ]
   ],
   "title": "Text generators, error analysis and feedback",
   "original": "iic4_021",
   "page_count": 4,
   "order": 21,
   "p1": "paper 021",
   "pn": "",
   "abstract": [
    "The purpose of this paper is to show how the linguistic resources contained in the multilingual text generator KPML can be used for detecting errors in fill-in-the-blank exercises of English and Spanish and providing relevant feedback. This constitutes the first step in the creation of a module that will detect errors in full sentences in future. In this paper I describe the algorithm employed to diagnose the cause of an error and some examples of the results obtained in initial tests. The algorithm has two important advantages: a) it was easy to create because it consists mainly of operations already present in the KPML environment, and b) it does not contain lists of anticipated errors or malrules. The final outcome of the algorithm is a collection of grammatical features that explain the difference between the users input and the right solution. Although no list of anticipated errors or malrules were included, the features obtained seemed useful material for the production of feedback text and the algorithm turned out to be able to handle a wide range of grammar-based errors.\n",
    ""
   ]
  },
  "delmonte04_icall": {
   "authors": [
    [
     "Rodolfo",
     "Delmonte"
    ]
   ],
   "title": "Evaluating students² summaries with GETARUNS",
   "original": "iic4_022",
   "page_count": 8,
   "order": 22,
   "p1": "paper 022",
   "pn": "",
   "abstract": [
    "Evaluating summaries is currently performed by the use of statistically-based tools which lack any linguistic knowledge and are unable to produce grammatical and semantic judgements (Landauer et al., 1997). However, summary evaluation needs precise linguistic information with a much finer-grained coverage than what is being offered by currently available statistically based systems. We assume that the starting point of any interesting application in these fields must necessarily be a good syntactic-semantic parser. In this paper we present the system for text understanding called GETARUNS, General Text and Reference Understanding System (Delmonte, 2003). The heart of the system is a rule-based top-down parser, which uses an LFG oriented grammar organization. Lately, a less constrained version of the parser for the application field of text summarization has been developed, which allows the system to recover gracefully from failures. To this end, the parser is couple with another concurrent parsing processes: a partial or shallow parse is always produced and used to recover from complete failures. GETARUNS, has a highly sophisticated linguistically based semantic module which is used to build up the Discourse Model. Semantic processing is strongly modularized and distributed amongst a number of different submodules which take care of Spatio-Temporal Reasoning, Discourse Level Anaphora Resolution. Evaluation taps information from the Discourse Model and uses Predicate Argument Structures (PAS) to detect students understanding of the text to summarize. It also uses the output of the Anaphora Resolution Module to check for most relevant topics in the text which the student should have addressed in his/her summary. The system uses a Topics-Stack while processing the text in order to corefer referential expressions: The Topic-Stack Hierarchy gauges nominal heads as either Main, Secondary or Potential Topic. This grading is used as a score that allows the system to detect the most relevant entities in the text at the end of the computation.\n",
    ""
   ]
  },
  "wang04_icall": {
   "authors": [
    [
     "Chao",
     "Wang"
    ],
    [
     "Stephanie",
     "Seneff"
    ]
   ],
   "title": "High-quality speech translation for language learning",
   "original": "iic4_023",
   "page_count": 4,
   "order": 23,
   "p1": "paper 023",
   "pn": "",
   "abstract": [
    "In this paper, we describe a translation framework aimed at achieving high-quality speech translation within restricted conversational domains. Towards this goal, we developed an interlingua-based approach, in which a generation-based method is augmented with an examplebased method to improve system robustness, even with imperfect inputs due to speech recognition errors. The framework is integrated into a dialogue-based language tutoring system, to provide immediate translation assistance to students during the dialogue interaction. We evaluated the translation quality within a weather information domain configured for native English speakers practicing Mandarin Chinese. We achieved perfect or acceptable translations for 94.3% of the manual transcriptions of a test set of 695 spoken queries, and 90.2% on automatic speech recognition outputs.\n",
    ""
   ]
  },
  "levi04_icall": {
   "authors": [
    [
     "Tatiana",
     "Levi"
    ],
    [
     "Steve",
     "Stokowski"
    ],
    [
     "Nikolaus",
     "Koster"
    ],
    [
     "Andreas",
     "Rycshka"
    ]
   ],
   "title": "Voice recognition feature of the German express courseware: conceptualization, specification and prototyping - model elaboration through phases",
   "original": "iic4_024",
   "page_count": 3,
   "order": 24,
   "p1": "paper 024",
   "pn": "",
   "abstract": [
    "In this paper we discuss how adding speech recognition (SR) affected the development of a computer-based language training program - how our understanding of the capabilities and limitations of the recognizer evolved and how this understanding affected design and implementation decisions. The program developed is called German Express, it is a CD-ROM based, interactive, language-training course.\n",
    ""
   ]
  },
  "schwartz04_icall": {
   "authors": [
    [
     "Lee",
     "Schwartz"
    ],
    [
     "Takako",
     "Aikawa"
    ],
    [
     "Michel",
     "Pahud"
    ]
   ],
   "title": "Dynamic language learning tools",
   "original": "iic4_025",
   "page_count": 4,
   "order": 25,
   "p1": "paper 025",
   "pn": "",
   "abstract": [
    "In this paper, we present prototypes of individualized language learning tools. We show how Natural Language Processing (NLP) technology developed at Microsoft Research (MSR) facilitates the dynamic creation of language exercises and provides new user experiences in language learning, while raising the bar for educational technology. We demonstrate how our technology, with its rich linguistic resources, enables the dynamic creation of language exercises which are individualized and user-centric. We present some user scenarios to illustrate the flexibility and unlimited potential of our language learning tools. We show that with innovative ideas and vision, our NLP technology can shed new light on the way technology is used in language learning/teaching.\n",
    ""
   ]
  },
  "winiwarter04_icall": {
   "authors": [
    [
     "Werner",
     "Winiwarter"
    ]
   ],
   "title": "PETRA - the personal embedded translation and reading assistant",
   "original": "iic4_026",
   "page_count": 4,
   "order": 26,
   "p1": "paper 026",
   "pn": "",
   "abstract": [
    "In this paper we present PETRA, a Personal Embedded Translation and Reading Assistant, which assists German-speaking language students in reading and translating Japanese documents. PETRA is fully embedded into Microsoft Word so that the students can invoke all its features directly from within the text editor. The translation rules are learnt in-crementally from translation examples provided by the students, therefore, they can customize the translations according to their personal preferences. This type of language learn-ing environment encourages a bidirectional knowledge transfer, which fosters a lively interaction and makes the learning process more interesting and entertaining.\n",
    ""
   ]
  },
  "wagner04_icall": {
   "authors": [
    [
     "Joachim",
     "Wagner"
    ]
   ],
   "title": "A false friends exercise with authentic material retrieved from a corpus",
   "original": "iic4_027",
   "page_count": 4,
   "order": 27,
   "p1": "paper 027",
   "pn": "",
   "abstract": [
    "This paper presents a CALL exercise that aims to raise the learner's awareness of false friends. In the exercise, the learner is asked to mark words in a text that are similar in form to a word in his or her native language and then to classify these words according to three levels of meaning correspondence. Text is randomly selected from a corpus and integrated into the exercise. A preliminary evaluation shows that mature students understand the exercise well.\n",
    ""
   ]
  },
  "bonneau04_icall": {
   "authors": [
    [
     "Anne",
     "Bonneau"
    ],
    [
     "Matthieu",
     "Camus"
    ],
    [
     "Yves",
     "Laprie"
    ],
    [
     "Vincent",
     "Colotte"
    ]
   ],
   "title": "A computer-assisted learning of English prosody for French students",
   "original": "iic4_028",
   "page_count": 4,
   "order": 28,
   "p1": "paper 028",
   "pn": "",
   "abstract": [
    "This paper presents a computer-assisted learning system of English prosody for French students. Our main goal is to provide learners with relevant feedback, based upon speech signal transformations and guided by a comparison between French and English prosodies. Considering that teachers should be given the possibility of customizing their courses, the main functions of WinSnoori for editing and modifying the signals has been ported in the form of active X controls. We present here these functions, a set of exercices conceived for the acquisition of English prosody, and give a concrete example illustrating our strategy.\n",
    ""
   ]
  },
  "thomas04_icall": {
   "authors": [
    [
     "Craig",
     "Thomas"
    ],
    [
     "Michael",
     "Levison"
    ],
    [
     "Greg",
     "Lessard"
    ]
   ],
   "title": "Experiments in prosody for the generation of oral French",
   "original": "iic4_029",
   "page_count": 4,
   "order": 29,
   "p1": "paper 029",
   "pn": "",
   "abstract": [
    "This paper describes a series of experiments designed to allow VINCI, a natural language generation environment, to produce not just orthographic, but also phonetic output in French with the help of the MBROLA speech generator. In order for this to be possible, it is necessary for the syntactic representation of utterances generated by VINCI to contain phonetic symbols and prosodic information, including pitch and length. We show that the resulting system is capable of generating oral output found to be largely acceptable according to a set of human evaluators and describe a number of pratical applications of the system.\n",
    ""
   ]
  },
  "hirano04_icall": {
   "authors": [
    [
     "Hiroko",
     "Hirano"
    ],
    [
     "Goh",
     "Kawai"
    ]
   ],
   "title": "Modeling pitch errors of Japanese intonational phrases spoken by a native speaker of Chinese",
   "original": "iic4_030",
   "page_count": 4,
   "order": 30,
   "p1": "paper 030",
   "pn": "",
   "abstract": [
    "We compared pitch patterns of Japanese intonational phrases spoken by a native speaker of Chinese.\n",
    "Several types of pitch errors were distinguished according to pitch contour shapes within and across intonational phrases. These shapes differ categorically from one another - for instance, the learner uses flat contours while the native uses hump-like contours.\n",
    "Comparisons of the learner and native speaker show that (a) the learners intonational phrases are shorter, (b) the learners pitch contour repertoire is smaller, (c) the learner has difficulty spreading pitch declinations over multiple syllables, and (d) segmental pronunciation errors cause pitch changes perceived by natives as intonational phrase boundaries.\n",
    ""
   ]
  },
  "haller04_icall": {
   "authors": [
    [
     "Johann",
     "Haller"
    ],
    [
     "Michael",
     "Carl"
    ],
    [
     "Sandrine",
     "Garnier"
    ],
    [
     "Brigitte",
     "Stroede"
    ],
    [
     "Lutz",
     "Wind"
    ]
   ],
   "title": "NLP tools for intelligent learner utterance evaluation",
   "original": "iic4_031",
   "page_count": 4,
   "order": 31,
   "p1": "paper 031",
   "pn": "",
   "abstract": [
    "In this paper, work on an intelligent learners utterance evaluation program is described. After a brief introduction to the basic multimedia learning program, the motivation for the development of an NLP package is given: learners are supposed to stick closer to the program and to spend more time and energy with it if they are given intelligent diagnosis of their errors. This has been achieved by combining linguistic analysis tools with a distance measure processing.\n",
    ""
   ]
  },
  "truong04_icall": {
   "authors": [
    [
     "Khiet",
     "Truong"
    ],
    [
     "Ambra",
     "Neri"
    ],
    [
     "Catia",
     "Cucchiarini"
    ],
    [
     "Helmer",
     "Strik"
    ]
   ],
   "title": "Automatic pronunciation error detection: an acoustic-phonetic approach",
   "original": "iic4_032",
   "page_count": 4,
   "order": 32,
   "p1": "paper 032",
   "pn": "",
   "abstract": [
    "In this paper, we present an acoustic-phonetic approach to automatic pronunciation error detection. Classifiers using techniques such as Linear Discriminant Analysis or a decision tree were developed for three sounds that are frequently pronounced incorrectly by L2-learners of Dutch: /A/, /Y/ and /x/. The acoustic properties of these pronunciation errors were examined so as to define a number of discriminative acoustic features to be used to train and test the classifiers. Experiments showed that the classifiers are able to discriminate correct sounds from incorrect sounds in both native and nonnative speech, and therefore can be used to detect pronunciation errors in non-native speech.\n",
    ""
   ]
  },
  "tsubota04_icall": {
   "authors": [
    [
     "Yasushi",
     "Tsubota"
    ],
    [
     "Masatake",
     "Dantsuji"
    ],
    [
     "Tatsuya",
     "Kawahara"
    ]
   ],
   "title": "Practical use of autonomous English pronunciation learning system for Japanese students",
   "original": "iic4_033",
   "page_count": 4,
   "order": 33,
   "p1": "paper 033",
   "pn": "",
   "abstract": [
    "We have developed an original CALL system designed to detect and diagnose English pronunciation errors in Japanese learners speech. We have begun using the system in an English class at Kyoto University in Kyoto, Japan. The class consists of approximately 40 students, and the students have practiced pronunciation using this system on four separate occasions. Sixty minutes was allocated for each practice session, providing a total of 9600 minutes of practice time per academic calender year. We have examined the recorded speech data and corresponding speech recognition results obtained for the first semester of the preceeding academic year.\n",
    ""
   ]
  },
  "bernstein04_icall": {
   "authors": [
    [
     "Jared",
     "Bernstein"
    ],
    [
     "Isabella",
     "Barbier"
    ],
    [
     "Elizabeth",
     "Rosenfeld"
    ],
    [
     "John De",
     "Jong"
    ]
   ],
   "title": "Development and validation of an automatic spoken Spanish test",
   "original": "iic4_034",
   "page_count": 4,
   "order": 34,
   "p1": "paper 034",
   "pn": "",
   "abstract": [
    "A computer-based Spoken Spanish Test (SST) was developed to provide an accurate and convenient assessment of speaking and listening for learners of Spanish. The SST is intended to measure a candidates receptive familiarity with a variety of forms of Spanish and the candidates facility in speaking Spanish. The SST test takes between 15 and 20 minutes to complete, all the items are presented in spoken Spanish, and the test is administered and scored completely automatically. The SST has seven sections, a reading section, a series of elicited imitations, a sentence construction section, two vocabulary sections, a section with opinion questions, and a section with story retelling. The SST items were assembled into tests presented to 579 adult non-native Spanish learners (mostly university students) and to 435 native Spanish speakers. The paper describes validation of the automatic scoring system with reference to concurrent administrations of ACTFL, ILR, and SPT Oral Proficiency Interviews conducted by certified interviewers/raters.\n",
    ""
   ]
  },
  "raux04_icall": {
   "authors": [
    [
     "Antoine",
     "Raux"
    ],
    [
     "Maxine",
     "Eskenazi"
    ]
   ],
   "title": "Using task-oriented spoken dialogue systems for language learning: potential, practical applications and challenges",
   "original": "iic4_035",
   "page_count": 4,
   "order": 35,
   "p1": "paper 035",
   "pn": "",
   "abstract": [
    "The technology developed for task-based spoken dialogue systems (SDS) has a significant potential for Computer-Assisted Language Learning. Based on the CMU Lets Go SDS, we describe two areas in which we investigated adaptations of the technology to non-native speakers: speech recognition and correction prompt generation. Although difficulties remain, particularly towards robust understanding, results prove that this technology can be used to provide realistic, involved environment for language learning.\n",
    ""
   ]
  },
  "seneff04_icall": {
   "authors": [
    [
     "Stephanie",
     "Seneff"
    ],
    [
     "Chau",
     "Wang"
    ],
    [
     "Julia",
     "Zhang"
    ]
   ],
   "title": "Spoken conversational interaction for language learning",
   "original": "iic4_036",
   "page_count": 4,
   "order": 36,
   "p1": "paper 036",
   "pn": "",
   "abstract": [
    "This paper describes our efforts towards utilizing multilingual spoken dialogue systems as all aid to second language acquisition. We argue that it is important for language students to have the opportunity to practice communication in a non-threatening environment, something that a computer can naturally provide. We envision a three-stage interaction focused around a specific topic of a lesson plan. The first stage would familiarize the student with the vocabulary and syntax by presenting simulated dialogues at a Web page. The second stage would involve spoken dialogue interaction with the computer, either at a workstation or on the telephone. The third stage would provide feedback to the user on the quality of the utterances they recorded during the dialogue exchange. We have thus far concentrated on Mandarin and English as the two languages, where the system can be configured reversibly to support either learning English or Mandarin. We have begun to develop dialogue interaction capabilities for a number of domains centered around the scenario of a traveler to a foreign city.\n",
    ""
   ]
  },
  "wilks04_icall": {
   "authors": [
    [
     "Yorick",
     "Wilks"
    ]
   ],
   "title": "Artificial companions",
   "original": "iic4_037",
   "page_count": 5,
   "order": 37,
   "p1": "paper 037",
   "pn": "",
   "abstract": [
    "What will an artificial Companion be like? Who will need them and how much good or harm will they do? Will they change our lives and social habits in the radical way technologies have in the past: just think of trains, phones and television? Will they force changes in the law so that things that are not people will be liable for damages; up till now, it is the case that if a machine goes wrong, it is always the maker or the programmer, or their company, which is at fault. Above all, how many people, with no knowledge of technology at all, such as the old and very young, will want to go about, or sit at home, with a companion that may look like a furry handbag on the sofa, or a rucksack on the back, but which will keep track of their lives by conversation, and be their interface to the rather elusive mysteries we now think of as the Internet or Web.\n",
    ""
   ]
  },
  "klenner04_icall": {
   "authors": [
    [
     "Manfred",
     "Klenner"
    ]
   ],
   "title": "Tutorial dialogue in diBEx",
   "original": "iic4_038",
   "page_count": 4,
   "order": 38,
   "p1": "paper 038",
   "pn": "",
   "abstract": [
    "A dialogue-based explanation facility for Intelligent CALL (ICALL) Systems is introduced. Our prototype system, DiBEx, uses meta reasoning to build up an explanation (error) tree, given a faulty user input. It relies on correct grammar sub theories, instead of explicit error taxonomies. The system enters in a tutorial dialogue with the student, where each explanation step is based on the principles of a single tutorial strategy. DiBEx focuses on the representation and utilization of grammatical knowledge to participate in such dialogues. Grammar theory is realized as an executable logical theory.\n",
    ""
   ]
  },
  "kirschning04_icall": {
   "authors": [
    [
     "Ingrid",
     "Kirschning"
    ]
   ],
   "title": "CSLU toolkit-based vocabulary tutors for the Jean Piaget special education school",
   "original": "iic4_039",
   "page_count": 4,
   "order": 39,
   "p1": "paper 039",
   "pn": "",
   "abstract": [
    "The TLATOA Speech Processing Group at UDLA, Puebla has developed a couple of applications using the CSLU Toolkit to support language acquisition for hearing impaired children of the Jean Piaget Special Education School in Puebla, México. These applications guide the practice of the pronunciation of vowels and a set of simple short words. The present paper describes the application for vowel production, the test plan and the first results as well as experiences of applying speech technology to support language acquisition for children in a public school in Mexico.\n",
    ""
   ]
  },
  "mich04_icall": {
   "authors": [
    [
     "Ornella",
     "Mich"
    ],
    [
     "Diego",
     "Giuliani"
    ],
    [
     "Matteo",
     "Gerosa"
    ]
   ],
   "title": "Parling, a CALL system for children",
   "original": "iic4_040",
   "page_count": 4,
   "order": 40,
   "p1": "paper 040",
   "pn": "",
   "abstract": [
    "The aim of this paper is to introduce Parling, a multimodal system developed for supporting learning of English as a foreign language. It is devoted to 8-11 year-old Italian children learning English at primary school. Parling features a set of instructional games that change their vocabulary content dynamically based on the users learning needs. Moreover, Parling proposes a key feature to involve more young learners: the Make-Your-Story tool, that enables the user to create herself a new story. The technological core of Parling is a speech recognizer that allows implementing automatic pronunciation assessment. The acoustic models are trained by exploiting speech data collected from native speakers of British English in the age range of the target system users. In this initial version of Parling a simple binary response, i.e. an accept/reject response, is generated for each input utterance. A more detailed feedback will be developed in future Parling versions.\n",
    ""
   ]
  },
  "peabody04_icall": {
   "authors": [
    [
     "Mitchell",
     "Peabody"
    ],
    [
     "Stephanie",
     "Seneff"
    ],
    [
     "Chao",
     "Wang"
    ]
   ],
   "title": "Mandarin tone acquisition through typed interactions",
   "original": "iic4_041",
   "page_count": 4,
   "order": 41,
   "p1": "paper 041",
   "pn": "",
   "abstract": [
    "This research aims to assess whether typed natural language interaction with a computer using tone-marked Mandarin pinyin can lead to improved tone production in L2 learners of Chinese. A method for correcting lexical tone errors in free form typed pinyin sentences is presented. A Web-based framework that allows students to enter sentences in pinyin and receive feedback on lexical tone mistakes was developed. To assess the feasibility of our approach, typed and acoustic data were collected from a small number of volunteers. Our plans to assess students' performance and possible extensions to this research are also discussed.\n",
    ""
   ]
  },
  "martin04_icall": {
   "authors": [
    [
     "Philippe",
     "MARTIN"
    ]
   ],
   "title": "Winpitch LTL II, a multimodal pronunciation software",
   "original": "iic4_042",
   "page_count": 6,
   "order": 42,
   "p1": "paper 042",
   "pn": "",
   "abstract": [
    "We introduce a new version of the pronunciation software program WinPitch LTL. This completely redesigned version is much more easier to use by the teacher and learner alike, and contains the regular function of prosodic real time display, variable speed playback, prosodic morphing, on screen teacher comment display, etc. New features include video capabilities (the program can process multimedia files in most formats) as well as automatic alignment of the learners imitation on the teachers models. This allows for an automated comparison and explanation on the differences analyzed on the segmental and suprasegmental levels. The new version of WinPitch LTL has a built in program for the preparation of lessons in any language (the program is Unicode compliant) allowing easy navigation by the learner between examples contained in each unit. Segments of prosodic curves can be highlighted in any color and text easily added for on screen explanation of specific melodic or rhythmic properties of the model.\n",
    ""
   ]
  },
  "kempen04_icall": {
   "authors": [
    [
     "Gerard",
     "Kempen"
    ]
   ],
   "title": "Interactive visualization of syntactic structure assembly for grammar-intensive first- and second-language instruction",
   "original": "iic4_043",
   "page_count": 4,
   "order": 43,
   "p1": "paper 043",
   "pn": "",
   "abstract": [
    "Understanding the grammatical structure of the target language is beneficial to certain categories of language learners, in particular to students learning to write in a language with many syntax-sensitive spelling rules, and to adult L1/L2 learners who prefer explicit rules. Moreover, grammar is an important body of knowledge in its own right. Two visual-interactive grammar instruction tools are presented that graphically support students in composing and transforming sentences. The structure of sentences is displayed in the form of easily interpretable syntactic trees that the student can assemble and modify interactively. The tools check on-line the grammatical well-formedness of the structures being manipulated. The programs are based on the new Performance Grammar formalism (e.g., Kempen & Harbusch, 2002). They have been implemented in JAVA and can run under most modern operating systems.\n",
    ""
   ]
  },
  "boytcheva04_icall": {
   "authors": [
    [
     "Svetla",
     "Boytcheva"
    ],
    [
     "Irena",
     "Vitanova"
    ],
    [
     "Albena",
     "Strupchanska"
    ],
    [
     "Milena",
     "Yankova"
    ],
    [
     "Galia",
     "Angelova"
    ]
   ],
   "title": "Towards the assessment of free learner's utterances in CALL",
   "original": "iic4_044",
   "page_count": 4,
   "order": 44,
   "p1": "paper 044",
   "pn": "",
   "abstract": [
    "Computer-Aided Language Learning (CALL) should play an important role in the modern training process because it provides easy accessible, adaptive and flexible ways of learning. This paper addresses the scenario of tutor-learner question answering and attempts to automate the free answers evaluation using the advantages of Natural Language Processing (NLP). Our current approach integrates shallow parsing for analysing the answers and allows the learners to enter various utterances to express themselves. However this variety does not impede the assessment of the students answer as we check the utterances against the automatically generated scope of the correct answers. The usage of a \"set of answers\" instead of one predefined correct answer enables feedback elaboration that helps learners to understand better their knowledge gaps. Briefly, in this paper we show how the combination of shallow and deep semantic NLP techniques can improve the effectiveness of eLearning systems which support communication in free natural language and can make them more satisfactory and pleasant for their users.\n",
    ""
   ]
  },
  "ayala04_icall": {
   "authors": [
    [
     "Gerardo",
     "Ayala"
    ]
   ],
   "title": "Software agents supporting second language learning as a personalized, collaborative and lifelong activity",
   "original": "iic4_045",
   "page_count": 4,
   "order": 45,
   "p1": "paper 045",
   "pn": "",
   "abstract": [
    "Second language learning is as a personalized, collaborative and lifelong activity. In this paper we present a model of a second language learning environment based on software agents, integrating speech technologies and natural language processing from this perspective. We have developed this model based on previous research concerning technologies for the development of software agents supporting second language learning from the perspective of collaborative learning (Ayala & Yano, 1998) personalization (Ayala & Yano, 1996) and lifelong learning (Ayala, 1999; Ayala 2003).\n",
    ""
   ]
  },
  "heiner04_icall": {
   "authors": [
    [
     "Cecily",
     "Heiner"
    ],
    [
     "Joseph",
     "Beck"
    ],
    [
     "Jack",
     "Mostow"
    ]
   ],
   "title": "Improving the help selection policy in a reading tutor that listens",
   "original": "iic4_046",
   "page_count": 4,
   "order": 46,
   "p1": "paper 046",
   "pn": "",
   "abstract": [
    "What type of oral reading assistance is most effective for a given student on a given word? We analyze 189,039 randomized trials of a within-subject experiment to compare the effects of several types of help in the 2002-2003 version of Project LISTENs Reading Tutor. The independent variable is the type of help given on a word. The outcome variable is the students performance at the next encounter of that word, as measured by automatic speech recognition. Training a help selection policy sensitive to student or word level improves this outcome by a projected 4% - a substantial effect for picking a single better intervention.\n",
    ""
   ]
  },
  "montanari04_icall": {
   "authors": [
    [
     "Simona",
     "Montanari"
    ],
    [
     "Serdar",
     "Yildirim"
    ],
    [
     "Sonia",
     "Khurana"
    ],
    [
     "Marni",
     "Landes"
    ],
    [
     "Lewis",
     "Lawyer"
    ],
    [
     "Elaine",
     "Andersen"
    ],
    [
     "Shrikanth",
     "Narayanan"
    ]
   ],
   "title": "Analyzing the interplay between spoken language and gestural cues in conversational child-machine interactions in pre/early literate age groups",
   "original": "iic4_047",
   "page_count": 4,
   "order": 47,
   "p1": "paper 047",
   "pn": "",
   "abstract": [
    "This paper reports on analysis of interplay between verbal and gestural cues in conversational childmachine interactions in pre-literate age groups. In particular, this study focuses on childrens responses to trouble spots (intra-utterance self-repairs, filled pauses), reference marking, and gestural cues (i.e. pointing or touching screen) that children employ in computerdirected children-computer interaction using a data from 15 children, 3 to 6 years old. Our gestural analysis indicated that with increasing age, children rely on purely verbal utterances rather than utterances accompanied by gestures. Co-analysis of gestural use and intra-utterance repairs revealed that children were less likely to produce intra-utterance repairs when they are multimodal. Also, results revealed that children were less likely to use filled pauses when they are interacting multimodally. In addition, the more children rely on purely verbal utterance, the more they use fullform, explicit noun phrases rather than pro-forms such as deictic adverbs and deictic numerals.\n",
    ""
   ]
  },
  "bianchi04_icall": {
   "authors": [
    [
     "Dario",
     "Bianchi"
    ],
    [
     "Monica",
     "Mordonini"
    ],
    [
     "Agostino",
     "Poggi"
    ]
   ],
   "title": "Spoken dialog for e-learning supported by domain ontologies",
   "original": "iic4_048",
   "page_count": 4,
   "order": 48,
   "p1": "paper 048",
   "pn": "",
   "abstract": [
    "Ontology may be used in the context of elearning to capture knowledge about learning activities and subjects. We present a system that supports an automatic speech recognition and generation between users and an agent based application on the basis these ontologies. The system is realized taking advantage of the JADE agent development framework and of the Java Speech API and has been experimented both in Italian and English.\n",
    ""
   ]
  },
  "cosi04_icall": {
   "authors": [
    [
     "Piero",
     "Cosi"
    ],
    [
     "Rodolfo",
     "Delmonte"
    ],
    [
     "S.",
     "Biscetti"
    ],
    [
     "Ron A.",
     "Cole"
    ],
    [
     "Brian",
     "Pellom"
    ],
    [
     "S. van",
     "Vuren"
    ]
   ],
   "title": "Italian literacy tutor - tools and technologies for individuals with cognitive disabilities",
   "original": "iic4_049",
   "page_count": 8,
   "order": 49,
   "p1": "paper 049",
   "pn": "",
   "abstract": [
    "The Italian Literacy Tutor (ILT) is a project designed to implement a program of individualized, computer-aided reading instruction with the potential to dramatically improve reading achievement and learning from text in Italian, especially considering L2 teaching/learning frameworks or working with children with reading disabilities. The Italian Literacy Tutor is the Italian counterpart of the \"Colorado Literacy Tutor\" (CLT), a project developed at CSLR (Center for Spoken Language Research, Colorado University Boulder) for English. The ILT will mainly integrate two sets of literacy tools, the first one based on speech and animation technology, and the second based on language comprehension technology.\n",
    ""
   ]
  },
  "vlugter04_icall": {
   "authors": [
    [
     "Peter",
     "Vlugter"
    ],
    [
     "Alistair",
     "Knott"
    ],
    [
     "Victoria",
     "Weatherall"
    ]
   ],
   "title": "A human-machine dialogue system for CALL",
   "original": "iic4_050",
   "page_count": 4,
   "order": 50,
   "p1": "paper 050",
   "pn": "",
   "abstract": [
    "This paper describes a CALL tool which interacts with the student via a bilingual human-machine dialogue system. We focus on the modifications needed to the systems grammar and dialogue manager to cater for student errors and help to diagnose them.\n",
    ""
   ]
  },
  "brown04b_icall": {
   "authors": [
    [
     "Charles Grant",
     "Brown"
    ],
    [
     "Nathan",
     "Keim"
    ],
    [
     "Kevin",
     "Brammer"
    ],
    [
     "Lorne",
     "Flagel"
    ]
   ],
   "title": "The incomplete grammar approach to the development of a strong-AI based ICALL system",
   "original": "iic4_051",
   "page_count": 4,
   "order": 51,
   "p1": "paper 051",
   "pn": "",
   "abstract": [
    "The development of our ICALL system is supported by the Incomplete Grammar approach, which allows us to model the learner with a cognitively based system of hypotheses held by the Tutor module. An Incomplete Grammar model of a learners language performance includes Constituent Productions PC, Constituent Production Errors PCE , Lexical Productions PCL and Lexical Production Errors PLE in the learner model, but is incomplete in the target language space. The generation of the set of hypotheses of mal-rules (elements of PCE, and PLE) when language errors are detected is examined from a computational perspective. Dynamic evaluation and ranking of mal-rules is a challenge. We report on approaches to this problem. Strategies for further development are explored.\n",
    ""
   ]
  },
  "morgan04_icall": {
   "authors": [
    [
     "John J.",
     "Morgan"
    ]
   ],
   "title": "Making a speech recognizer tolerate non-native speech through Gaussian mixture merging",
   "original": "iic4_052",
   "page_count": 5,
   "order": 52,
   "p1": "paper 052",
   "pn": "",
   "abstract": [
    "Practicing the spoken language is important to language learners in critical parts of the United States military. Automatic speech recognition (ASR) is a technology that promises to provide self-paced practice opportunities to language learners. We propose to improve ASR in computer assisted language learning (CALL) applications by modeling the speech behavior of language learners. ASR systems trained on native data perform poorly when used to recognize beginning language learners. The Model Merging adaptation method via a confusion matrix map makes our Arabic speech recognizers more tolerant of Anglophone students.\n",
    "Hidden Markov Model (HMM) phone sets are trained for English and Arabic, and then English phones are merged into the Arabic phones to make a new Arabic system. A data-driven procedure is presented for automatically mapping phones between two HMM sets.\n",
    "Accuracy improvements were observed when model merging was combined with other adaptation techniques. The positive results indicate that the speech patterns of non-native speakers are carried over to the new system by the mapping of phones and their weighting.\n",
    ""
   ]
  }
 },
 "sessions": [
  {
   "title": "Table of Contents and Access to Abstracts",
   "papers": [
    "granstrom04_icall",
    "gerosa04_icall",
    "neri04_icall",
    "tillmann04_icall",
    "johnson04_icall",
    "brown04_icall",
    "demol04_icall",
    "schmidt04_icall",
    "kraif04_icall",
    "zock04_icall",
    "maclochlainn04_icall",
    "mote04_icall",
    "vitanova04_icall",
    "greene04_icall",
    "fortmann04_icall",
    "hincks04_icall",
    "ishida04_icall",
    "handley04_icall",
    "menzel04_icall",
    "bender04_icall",
    "zamoranomansilla04_icall",
    "delmonte04_icall",
    "wang04_icall",
    "levi04_icall",
    "schwartz04_icall",
    "winiwarter04_icall",
    "wagner04_icall",
    "bonneau04_icall",
    "thomas04_icall",
    "hirano04_icall",
    "haller04_icall",
    "truong04_icall",
    "tsubota04_icall",
    "bernstein04_icall",
    "raux04_icall",
    "seneff04_icall",
    "wilks04_icall",
    "klenner04_icall",
    "kirschning04_icall",
    "mich04_icall",
    "peabody04_icall",
    "martin04_icall",
    "kempen04_icall",
    "boytcheva04_icall",
    "ayala04_icall",
    "heiner04_icall",
    "montanari04_icall",
    "bianchi04_icall",
    "cosi04_icall",
    "vlugter04_icall",
    "brown04b_icall",
    "morgan04_icall"
   ]
  }
 ]
}