{
 "title": "Intonation: Theories, Models and Applications",
 "location": "Athens, Greece",
 "startDate": "18/9/1997",
 "endDate": "20/9/1997",
 "conf": "INT",
 "year": "1997",
 "name": "int_1997",
 "series": "",
 "SIG": "",
 "title1": "Intonation: Theories, Models and Applications",
 "date": "18-20 September 1997",
 "papers": {
  "rossi97_int": {
   "authors": [
    [
     "Mario",
     "Rossi"
    ]
   ],
   "title": "Intonation: past, present, future",
   "original": "inta_001",
   "page_count": 10,
   "order": 1,
   "p1": "1",
   "pn": "10",
   "abstract": [
    "This is not a catalogue nor a history of past and present intonation studies. I tried to reconstruct the theoretical background likely to explain some of the features of present intonation theories and models. The exponential growth of prosodic studies, from the middle of sixties till now, was prepared by pioneering ideas in the field of form, content and methodology. These views (requirement for a theory and/or model, frameworks for intonation studies) together with the strength of the I intend neither to draw up an inventory nor to relate the history of the past and present publications on intonation. Partial or exhaustive references can be consulted in Leon et Martin (1970), Di Cristo (1975), Gibbon (1976), Hirst and Di Cristo (forthcoming), Rossi et al. (1981), Selkirk (1984), Cruttenden (1986), Ladd (1996). It would require a huge amount of useless effort to go back and look for past prosodic or intonative studies, which have been increasing, exponentially in number over the years. If we take international conferences and congresses as fairly good indicators of the scientists' interest in a given topic, it is interesting to note that between the third international congress of Apart from the pivotal report by Pike on The grammar of intonation, only four papers on prosody were presented, twenty six years later, at the 5th ICPhS of Münster in 1964; seven papers can be found in the Proceedings of the 6th ICPhs in Prague, so that in his keynote on « The present-day tasks of the phonetic sciences », Dennis Fry was compelled to complain about such a situation, claiming that the study of prosodic features in speech had to be «one of our present-day tasks». His exact words were: Prague School and of the more concrete approach of American structuralism shed some light on the present trends of the field of intonation. The main tasks for the future of intonation studies are briefly outlined. Details will be given at the Conference about the relationships and the amount of overlapping between theories, and about the main results obtained at the present time and the tasks for the future.\n",
    ""
   ]
  },
  "bruce97_int": {
   "authors": [
    [
     "Gösta",
     "Bruce"
    ]
   ],
   "title": "Models of intonation - from the Lund horizon",
   "original": "inta_011",
   "page_count": 8,
   "order": 2,
   "p1": "11",
   "pn": "18",
   "abstract": [
    "My contribution to the Intonation Workshop is an overview of research on intonation and modelling of intonation conducted at Lund. Four main areas ate covered: dialect, focus, phrasing, and dialogue. In our modelling of dialect variation in Swedish accentuation, the timing of pitch accents (H and L turning points) as well as the pitch realization of focus represent important criteria. The phonology and phonetics of focus, in Scandinavian languages are treated in outline. Our modelling of prosodic phrasing and its relation to accentuation is discussed. Finally our current project work on modelling intonation in spontaneous speech and dialogue is presented.\n",
    ""
   ]
  },
  "granstrom97_int": {
   "authors": [
    [
     "Björn",
     "Granström"
    ]
   ],
   "title": "Applications of intonation - an overview",
   "original": "inta_021",
   "page_count": 4,
   "order": 3,
   "p1": "21",
   "pn": "24",
   "abstract": [
    "As an introduction to the session on intonation applications we give an overview of some of the past and present applications of intonation research. The inherently confounded nature of information in the intonational manifestation poses a major obstacle. Despite this, we can see a number of application areas emerging, ranging from speech technology devices and systems to the use in medical diagnosis and rehabilitation. One especially interesting area is the pedagogical application of intonation research in language learning.\n",
    ""
   ]
  },
  "alter97_int": {
   "authors": [
    [
     "Kai",
     "Alter"
    ],
    [
     "H.",
     "Pirker"
    ]
   ],
   "title": "On the specification of sentence initial F0-patterns in German",
   "original": "inta_025",
   "page_count": 4,
   "order": 4,
   "p1": "25",
   "pn": "28",
   "abstract": [
    "It is widely accepted that linguistic high level information like information structure (focus-background-division, topicalization) influences accent placement and accent type (rising, falling, hat pattern etc.) in German. Previous research was concentrated on tonal patterns associated with focus and topic ([1],[2]). We will demonstrate that 1) sentence initial tonal variation and 2) syllable duration depend on the location and the type of focus in the sentence. We assume that focussed material forms its own prosodic domain. Both prosodic parameters show a significant variation depending on whether they are associated with prosodic categories inside or outside of focussed domains.\n",
    ""
   ]
  },
  "astesano97_int": {
   "authors": [
    [
     "C.",
     "Astesano"
    ],
    [
     "Robert",
     "Espesser"
    ],
    [
     "Emmanuel",
     "Flachaire"
    ],
    [
     "P.",
     "Nicolas"
    ]
   ],
   "title": "Tonal configurations of prominence in French",
   "original": "inta_029",
   "page_count": 4,
   "order": 5,
   "p1": "29",
   "pn": "32",
   "abstract": [
    "In this paper, we present a description of tonal configurations of prominence in French based on a multi-style corpus. This study is carried out within the typological framework developed in Aix depicting prominence on a functional basis. The phonetic correlates of the pre-defined accentual categories are investigated according to the dynamic properties of tonal variations, namely the slopes, timing and span of the 10 contours. This phonetic description is complemented by an attempt to predict membership of prominence for a particular accentual category using a regression model. This empirical investigation clearly validates the functional distinction of prominences on a tonal basis, although the inclusion of duration parameters seems necessary to improve the global predictions of the model.\n",
    ""
   ]
  },
  "bartkova97_int": {
   "authors": [
    [
     "Katarina",
     "Bartkova"
    ]
   ],
   "title": "Some experiments about the use of prosodic parameters in a speech recognition system",
   "original": "inta_033",
   "page_count": 4,
   "order": 6,
   "p1": "33",
   "pn": "36",
   "abstract": [
    "This paper summarises results of experiments related to the introduction of prosodic parameters in automatic speech recognition in French. The goal of using prosodic parameters was to improve speech recognition in real applications such as vocal services available in the telephone network [1]. The prosodic parameters studied were phoneme duration, pitch movement and phoneme intensity. They were used in a post-processing procedure of an automatic speech recognition system based on HMM modelling. The first set of experiments involved re-scoring the N-best solutions, supplied by the HMM modelling in order to reduce the recognition error rate. The second set of experiments aimed to improve, in a real application context, the rejection of incorrect tokens such as noise tokens and out-of-vocabulary words. It was shown that the prosodic parameters can be efficiently used to improve recognition performance either by recovering the HMM errors or by improving the rejection of incorrect tokens.\n",
    ""
   ]
  },
  "batliner97_int": {
   "authors": [
    [
     "Anton",
     "Batliner"
    ],
    [
     "Andreas",
     "Kießling"
    ],
    [
     "Ralf",
     "Kompe"
    ],
    [
     "Heinrich",
     "Niemann"
    ],
    [
     "Elmar",
     "Nöth"
    ]
   ],
   "title": "Can we tell apart intonation from prosody (if we look at accents and boundaries)?",
   "original": "inta_039",
   "page_count": 4,
   "order": 7,
   "p1": "39",
   "pn": "42",
   "abstract": [
    "Studies on prosody/intonation normally look for important (distinctive) features denoting linguistic contrasts in production, or perception experiments. The recent development in automatic speech processing and the availability of large speech data bases made it possible to have a fresh look at these topics. In our study, we classify automatically accent and boundary positions in a spontaneous speech corpus with a large feature vector comprising as many relevant prosodic features as possible. The results obtained for different subsets of prosodic features (F0, duration, energy, etc.) show that each feature class contributes to the marking of accents and boundaries, and that the best results can be achieved by simply using all feature subsets together. Finally, we discuss possible conclusions for prosodic theory and for the application of prosody in speech processing.\n",
    ""
   ]
  },
  "beaugendre97_int": {
   "authors": [
    [
     "Frédéric",
     "Beaugendre"
    ],
    [
     "David",
     "House"
    ],
    [
     "Dik J.",
     "Hermes"
    ]
   ],
   "title": "Accentuation boundaries in dutch, French and Swedish",
   "original": "inta_043",
   "page_count": 4,
   "order": 8,
   "p1": "43",
   "pn": "46",
   "abstract": [
    "This paper presents a comparative study investigating the relation between the timing of a rising or falling pitch movement and the syllable it accentuates for three different languages: Dutch, French and Swedish. In a perception experiment, the five-syllable utterances /mamamamama/ and /a.a.a.a.a/ were provided with a relatively fast rising or falling pitch movement. The timing of the movement was systematically varied so that it accented the third or the fourth syllable. Subjects were asked to indicate which syllable they perceived as accented. The accentuation boundary (AB) was then defined as the moment before which more than half of the subjects indicated the third syllable as accented and after which more than half of the subjects indicated the fourth syllable. The results show that there are significant differences between the different languages as to the location of the AB. In general, for the rises, well defined ABs were found, which for French were located in the middle of the vowel of the third syllable, while for Dutch and Swedish the ABs of the rises were located later in the vowel. For the falls, only for the Dutch and the Swedish listeners WAS a clear AB obtained. This was located at the end of the third syllable. For the French listeners, the fall did not yield a clear AB. This corroborates the absence of accentuation by means of falls in French. Finally, especially for the stimuli with the longer pauses between the /a/'s in Dutch, and perhaps Swedish, an interval was found were the fall induced ambiguity as to accent location.\n",
    ""
   ]
  },
  "botinis97_int": {
   "authors": [
    [
     "Antonis",
     "Botinis"
    ],
    [
     "Robert",
     "Bannert"
    ]
   ],
   "title": "Tonal perception of focus in Greek and Swedish",
   "original": "inta_047",
   "page_count": 4,
   "order": 9,
   "p1": "47",
   "pn": "50",
   "abstract": [
    "Ten Greek and thirteen Swedish listeners were asked to identify focus in a perceptual experiment with tonal manipulations in a reference ~ target experimental procedure for each language. The results indicate: 1. Listeners can reliably identify focal structures but not neutral ones. 2. Structural tonal manipulations have a bigger perceptual effect than tonal-range ones. 3. Focal tonal shifts have a categorical effect and override the conflicting cues of duration and intensity in Greek but not in Swedish. 4. Tonal neutralisations have a categorical effect in Swedish but not in Greek. In summary, tonal manipulations have a major perceptual effect for focus in both languages but in different ways.\n",
    ""
   ]
  },
  "brindopke97_int": {
   "authors": [
    [
     "Christel",
     "Brindöpke"
    ],
    [
     "Brigitte",
     "Schaffranietz"
    ]
   ],
   "title": "Evaluation of an intonation model for German spontaneous speech",
   "original": "inta_051",
   "page_count": 4,
   "order": 10,
   "p1": "51",
   "pn": "54",
   "abstract": [
    "In this paper we present an evaluation of an intonation model for German spontaneous speech. In contrast to the model developed by Adriaens [1] which is based on read speech and has been evaluated with regard to its acceptability for read speech of a single male speaker, our corpus involves spontaneous spoken utterances of male and female German speakers. Native speakers had to rate resynthesized originals versus stylized contours. Foreign (English) intonations patterns were used as a control group. The results of the experiment give sufficient support to the validity of the model as it stands for German spontaneous utterances.\n",
    ""
   ]
  },
  "brondsted97_int": {
   "authors": [
    [
     "Tom",
     "Brondsted"
    ]
   ],
   "title": "Intonation contours \"distorted\" by tone patterns of stress groups and word accents",
   "original": "inta_055",
   "page_count": 4,
   "order": 11,
   "p1": "55",
   "pn": "58",
   "abstract": [
    "The present paper discusses the question if the interrogative vs. declarative mode of (short, elliptical) utterances can be determined solely by observing the pitch over time. To some extent, this may implicitly be claimed by a widespread analytic model according to which intonation should be specified in terms of a running summation of local ups and downs. Certainly, in speech technology the same thing is claimed very directly by designers of stochastic prosodic classifiation modules trained on nothing but F0 contours. The paper concludes that this concept in many cases is too simple. Intonation contours may be \"destorted\" by local tone patterns of smaller units constituting the utterances- The smaller units discussed are stress groups and words or syllables. We suggest that a simple acoustic parameter \"energy\" is added to the F0 contour. The paper concentrates on Danish, however, attempts to relate the conclusions to other stress-timed languages and other languages with word accents.\n",
    ""
   ]
  },
  "bruce97b_int": {
   "authors": [
    [
     "Gösta",
     "Bruce"
    ],
    [
     "Marcus",
     "Filipsson"
    ],
    [
     "Johan",
     "Frid"
    ],
    [
     "Björn",
     "Granström"
    ],
    [
     "Kjell",
     "Gustafson"
    ],
    [
     "Merle",
     "Horne"
    ],
    [
     "David",
     "House"
    ]
   ],
   "title": "Global features in the modelling of intonation in spontaneous Swedish",
   "original": "inta_059",
   "page_count": 4,
   "order": 12,
   "p1": "59",
   "pn": "62",
   "abstract": [
    "In this paper, we present a model for the analysis and synthesis of intonation in spontaneous conversations in Swedish. The model is implemented in a computational environment, making it possible to generate F0 contours, which can be imposed on a speech waveform using the PSOLA technique. Testing and exploration of this analysis-by-synthesis system on spontaneous conversational speech have led to recent extensions in the analytical framework, as well as in the actual realisation of the prosodic transcription as F0 contours. In earlier versions of the model, phrase boundaries were treated similarly for all phrases, but now we make a distinction between a minor and a major boundary. Different intonational characteristics of the type of phrase boundary have consequently been implemented. We have also introduced a rule of downstepping, which is realised by successively lowering the valleys after the pitch gesture of an accented syllable.\n",
    ""
   ]
  },
  "caelenhaumont97_int": {
   "authors": [
    [
     "Genevieve",
     "Caelen-Haumont"
    ],
    [
     "Mariette",
     "Bessac"
    ]
   ],
   "title": "From reading to spontaneous dialogue: on the track of an information processing model to explain pitch variations in lexical words",
   "original": "inta_063",
   "page_count": 4,
   "order": 13,
   "p1": "63",
   "pn": "66",
   "abstract": [
    "The aim of this paper is to present the adaptation of a model of expected / unexpected information processing. This model, based on an extension of Prince's (1983) and then of Brown's (1983) in the domain of shared knowledge, is processed in our works, first on reading and then on spontaneous dialogue. On the ground of the first results on spontaneous speech, we try to compare the results and also the speaker's strategies for those two different kinds of speech.\n",
    ""
   ]
  },
  "campbell97_int": {
   "authors": [
    [
     "Nick",
     "Campbell"
    ],
    [
     "MaryBeckman",
     "MaryBeckman"
    ]
   ],
   "title": "Stress, prominence, and spectral tilt",
   "original": "inta_067",
   "page_count": 4,
   "order": 14,
   "p1": "67",
   "pn": "70",
   "abstract": [
    "This paper examines spectral correlates of stress and accent in a corpus of sentences with varying focus, produced by four speakers of American English. Analyses of the spectrum at vowel centre show a clear effect on the spectral tilt - i.e. more energy at higher frequencies relative to energy nearer to the fundamental - when the vowel is in a nuclear-accented syllable. However, unlike in the Dutch corpus examined by Sluijter & van Heuven, there was no difference in spectral tilt between vowels in stressed versus unstressed syllables in the absence of the accompanying intonational prominence contrast. These results lend support to the hypothesis that syllables marking focal prominence are phonated in a more emphatic way than other syllables. That is, accented syllables may be louder and not simply intonationally prominent, but this effect does not distinguish an independent lexically specified level of 'primary stress' between the intonational prominence of accent and the basic rhythmic contrast between strong (full) and weak (reduced) syllables.\n",
    ""
   ]
  },
  "campione97_int": {
   "authors": [
    [
     "Estelle",
     "Campione"
    ],
    [
     "Emmanuel",
     "Flachaire"
    ],
    [
     "Daniel",
     "Hirst"
    ],
    [
     "Jean",
     "Veronis"
    ]
   ],
   "title": "Stylisation and symbolic coding of F0: a quantitative model",
   "original": "inta_071",
   "page_count": 4,
   "order": 15,
   "p1": "71",
   "pn": "74",
   "abstract": [
    "This paper presents a reversible model for the stylisation and the symbolic coding of macroprosodic fundamental frequency patterns. Prosodic labels are generated automatically from the speech signal and can be used to regenerate a synthetic F0 curve which is as close as possible to the original curve. The model has been tested successfully for 20 speakers in French and Italian.\n",
    ""
   ]
  },
  "motagorriz97_int": {
   "authors": [
    [
     "Carme de la",
     "Mota Gorriz"
    ]
   ],
   "title": "Prosody of sentences with contrastive new information in Spanish",
   "original": "inta_075",
   "page_count": 4,
   "order": 16,
   "p1": "75",
   "pn": "78",
   "abstract": [
    "Contrastive new information can be highlighted in some languages by means of prosody. The aim of this paper is to study the properties of sentences with this kind of informative salience in Spanish. The results obtained show that the prosodic manifestation of phonological significance associated with the new input highlighted by contrast implies a variation of the basic stress pattern, which includes the inhibition of the regular dissociation between F0 peak and stress.\n",
    ""
   ]
  },
  "delaney97_int": {
   "authors": [
    [
     "Martina",
     "Delaney"
    ],
    [
     "Alex I. C.",
     "Monaghan"
    ]
   ],
   "title": "SAMBA: prosody in an airline announcement generation system",
   "original": "inta_079",
   "page_count": 4,
   "order": 17,
   "p1": "79",
   "pn": "82",
   "abstract": [
    "This paper describes a text-to-speech (TTS) application for airline announcements which enables airport staff to specify the type and content of a synthetic announcement. This is a limited domain similar to that for train announcements or other successful restricted-vocabulary systems. Our system demonstrates the possibility of producing natural-sounding prosody automatically for a specified application. Within our chosen domain, we have access to the semantic and pragmatic knowledge which is essential for generating high-quality synthetic prosody. We combine this information with a sophisticated linguistic approach to prosody specification. These two aspects of our system allow it to supersede the unnatural and often unintelligible automatic announcement systems found in many current commercial applications.\n",
    ""
   ]
  },
  "cristo97_int": {
   "authors": [
    [
     "Albert Di",
     "Cristo"
    ],
    [
     "Philippe Di",
     "Cristo"
    ],
    [
     "Jean",
     "Veronis"
    ]
   ],
   "title": "A metrical model of rhythm and intonation for French text-to-speech synthesis",
   "original": "inta_083",
   "page_count": 4,
   "order": 18,
   "p1": "83",
   "pn": "86",
   "abstract": [
    "This paper presents the prosodic component of a French text-to-speech synthesis system based on a metrical model of rhythm and intonation in which the prosodic well-formedness of utterances is governed by a set of rhythmic and morphosyntactic constraints. We first set out the theoretic basis of the generation of prosodic levels that correspond to the metrical and tonal structure of utterances. Then, we outline the implementation in our system, and, in particular, the prosodic module that produces a metrical interpretation of phrase-level parsed text, by computing relative prominence levels and generating the F0 patterns and segmental duration. This approach produces high quality results for text-to-speech synthesis at a very minimal implementation cost, and enables a realistic modelling of the prosodic variability observed in real speech.\n",
    ""
   ]
  },
  "dimperio97_int": {
   "authors": [
    [
     "Mariapaola",
     "D'Imperio"
    ]
   ],
   "title": "Narrow focus and focal accent in the neapolitan variety of Italian",
   "original": "inta_087",
   "page_count": 4,
   "order": 19,
   "p1": "87",
   "pn": "90",
   "abstract": [
    "Italian questions are expressed, differently from English and similarly to languages like Hungarian [4], by prosodic means alone. In the Neapolitan variety, yes/no questions with early focus present a very salient pitch accent on the focused constituent, which is followed by a smaller pitch obtrusion associated to the last stressed syllable of the intonation phrase. Results of a perception study showed that the later accent is not perceived as a focal prominence, despite the fact that it is in the position of the nuclear accent in broad focus contours. A spoken corpus of yes/no questions with narrow and broad focus was later analyzed, revealing systematic phonetic differences between the focal pitch-accent and the postfocal accent. Specifically, the postfocal accent presents a more shallow melodic movement, while its peak occurs earlier in the syllable than the focal accent peak.\n",
    ""
   ]
  },
  "dimperio97b_int": {
   "authors": [
    [
     "Mariapaola",
     "D'Imperio"
    ],
    [
     "Barbara",
     "Gili Fivela"
    ]
   ],
   "title": "Focus, phrasing and boundary phenomena in Italian read speech",
   "original": "inta_091",
   "page_count": 4,
   "order": 20,
   "p1": "91",
   "pn": "94",
   "abstract": [
    "One of the phenomena generally used in defining the Phonological Phrase (cp) domain is Raddoppiamento Sintattico (RS), a sandhi rule of Central and Southern varieties of Italian. The application or lack of this rule has also been invoked as evidence for prosodic boundary insertion due to focus restructuring. Our study explores the relationship between phrasing induced by focus and phrasing generated by the Prosodic Phonology component. Though RS is indeed blocked by focus, as predicted by the theory, the prosodic break created is different in strength compared to phonological phrase boundaries that are not produced by focus restructuring. We also show that in another variety of Italian, where RS is not found, it is still possible to observe comparable boundary strength differences.\n",
    ""
   ]
  },
  "ding97_int": {
   "authors": [
    [
     "H.",
     "Ding"
    ],
    [
     "Jörg",
     "Helbig"
    ]
   ],
   "title": "Natural tone contours in a Mandarin Chinese speech synthesizer",
   "original": "inta_095",
   "page_count": 4,
   "order": 21,
   "p1": "95",
   "pn": "98",
   "abstract": [
    "This paper describes the introduction of natural tone contours in a syllable-based Chinese speech synthesis system. The speech units are waveforms of monosyllables extracted from carrier sentences. In order to maintain the natural tone contours, the syllables were recorded with all possible tonal variation. Using the PSOLA algorithm, the sentence intonation contour is overlayed by the unit inherent tone structures. The intonation modell was applied to synthesize simple sentences and a listening test was conducted to test the acceptance of the model. It shows that the approach can provide a high naturalness of the resulting intonation patterns and preserves the variability of tone contours.\n",
    ""
   ]
  },
  "dogil97_int": {
   "authors": [
    [
     "Grzegorz",
     "Dogil"
    ],
    [
     "J.",
     "Kuhn"
    ],
    [
     "Jörg",
     "Mayer"
    ],
    [
     "Gregor",
     "Möhler"
    ],
    [
     "S.",
     "Rapp"
    ]
   ],
   "title": "Prosody and discourse structure: issues and experiments",
   "original": "inta_099",
   "page_count": 4,
   "order": 22,
   "p1": "99",
   "pn": "102",
   "abstract": [
    "In this report we summarize the approach of examining structural relations between prosody and discourse semantics by means of experimental phonetics. We sketch the computational basis of the project, its methodological setting, and we present the results of three experiments on: the role of local prominence in disambiguation of focal adverbs the role of relative prominence in anaphora resolution the role of global prominence [register features] in discourse structure.\n",
    ""
   ]
  },
  "douglascowie97_int": {
   "authors": [
    [
     "Ellen",
     "Douglas-Cowie"
    ],
    [
     "R.",
     "Cowie"
    ]
   ],
   "title": "Macrostructures in prosody: the case of phonecalls",
   "original": "inta_103",
   "page_count": 4,
   "order": 23,
   "p1": "103",
   "pn": "106",
   "abstract": [
    "A study of business phone calls provides quantitative evidence suggesting 'intonational settings': certain attributes of intonation are sustained through discourse units, and differentiate one unit from another, as if phonologically significant aspects of intonation are realised within a space controlled by discourse-related parameters. Two types of parameter emerge, one controlling stretch /compression of the F0 contour in frequency space, the other in temporal space.\n",
    ""
   ]
  },
  "dusterhoff97_int": {
   "authors": [
    [
     "Kurt",
     "Dusterhoff"
    ],
    [
     "Alan W.",
     "Black"
    ]
   ],
   "title": "Generating F0 contours for speech synthesis using the tilt intonation theory",
   "original": "inta_107",
   "page_count": 4,
   "order": 24,
   "p1": "107",
   "pn": "110",
   "abstract": [
    "This paper presents a method for generating F0 contours for a speech synthesis system using the Tilt intonation theory ([10], [9]). The Tilt theory offers an abstract description of natural F0 contours which may be derived automatically from natural speech. Given a speech database labelled with Tilt events, this paper shows how that data may be used to train a model which can adequately predict Tilt parameters from features available in a text to speech system and hence produce natural sounding F0 contours. After a short description of the Tilt theory, the database used and the necessary features used to generate the parameters are presented. For comparison, this work is contrasted with a previous similar experiment on the same database using the ToBI intonation labelling system [2]. The Tilt method not only produces better results (RMSE 32.5 and correlation 0.60) but as it offers automatic labelling of data, it promises the ability to more easily train from general speech databases.\n",
    ""
   ]
  },
  "fant97_int": {
   "authors": [
    [
     "Gunnar",
     "Fant"
    ],
    [
     "Anita",
     "Kruckenberg"
    ],
    [
     "S.",
     "Hertegard"
    ],
    [
     "Johan",
     "Liljencrants"
    ]
   ],
   "title": "Accentuation and subglottal pressure in Swedish",
   "original": "inta_111",
   "page_count": 4,
   "order": 25,
   "p1": "111",
   "pn": "114",
   "abstract": [
    "A recent study of sub- and supraglottal pressures in speech has widened the basis for analysis of the physical correlates of stress and accentuation in Swedish. In order to establish a tie to perception we have performed assessments of relative syllable prominence on a continuous interval scale. The relative importance of duration, F0, intensity, source spectral slope and segmental contrasts are discussed. As outlined in more detail in [6], the transglottal pressure together with F0 is a main determinant of the voice source excitation amplitude Ee and thus of the sound pressure level. Special attention has been devoted to the nature of focal accent 1 and accent 2 and their relation to continuously scaled physical and perceptual data.\n",
    ""
   ]
  },
  "farnetani97_int": {
   "authors": [
    [
     "Edda",
     "Farnetani"
    ],
    [
     "C.",
     "Zmarich"
    ]
   ],
   "title": "Prominence patterns in Italian: an analysis of F0 and duration",
   "original": "inta_115",
   "page_count": 4,
   "order": 26,
   "p1": "115",
   "pn": "118",
   "abstract": [
    "This study deals with the suprasegmental structure of trisyllabic nouns with varying stress position in short SV and VS sentences. It investigates the effects of focus structure (contrastive focus vs broad focus vs no focus condition), on F0 patterns and durations. For F0, four pitch movement categories were identified and analyzed in terms of F0 onset/offset time, location of F0 peaks, excursions and rates of F0 movements. The results indicate that the durations of the target nouns are little affected by focus structure, suggesting, especially for final defocused words, that the speakers intended to preserve the stressed/unstressed relation also in absence of pitch movements. Extensive pitch movements were observed in sentence initial position in both broad focus and pre-focal conditions, but were never observed in post-focal condition. The finding that pre-focal words can be characterized by extensive pitch movements suggests that the intended focus structure can be realized and perceived also in this case, provided that the focus on final word is correctly realized.\n",
    ""
   ]
  },
  "fitzpatrickcole97_int": {
   "authors": [
    [
     "J.",
     "Fitzpatrick-Cole"
    ],
    [
     "Aditi",
     "Lahiri"
    ]
   ],
   "title": "Focus, intonation and phrasing in bengali and English",
   "original": "inta_119",
   "page_count": 4,
   "order": 27,
   "p1": "119",
   "pn": "122",
   "abstract": [
    "In this paper we compare focus intonation in Bengali and English, particularly with respect to phrasing. Bengali marks the beginning of focus with a pitch accent and the end of focus with a phrasal tone, i.e. there is a phrase break at the right edge of focus. English marks the end of focus with a pitch accent and arguably a phrase break. But evidence from intonation and the Rhythm Rule suggest that there is a phrase break at the left edge of focus. Indeed, a left phrase break distinguishes apparent cases of ambiguity between word and phrasal focus.\n",
    ""
   ]
  },
  "fretheim97_int": {
   "authors": [
    [
     "Thorstein",
     "Fretheim"
    ],
    [
     "Wim van",
     "Dommelen"
    ],
    [
     "Randi Alice",
     "Nilsen"
    ]
   ],
   "title": "Intonational phrasing, clause order, and concessive interpretation of norwegian conditionals",
   "original": "inta_123",
   "page_count": 4,
   "order": 28,
   "p1": "123",
   "pn": "126",
   "abstract": [
    "A listening experiment reveals that intonational phrasing differentiates successfully between a regular if-then interpretation and a concessive interpretation of Norwegian conditionals when the clause order is main clause (expressing the 'apodosis') first, conditional clause (expressing the 'protasis') last, and that it appears to be a less successful procedural device when the order of clauses is reversed. The general immediate impression that intonational phrasing is a poor disambiguator when the protasis precedes the apodosis is seen to be in need of some qualification, however, once the interaction of intonational phrasing and conventional lexical means of expressing the concessive even if meaning in spoken Norwegian is taken into consideration.\n",
    ""
   ]
  },
  "frota97_int": {
   "authors": [
    [
     "Sonia",
     "Frota"
    ]
   ],
   "title": "Association, alignment, and meaning: the tonal sequence HL and focus in european portuguese",
   "original": "inta_127",
   "page_count": 4,
   "order": 29,
   "p1": "127",
   "pn": "130",
   "abstract": [
    "This study investigates the defining features of two different nuclei in £. Portuguese declarative intonation: the neutral HL and the focus HL. Confirming previous analyses, evidence is provided for the organisation of the H and L targets in bitonal accents, and not in sequences of monotonal accent and edge tone. The two bitonal nuclei are further shown to differ with respect to the alignment of the tonal targets with the segmental string, the stability of H and L alignment, and the (independence of one target alignment relative to the other. By providing evidence for a H+L*/H*+L contrast, the results contribute to the definition of the phonetic exponents of association and to the characterisation of leading and trailing tones. Further, they strengthen the argument for pitch accent structure, and for the tonal target view of intonation primes.\n",
    ""
   ]
  },
  "fujisaki97_int": {
   "authors": [
    [
     "Hiroya",
     "Fujisaki"
    ],
    [
     "Sumio",
     "Ohno"
    ]
   ],
   "title": "Comparison and assessment of models in the study of fundamental frequency contours of speech",
   "original": "inta_131",
   "page_count": 4,
   "order": 30,
   "p1": "131",
   "pn": "134",
   "abstract": [
    "This paper examines the underlying assumptions, simplifications, and supporting evidences for a variety of models thus far presented for the analysis, interpretation and synthesis of fundamental frequency contours of speech, and gives examples of quantitative comparison of some of the models. It also discusses the role of a model as a mediator between various types of information and an observed F0 contour.\n",
    ""
   ]
  },
  "gaminde97_int": {
   "authors": [
    [
     "I.",
     "Gaminde"
    ],
    [
     "I.",
     "Hernaez"
    ],
    [
     "B.",
     "Etxebarria"
    ],
    [
     "P.",
     "Etxeberria"
    ]
   ],
   "title": "An analysis of the intonation for a pitch accent variety of the basque language",
   "original": "inta_137",
   "page_count": 4,
   "order": 31,
   "p1": "137",
   "pn": "140",
   "abstract": [
    "In this paper we present the results of the analysis of the intonation for a pitch-accent variety of the Basque language. This variety is characterized by a distinctions between lexically accented words and non accented ones. This propriety have a great influence on the final intonation curve on sentences. The accent is realized as an H*L tonal melody, and conflicts between focal and lexical accents appear in the sentences construction process. Results show that different structures can be found according to the relative position of the accents. Intonation curves of declarative affirmative and questions are described.\n",
    ""
   ]
  },
  "garcialecumberri97_int": {
   "authors": [
    [
     "Maria Luisa",
     "Garcia Lecumberri"
    ],
    [
     "Mercedes",
     "Cabrera Abreu"
    ],
    [
     "John A.",
     "Maidment"
    ]
   ],
   "title": "The realisation of focal accent in English and Spanish: similarities and differences",
   "original": "inta_141",
   "page_count": 4,
   "order": 32,
   "p1": "141",
   "pn": "144",
   "abstract": [
    "In this paper we present and analyse some Spanish and English utterances of two distinct types: (a) focus-initial utterances, (b) focus-medial utterances. The data used is a selection from that found in Garcia Lecumberri [1]. The analysis is based on Pierrehumbert [2} which analyses pitch contours in terms of two tones, H(igh) and L(ow). Our generalisations about the intonational realisation of initial focus is that in both languages, it is realised as H* accents. However, there are striking differences between English and Spanish in focus medial utterances, particularly in the treatment of pre-focal material. In English, pre-focal accents are realised as H* tones, whereas in Spanish, these accents are realised as L*+H tones. In addition, there is downstep in focal accents in Spanish, something which does not occur in the English data. We discuss two alternative treatments of the Spanish medial accent pitch patterns and speculate briefly on the implications of these for intonational theory.\n",
    ""
   ]
  },
  "garding97_int": {
   "authors": [
    [
     "Eva",
     "Garding"
    ],
    [
     "Jialu",
     "Zhang"
    ]
   ],
   "title": "Tempo effects in Chinese prosodic patterns",
   "original": "inta_145",
   "page_count": 4,
   "order": 33,
   "p1": "145",
   "pn": "148",
   "abstract": [
    "This paper is a study of how speech rate (normal, fast and slow) influences temporal and tonal patterns in Standard Chinese. The main effect of a shift of tempo from slow to fast is a compression and an upward movement of the overall pitch range while the number of turning points and their positions relative to the segments are well retained. In the time domain there is a lengthening of about 50% from normal to slow and a shortening of about 25% from normal to fast speech. This compression is not uniform. For the higher tempo the last constituent increases in relative duration and prominence at the expense of the segments of the first constituent. The larger number of lexically pitch-determined syllables in a Chinese sentence makes the prosodic patterns of Chinese differ from some European languages.\n",
    ""
   ]
  },
  "gavat97_int": {
   "authors": [
    [
     "I.",
     "Gavat"
    ],
    [
     "M.",
     "Zirra"
    ],
    [
     "O.",
     "Cula"
    ]
   ],
   "title": "Intonation estimation for romanian language",
   "original": "inta_149",
   "page_count": 4,
   "order": 34,
   "p1": "149",
   "pn": "152",
   "abstract": [
    "We propose a method to estimate prosodic features from pitch contours combined with energy contours, extracting information about: the lexical stress, the melody in the sentence and the duration of all segments in the utterances. To determine F0 contours, we have utilised two methods for pitch detection: a nonlinear variant for a cepstrum pitch detector which works very effectively in the range of medium pitch periods and stationary segments and an event based pitch detector applying the dyadic wavelet transform proposed by Mallat, which can correctly estimate the pitch variation for nonstationary and also for noisy segments of large varying length. The speech material consisting in 50 sentences, 36 affirmative, 7 exclamative and 7 interrogative, uttered by 3 male and 2 female speakers, was analysed by combining pitch and energy contours, and the results were compared with results obtained by manually segmenting and stressing of the same speech material. In mean 92,59% of the situations were correct for lexical stress, 90,3% for word boundaries and 84% for global phrase intonation.\n",
    ""
   ]
  },
  "goldman97_int": {
   "authors": [
    [
     "Jean-Philippe",
     "Goldman"
    ],
    [
     "Eric",
     "Wehrli"
    ]
   ],
   "title": "Deriving prosodic patterns from syntactic structures: the cases of extraposition, clefts and parentheticals",
   "original": "inta_153",
   "page_count": 4,
   "order": 35,
   "p1": "153",
   "pn": "156",
   "abstract": [
    "This paper discusses some of the features of the prosodic module of the FipsVox French text-to-speech system under development at LATL. The prosodic parameters are determined on the basis of (i) a detailed GB-style syntactic parse of the input sentences, (ii) a grapheme-to-phoneme conversion module, and (iii) a small set of standard intonation rules combined with a perceptual approach. We will illustrate the derivation of prosodic patterns with examples of constructions involving the extraposition of a constituant as in cleft, heavy-NP shift and left-dislocation structures, as well as some cases of parentheticals.\n",
    ""
   ]
  },
  "grabe97_int": {
   "authors": [
    [
     "Esther",
     "Grabe"
    ]
   ],
   "title": "Comparative intonational phonology: English and German",
   "original": "inta_157",
   "page_count": 4,
   "order": 36,
   "p1": "157",
   "pn": "160",
   "abstract": [
    "This paper presents a selection of results from an autosegmental-metrical comparison of intonation in Northern Standard German and Southern British English. Evidence from a cross-linguistically comparable corpus of speech data suggests that the languages share a common inventory of phonological representations but differ in the way these representations are realised phonetically. Evidence for a shared tonal inventory comes from a discussion of intonation phrase boundaries and evidence for a difference in phonetic realisation from differences in pitch accent accommodation effects.\n",
    ""
   ]
  },
  "grabe97b_int": {
   "authors": [
    [
     "Esther",
     "Grabe"
    ],
    [
     "Carlos",
     "Gussenhoven"
    ],
    [
     "Judith",
     "Haan"
    ],
    [
     "E.",
     "Marsi"
    ],
    [
     "B.",
     "Post"
    ]
   ],
   "title": "The meaning of intonation phrase onsets in dutch",
   "original": "inta_161",
   "page_count": 4,
   "order": 37,
   "p1": "161",
   "pn": "164",
   "abstract": [
    "This paper investigates the pragmatic effect of the pitch of initial unstressed syllables - or \"onset' - before the first pitch accent in Dutch intonation contours. The experimental investigation presented here explored two hypotheses: (a) a different choice of onset (high or low) signals a difference in meaning, and (b) the onset is morphologically independent. The finding that onsets contribute significantly to the interpretation of utterances confirmed our first hypothesis. However, we also found that, contrary to the view held in the literature, the attitude signalled by onsets depends on the following pitch accent.\n",
    ""
   ]
  },
  "grover97_int": {
   "authors": [
    [
     "C.",
     "Grover"
    ],
    [
     "Barbara",
     "Heuft"
    ],
    [
     "Bert Van",
     "Coile"
    ]
   ],
   "title": "The reliability of labelling word prominence and prosodic boundary strength",
   "original": "inta_165",
   "page_count": 4,
   "order": 38,
   "p1": "165",
   "pn": "168",
   "abstract": [
    "This paper investigates the reliability of two prosodic labelling methods. We conducted experiments with 3 subjects on transcribing word prominence and prosodic boundary strength for American English. The reliability of transcription using two scales was compared: a scale of 4 values and a scale of unlimited values. We measured reliability in several ways, and obtained consistent results. The transcriptions yielded higher correlations using the smaller 4 value scale for prosodic boundary strength (PBS), but for word prominence the unlimited scale of values was applied more reliably. In practice the scale of unlimited values can be reduced to a scale of 10 values.\n",
    ""
   ]
  },
  "gussenhoven97_int": {
   "authors": [
    [
     "Carlos",
     "Gussenhoven"
    ],
    [
     "Toni",
     "Rietveld"
    ]
   ],
   "title": "Empirical evidence for the contrast between l* and h* in dutch rising contours",
   "original": "inta_169",
   "page_count": 4,
   "order": 39,
   "p1": "169",
   "pn": "172",
   "abstract": [
    "A Dutch accent-lending rising intonation contour can be realised either as a rise that begins low and ends mid-to-high (henceforth 'low rise'), or as a rise that begins mid and ends high (henceforth 'high rise'). These two contours can either be seen as the extremes on a continuum of phonetically different realisations of the same phonological contour L*H H%, or as phonetic realisations of two phonologically different contours, L*H H% and H* H%. One property that potentially distinguishes L-tones from H-tones is their behaviour under variation in pitch range. H* is generally claimed to be higher as the pitch range increases, and at least some researchers have claimed that L* is lower as the pitch range is increased. Our approach to the issue of the phonological status of high and low rises in Dutch took this hypothesis as its point of departure. To this end, we manipulated the F0 contours of four utterances, so as to produce a range of stimuli for each of them, which represented high rises and low rises in a number of different pitch ranges. Listeners were asked to indicate the degree to which each of these stimuli expressed 'Surprise' The results lend support to the hypothesis that the low rise and the high rise are categorically distinct contours of Dutch.\n",
    ""
   ]
  },
  "haan97_int": {
   "authors": [
    [
     "Judith",
     "Haan"
    ],
    [
     "Vincent J. van",
     "Heuven"
    ],
    [
     "Jos J. A.",
     "Pacilly"
    ],
    [
     "Renée van",
     "Bezooijen"
    ]
   ],
   "title": "Intonational characteristics of declarativity and interrogativity in dutch: a comparison",
   "original": "inta_173",
   "page_count": 4,
   "order": 40,
   "p1": "173",
   "pn": "176",
   "abstract": [
    "Intonational characteristics of two major communicative functions, declarativity and intenogativity, were compared and contrasted by systematically varying statements and several question types. It was hypothesized that, in Dutch, interrogativity distinguishes itself from declarativity by high(er) pitch, both local and global. On a local level, interrogative utterances were found to have high onsets as well as high offsets. Globally, interrogativity caused utterances to be realized in a higher and a narrower register. Also, in questions all-points regression lines lacked the steady decline of F0 characteristic of declarativity. However, among the various question types these properties are by no means evenly distributed. Thus each sentence type has a characteristic pitch profile of its own; the data suggest that this is brought about, among other things, by pragmatic factors affecting (de)accentuation patterns.\n",
    ""
   ]
  },
  "hermes97_int": {
   "authors": [
    [
     "Dik J.",
     "Hermes"
    ],
    [
     "Frédéric",
     "Beaugendre"
    ],
    [
     "David",
     "House"
    ]
   ],
   "title": "Temporal alignment of accentuation boundaries in dutch",
   "original": "inta_177",
   "page_count": 4,
   "order": 41,
   "p1": "177",
   "pn": "180",
   "abstract": [
    "This study is concerned with the temporal alignment of accent-lending pitch movements within the structure of the syllables they accentuate. The experiments were carried out with reiterant utterances consisting of five syllables of the type /a/, /Ca/, /CCa/ or /CCCa/. The middle three syllables were exact replicates of each other as to duration and spectral content. The timing of the pitch movements, rises and falls, was systematically varied in such a way that they accented the third or the fourth syllable. Subjects were asked to indicate which syllable they perceived as accented. The accentuation boundary (AB) was then defined as the moment before which more than half of the subjects indicated the previous syllable as accented and after which more than half of the subjects indicated the next syllable. In order to find out to which segments of the utterance the AB is linked to, the temporal relation was investigated between this AB and the vowel offset, the voicing onset, the vowel onset, and the perceptual moment of occurrence of the syllable, i.e. the P-center. The results show that, in Dutch, the AB of rises is linked to the vowel offset of the syllable, while the accentuation boundary of falls is most closely linked to the vowel onset.\n",
    ""
   ]
  },
  "heuft97_int": {
   "authors": [
    [
     "Barbara",
     "Heuft"
    ],
    [
     "Thomas",
     "Portele"
    ]
   ],
   "title": "Comparing two methods of developing a rule system for prosody",
   "original": "inta_181",
   "page_count": 4,
   "order": 42,
   "p1": "181",
   "pn": "184",
   "abstract": [
    "We compare two methods for developing a rule system for synthetic prosody: hand crafted rules and rules generated by automatic training using the regression tree approach. Measured numerically, the output of both systems and their performance in predicting is very similar. A perceptual study, however, reveals thai the hand-crafted rules yield a more acceptable synthetic prosody.\n",
    ""
   ]
  },
  "hirose97_int": {
   "authors": [
    [
     "Keikichi",
     "Hirose"
    ],
    [
     "Hiromichi",
     "Kawanami"
    ],
    [
     "Nobuyuki",
     "Ihara"
    ]
   ],
   "title": "Analysis of intonation in emotional speech",
   "original": "inta_185",
   "page_count": 4,
   "order": 43,
   "p1": "185",
   "pn": "188",
   "abstract": [
    "Prosodic features were analyzed for utterances with various kinds of attitude and emotion and were compared to those of reading speech. The results clearly showed the lack of declination in fundamental frequency contours of emotional speech, which was mainly due to rather large phrase components at phrase boundaries. Although several tendencies were obtained for the prosodic features of emotional speech, they were subjected to rather large speaker to speaker variations; indicating that an attitude/emotion can be expressed in different ways and should have a wide variety in its levels and types. Perceptual experiments were also conducted using synthetic speech whose prosodic features were modified during the analysis-resynthesis process. The results showed the relative importance of speech rates, but also showed large variations depending on the speaker of the original utterances.\n",
    ""
   ]
  },
  "hirschberg97_int": {
   "authors": [
    [
     "Julia",
     "Hirschberg"
    ],
    [
     "Cinzia",
     "Avesani"
    ]
   ],
   "title": "The role of prosody in disambiguating potentially ambiguous utterances in English and Italian",
   "original": "inta_189",
   "page_count": 4,
   "order": 44,
   "p1": "189",
   "pn": "192",
   "abstract": [
    "We investigate the role that intonation plays in disambiguating potentially ambiguous utterances in English and Italian, to see a) whether speakers employ intonational means to disambiguate these utterances, and b) whether speakers of the two languages employed consistently different intonational strategies in this disambiguation. We find that, while some semantic phenomena are consistently disambiguated by both sets of speakers, the syntactic phenomena tested are not. We suggest a possible explanation for this disparity.\n",
    ""
   ]
  },
  "jun97_int": {
   "authors": [
    [
     "Sun-Ah",
     "Jun"
    ],
    [
     "Gorka",
     "Elordieta"
    ]
   ],
   "title": "Intonational structure of lekeitio basque",
   "original": "inta_193",
   "page_count": 4,
   "order": 45,
   "p1": "193",
   "pn": "196",
   "abstract": [
    "The pitch accent in Lekeitio Basque (LB) is realized as H*L on the penult of an underlyingly accented word or on the final syllable of a derived accented word, (=underlyingly unaccented, but accented in a preverbal position). Elordieta claimed that LB has an Accentual Phrase (AP) demarcated by H*L; thus, unaccented words in non-preverbal position never form one AP. It has also been assumed that the peak of H*L is the same whether it is underlying or not. However, results of a phonetic experiment show that unaccented words can form one AP, thus eliminating the H* tone leftward spreading rule. Also, we found that the underlying pitch accent is significantly higher than the derived pitch accent. Finally, an Intonation Phrase final vowel is significantly lengthened while vowels at the end of AP or Intermediate Phrase are not.\n",
    ""
   ]
  },
  "konopczynski97_int": {
   "authors": [
    [
     "Gabrielle",
     "Konopczynski"
    ],
    [
     "S.",
     "Santi"
    ],
    [
     "M.",
     "Embarki"
    ],
    [
     "R.",
     "Bertrand"
    ]
   ],
   "title": "F0 declination line: new evidence from infants and children's speech (9-36 months), a preliminary research",
   "original": "inta_199",
   "page_count": 4,
   "order": 46,
   "p1": "199",
   "pn": "202",
   "abstract": [
    "In this preliminary study, we examine the F0 declination line (F0DL) between the age of 9 months, when the child still babbles, and the age of 30 months when a first language, with some longer and complex sentences, is already acquired. An instrumental analysis (Pitch detection, F0 curves) was conducted. We computed a linear regression on all detected F0 values and we tested statistically its significance. The first results show that both situation of communication (solitary vs interaction with an adult) and age influence the presence and use of FoDL. Its physiological and phonological aspects in communication and language development are discussed.\n",
    ""
   ]
  },
  "koval97_int": {
   "authors": [
    [
     "Serguei",
     "Koval"
    ],
    [
     "Michael",
     "Khitrov"
    ],
    [
     "Andrey",
     "Raev"
    ]
   ],
   "title": "Working technology for melody investigation and check-up of pitch detection correctness",
   "original": "inta_203",
   "page_count": 4,
   "order": 47,
   "p1": "203",
   "pn": "206",
   "abstract": [
    "For some tasks (e.g. medical, forensic, educational applications) it is important to know the very real pitch. So there is a problem to check-up the correctness of any concrete pitch contour for long speech records for any pitch detection method. Besides it would be useful to see the degree of signal periodicity without strong decision voice/noise. The new homomorphic method of signal periodicity degree detection with analysis frame length in proportion to the time-lag is described. The powerful working approach to visual analysis of speech signal periodicity is proposed. This Voicegrams method of speech periodicity representation ensures the practical correctness of pitch estimation and allows to find periodicity degree for poor quality signal.\n",
    ""
   ]
  },
  "lint97_int": {
   "authors": [
    [
     "Lisa",
     "Lint"
    ]
   ],
   "title": "Intonation patterns characterising three ethnic varieties of English in singapore: observations and implications",
   "original": "inta_207",
   "page_count": 4,
   "order": 48,
   "p1": "207",
   "pn": "210",
   "abstract": [
    "This paper begins by describing research conducted on the intonation of three ethnic varieties of Singapore English. However, it does hot simply address the phonetic facts, but also compels us to reflect on other perhaps more abstract and basic issues. A question raised is, taking into account the systematic variation in the intonation patterns exhibited by the ethnic groups, what the underlying representation of the intonation of SE and its unit of analysis might be. This leads us to consider whether such concepts as 'nucleus', for example, are applicable in the varieties of English found in Singapore (and in other non-Southern British English varieties?), and hence whether employing the traditional British model of intonation for describing and analysing intonation patterns in Singapore English is appropriate.\n",
    ""
   ]
  },
  "madureira97_int": {
   "authors": [
    [
     "Sandra",
     "Madureira"
    ],
    [
     "Mario A. S.",
     "Fontes"
    ]
   ],
   "title": "Fundamental contours in brazilian portuguese words",
   "original": "inta_211",
   "page_count": 4,
   "order": 49,
   "p1": "211",
   "pn": "214",
   "abstract": [
    "This study investigates fundamental frequency variations in oxytons, paroxytons and proparoxytons in Brazilian Portuguese in order to set up patterns to reconstruct word contours according to the location of the stressed syllables in the word. It takes into account fundamental frequency contours in Brazilian Portuguese and is meant to contribute to the research on prosodic features for the ongoing project on text-to-speech system for Brazilian Portuguese. A database has been developed to relate prosodic[2], grammatical and acoustic information in the system. One of linguistic levels in the tables of the database in the word. In the arrays of the table which describes the word, among others, the following features can be related: number of syllables, stress pattern, location of the unstressed syllables in relation to the stressed and initial and final fundamental frequency values. The correlation among these features can be used to implement the rules to generate the fundamental frequency word contours.\n",
    ""
   ]
  },
  "maghbouleh97_int": {
   "authors": [
    [
     "Arman",
     "Maghbouleh"
    ]
   ],
   "title": "Prosodic phrasing without syntax via part-of-speech amalgamation",
   "original": "inta_215",
   "page_count": 4,
   "order": 50,
   "p1": "215",
   "pn": "218",
   "abstract": [
    "This paper describes a set of regression models for predicting prosodic phrasing, ToBI break indices, from text. Two notable features of the models are the use of a variable-length window of information, and the use of easily extractable features, such as automatically determined part-of-speech tags. The models are especially useful for text-to-speech systems which often do not have access to computationally expensive information such as syntactic parses or derived information structure. This paper reports results of training and testing on different portions of the WBUR Radio News Corpus. Results include 87% correct prediction of the presence or absence of a phrase break, which corresponds to 78% correct detection and 8% false detection of the presence of a phrase break.\n",
    ""
   ]
  },
  "malliopoulos97_int": {
   "authors": [
    [
     "Christos",
     "Malliopoulos"
    ],
    [
     "George",
     "Carayannis"
    ]
   ],
   "title": "An F0 generation algorithm for the greek language",
   "original": "inta_219",
   "page_count": 4,
   "order": 51,
   "p1": "219",
   "pn": "222",
   "abstract": [
    "This paper describes a phonetic implementation model for Greek intonation, based on the results of a set of experiments, conducted m order to determine language specific characteristics of speech pitch. Analysis of experimental data showed some interesting systematic deviations of the pitch contours of Greek utterances compared to other non syllabic-rhythm languages. Moreover it was proven once more that for the synthesis of intonation, only a notional centroid of the distribution of the acoustic patterns associated with pitch accents and boundary tones is required [8] and that in pitch perception there are at least two factors of equal importance, namely the relative high and the alignment of tones over the syllables they accent.\n",
    ""
   ]
  },
  "marcelino97_int": {
   "authors": [
    [
     "Marcello",
     "Marcelino"
    ],
    [
     "Paulina D. A.",
     "Rocca"
    ]
   ],
   "title": "Teaching intonation to brazilian learners of English",
   "original": "inta_223",
   "page_count": 4,
   "order": 52,
   "p1": "223",
   "pn": "226",
   "abstract": [
    "Intonation poses a lot of challenges to teachers of foreign languages, with questions ranging from the appropriate theoretical model to the best approach in dealing with a particular language group. The objective of our research is to tackle the questions placed within the continuum mentioned above by analyzing students' repetitions of intonation patterns. A group of eight intermediate-to-advanced students were the subjects. They were asked to repeat utterances from a recording. The stimulus was contrasted with the learner's repetition by means of spectrographic analysis. Pitch patterns were compared and duration of pitch accented syllables measured. The results of the research, such as the lengthening of syllables replacing pitch contrasts in the utterances are discussed on the efficacy of techniques for teaching English Intonational patterns to Brazilian learners of English.\n",
    ""
   ]
  },
  "martin97_int": {
   "authors": [
    [
     "Philippe",
     "Martin"
    ]
   ],
   "title": "Sentence intonation in four romance languages",
   "original": "inta_227",
   "page_count": 4,
   "order": 53,
   "p1": "227",
   "pn": "230",
   "abstract": [
    "Current phonosyntactic theories of intonation associate the syntactic structure of the sentence with a prosodic structure encoded by contours located on or around stressed syllables. This prosodic structure appears to use specific mechanisms in different languages, based on various contrasts of contours such as slope (i.e. rising vs. falling), amplitude of melodic variation, duration, and so forth. In French, for instance, prosodic contours on stressed syllables contrast in slope and amplitude with the contour dominating on the right [1 ]. Native speakers of four Romance languages (French, Italian, Spanish and Portuguese) were asked to read 25 sentences, designed to be similar in their syntactic structure, so that a relatively easy comparison between contours and prosodic grammar in each language could be conducted. These sentences were analyzed in order to determine the characteristics of the prosodic contours located on stressed syllables, and the type of contrast they maintain with each other. Experimental results reveal strong similarities between contour sequences in the four languages, as well as some systematic differences.\n",
    ""
   ]
  },
  "mayo97_int": {
   "authors": [
    [
     "Catherine",
     "Mayo"
    ],
    [
     "Matthew",
     "Aylett"
    ],
    [
     "D. Robert",
     "Ladd"
    ]
   ],
   "title": "Prosodic transcription of glasgow English: an evaluation study of glatobi",
   "original": "inta_231",
   "page_count": 4,
   "order": 54,
   "p1": "231",
   "pn": "234",
   "abstract": [
    "GlaToBI, a version of the ToBI prosodic transcription system which can be used to transcribe the intonation patterns of western Scottish (Glasgow) English, is currently under development. An assessment of GlaToBI, similar to the evaluation studies that were undertaken for the original ToBI system [7], and for GToBI, a version developed for German [4], has been carried out to test the new system's reliability, learnability and comprehensiveness. The results of this study show that this adaptation of the ToBI system can be applied with the expected level of reliability to the transcription of Glasgow English.\n",
    ""
   ]
  },
  "mersdorf97_int": {
   "authors": [
    [
     "Joachim",
     "Mersdorf"
    ],
    [
     "Ansgar",
     "Rinscheid"
    ],
    [
     "Marc",
     "Brüggen"
    ],
    [
     "Kai Uwe",
     "Schmidt"
    ]
   ],
   "title": "Coding of large intonational units by linear prediction",
   "original": "inta_235",
   "page_count": 4,
   "order": 55,
   "p1": "235",
   "pn": "238",
   "abstract": [
    "A new approach for analyzing, coding, predicting and generating F0 curves based on linear predictive coding [1] is presented. The suggested model supports an automatic extraction of different parameters and accents from intonational contours by means of an appropriately simplified rectangular residual function and typical filter coefficients. The signal approximation can be regarded as an excitation signal for prosodical accents and other gestures, as a result of the pragmatical, semantical, syntactical and syllabical structure of the sentence. The resulting filter coefficients can be interpreted either as physiological parameters [3][4] or as speaker-individual features in the intonation shape. The method was developed for both practical prosodical data analysis and contour resynthesis in TTS or dialog machines. Perceptual evaluation also indicated first success for invariant filter structures and highly simplified residual signals. In this first approach the model is perceptually motivated [5] and directed towards the intonational gestalt on the sentence or phrase level.\n",
    ""
   ]
  },
  "mixdorff97_int": {
   "authors": [
    [
     "Hansjörg",
     "Mixdorff"
    ]
   ],
   "title": "Production of broad and narrow focus in German a study applying a quantitative model",
   "original": "inta_239",
   "page_count": 4,
   "order": 56,
   "p1": "239",
   "pn": "242",
   "abstract": [
    "The present paper examines the influence of broad and narrow focus on the Fq contours of short German utterances. The contours were analyzed using the Fujisaki-model in order to yield quantitative results. In utterances of statements, narrow focus boosts the accent command amplitude assigned to the focused item, which generally exhibits a clear accent peak. Secondary accents are reduced. The broad focus condition is characterized by accent merging. In utterances of questions, little influence of the focus condition on the accent command amplitude was observed which may be assigned to the fact that question-final accents generally exhibit higher accent command amplitudes than statement-final ones. The phrase command amplitude in narrow focal conditions is reduced compared with the broad focal condition.\n",
    ""
   ]
  },
  "moen97_int": {
   "authors": [
    [
     "Inger",
     "Moen"
    ],
    [
     "Kjetil",
     "Sundet"
    ]
   ],
   "title": "An acoustic investigation of intonation in the speech of a norwegian patient with a left hemisphere lesion",
   "original": "inta_243",
   "page_count": 4,
   "order": 57,
   "p1": "243",
   "pn": "246",
   "abstract": [
    "Our paper addresses the question of the functional lateralisation of intonation in a pitch accent language. The fundamental frequency patterns in the speech of an aphasic patient who had suffered damage to the left frontotemporal area of the brain as the result of a stroke, was investigated on the basis of a reading test. The test results indicate that the patient's ability to produce a proper distinction between the two Norwegian pitch accents was reduced. He also failed to produce normal intonation patterns. This failure is probably a secondary result of a reduced ability to perform articulatory planning spanning sequences of more than one word.\n",
    ""
   ]
  },
  "mora97_int": {
   "authors": [
    [
     "Elsa",
     "Mora"
    ],
    [
     "Daniel",
     "Hirst"
    ],
    [
     "Albert Di",
     "Cristo"
    ]
   ],
   "title": "Intonation features as a form of dialectal distinction in venezuelan Spanish",
   "original": "inta_247",
   "page_count": 4,
   "order": 58,
   "p1": "247",
   "pn": "250",
   "abstract": [
    "This study presents the results of a melodic analysis which brings to light the role of certain intonative phenomena in showing dialectal variation in Venezuelan Spanish. The signal was digitised and analysed using MES (Motif Editor for Speech-signal) [1]. The f0 was analysed and modelled as a sequence of target points [2]. The values, in Hertz, obtained from the sample spoken signals were transformed into normalized values expressed in ERB [3]. The target points were then coded symbolically using INTSINT [2]. The registers attained by each tone in the different dialects and the melodic variability of the emission were observed. The statistical analysis supported the conclusion that both variables are important indices to use when establishing melodic differences between dialects.\n",
    ""
   ]
  },
  "morlec97_int": {
   "authors": [
    [
     "Yann",
     "Morlec"
    ],
    [
     "Gérard",
     "Bailly"
    ],
    [
     "Veronique",
     "Aubergé"
    ]
   ],
   "title": "Generating the prosody of attitudes",
   "original": "inta_251",
   "page_count": 4,
   "order": 59,
   "p1": "251",
   "pn": "254",
   "abstract": [
    "This paper presents a superpositional model of prosody where linguistic structures are directly encoded into the prosodic parameters via global melodic and rhythmic contours. This model is applied here to the generation of prosody specific to six common attitudes in French. Perceptual tests using high-quality TD-PSOLA re-synthesis show that predicted contours yield the same identification scores as natural stimuli.\n",
    ""
   ]
  },
  "nakatani97_int": {
   "authors": [
    [
     "Christine H.",
     "Nakatani"
    ]
   ],
   "title": "Bootstrapping on citation form accent assignment",
   "original": "inta_255",
   "page_count": 4,
   "order": 60,
   "p1": "255",
   "pn": "258",
   "abstract": [
    "A new approach to accent assignment is explored in which patterns of deviation from citation form accentuation, defined at the constituent level, are automatically learned from an annotated corpus. This constituent-based approach to accent prediction bootstraps off of established knowledge about citation-form accenting, and allows for the direct integration of higher-level linguistic features, such as form of referring expression and grammatical function, with lower-level linguistic features, such as lexical class and word lemma information. Machine learning experiments show that for two speakers from a corpus of spontaneous direction-giving monologues, accent assignment can be improved by up to 4%-6% relative to a hypothetical baseline system that would produce only citation-form accentuation, giving an error rate reduction of 11 %-24%.\n",
    ""
   ]
  },
  "nolan97_int": {
   "authors": [
    [
     "Francis",
     "Nolan"
    ],
    [
     "Esther",
     "Grabe"
    ]
   ],
   "title": "Can 'toBI' transcribe intonational variation in british English?",
   "original": "inta_259",
   "page_count": 4,
   "order": 61,
   "p1": "259",
   "pn": "262",
   "abstract": [
    "This paper argues that ToBI, the de facto standard for international representation of English, falls unsatisfactorily between a phonetic and a phonological representation. Some differences between dialects cannot be captured, at least not without powerful interpretative conventions governing the relation of the representation to the speech signal. On the other hand ToBI is often too 'concrete' to reveal basic similarities between patterns. The issues are discussed, using existing examples from Northern Irish English, in the context of a new project on intonational variation in the English spoken in the British Isles.\n",
    ""
   ]
  },
  "ode97_int": {
   "authors": [
    [
     "Cecilia",
     "Ode"
    ]
   ],
   "title": "The realization of types of tone in different positions of utterances in MPUR (west papuan phylum): an experimental phonetic analysis",
   "original": "inta_263",
   "page_count": 4,
   "order": 62,
   "p1": "263",
   "pn": "266",
   "abstract": [
    "An analysis of the realizations of types of tone in different positions of declarative utterances in Mpur, an unwritten language with perceptually five lexical tone contrasts, will be discussed. In a production experiment, words representing each of the five tones, pronounced in isolation and in initial, central and final position in short declarative utterances by speakers differing in dialectal background, were recorded. For the analysis, sixty items were selected (5 words in 4 positions by 3 speakers), measured (pitch, duration) and stylized, using the stylization method. For each of the target words, phonetic correlates of tone realized in one position were compared to those realized a) in the other positions per speaker (one and the same word in four different positions); b) in the same position between speakers (one and the same word in one and the same position). The results show similarities and differences in realizations of the five types of tone in the four positions.\n",
    ""
   ]
  },
  "palkova97_int": {
   "authors": [
    [
     "Zdena",
     "Palkova"
    ]
   ],
   "title": "Modelling intonation in Czech: neutral vs. marked TTS F0-patterns",
   "original": "inta_267",
   "page_count": 4,
   "order": 63,
   "p1": "267",
   "pn": "270",
   "abstract": [
    "The examination of marked intonation by means of synthesised speech signal provides a possibility to specify more precisely separate intonation features detected at first as potentially relevant in the sound complex of natural speech. Sets of Czech utterances systematically altered in F0-patterns are produced and the relevance of their differences for the native listener is then evaluated by listening tests. Accord- ing to our results, the number and size of steps in tone, their place in the higher text unit and the kind of sequence of falling and rising contours seem to be of the primary importance in the opposition of neutral vs. marked intonation in Czech.\n",
    ""
   ]
  },
  "portele97_int": {
   "authors": [
    [
     "Thomas",
     "Portele"
    ]
   ],
   "title": "Perceptual evidence for accent categories: preliminaries and first results",
   "original": "inta_271",
   "page_count": 4,
   "order": 64,
   "p1": "271",
   "pn": "274",
   "abstract": [
    "In German, a pitch accent is marked by an associated F0 maximum or movement. For a maximum-based parametrized description of pitch accents by four parameters, differences in the discriminative ability are investigated for each parameter. An optimal step size for each parameter was established for four versions of one sentence and successfully applied to other sentences. First results indicate marked differences in discriminative ability which depend on the utterance and the pertinent prosodic context.\n",
    ""
   ]
  },
  "prietoivives97_int": {
   "authors": [
    [
     "Pilar",
     "Prieto i Vives"
    ]
   ],
   "title": "Register shift in Spanish downstepping contours",
   "original": "inta_275",
   "page_count": 4,
   "order": 65,
   "p1": "275",
   "pn": "278",
   "abstract": [
    "The present study examines the behavior of the lower part of the tonal space (or L points found in between peaks) in Spanish downstepping F0 contours as a function of the following four linguistic factors: 1) F0 height of surrounding peaks; 2) temporal distance from L points to preceding peaks; 3) phrasal length; and 4) phrasal position. In contrast with H values, which are accurately predicted by a constant ratio of downstep from the previous peak ([9]), L values are shown to be affected by a variety of linguistic factors. The best fit to the data is obtained using a multiple regression that takes all contextual factors into consideration (between 55 and 80% of the variance of the data is explained). Thus, while we can view H peaks as highly stable and precise targets, L values are more varied and are probably displaying different degrees of undershoot.\n",
    ""
   ]
  },
  "rajouani97_int": {
   "authors": [
    [
     "A.",
     "Rajouani"
    ],
    [
     "M.",
     "Loukili"
    ],
    [
     "Z.",
     "Najim"
    ]
   ],
   "title": "A perceptual study of Arabic intonation",
   "original": "inta_279",
   "page_count": 5,
   "order": 66,
   "p1": "279",
   "pn": "284",
   "abstract": [
    "In this paper we describe the development of an intonative model for Arabic language. Our model is designed for text-to-speech synthesis. We adopted the perceptual approach proposed at the Institute for Perception Research, Netherlands. The corpus recorded in soundproof room is constituted of 120 declarative and interrogative sentences. Natural F0 contours were closely approximated by means of a concatenation of straight lines , it's the stylization stage. We used 65 stylized sentences and obtained about 650 F0 movements which were processed and reduced to a small set of standard movements, it's the standardization stage. The F0 contours made of standardized movements are not perceptually identical to stylized contours, but they must be perceptually equivalent. Categorization stage reduces the number of standard movements to 11 (5 rises, 5 falls and a flat movement). Rises and falls are differentiated according to variables such as position in the syllable, size and slope.\n",
    ""
   ]
  },
  "renato97_int": {
   "authors": [
    [
     "A.",
     "Renato"
    ],
    [
     "J.",
     "Alvarez"
    ],
    [
     "L.",
     "Caballero"
    ]
   ],
   "title": "Boundary tones pitch and ending movements in argentine Spanish",
   "original": "inta_285",
   "page_count": 4,
   "order": 67,
   "p1": "285",
   "pn": "288",
   "abstract": [
    "Boundary tones pitch movements were analysed in terms of shape, pitch level and alignment with segmental structure. A speech database (2 1/2 hours of spontaneous speech) was performed with radial and TV announcers voices, all argentine Spanish speakers. Situations of dialogues, monologues and reading aloud were chosen for this purpose. Transcriptions and measurements were done in order to obtain the ending phrase movements contours. The results indicate that the falling pitch movements were prevailing for \"finalization\" phrase, and several rising and \"half completion' falling movements for \"continuation\" phrase. The model is then perceptually evaluated. Contours of a monologue were normalised and stylised by the analysis-by-synthesis methodology. The resynthetized contours were included in three version of a monologue belonging to the database mentioned above. This monologue was used for a perceptual experiment in which ten listeners were instructed to push a computer key as quickly as possible, whenever they thought a major discourse unit had ended.\n",
    ""
   ]
  },
  "rialland97_int": {
   "authors": [
    [
     "Annie",
     "Rialland"
    ],
    [
     "Stephane",
     "Robert"
    ]
   ],
   "title": "Morphosyntax and intonation in WOLOF the coherence of a system",
   "original": "inta_289",
   "page_count": 4,
   "order": 68,
   "p1": "289",
   "pn": "292",
   "abstract": [
    "There is no tradition of research on Wolof intonation as there is on most European intonation systems. Consequently, this paper deals with a barely studied intonation system and builds largely from scratch. It examines the overall organisation of the Wolof intonational system and its relationship with grammatical features, in particular the complex system of focus-marking in the verb conjugation. We first show that Wolof has unmarked, all-low declarative sentences which are not organised into smaller prosodic units. We then study utterances with high pitch targets: 1) in relation to their syntactically-determined division into prosodic groups, and 2) in interrogative utterances, with and without interrogative morphemes. Rules such as downdrift and downdrift cancellation apply to these high targets. Final boundary tones are also studied.\n",
    ""
   ]
  },
  "shih97_int": {
   "authors": [
    [
     "Chilin",
     "Shih"
    ]
   ],
   "title": "Declination in Mandarin",
   "original": "inta_293",
   "page_count": 4,
   "order": 69,
   "p1": "293",
   "pn": "296",
   "abstract": [
    "in a sequence of high level tones, downstep is by definition absent and the tonal contribution to F0 movement is minimal. The surface F0 contour therefore is a close approximation of the declination slope, or the declarative sentence intonation. This paper reports experimental results of Mandarin high tones, and concludes that there is a clear declination effect stronger in magnitude than previously reported, which is best modeled as an exponential decay. Futhermore, declination interacts with sentence length and focus.\n",
    ""
   ]
  },
  "swerts97_int": {
   "authors": [
    [
     "Marc",
     "Swerts"
    ],
    [
     "Raymond",
     "Veldhuis"
    ]
   ],
   "title": "Interactions between intonation and glottal-pulse characteristics",
   "original": "inta_297",
   "page_count": 4,
   "order": 70,
   "p1": "297",
   "pn": "300",
   "abstract": [
    "This paper explores whether a speaker's voice quality changes as a function of variation in speech melody. Analyses are based on several productions of the vowel 'a' provided with different intonation patterns. It appears that fundamental frequency covaries to some extent with the 'strength relationship\" between the first two harmonics, which is often claimed to reflect open quotient. However, correlating the H1-H2 measure to parameters of the LF-model reveals that both the open quotient and the skewness of the glottal pulse have an impact on the lower part of the harmonic spectrum.\n",
    ""
   ]
  },
  "taff97_int": {
   "authors": [
    [
     "Alice",
     "Taff"
    ]
   ],
   "title": "Intonation patterns in unangan (eastern aleut)",
   "original": "inta_301",
   "page_count": 4,
   "order": 71,
   "p1": "301",
   "pn": "304",
   "abstract": [
    "This paper provides phonetic evidence for the following claims about the patterning of intonation in Unangan (Eastern Aleut): 1. each content word in the language is an phonological phrase (PP) of the contour HL; 2. words/PP's are organized into Intonational Phrases (IP's) with boundary tones either H% or L%. (References herein to H and L tone types and phrase types follow the system elaborated by Pierrehumbert [6], and others.) Phonetic evidence is provided by pitch tracks of sentences elicited from eight native speakers of Unangan and by statistical analysis of the pitch tracks.\n",
    ""
   ]
  },
  "tramboulis97_int": {
   "authors": [
    [
     "Theophilos",
     "Tramboulis"
    ]
   ],
   "title": "Stress and katathesis within spontaneous oral greek narration",
   "original": "inta_305",
   "page_count": 4,
   "order": 72,
   "p1": "305",
   "pn": "308",
   "abstract": [
    "The maximum rise in Greek natural discourse may be attained either at the stressed syllable of a lexical item or at the immediately following one. The asymmetrical distribution of stress corresponds to different discursive roles performed by intonation pitch rises within the utterance. If the rise is located on the next-to-stress syllable, intonation is functioning mainly as a segmentation procedure and indicates boundaries of discursive units such as topics, modals or even utterances. If the rise is located on the stressed syllable, intonation is functioning as a selection procedure, setting in salience the prominent word, the stress syllable being the phonological \"emblem\" of the lexical unit. Nevertheless, both functions must be attributed to a fundamental value of f0, i.e. respectively negotiating discursive representations.\n",
    ""
   ]
  },
  "vainio97_int": {
   "authors": [
    [
     "M.",
     "Vainio"
    ],
    [
     "Toomas",
     "Altosaar"
    ],
    [
     "Marti",
     "Karjalainen"
    ],
    [
     "R.",
     "Aulanko"
    ]
   ],
   "title": "Modeling Finnish microprosody for speech synthesis",
   "original": "inta_309",
   "page_count": 4,
   "order": 73,
   "p1": "309",
   "pn": "312",
   "abstract": [
    "In our research on the prosody of Finnish we have modeled word-level prosody with artificial neural networks and a comparable model based on multiple linear regression. In earlier work [6] we have used multi-layer feed-forward networks to estimate prosodic parameters - segmental durations, loudness and pitch values - for single phones within words. The performance of these models in predicting average values for phones was encouraging. Nevertheless, a more detailed account of the behavior of the continuous prosodic parameters is needed, e.g., to enhance the intelligibility and naturalness of speech synthesis. We present results for both models' ability to estimate microprosodic variation of pitch in Finnish.\n",
    ""
   ]
  },
  "donzel97_int": {
   "authors": [
    [
     "Monique E. van",
     "Donzel"
    ],
    [
     "Florien J.",
     "Koopmans-van Beinum"
    ]
   ],
   "title": "Pitch accents, boundary tones, and information structure in spontaneous discourse in dutch",
   "original": "inta_313",
   "page_count": 4,
   "order": 74,
   "p1": "313",
   "pn": "316",
   "abstract": [
    "In this paper we present the results of a study investigating intonational aspects of spontaneous Dutch speech in relation to discourse structure and to judgements of perceived prominence. Pitch accents and boundary tones were labeled directly in the intonation contour, specifying frequency of occurrence, F0-value, and timing of accent peaks and boundary tones. These findings were subsequently related to aspects of discourse structure, and to data on perceived prominence and phrasing. Results show a tendency for 'new* information to be accented more often than 'given', but not all pitch accents turn out to be equally important to the listeners.\n",
    ""
   ]
  },
  "heuven97_int": {
   "authors": [
    [
     "Vincent J. van",
     "Heuven"
    ],
    [
     "Judith",
     "Haan"
    ],
    [
     "Esther",
     "Janse"
    ],
    [
     "Erik Jan van der",
     "Torre"
    ]
   ],
   "title": "Perceptual identification of sentence type and the time-distibution of prosodic interrogativity markers in dutch",
   "original": "inta_317",
   "page_count": 4,
   "order": 75,
   "p1": "317",
   "pn": "320",
   "abstract": [
    "Dutch distinguishes at least four sentence types: statements and questions, the latter type being subdivided into wh-questions (beginning with a question word), yes/no-questions (with inversion of subject and finite), and declarative questions (lexico-syntactically identical to statement). Acoustically, each of these (sub)types was found to have clearly distinct global F0-patterns, as well as a characteristic distribution of final rises [1,2]. The present paper explores the separate contribution of parameters of global downtrend and size of accent-lending pitch movements versus aspects of the terminal rise to the human identification of the four sentence (sub)types, at various positions in the time-course of the utterance. The results show that interrogativity in Dutch can be identified at an early point in the utterance. However, wh-questions are not distinct from statements.\n",
    ""
   ]
  },
  "santen97_int": {
   "authors": [
    [
     "Jan van",
     "Santen"
    ],
    [
     "Bernd",
     "Möbius"
    ]
   ],
   "title": "Modeling pitch accent curves",
   "original": "inta_321",
   "page_count": 4,
   "order": 76,
   "p1": "321",
   "pn": "324",
   "abstract": [
    "Segmental factors can cause large temporal changes in local pitch contours associated with accented syllables (\"accent curves\"), but these changes are often not phonologically or perceptually significant. Yet, other factors can cause temporal changes that are smaller but nevertheless significant. We propose a model according to which accent curves are (phonologically, perceptually) equivalent when they are generated from the same accent curve template using a shared family of time warp functions. The model is shown to provide a detailed and accurate account of alignment of accent curves over a wide range of segmental configurations.\n",
    ""
   ]
  },
  "vella97_int": {
   "authors": [
    [
     "Alexandra",
     "Vella"
    ]
   ],
   "title": "Intonational variation across dialects: an intonational phonology approach",
   "original": "inta_325",
   "page_count": 4,
   "order": 77,
   "p1": "325",
   "pn": "328",
   "abstract": [
    "Working on the intonation of Maltese within the framework of intonational phonology ([12], [10]), Vella [13] notes an asymmetry in the timing implementation of the nuclear statement tune as compared with that of the nuclear question tune. Vella's preliminary conclusion regarding the former is that there is a tendency for early alignment of H* with the stressed syllable; in the latter case, the tendency is rather for late alignment of L* with the stressed syllable. This paper uses interview data to corroborate preliminary evidence relating to the timing of the peak in the nuclear statement tune in Standard Maltese. At the same time, it investigates the timing of pitch accent alignment in the nuclear statement tune in one particular dialect of Maltese. The difference in the timing implementation of the peak across the two varieties is accounted for by means of a phonological feature [early peak].\n",
    ""
   ]
  },
  "wichmann97_int": {
   "authors": [
    [
     "Anne",
     "Wichmann"
    ],
    [
     "Jill",
     "House"
    ],
    [
     "Toni",
     "Rietveld"
    ]
   ],
   "title": "Peak displacement and topic structure",
   "original": "inta_329",
   "page_count": 4,
   "order": 78,
   "p1": "329",
   "pn": "332",
   "abstract": [
    "This paper examines the various constraints, segmental and prosodic, on the alignment of an F0 peak with its associated accented syllable. In a naturally-occurring spoken text (a broadcast news summary in British English) the first accented syllable of each major intonational phrase was identified, and the timing of the associated F0 peak was investigated. Segmental and low-level prosodic constraints reported in the literature were observed to operate. In addition the results suggest the presence of a further, higher-level timing constraint whereby topic initiality appears to cause the F0 peak associated with the first accented syllable to be delayed, in some cases beyond the domain of the syllable itself.\n",
    ""
   ]
  },
  "wright97_int": {
   "authors": [
    [
     "Helen",
     "Wright"
    ],
    [
     "Paul",
     "Taylor"
    ]
   ],
   "title": "Modelling intonational structure using hidden Markov models",
   "original": "inta_333",
   "page_count": 4,
   "order": 79,
   "p1": "333",
   "pn": "336",
   "abstract": [
    "A method is introduced for using hidden Markov models (HMMs) to model intonational structure. HMMs are probabilistic and can capture the variability in structure which previous finite state network models lack. We show how intonational tunes can be modelled by separate HMMs and how HMMs can be used in a recognition system to automatically determine the tune type of an utterance.\n",
    ""
   ]
  },
  "xu97_int": {
   "authors": [
    [
     "Yi",
     "Xu"
    ],
    [
     "Q. Emily",
     "Wang"
    ]
   ],
   "title": "What can tone studies tell us about intonation?",
   "original": "inta_337",
   "page_count": 4,
   "order": 80,
   "p1": "337",
   "pn": "340",
   "abstract": [
    "The present paper demonstrates that much can be learned about intonation through the study of the contribution of lexical tones to the & contour of speech utterances. A fundamental principle and several basic mechanisms of tone production and perception are proposed based on studies of both tone and intonation. Their implications for intonation in general are discussed.\n",
    ""
   ]
  }
 },
 "sessions": [
  {
   "title": "Table of Contents and Access to Abstracts",
   "papers": [
    "rossi97_int",
    "bruce97_int",
    "granstrom97_int",
    "alter97_int",
    "astesano97_int",
    "bartkova97_int",
    "batliner97_int",
    "beaugendre97_int",
    "botinis97_int",
    "brindopke97_int",
    "brondsted97_int",
    "bruce97b_int",
    "caelenhaumont97_int",
    "campbell97_int",
    "campione97_int",
    "motagorriz97_int",
    "delaney97_int",
    "cristo97_int",
    "dimperio97_int",
    "dimperio97b_int",
    "ding97_int",
    "dogil97_int",
    "douglascowie97_int",
    "dusterhoff97_int",
    "fant97_int",
    "farnetani97_int",
    "fitzpatrickcole97_int",
    "fretheim97_int",
    "frota97_int",
    "fujisaki97_int",
    "gaminde97_int",
    "garcialecumberri97_int",
    "garding97_int",
    "gavat97_int",
    "goldman97_int",
    "grabe97_int",
    "grabe97b_int",
    "grover97_int",
    "gussenhoven97_int",
    "haan97_int",
    "hermes97_int",
    "heuft97_int",
    "hirose97_int",
    "hirschberg97_int",
    "jun97_int",
    "konopczynski97_int",
    "koval97_int",
    "lint97_int",
    "madureira97_int",
    "maghbouleh97_int",
    "malliopoulos97_int",
    "marcelino97_int",
    "martin97_int",
    "mayo97_int",
    "mersdorf97_int",
    "mixdorff97_int",
    "moen97_int",
    "mora97_int",
    "morlec97_int",
    "nakatani97_int",
    "nolan97_int",
    "ode97_int",
    "palkova97_int",
    "portele97_int",
    "prietoivives97_int",
    "rajouani97_int",
    "renato97_int",
    "rialland97_int",
    "shih97_int",
    "swerts97_int",
    "taff97_int",
    "tramboulis97_int",
    "vainio97_int",
    "donzel97_int",
    "heuven97_int",
    "santen97_int",
    "vella97_int",
    "wichmann97_int",
    "wright97_int",
    "xu97_int"
   ]
  }
 ]
}