{
 "series": "ISAPh",
 "title": "3rd International Symposium on Applied Phonetics (ISAPh 2021)",
 "location": "Tarragona, Spain",
 "startDate": "6/9/2021",
 "endDate": "8/9/2021",
 "URL": "https://wwwa.fundacio.urv.cat/congressos/isaph2021",
 "chair": "Chair: Joaquín Romero",
 "conf": "ISAPh",
 "year": "2021",
 "name": "isaph_2021",
 "SIG": "",
 "title1": "3rd International Symposium on Applied Phonetics",
 "title2": "(ISAPh 2021)",
 "date": "6-8 September 2021",
 "papers": {
  "carrerasabate21_isaph": {
   "authors": [
    [
     "Josefina",
     "Carrera-Sabaté"
    ]
   ],
   "title": "Body to Speech and Back: Considerations on Embodied Pronunciation",
   "original": "1",
   "page_count": 8,
   "order": 1,
   "p1": 1,
   "pn": 8,
   "abstract": [
    "While neuroscience research has increasingly demonstrated the effectiveness of embodied cognition, the teaching of pronunciation lags far behind. In this paper I connect three aspects of embodied cognition with the learning of pronunciation: 1) the use of senses of the body to improve pronunciation; 2) the physical properties of the body and posture as a basis for enhancing pronunciation; 3) emotion and the use of slow respiration and meditation to overcome anxiety when pronouncing.\n"
   ],
   "doi": "10.21437/ISAPh.2021-1"
  },
  "mora21_isaph": {
   "authors": [
    [
     "Joan C.",
     "Mora"
    ]
   ],
   "title": "Assessing L2 vowel production gains after high-variability phonetic training: acoustic measurements vs. perceptual judgements",
   "original": "2",
   "page_count": 10,
   "order": 2,
   "p1": 9,
   "pn": 18,
   "abstract": [
    "The current study examined vowel production data from a high-variability phonetic training project (HVPT) focusing on the English vowel contrast /æ/-/ᴧ/ to compare the sensitivity of various acoustic measures of vowel overlap and distinctiveness (Pillai scores and Euclidean and Mahalanobis distances) in capturing L2 learners' training gains in (a) qualitatively distinguishing between /æ/ and /ᴧ/ in production, and (b) reducing qualitative differences with respect to native speakers' productions of /æ/ and /ᴧ/. A subset of these data was then perceptually judged by a group of native listeners for pronunciation accuracy.\nThe results showed that all acoustic distance measures consistently captured phonetic training gains in measures of contrast distinctiveness and nativelikeness, correlating strongly with one another, and predicting perceptual distance measures. However, measures also differed substantially in effect sizes for training gains (pre- vs- post-test distance scores), training group differences (lexical vs. non-lexical training) and vowel (/æ/ vs. /ᴧ/). Acoustic distance measures were found to predict perceptual distance scores based on native English listeners' ratings of pronunciation accuracy. These findings suggest that when assessing gains in the pronunciation of L2 vowel contrasts it is important to measure both acoustic distances between vowels and acoustic distances between learners' and native speakers' productions.\n"
   ],
   "doi": "10.21437/ISAPh.2021-2"
  },
  "quesadavazquez21_isaph": {
   "authors": [
    [
     "Leticia",
     "Quesada Vázquez"
    ]
   ],
   "title": "Tools and techniques to teach phonetic transcription online",
   "original": "3",
   "page_count": 7,
   "order": 3,
   "p1": 19,
   "pn": 25,
   "abstract": [
    "Despite the global impact of the digital revolution, the use of technological advancements in education remains underexplored. Teachers and students have incorporated technology in the classroom mainly as a secondary support to invigorate learning, and remote teaching has been applied in specific and rather isolated situations. However, the spread of the COVID-19 pandemic around the globe has turned the tables, and nowadays most of the students worldwide are learning online. This situation has forced the adaptation of all types of courses to a virtual setting so that learners could keep studying from home during lockdown. Consequently, the tools and techniques used in face-to-face lectures had to be re-assessed to guarantee their validity when teaching remotely, and new digital resources had to be tested to ensure that learning was not jeopardized.\nPronunciation instruction is not an exception. Despite the wide range of multimedia material available on the internet to practice transcription, not much has been investigated on how to include it in class, especially when teaching it online. This paper aims at examining the tools and methods applied in an undergraduate pronunciation course in order to provide helpful and inspiring ideas for those practitioners who must teach pronunciation remotely."
   ],
   "doi": "10.21437/ISAPh.2021-3"
  },
  "ashby21_isaph": {
   "authors": [
    [
     "Patricia",
     "Ashby"
    ]
   ],
   "title": "Is there still a role for traditional phonetics in pronunciation teaching today? Is there still a need for the IPA Certificate?",
   "original": "4",
   "page_count": 6,
   "order": 4,
   "p1": 26,
   "pn": 31,
   "abstract": [
    "﻿The International Phonetic Association (IPA), while now truly a phoneticians’ association, began as an association of teachers of modern (foreign) languages, a language teachers’ association. It began nearly half a century before phonetics was included as a subject of study in university degree programmes and established the qualification known today as the ‘IPA Certificate’. This award was originally considered a language teaching qualification and held in high esteem. But during the past decade, numbers entering for the examination have declined dramatically and the success rates among those who do enter have plummeted. The future of the award (still strikingly similar to its original 1908 content and format) is now in doubt. This paper (part of a wider, four-year investigation) considers possible reasons for the decline, the viability of the award and whether it is needed at all.\n"
   ],
   "doi": "10.21437/ISAPh.2021-4"
  },
  "baditznepalvolgyi21_isaph": {
   "authors": [
    [
     "Kata",
     "Baditzné Pálvölgyi"
    ]
   ],
   "title": "Utterance-initial F0 movements in the spontaneous speech of Hungarian learners of Spanish",
   "original": "5",
   "page_count": 5,
   "order": 5,
   "p1": 32,
   "pn": 36,
   "abstract": [
    "﻿Apart from various pronunciation errors at the segmental level, anomalous stress and intonation patterns are reported to be a salient area of negative transfer in the case of Hungarian learners of Spanish (HLS) [1]. This comparative study deals with utterance-initial melodic traits in the spontaneous declarative utterances of HLS, as contrasted to native Spanish (NS) prosodic patterns.\nThe corpus consists of map task activities: 100 utterances by 16 European Spanish speakers, and160 utterances by 16 Hungarian informants. The method applied in the research is Cantero Serena’s ‘Prosodic Analysis of Speech’ [2], which represents intonation by objectively comparable standardized melodic curves. In this study, the focus was on the tonal movements from the utterance-first syllable to the first f0 turning point of the sentence, supposing that these would rather rise in the case of NS speakers, as opposed to a fall in the case of HLS.\nAccording to the results, Hungarian learners of Spanish do produce utterance-initial syllables followed by a fall rather than a rise as a consequence of presumable negative transfer from their mother tongue, but the native Spanish corpus used for this study is not exclusively characterized by a definite rise from the utterance-first syllable to the first peak either.\n"
   ],
   "doi": "10.21437/ISAPh.2021-5"
  },
  "frost21_isaph": {
   "authors": [
    [
     "Dan",
     "Frost"
    ]
   ],
   "title": "Doing pronunciation online: creating a self-study English pronunciation course",
   "original": "6",
   "page_count": 7,
   "order": 6,
   "p1": 37,
   "pn": 43,
   "abstract": [
    "This paper describes a pilot study for a project being carried out at Grenoble Alpes University which seeks to assess the efficacy of online learning paths in several languages. The learning path presented here targets pronunciation and listening skills in English, and can be used by specialist English students and non-specialists alike. It contains material for one academic year, but may be realised over a shorter time, either as a free-standing course, or as a complement to a physical class. It integrates short subtitled videos and interactive activities, and is based on an articulatory approach to learning pronunciation, centring on prosody, and combining cognitive and imitative methodologies. Using a mixed methods approach, we collect a variety of data to enable us to measure the learning arc of the students enrolled on the course. In this article, we explore some of the problems of learning English pronunciation, before presenting our pedagogical approach and finally the technological solutions we propose. The study is ongoing, and the data presented here is from the first year of this project, which constitutes the pilot study, and concerns the first cohort to use the learning paths. \n"
   ],
   "doi": "10.21437/ISAPh.2021-6"
  },
  "iseijaakkola21_isaph": {
   "authors": [
    [
     "Toshiko",
     "Isei-Jaakkola"
    ],
    [
     "Keiko",
     "Ochi"
    ],
    [
     "Keikichi",
     "Hirose"
    ]
   ],
   "title": "Problems of macro-prosodic control by Japanese EFL learners when reading an English passage",
   "original": "7",
   "page_count": 4,
   "order": 7,
   "p1": 44,
   "pn": 47,
   "abstract": [
    "Our aim in this study is to determine how well correlated macro-prosodic features such as pitch and intensity movements are for Japanese learners of English as a foreign language (JEFL) when reading a passage, in comparison with English speakers (EL1). For this purpose, we recorded four EL1s and five JEFLs and analyzed a total of 37 story utterances after discarding the speakers and utterances with hesitation, general instability, etc. Pitch and intensity movements were determined using only the voiced parts of each utterance. The results showed that JEFLs’ macro-prosodic pitch and intensity controls were not statistically correlated. JEFLs’ registers were much narrower than those of EL1s, and F0 and intensity resets occurred much more frequently among JEFLs than EL1s. JEFLs’ prosodic boundaries were set at the word level and thus their prosodic units were much shorter than those of EL1s.\n"
   ],
   "doi": "10.21437/ISAPh.2021-7"
  },
  "juhasz21_isaph": {
   "authors": [
    [
     "Kornélia",
     "Juhász"
    ]
   ],
   "title": "The acoustic analysis of Mandarin Sibilants in the Production of Hungarian learners of Chinese",
   "original": "8",
   "page_count": 5,
   "order": 8,
   "p1": 48,
   "pn": 52,
   "abstract": [
    "In this study we carried out an acoustic analysis on the three voiceless Chinese sibilants, that is the dental [s], the alveolo-palatal [ɕ] and the so-called retroflex post-alveolar [ʂ], by comparing the production of Hungarian learners of Mandarin Chinese and Chinese natives. We analysed the three Chinese sibilants according to two parameters: the sibilant constriction’s relative position in the vocal tract by the length of the cavity anterior to the sibilant’s constriction, and the degree of palatalization, that is, the length of the cavity posterior to the sibilant constriction. Due to the distinct distribution and opposition of sibilants in Hungarian and Chinese, we assumed negative transfer-induced difficulties in Hungarian speakers’ production in the case of the alveolo-palatal [ɕ]. Our results confirmed this hypothesis that Hungarian learners produced the [ɕ] identical to the dental [s] and the (alveolo-)palatalized production (which is absent from the L1) is substituted with a coarticulatory-driven gradually palatalizing pattern at the end of the sibilant phase. The production of the dental [s] and the so-called retroflex post-alveolar [ʂ] did not pose problems for Hungarian learners of Chinese.\n"
   ],
   "doi": "10.21437/ISAPh.2021-8"
  },
  "minematsu21_isaph": {
   "authors": [
    [
     "Nobuaki",
     "Minematsu"
    ],
    [
     "Fuki",
     "Yoshizawa"
    ],
    [
     "Tadashi",
     "Kumano"
    ],
    [
     "Kiyoshi",
     "Kurihara"
    ],
    [
     "Daisuke",
     "Saito"
    ]
   ],
   "title": "Comparison of accent theories of Japanese using E2E speech synthesis in terms of their effectiveness for learners to acquire natural prosody",
   "original": "9",
   "page_count": 6,
   "order": 9,
   "p1": 53,
   "pn": 58,
   "abstract": [
    "When teaching Japanese prosody to learners, two major theories of lexical accent are available, but they decompose an observed pitch pattern differently into\nlexical and phrasal components. Which theory is more valid pedagogically? In this work, a candidate answer is sought by comparing the two theories using\ntext-to-speech conversion technologies. An end-to-end speech synthesizer is assumed to be a machine learner, which is built in two ways using a speech corpus annotated differently based on the two theories. Naturalness of the synthesized voices is compared between\nthem, and it is shown that the two theories do not make any significant difference. With this finding in mind, from practitioners’ point of view, a pedagogical suggestion is made on which theory should be used in which teaching context. The two theories correspond directly to opposite approaches of teaching and/or learning prosody, i.e., analytic and holistic."
   ],
   "doi": "10.21437/ISAPh.2021-9"
  },
  "rallofabra21_isaph": {
   "authors": [
    [
     "Lucrecia",
     "Rallo Fabra"
    ],
    [
     "Michael D.",
     "Tyler"
    ]
   ],
   "title": "Discrimination of Californian central vowel contrasts by Spanish-Catalan EFL learners",
   "original": "10",
   "page_count": 4,
   "order": 10,
   "p1": 59,
   "pn": 62,
   "abstract": [
    "Spanish and Catalan speakers often face difficulties when learning the English vowel system. Acquisition of English schwa (/ə/) is of particular interest, because Majorcan Catalan has a stressed /ə/ in its phonemic inventory. PAM/PAM-L2 posits that native language experience shapes perception of L2 sounds, so discrimination of L2 contrasts can be predicted from L2-to-L1 categorization. The current study focused on whether discrimination of the vowel contrasts /ɛ/-/ə/, /ʌ/-/ǝ/, and /ʊ/-/ǝ/ can be accounted for by the perceptual assimilation of these vowels onto L1-Catalan categories. Spanish-Catalan experienced learners of English performed a categorization with goodness rating task and an AXB discrimination task. The four vowels of interest, /ɛ/, /ʌ/, /ʊ/ and /ǝ/, were perceived as uncategorized and the contrasts involving /ǝ/ differed in the degree of perceptual overlap. Specifically, /ʊ/-/ǝ/ was non-overlapping, /ɛ/-/ə/ was partially overlapping, and /ʌ/-/ǝ/ was completely overlapping. Discrimination was poorer for /ʌ/-/ǝ/ than the other two contrasts. However, contrary to PAM predictions, no differences were found between the partially overlapping contrast /ɛ/-/ə/ and the non-overlapping contrast /ʊ/-/ǝ/. Overlap scores for individual participants were not related to discrimination accuracy, suggesting that predictions of L2 discrimination based on L2-to-L1 categorization should be made at the group level."
   ],
   "doi": "10.21437/ISAPh.2021-10"
  },
  "sansegundo21_isaph": {
   "authors": [
    [
     "Eugenia",
     "San Segundo"
    ],
    [
     "Jonathan",
     "Delgado"
    ]
   ],
   "title": "A preliminary approach to the acoustic-perceptual characterization of dysarthria",
   "original": "11",
   "page_count": 4,
   "order": 11,
   "p1": 63,
   "pn": 66,
   "abstract": [
    "We have conducted an acoustic-perceptual evaluation of 15 dysarthric and 15 neurologically healthy speakers. On the one hand, speech samples were analysed with Praat (13 acoustic parameters were extracted, related to F0, frequency and amplitude variation, as well as other source and vocal tract measures). On the other hand, two raters evaluated all the voices perceptually using the Simplified Vocal Profile Analysis (SVPA), which implements a visual analog scale for each voice quality setting in an online interface.\nThe results show, for the perceptual analyses, that (1) intra- and interrater agreement is overall very good; and that (2) the perceptual settings ‘vocal tract tension’ and ‘laryngeal tension’ are the most useful to characterize dysarthria. In terms of statistical modelling, most linear models were significant using only 4-5 acoustic parameters, but the specific parameters in each model depend on the VPA setting under consideration.\nAll in all, acoustic-perceptual assessment through the SVPA seems to be an important complement to traditional assessment in dysarthria, as it provides information on the functioning of the supraglottic structures commonly affected in this type of motor speech disorder, in which the muscles used to produce speech are damaged, paralyzed, or weakened."
   ],
   "doi": "10.21437/ISAPh.2021-11"
  },
  "szantho21_isaph": {
   "authors": [
    [
     "Zsuzsa",
     "Szánthó"
    ]
   ],
   "title": "Foreign language anxiety and filled pauses in spontaneous L2 speech",
   "original": "12",
   "page_count": 4,
   "order": 12,
   "p1": 67,
   "pn": 70,
   "abstract": [
    "The purpose of this study was to examine whether there is a connection between foreign language anxiety (FLA) and characteristics of spontaneous speech of Hungarian-speaking Spanish language learners. Speech rate, frequency of occurrence and duration of elements that are used as hesitation disfluencies were analyzed with special attention paid to filled pauses (FP). The results showed that the characteristics of spontaneous speech of Spanish learners showing FLA were typically different from those not showing FLA. The difference was manifested in the occurrence frequency of FPs: FPs were more frequent in the speech of speakers showing FLA, especially the type similar to the neutral vowel [ə] which is the most common in the speech of adult native Hungarians in their mother tongue [1], but differs from typical Spanish FP, which is [eː]. According to a recently published study, the usage of this schwa-like FP in Spanish speech may lead to discrimination of Hungarian learners of Spanish in the labor market [2]. Therefore, we can conclude that FLA could lead to linguistic disadvantage."
   ],
   "doi": "10.21437/ISAPh.2021-12"
  },
  "zetterholm21_isaph": {
   "authors": [
    [
     "Elisabeth",
     "Zetterholm"
    ],
    [
     "Mikko",
     "Kuronen"
    ],
    [
     "Valtteri",
     "Nyyssönen"
    ]
   ],
   "title": "The impact of a short auditory training on L2 pronunciation in languages with different orthographic depth",
   "original": "13",
   "page_count": 5,
   "order": 13,
   "p1": 71,
   "pn": 75,
   "abstract": [
    "It is sometimes assumed that the pronunciation of an L2 is more predictable and thus easier to learn if its orthography is transparent. This study aims to find out whether this assumption holds true in the first stages of L2 learning in languages with different orthographic depth. The study also examines the effect that a short auditory training (supported by simultaneous orthographic input) has on L2 pronunciation. A central finding was that the pronunciation of an L2 with a transparent orthography was not easier to learn for a naïve learner when compared to an L2 with an opaque orthography. A second finding was that even a short period of auditory training can introduce a significant improvement of a naïve L2 learner’s speech. Further, the results show that mimicking one specific native speaker could be an effective strategy for pronunciation learning. This method should be studied in more detail in future research."
   ],
   "doi": "10.21437/ISAPh.2021-13"
  },
  "zhang21_isaph": {
   "authors": [
    [
     "Xiaodan",
     "Zhang"
    ],
    [
     "Joaquín",
     "Romero"
    ]
   ],
   "title": "Investigating the influence of sentence stress perception on foreign accent in utterances",
   "original": "14",
   "page_count": 4,
   "order": 14,
   "p1": 76,
   "pn": 79,
   "abstract": [
    "What constitutes a foreign accent is an intricate matter that involves a wide variety of variables. From the phonological perspective, both segmental and prosodic aspects have been revealed to have an influence on the perception of foreign accent [1]. The current research intends to explore whether ability in prosody perception is correlated with the degree of perceived foreign accent in pronounced utterances. 30 Chinese university students aged 21 to 25 with an intermediate level of English provided oral recordings in the form of text-reading and free-talk,followed by an English sentence stress perception\ntest. Subsequently, 6 native English speakers scored the participants’ recordings in terms of their foreign accent. The performance on sentence stress perception and the scale of foreign accent were compared to explore whether a correlation exists between the two parameters. The results of the statistical analysis indicated a significant positive\ncorrelation. Thus, this study provides new evidence of the need to investigate the acquisition of suprasegmental features in learning English as a foreign language. Based on these findings, effective classroom techniques integrating suprasegmental perception and production could be developed for facilitating EFL learners’ acquisition of proficient pronunciation."
   ],
   "doi": "10.21437/ISAPh.2021-14"
  }
 },
 "sessions": [
  {
   "title": "Keynotes",
   "papers": [
    "carrerasabate21_isaph",
    "mora21_isaph"
   ]
  },
  {
   "title": "Workshops",
   "papers": [
    "quesadavazquez21_isaph"
   ]
  },
  {
   "title": "Oral and Poster Presentations",
   "papers": [
    "ashby21_isaph",
    "baditznepalvolgyi21_isaph",
    "frost21_isaph",
    "iseijaakkola21_isaph",
    "juhasz21_isaph",
    "minematsu21_isaph",
    "rallofabra21_isaph",
    "sansegundo21_isaph",
    "szantho21_isaph",
    "zetterholm21_isaph",
    "zhang21_isaph"
   ]
  }
 ],
 "doi": "10.21437/ISAPh.2021"
}