{
 "series": "ISAPh",
 "title": "ISAPh 2022, 4th International Symposium on Applied Phonetics",
 "location": "Lund, Sweden",
 "startDate": "14/9/2022",
 "endDate": "16/9/2022",
 "URL": "https://konferens.ht.lu.se/the-4th-international-symposium-on-applied-phonetics-isaph-2022/",
 "chair": "Chairs: Shinichiro Ishihara and Mechtild Tronnier",
 "conf": "ISAPh",
 "year": "2022",
 "name": "isaph_2022",
 "SIG": "",
 "title1": "ISAPh 2022, 4th International Symposium on Applied Phonetics",
 "date": "14-16 September 2022",
 "papers": {
  "ashby22_isaph": {
   "authors": [
    [
     "Michael",
     "Ashby"
    ],
    [
     "Patricia",
     "Ashby"
    ]
   ],
   "title": "Practical phonetics in the 21st century",
   "original": "Ashby_Ashby_ISAPh2022",
   "page_count": 6,
   "order": 1,
   "p1": 1,
   "pn": 6,
   "abstract": [
    "This paper is concerned with the teaching, learning and assessment of practical skill in speech sound production which has formed part of general phonetic training in the British tradition for most of the last century, though it is presently in decline. We re-examine the purposes of production training, suggesting that the true purpose is widely misunderstood. We analyse the practices of this training in relation to recent pedagogical thinking and argue that it is student-centred, multi-sensory, and constitutes an unusual example of object-based learning. We scrutinise the arguments used by opponents of the practical approach and relate these to a prevailing scientism. We revisit classic formulations of the methods and benefits of practical training in the published literature, pointing out that even the most recent of these is now more than 20 years old. We indicate ways in which personal computers and mobile devices can now support a reformulated approach to practical training and encourage a reasonable and beneficial integration of practical and laboratory-based approaches to general phonetics."
   ],
   "doi": "10.21437/ISAPh.2022-1"
  },
  "cavalcanti22_isaph": {
   "authors": [
    [
     "Julio Cesar",
     "Cavalcanti"
    ],
    [
     "Anders",
     "Eriksson"
    ],
    [
     "Plinio A.",
     "Barbosa"
    ]
   ],
   "title": "Assessing the speaker discriminatory power asymmetry of different acoustic-phonetic parameters",
   "original": "Cavalcanti_ISAPh2022",
   "page_count": 6,
   "order": 2,
   "p1": 7,
   "pn": 12,
   "abstract": [
    "This pilot study set out to assess the speaker discriminatory power asymmetry regarding parameters from different phonetic dimensions in spontaneous speech, i.e., spectral, melodic, and temporal. The speech material consisted of spontaneous telephone conversations between siblings. The participants were 20 male subjects, Brazilian Portuguese speakers from the same dialectal area. Six acoustic-phonetic parameters were chosen for the comparison: f0 median, f0 baseline, speech rate, articulation rate, F3, and F4. Overall, acoustic parameters pertaining to the speech tempo category depicted the worse performance in terms of speaker discriminatory power when assessed in isolation. Such a trend was indicated by the relatively higher median and mean Cllr and EER values. Moreover, from the set of parameters assessed, high formant frequencies, i.e., F3 and F4, were the best-performing estimates in terms of discriminability depicting the lowest EER and Cllr values. The results suggested a speaker discriminatory power asymmetry concerning different acoustic-phonetic parameters, in which speech tempo estimates presented a lower discriminatory power when compared to melodic and spectral parameters. The findings also suggest that data sampling is crucial for the reliability of Cllr and EER calculations."
   ],
   "doi": "10.21437/ISAPh.2022-2"
  },
  "fujimori22_isaph": {
   "authors": [
    [
     "Atsushi",
     "Fujimori"
    ],
    [
     "Noriko",
     "Yamane"
    ],
    [
     "Ikuyo",
     "Kaneko"
    ],
    [
     "Brian",
     "Teaman"
    ]
   ],
   "title": "Short-term intervention effects on the development of pausing in read speech",
   "original": "Fujimori_Yamane_Kaneko_Teaman_ISAPh2022",
   "page_count": 4,
   "order": 3,
   "p1": 13,
   "pn": 16,
   "abstract": [
    "This study examined whether short-term intervention\nhelps improve L2 fluency in read speech, particularly\nfocusing on pausing in a narrative. The experimental\nresults showed that low level learners of English\nimproved their pause length and pause location, after\nbeing trained with kinesthetic instructions\nappropriately associated with auditory input."
   ],
   "doi": "10.21437/ISAPh.2022-3"
  },
  "juhasz22_isaph": {
   "authors": [
    [
     "Kornélia",
     "Juhász"
    ],
    [
     "Huba",
     "Bartos"
    ]
   ],
   "title": "The interplay of tone and intonation: f0 contours produced by Hungarian learners of Mandarin",
   "original": "Juhasz_Bartos_ISAPh2022",
   "page_count": 5,
   "order": 4,
   "p1": 17,
   "pn": 21,
   "abstract": [
    "In this acoustic analysis we compare the f0 contours of syntactically unmarked Mandarin Chinese (MC) echo-questions to statements in the production of two groups of Hungarian learners of Chinese and a native MC control group. MC and Hungarian differ in terms of question intonation patterns, thus we hypothesized that synchronizing tone and intonation production poses problems to L2 learners of MC due to the different intonation patterns and the absence of tones in the L1. In the experiment speakers were asked to contrast the same 4-syllable utterance in the two analysed moods: as a declarative and as a syntactically unmarked echo-question. We compared f0 contours of each isolated syllable by general additive mixed models. Our results partially confirmed the hypothesis that L2 learners’ production MC questions are not as elevated in their characteristic as natives, yet L2 speakers do differentiate between the two moods in their production but produce terminal tonal patterns differently than those of natives."
   ],
   "doi": "10.21437/ISAPh.2022-4"
  },
  "kallio22_isaph": {
   "authors": [
    [
     "Heini",
     "Kallio"
    ],
    [
     "Mikko",
     "Kuronen"
    ],
    [
     "Liisa",
     "Koivusalo"
    ]
   ],
   "title": "The role of pause location in perceived fluency and proficiency in L2 Finnish",
   "original": "Kallio_et_al_ISAPh2022",
   "page_count": 6,
   "order": 5,
   "p1": 22,
   "pn": 27,
   "abstract": [
    "Fluency is a commonly used descriptor of second\nlanguage (L2) speaking skills. Unplanned and too\nfrequent pauses, hesitations, and repetitions disrupt\nthe flow of speech and can cause temporal irregularities\nat all levels of speech hierarchy, from syllable\nrate to phrasing. However, most studies that attempt\nto quantify fluency disregard pause locations.\nThe current study investigates, whether and which\npause locations affect the perceived fluency and proficiency\nin L2 Finnish.\nSeveral pause parameters were computed from\nspontaneous L2 Finnish speech samples. Pause locations\nwere investigated with regards to clauses and\nphrases as well as incomplete words. The effect of\npause locations to human assessments of fluency and\nproficiency was investigated using linear regression\nmodels.\nThe results suggest that silent and filled pauses\nwithin phrases and pauses after incomplete words\nsignificantly reduce the fluency of L2 Finnish\nspeech, whereas pauses within clauses may even\nhave a positive effect on fluency and proficiency.\nThe results support the role of phrases over clauses\nas bases for prosodic grouping in spontaneous\nFinnish, but further research is needed with native\nspeakers of Finnish. Furthermore, the results encourage\nto investigate the role of pause location parameters\nin comprehensive models for L2 speech\nfluency."
   ],
   "doi": "10.21437/ISAPh.2022-5"
  },
  "krepsz22_isaph": {
   "authors": [
    [
     "Valéria",
     "Krepsz"
    ],
    [
     "Anna",
     "Huszár"
    ]
   ],
   "title": "Acoustical cues as boundary markers in a left-headed language",
   "original": "Krepsz_ISAPh2022",
   "page_count": 6,
   "order": 6,
   "p1": 28,
   "pn": 33,
   "abstract": [
    "Some previous studies have investigated the relationship between syntactic and prosodic structure, especially in those structures that are structured differently. One of the most commonly used methodologies is the variously grouped linguistic units (e.g. name grouping), which has been applied to many languages. The present examination is the adaptation of Wagner’s analysis [2] from English to Hungarian. The aim of the present study is to examine how boundaries of different strengths realize in Hungarian based on the variously coordinated names. The main question of the examination is how the prosodic boundary marker patterns differ from each other regarding their position and syntactic structure.\nDuration, mean fundamental frequency of the names, appearance of silent pause, mean intensity and the appearance of creaky voice were measured regarding the names’ structure (540 items based on 15 speakers reading). \nThe results showed that more boundary markers appeared if the given structure contained a single boundary and/or it was a left-headed structure. Based on the examination of the similarities and differences between the languages, the results of the research contribute to the teaching of Hungarian as a foreign language and to the more accurate operation of the text-to-speech process."
   ],
   "doi": "10.21437/ISAPh.2022-6"
  },
  "leppik22_isaph": {
   "authors": [
    [
     "Katrin",
     "Leppik"
    ],
    [
     "Cristian",
     "Tejedor-García"
    ],
    [
     "Eva Liina",
     "Asu"
    ],
    [
     "Pärtel",
     "Lippus"
    ]
   ],
   "title": "Improving Spanish L1 learners' perception and production of Estonian vowels",
   "original": "Leppik_ISAPh2022",
   "page_count": 6,
   "order": 7,
   "p1": 34,
   "pn": 39,
   "abstract": [
    "This study tests the effectiveness of a CAPT tool tailored for Spanish L1 learners of Estonian to practice the perception and production of Estonian vowels. The tool is designed to train seven vowel contrasts (/i-y/, /u-y/, /ɑ-o/, /ɑ-æ/, /e-æ/, /o-ø/, and /o-ɤ/) that have been shown to be difficult for Spanish L1 learners. When practicing with the CAPT tool the learners first see a theoretical video followed by four training modes: exposure, discrimination, pronunciation and mixed. To assess the effectiveness of the tool an experiment combining training sessions with the tool and pre- and post-testing was conducted. The results show that on the whole the learners’ perception and production improved significantly after the training period, suggesting that CAPT tools are an effective resource for pronunciation practice."
   ],
   "doi": "10.21437/ISAPh.2022-7"
  },
  "li22_isaph": {
   "authors": [
    [
     "Peng",
     "Li"
    ],
    [
     "Xiaotong",
     "Xi"
    ]
   ],
   "title": "Spanish lexical stress produced by proficient Mandarin learners of Spanish",
   "original": "Li_ISAPh2022",
   "page_count": 6,
   "order": 8,
   "p1": 40,
   "pn": 45,
   "abstract": [
    "L2 learners produce the Spanish lexical stress differently from native speakers in various aspects. However, relatively fewer studies have focused on how Mandarin learners of Spanish produce lexical stress and how it influences vowel quality. In this study, ten Mandarin students with advanced Spanish proficiency and six Spanish native speakers completed text-reading and word-reading tasks in Spanish. The results revealed that (a) Mandarin students encoded Spanish lexical stress with pitch contrast more than duration or intensity, which added positive evidence for the phonetic approaches to L2 lexical stress acquisition because only pitch is relevant to Mandarin lexical tones. (b) Moreover, lexical stress enhanced the mouth aperture of /a, o/ for Spanish natives but that of /e, i, o/ for Mandarin students, which suggests that L2 learners still differ from native speakers in speech production, even at a high proficiency level."
   ],
   "doi": "10.21437/ISAPh.2022-8"
  },
  "tseng22_isaph": {
   "authors": [
    [
     "Chiu-ching",
     "Tseng"
    ],
    [
     "Rina Y.",
     "Tseng"
    ]
   ],
   "title": "A Comparison of Lexical Tone Effects on VOT in L1 and Three Groups of L2 Speaker of Mandarin Chinese",
   "original": "Tseng_ISAPh2022",
   "page_count": 6,
   "order": 9,
   "p1": 46,
   "pn": 51,
   "abstract": [
    "This study focuses on the effect of lexical tone on Voice\nOnset Time (VOT) in Mandarin from four different L1\nbackgrounds. It surveys VOT variations between L1 and\nL2 speakers. Although it has been suggested that VOT\nvaries because of different lexical tones in L1 Mandarin [1]\n[2] [3] [4] [5] [6] [7] [8] [9] [10], a question remains as to\nwhether L2 Mandarin from different language\nbackgrounds also exhibits the same effect. Exploring this\ncan potentially shed light on whether tone effect on VOT\nis a language-specific or universal phenomenon. In\nparticular, we ask whether L2 speakers who feature\ndifferent native VOT values, such as Spanish (unaspirated)\n[11], Japanese (weakly-aspirated) [12], and English\n(aspirated) [13] [14] would show the same, similar, or\ndifferent tone effect patterns in comparison to L1 Mandarin\n(highly-aspirated) [2].\nTesting 164 participants (68 Taiwanese, 34 Spanish, 40\nJapanese, and 22 English speakers of Mandarin), the results\nreveal that when other factors were kept constant, tone\nindeed influenced VOT where tone2 and tone3 had\nsignificantly longer VOT values than those in tone1 and\ntone4 in all four groups. All non-native groups showed the\nsame effects regardless of their L1, which suggests that the\ntone effect on VOT in Mandarin is a universal tendency,\nperhaps due to the physiology of the vocal tract rather than\ndue to language-specific phonology. In a baseline VOT\ntest, we also found that the Spanish and Japanese groups\nshowed extended VOT values, which were not from their\nnative VOTs, although their Mandarin VOTs were still\nsignificantly shorter than the native Mandarin speakers.\nThis may be due to the deficient learning of the aspiration.\nAdditionally, the significant VOT differences between\ngroups indicate some degree of L1 influence, which\nsuggests that L2 VOT delay is probably mediated by\nlanguage-specific phonological grammar [17].\nThis cross-linguistic survey offers insight into L2\nperformance variations regarding phonetics, which may\nprovide Mandarin instructors with multi-dimensional\ncomparisons and confirmation of the interlanguage process\nas relevant to Second Language Acquisition [18]. The\nobserved phenomena may aid L2 classrooms insights into\nMandarin accent variations for L2 English, Japanese, and\nSpanish learners of Mandarin."
   ],
   "doi": "10.21437/ISAPh.2022-9"
  }
 },
 "sessions": [
  {
   "title": "Oral and Poster Presentations",
   "papers": [
    "ashby22_isaph",
    "cavalcanti22_isaph",
    "fujimori22_isaph",
    "juhasz22_isaph",
    "kallio22_isaph",
    "krepsz22_isaph",
    "leppik22_isaph",
    "li22_isaph",
    "tseng22_isaph"
   ]
  }
 ],
 "doi": "10.21437/ISAPh.2022"
}