{
 "series": "ISAPh",
 "title": "5th International Symposium on Applied Phonetics (ISAPh 2024)",
 "location": "Tartu, Estonia",
 "startDate": "30/9/2024",
 "endDate": "2/10/2024",
 "URL": "https://sisu.ut.ee/isaph2024/",
 "chair": "Chair: Pärtel Lippus",
 "conf": "ISAPh",
 "name": "isaph_2024",
 "year": "2024",
 "SIG": "",
 "title1": "5th International Symposium on Applied Phonetics",
 "title2": "(ISAPh 2024)",
 "booklet": "intro.pdf",
 "date": "30 September - 2 October 2024",
 "month": 9,
 "day": 30,
 "now": 1733296719159251,
 "papers": {
  "wan24_isaph": {
   "authors": [
    [
     "Tsung-Lun Alan",
     "Wan"
    ]
   ],
   "title": "Communicating Dominance through Prosody in Deaf Speakers of Taiwan Mandarin",
   "original": "ISAPh2024_paper_1",
   "order": 23,
   "page_count": 4,
   "abstract": [
    "This study investigates politeness prosody strategies among Taiwanese deaf adults, aiming to fill a gap in research that has traditionally focused on deaf children. Additionally, it explores whether sociolinguistic prosody varies between individuals who have entered the workforce and those who have not, using workforce entry as a proxy for social age. The research involves a role-playing task where participants enact various scenarios, emphasizing speech acts associated with requests and orders. The study finds that adult deaf speakers do not utilize frequency or temporal cues to convey politeness prosodies, and this utilization is not correlated with the social age operationalized in the study."
   ],
   "p1": 121,
   "pn": 124,
   "doi": "10.21437/ISAPh.2024-23",
   "url": "isaph_2024/wan24_isaph.html"
  },
  "vurma24_isaph": {
   "authors": [
    [
     "Allan",
     "Vurma"
    ],
    [
     "Einar",
     "Meister"
    ],
    [
     "Lya",
     "Meister"
    ],
    [
     "Jaan",
     "Ross"
    ],
    [
     "Marju",
     "Raju"
    ],
    [
     "Veeda",
     "Kala"
    ],
    [
     "Tuuri",
     "Dede"
    ]
   ],
   "title": "Coping with reverberant acoustics in singing by extending the plosive closures in vowel-plosive-vowel sequences",
   "original": "ISAPh2024_paper_5",
   "order": 22,
   "page_count": 6,
   "abstract": [
    "This study examines how the duration of voiceless plosive closures in vowel–plosive–vowel (VCV) sequences affects intelligibility of sung text, particularly in reverberant environments. We hypothesize that extended closure durations reduce the masking effect of reverberation, thus enhancing plosive recognition. Perceptual experiments were conducted with modified closure durations across various acoustic settings, using stimuli created from professional opera singers’ performances. Results indicate that longer closure durations improve plosive recognition in typical concert hall acoustics with reverberation. The findings suggest that singers might improve text intelligibility by lengthening plosive closures."
   ],
   "p1": 115,
   "pn": 120,
   "doi": "10.21437/ISAPh.2024-22",
   "url": "isaph_2024/vurma24_isaph.html"
  },
  "tsukada24_isaph": {
   "authors": [
    [
     "Kimiko",
     "Tsukada"
    ],
    [
     "Jeong-Im",
     "Han"
    ],
    [
     "",
     "Yurong"
    ],
    [
     "Pierre",
     "Hallé"
    ],
    [
     "Rachid",
     "Ridouane"
    ]
   ],
   "title": "Perception of Tashlhiyt Singleton-Geminate Contrasts by Speakers from Korean, Mandarin, and Mongolian Backgrounds",
   "original": "ISAPh2024_paper_6",
   "order": 21,
   "page_count": 5,
   "abstract": [
    "We extend our previous work which examined the effect of first language (L1) on the perception of Tashlhiyt gemination by adding three groups of participants from Korean, Mandarin, and Mongolian backgrounds. Tashlhiyt permits gemination for all consonants in all word positions, whereas the incidence of gemination differs in the participants’ L1s: the lowest in Mandarin, the highest in Korean and Mongolian. This study aims at better understanding non-native perception of consonant gemination.\nThe participants responded to 200 trials of an AXB discrimination task. The overall mean accuracy was 76%, 67%, and 77% for the Korean, Mandarin and Mongolian groups, respectively. All groups had much greater difficulty in word-initial position, although this was modulated by consonant type. (A lesser differential was found for /s/-/ss/ than the other contrasts in all groups.) Overall, the new data are consistent with our earlier proposal that initial and non-initial gemination engage different perceptual processes."
   ],
   "p1": 110,
   "pn": 114,
   "doi": "10.21437/ISAPh.2024-21",
   "url": "isaph_2024/tsukada24_isaph.html"
  },
  "kleen24_isaph": {
   "authors": [
    [
     "Caroline",
     "Kleen"
    ],
    [
     "Marina",
     "Frank"
    ],
    [
     "Alfred",
     "Lameli"
    ]
   ],
   "title": "Vertical Differences in German Vowel Space Areas",
   "original": "ISAPh2024_paper_10",
   "order": 9,
   "page_count": 6,
   "abstract": [
    "This study investigates phonetic variation in German dialects by analyzing vowel space areas (VSAs) across seven regional varieties and three communicative settings: dialect-intended speech (DIS), standard-intended speech (SIS), and read speech (RS). Results reveal significant vertical variation, with smaller VSAs in DIS compared to SIS and RS, reflecting reduced articulatory precision in informal registers. While vowel duration differs significantly across age groups, VSA configurations remain stable, indicating robust phonological structures. Regional variation in DIS highlights local phonetic distinctiveness, while overlaps in SIS and RS underscore the influence of linguistic standardization."
   ],
   "p1": 43,
   "pn": 48,
   "doi": "10.21437/ISAPh.2024-9",
   "url": "isaph_2024/kleen24_isaph.html"
  },
  "diskinholdaway24_isaph": {
   "authors": [
    [
     "Chloé",
     "Diskin-Holdaway"
    ],
    [
     "Debbie",
     "Loakes"
    ],
    [
     "Kirsty",
     "McDougall"
    ]
   ],
   "title": "The sociophonetics of coda /t/ in Dublin English",
   "original": "ISAPh2024_paper_11",
   "order": 4,
   "page_count": 5,
   "abstract": [
    "We present an acoustic study of sociophonetic variation in the realization of coda /t/ in Dublin English. Wordlist data from 21 DubE speakers (11f, 10m) from the north, south and south-west of Dublin are analyzed using acoustic profiling. Extensive variation is present, with 13 variants of /t/ observed. A fricated variant [t̞] is the most common realization (45.6% of tokens), followed by the aspirated stop (41.7%). The remaining 12.7% of tokens include pre-glottalized realizations (5.6%), affricates (2.7%) and other less frequently occurring variants (total 4.4%). Some patterns for gender, location and age are evident, with fricated variants being most prevalent for female speakers and speakers from south Dublin and neighbouring Wicklow, with some limited evidence of frication being more prevalent in younger participants."
   ],
   "p1": 17,
   "pn": 21,
   "doi": "10.21437/ISAPh.2024-4",
   "url": "isaph_2024/diskinholdaway24_isaph.html"
  },
  "dimitrova24_isaph": {
   "authors": [
    [
     "Denitsa",
     "Dimitrova"
    ]
   ],
   "title": "Decoding L1 Influence: Navigating Phonotactic Barriers in L2 German Pronunciation by Bulgarian Speakers",
   "original": "ISAPh2024_paper_15",
   "order": 3,
   "page_count": 6,
   "abstract": [
    "This study investigates the influence of first-language (L1) phonotactics on the pronunciation of German as a second language (L2) by Bulgarian speakers, focusing on the lateral consonant /l/. Bulgarian and German exhibit significant differences in the realization of /l/, with Bulgarian employing two positionally conditioned allophones and German consistently using an alveolar variant. These phonotactic mismatches create challenges for Bulgarian learners, particularly in articulating /l/ before back vowels. Using qualitative acoustic analysis, the study draws on the Perceptual Assimilation Model (PAM) and the Speech Learning Model (SLM) as interpretive frameworks to explore how L1 phonological structures shape L2 sound acquisition. While the findings align with theoretical predictions of perceptual assimilation and equivalence classification, the study highlights the need for further statistical validation. By identifying patterns of L1 influence, this research contributes to understanding cross-linguistic interference and its implications for second-language phonological adaptation."
   ],
   "p1": 11,
   "pn": 16,
   "doi": "10.21437/ISAPh.2024-3",
   "url": "isaph_2024/dimitrova24_isaph.html"
  },
  "mixdorff24_isaph": {
   "authors": [
    [
     "Hansjörg",
     "Mixdorff"
    ],
    [
     "Albert",
     "Rilliard"
    ],
    [
     "Navneet",
     "Nayan"
    ]
   ],
   "title": "Perceptual Evaluation of Attitudinal Expressions",
   "original": "ISAPh2024_paper_16",
   "order": 12,
   "page_count": 5,
   "abstract": [
    "Building upon previous experiments investigating the cross-cultural and cross-linguistic perception of short audio-visual expressions reflecting various attitudes, we conducted a comparative analysis of verbal responses from Indian and German participants to stimuli presented in Hindi. These responses were delivered in either English or Hindi for Indian participants and German for German participants, then normalized and translated into English for analysis. Leveraging a comprehensive study by Warriner et al., encompassing nearly 14,000 lemmas, we aligned our existing labels with their established reference system, enabling a cross-language evaluation. Our findings highlight significant influences of attitude type, participant language, and stimulus language on raters&#x27; responses across dimensions of valence, arousal, and dominance. Correlation analyses within and between rater groups indicate a notable replication of judgments between Indian and German evaluators."
   ],
   "p1": 60,
   "pn": 64,
   "doi": "10.21437/ISAPh.2024-12",
   "url": "isaph_2024/mixdorff24_isaph.html"
  },
  "skarnitzl24_isaph": {
   "authors": [
    [
     "Radek",
     "Skarnitzl"
    ],
    [
     "Tomáš",
     "Bořil"
    ]
   ],
   "title": "Training English prosody with manipulated voices: Can both intermediate and advanced learners benefit?",
   "original": "ISAPh2024_paper_17",
   "order": 18,
   "page_count": 6,
   "abstract": [
    "Prosodic aspects of speech such as intonation and rhythm are crucial for the comprehensibility and fluency of L2 speakers. However, prosody is rarely addressed in English pronunciation teaching. This paper reports on a short prosody-focused training, where participants’ own PSOLA-modified speech was used as model in an adapted listen-and-repeat paradigm. The individualized training, comprising one audio-only and one audio-visual session, was delivered to six intermediate (B-level as per CEFR) and six advanced (C-level) Czech speakers of English. The comparison of before- and after-training reading performance shows that both intermediate and advanced speakers benefitted from the training: their phrasing was more in line with the linguistic structure of the texts, and particularly their melodic variability increased significantly. The implications of the study are discussed especially with respect to awareness-raising."
   ],
   "p1": 94,
   "pn": 99,
   "doi": "10.21437/ISAPh.2024-18",
   "url": "isaph_2024/skarnitzl24_isaph.html"
  },
  "huang24_isaph": {
   "authors": [
    [
     "Yixuan",
     "Huang"
    ],
    [
     "Mariko",
     "Kondo"
    ]
   ],
   "title": "Perception of Voicing Contrast of Japanese Word-Medial Plosives by Japanese and Chinese Listeners",
   "original": "ISAPh2024_paper_18",
   "order": 7,
   "page_count": 5,
   "abstract": [
    "This study investigates the roles of Voice Onset Time (VOT) and closure duration on the perception of voicing contrast of Japanese word-medial plosives by native speakers of Japanese and Chinese. An identification test of voiced and voiceless plosives was conducted using resynthesized stimuli that varied in VOT and closure duration. Twenty native Chinese speakers and fourteen native Japanese speakers participated in the study. The results showed different perceptual patterns of voicing between native speakers of Japanese and Chinese. For native Japanese speakers, closure duration strongly interacted with VOT. In general, longer closure duration tended to be a cue for voicelessness. A negative VOT of -40 ms did not signal 100% voiced responses, whereas a short closure duration of 10 ms signaled almost 100% voiced responses. Neither VOT nor closure duration affected the identification of native Chinese speakers, who gave predominantly voiced responses across all stimuli. The inability of native Chinese speakers to discriminate closure duration differences may explain their poor performance in identifying Japanese word-medial plosives. Overall, this study highlights the importance of closure duration in discriminating the voicing of Japanese word-medial plosives. It also suggests that closure duration should be used to develop perceptual training materials for plosive voicing discrimination for Chinese learners of Japanese."
   ],
   "p1": 33,
   "pn": 37,
   "doi": "10.21437/ISAPh.2024-7",
   "url": "isaph_2024/huang24_isaph.html"
  },
  "puggaardrode24_isaph": {
   "authors": [
    [
     "Rasmus",
     "Puggaard-Rode"
    ],
    [
     "Kathleen",
     "Jepson"
    ]
   ],
   "title": "Stop production in Dhuwaya: Implications for literacy teaching",
   "original": "ISAPh2024_paper_19",
   "order": 14,
   "page_count": 6,
   "abstract": [
    "The Dhuwaya language has a stop inventory with a rich set of place contrasts, and a very limited ‘strength’ contrast that is only found intervocalically in retroflex and (marginally) alveolar stops. The Dhuwaya orthography is overall quite transparent, but the orthography is inherited from a related language with a less limited ‘strength’ contrast, and for this reason there are 12 stop graphemes but only seven or eight stop phonemes, which causes difficulty in early literacy acquisition. In this study, we provide a first pass at an acoustic description of the Dhuwaya stops, and shows that while the stop graphemes do not all signify distinctive phonemes, they are consistently phonetically cued: sounds written with &lt;b d g&gt; etc. have a short closure while sounds written with &lt;p t k&gt; have a long closure."
   ],
   "p1": 71,
   "pn": 76,
   "doi": "10.21437/ISAPh.2024-14",
   "url": "isaph_2024/puggaardrode24_isaph.html"
  },
  "wang24_isaph": {
   "authors": [
    [
     "Bojia",
     "Wang"
    ],
    [
     "Dafydd",
     "Gibbon"
    ]
   ],
   "title": "Duration and Declination in L2 Reading",
   "original": "ISAPh2024_paper_20",
   "order": 24,
   "page_count": 6,
   "abstract": [
    "This study is motivated by requirements to deal with L2 prosody evaluation, as stated, for instance in the Common European Framework of References for Languages (CEFR), and by the importance of prosody in expressing emotion, emphasis, contrast and structure, one functional component of prosody which receives little attention in the literature was picked out for attention: the global property of holistic slope variability (e.g. declination or inclination). Statistical and machine learning methods were used in the context of a novel modulation theoretic ‘Radio Model’ of speech to identify differences in slope properties as a model for global declination-like trends. The different methods were used in order to gain different views of the data, with Southern British English as Ltarget and as L2 for Mandarin Chinese speakers. The null hypothesis that there are no Ltarget-L2 differences was refuted by each of these methods. The results show that the automatic analysis of global F0 trends is potentially viable as support for learner self-instruction and for learner evaluation."
   ],
   "p1": 125,
   "pn": 130,
   "doi": "10.21437/ISAPh.2024-24",
   "url": "isaph_2024/wang24_isaph.html"
  },
  "deme24_isaph": {
   "authors": [
    [
     "Andrea",
     "Deme"
    ],
    [
     "Kornélia",
     "Juhász"
    ],
    [
     "Zsuzsa",
     "Szánthó"
    ],
    [
     "Szabina",
     "Zsoldos"
    ],
    [
     "Reinhold",
     "Greisbach"
    ]
   ],
   "title": "German and Hungarian long and short vowels in fast speech",
   "original": "ISAPh2024_paper_22",
   "order": 2,
   "page_count": 6,
   "abstract": [
    "At faster speech rates, segments are generally expected to be produced shorter, but not every segment may be compressed to the same extent. In both German, and Hungarian we find phonologically distinctive vowel length contrast which is expressed using different combinations of durational and spectral cues. In fast speech, temporal reduction is also expected to be accompanied by some degree of spectral reduction due to target undershoot. As a result, increased speech rate is assumed to endanger the vowel length contrast in both the temporal and the spectral domains of speech. In the present study, we tested this hypothesis and explored whether contrast reduction manifests differently in the two typologically unrelated languages mentioned above. We analyzed the duration of vowels and the duration ratio, and spectral distance in the F1×F2 plane of the short-long vowel pairs produced by 15 Hungarian and 14 German speaking females. Results showed that, in general, both durational and spectral cues of the quantity contrast were preserved. Hence, the quantity contrast was maintained in fast speech in both languages, suggesting that neither durational nor spectral cues of the contrast may be considered redundant."
   ],
   "p1": 5,
   "pn": 10,
   "doi": "10.21437/ISAPh.2024-2",
   "url": "isaph_2024/deme24_isaph.html"
  },
  "greisbach24_isaph": {
   "authors": [
    [
     "Reinhold",
     "Greisbach"
    ],
    [
     "Kornélia",
     "Juhász"
    ],
    [
     "Zsuzsa",
     "Szánthó"
    ],
    [
     "Szabina",
     "Zsoldos"
    ],
    [
     "Andrea",
     "Deme"
    ]
   ],
   "title": "Durational Aspects of fast speech in German",
   "original": "ISAPh2024_paper_24",
   "order": 6,
   "page_count": 6,
   "abstract": [
    "It is debatable whether the phonetic manifestation of the central phonological contrast in the German vowel system is a quantitative (vowel length) or qualitative contrast. An acceleration of articulation has an effect on the duration of the vowels and thus on the quantitative contrast. Acceleration can also lead to greater centralization and thus influence the qualitative contrast. The investigation of fast speech is intended to provide information on which parameter is more resistant and can therefore considered to be the distinctive feature. In the experiment, the corner vowels of 19 native German speakers were examined in normal and fast speech using minimal pairs and analyzed with regard to their duration and quality parameters (formants). A new algorithm for normalizing the formant frequencies is presented. The results go both ways. The qualitative contrast is more robust to speeding up speech. However, the quantitative contrast seems to be more important as it extends from the vowels to all sounds of the analyzed minimal pairs. The two strategies are not correlated, which indicates that the speakers use different individual strategies to increase their speaking rate."
   ],
   "p1": 27,
   "pn": 32,
   "doi": "10.21437/ISAPh.2024-6",
   "url": "isaph_2024/greisbach24_isaph.html"
  },
  "kallio24_isaph": {
   "authors": [
    [
     "Heini",
     "Kallio"
    ],
    [
     "Kamil",
     "Kaźmierski"
    ]
   ],
   "title": "Reduction of unstressed English vowels by EFL speakers with different language backgrounds",
   "original": "ISAPh2024_paper_26",
   "order": 8,
   "page_count": 5,
   "abstract": [
    "This study investigates the reduction of unstressed monophthong vowels by EFL speakers from three L1 backgrounds: Hungarian, Polish, and Slovak. While English stress patterns are varying and stress contrasts strongly realized, the above mentioned languages have fixed word stress and acoustic realizations of stress contrasts are relatively weak. This may cause difficulties for the speakers of these languages in the production of English stress. Scrutinizing EFL stress production by comparing speakers based on their L1 can help in the development of language-aware EFL teaching as well as automatic foreign accent identification.\nSpeech samples from 27 A2–B1 level EFL learners (nine learners per L1 group) and five native speakers of British English were analyzed. Vowel space areas (VSA) and durations were measured separately from stressed and unstressed vowel segments to quantify the level of reduction in unstressed vowels. The results indicate that while EFL learners do reduce both the quality and duration of unstressed vowels when speaking English, the level of reduction is considerably smaller than with native English speakers. Vowel reduction was more weakly realized in terms of vowel duration than VSAs, which indicates the need to emphasize duration-based stress contrasts in EFL teaching. Differences were also observed between EFL groups and possible differences are looked for in L1 transfer effect."
   ],
   "p1": 38,
   "pn": 42,
   "doi": "10.21437/ISAPh.2024-8",
   "url": "isaph_2024/kallio24_isaph.html"
  },
  "nance24_isaph": {
   "authors": [
    [
     "Claire",
     "Nance"
    ],
    [
     "Sam",
     "Kirkham"
    ]
   ],
   "title": "Acquiring tongue shape complexity in consonants with multiple articulations",
   "original": "ISAPh2024_paper_28",
   "order": 13,
   "page_count": 6,
   "abstract": [
    "This paper reports preliminary findings from a small-scale pilot study. Our aim is to understand the interaction of differing bilingual acquisition modes and the development of articulation in children. Specifically, we investigate differences between Scottish Gaelic-English bilingual children from different backgrounds: sequential bilinguals (Gaelic L1), simultaneous bilinguals, and sequential bilinguals (English L1). Ultrasound and acoustic data were collected from sixteen children in Gaelic immersion education in Lewis, Scotland, and eight adults who are professional Gaelic users. Analysis of tongue shapes using Modified Curvature Index and Number of Inflections indicates that children are less able to differentiate multiple lingual gestures. Children from Gaelic-only homes produced more adultlike tongue shapes. These preliminary results indicate that production differences observed between groups of bilinguals may have an origin in the early acquisition of motor control skills."
   ],
   "p1": 65,
   "pn": 70,
   "doi": "10.21437/ISAPh.2024-13",
   "url": "isaph_2024/nance24_isaph.html"
  },
  "francolino24_isaph": {
   "authors": [
    [
     "Davide",
     "Francolino"
    ],
    [
     "Wen",
     "Cao"
    ]
   ],
   "title": "Prosodic challenges among Italian speakers in L2 Mandarin: Preliminary evidence from falling tone production",
   "original": "ISAPh2024_paper_32",
   "order": 5,
   "page_count": 5,
   "abstract": [
    "This study investigates prosodic challenges faced by Italian learners of L2 Mandarin at varying proficiency levels, focusing on the production of the falling tone (T4) within disyllabic phrases that convey multiple prosodic meanings across communicative contexts. Participants’ Mandarin tone proficiency in isolation was first assessed through identification and production tasks. The main experiment involved paired readings of short dialogues eliciting the production of disyllabic target phrases in multiple tone combinations across two sentence types (statement and echo question), with contrastive prosodic focus on syllable 1 (Syl1) or syllable 2 (Syl2). The experiment included 130 pseudo-randomized dialogues (64 target phrases, 70 fillers). The results showed distinct F0 contour patterns for T4 on Syl1 and Syl2. On Syl1, sentence type affected the F0 contour, with a syllable-final rise in statements, indicating difficulty in maintaining the expected T4 fall, due to both tonal and intonational reasons. On Syl2, F0 varied significantly by sentence type, with questions displaying a prominent syllable-final rise, primarily influenced by intonational demands rather than by the production of T4 itself. These findings suggest the presence of prosodic difficulties in tone production that differ from those observed in isolated tone production. Preliminary results indicate that Italian learners prioritize intonation patterns over lexical tone contours, diverging from the prosodic strategies of native Mandarin speakers and compromising tone production accuracy that they may otherwise achieve in isolation. Proficiency emerged as a stronger predictor of tone and intonation accuracy than variables such as University Year and Musicality."
   ],
   "p1": 22,
   "pn": 26,
   "doi": "10.21437/ISAPh.2024-5",
   "url": "isaph_2024/francolino24_isaph.html"
  },
  "teras24_isaph": {
   "authors": [
    [
     "Pire",
     "Teras"
    ],
    [
     "Kristiina",
     "Praakli"
    ]
   ],
   "title": "Variation of vowel /ɤ/ in the speech of teenagers in Saaremaa: A case study",
   "original": "ISAPh2024_paper_34",
   "order": 19,
   "page_count": 5,
   "abstract": [
    "In the context of dialect levelling and the sustainability of regional languages, it is essential to examine which features persist in young people’s speech. This study focuses on the labialization of the vowel õ /ɤ/ as a characteristic feature of the accent of the insular dialect in Estonian. The aim is to determine the variability in the pronunciation of /ɤ/ in the speech of two 12-year-old boys from Kuressaare, Saaremaa. The data is from the spoken corpus compiled within the project “Teen Speak in Estonia” (TeKE, [1]). Acoustic analysis of the vowels õ /ɤ/ and ö /ø/ reveals that their pronunciation does not entirely overlap. There is significant variation in the front-back dimension of /ɤ/, with some variants resembling unrounded back vowel [ɤ] and others resembling rounded front vowel [ø]. In addition, /ø/ has become more backward, indicating an approximation in the quality of these two vowels. Despite the relatively large variation, the labialization of /ɤ/ can be considered a characteristic of the accent of insular dialect in the speech of these two teenagers."
   ],
   "p1": 100,
   "pn": 104,
   "doi": "10.21437/ISAPh.2024-19",
   "url": "isaph_2024/teras24_isaph.html"
  },
  "romero24_isaph": {
   "authors": [
    [
     "Daniel",
     "Romero"
    ],
    [
     "Joaquín",
     "Romero"
    ],
    [
     "Cristina",
     "Crison"
    ]
   ],
   "title": "English vowel perception by Kichwa–Spanish bilingual speakers and Ecuadorian Spanish speakers",
   "original": "ISAPh2024_paper_36",
   "order": 15,
   "page_count": 5,
   "abstract": [
    "The current study aims to evaluate the perception of English high-front vowels, low vowels, and high-back vowels by Kichwa-Spanish bilingual speakers and Ecuadorian Spanish speakers. The study was carried out in Ambato, Ecuador, with 24 Kichwa-Spanish bilinguals and 24 native monolingual speakers of Spanish who were university students from Universidad Técnica de Ambato. The aim was to determine the influence of their linguistic backgrounds on English vowel perception.\nThe investigation responds to two main questions 1) How do perceived phonetic differences between an English sound and its closest L1 counterpart influence the perception of English sounds in bilingual Kichwa-Spanish and monolingual Ecuadorian Spanish learners of English? and 2) To what extent can bilingual Kichwa-Spanish and monolingual Ecuadorian Spanish learners of English distinguish phonetic variations between English sounds and their closest L1 equivalents? The data was gathered by exposing participants to AX and ABX tasks on E-Prime 2.0 software.\nResults from the ABX task indicate that bilingualism did not significantly impact participants&#x27; ability to recognize English vowels. However, findings from the AX task suggest that linguistic background may influence sound discrimination in this task."
   ],
   "p1": 77,
   "pn": 81,
   "doi": "10.21437/ISAPh.2024-15",
   "url": "isaph_2024/romero24_isaph.html"
  },
  "crison24_isaph": {
   "authors": [
    [
     "Cristina",
     "Crison"
    ],
    [
     "Joaquín",
     "Romero"
    ],
    [
     "Leonardo",
     "Oliveira"
    ],
    [
     "Daniel",
     "Romero"
    ]
   ],
   "title": "The impact of visual and auditory training on the production of r-colored vowels by Catalan/Spanish bilingual learners of English as a foreign language",
   "original": "ISAPh2024_paper_37",
   "order": 1,
   "page_count": 4,
   "abstract": [
    "This paper reports on the results of a pilot study that investigated the use of visual and auditory training on the production of r-colored vowels by Catalan/Spanish bilingual learners of English as a foreign language. The study explored two research questions: (a) the influence of these training strategies on the production of r-colored vowels, and (b) the extent to which these strategies contribute to accurate production of r-colored vowels. To address these questions the subjects of the study were required to read a set of words while being recorded with an ultrasound device. The ultrasound data was analyzed using contours created from (x, y) coordinates. Results suggest that, despite continued exposure to the correct input, subjects display a general lack of awareness regarding the articulation of r-colored vowels, as well as heavy reliance on the orthographic representation of the words."
   ],
   "p1": 1,
   "pn": 4,
   "doi": "10.21437/ISAPh.2024-1",
   "url": "isaph_2024/crison24_isaph.html"
  },
  "matthews24_isaph": {
   "authors": [
    [
     "John",
     "Matthews"
    ],
    [
     "Takako",
     "Kawasaki"
    ],
    [
     "Kuniyoshi",
     "Tanaka"
    ]
   ],
   "title": "Cross-linguistic interference in the perception of L2 English fricatives by speakers of Chinese, Japanese, and Vietnamese",
   "original": "ISAPh2024_paper_41",
   "order": 11,
   "page_count": 6,
   "abstract": [
    "This study reports an experiment in which native speakers of Chinese, Japanese, and Vietnamese performed an identification task with English voiceless obstruents. Although these three languages resemble English in distinguishing alveolar from post-alveolar fricatives, they all differ in their phonetic implementation of the post-alveolar. We investigate the impact the different realizations have on categorical perception, as well as the ramifications of phonological neutralization, allophonic alternation, and invariant contrast in each of these languages. Results indicate differences in identification performance based on native language that reflect the mapping between phonological categories and phonetic realizations in addition to the phonological behavior of these segments in different vowel environments in each language."
   ],
   "p1": 54,
   "pn": 59,
   "doi": "10.21437/ISAPh.2024-11",
   "url": "isaph_2024/matthews24_isaph.html"
  },
  "romero24b_isaph": {
   "authors": [
    [
     "Joaquín",
     "Romero"
    ]
   ],
   "title": "Language transfer and articulatory conflict in advanced L1 Spanish/Catalan learners of English",
   "original": "ISAPh2024_paper_44",
   "order": 16,
   "page_count": 6,
   "abstract": [
    "This study investigates the production of coronal consonants in isolation and in sequences by native speakers of Spanish/Catalan who are advanced learners of English as a foreign language. The conflicting articulatory demands of consonants such as /ð/, /ɹ/ and /ɾ/, coupled with the complex relationship between the phonemic and allophonic levels across the two languages, have been observed to result in an increased degree of negative L1 to L2 transfer. Advanced English major students produced the consonants in a series of sentences, in which they appeared either in isolation or in combination of two consonants, which, in turn, could be contiguous or noncontiguous. Measures of relative intensity and duration were obtained for each consonant and compared across contexts using linear mixed-models analyses. Both quantitative and qualitative results indicate that, while the production of single consonants does not cause significant problems, sequences of two consonants result in a high percentage of mispronunciations. These findings are taken as evidence of the complex relationship between the phonemic/phonetic status of coronal consonants cross-linguistically and the difficulty in achieving conflicting articulatory targets, which resutls in increased L1 to L2 negative transfer."
   ],
   "p1": 82,
   "pn": 87,
   "doi": "10.21437/ISAPh.2024-16",
   "url": "isaph_2024/romero24b_isaph.html"
  },
  "salcedo24_isaph": {
   "authors": [
    [
     "Adrián",
     "Salcedo"
    ],
    [
     "Joaquín",
     "Romero"
    ]
   ],
   "title": "Examining L2 Vowel Contrast Perception in the EFL Classroom – A Study on Spanish/Catalan Speaker Acquisition of English Tense and Lax Vowels",
   "original": "ISAPh2024_paper_45",
   "order": 17,
   "page_count": 6,
   "abstract": [
    "This study assessed the cue weighting of vowel duration and spectra in non-native vowel perception among Spanish/Catalan EFL learners of 13-14 years of age and the effect of training in vowel perception and production. A two-alternative forced-choice test was administered, which contained 50 resynthesized beat-bit tokens manipulated in five steps in quantity and quality. Productions of minimal pairs /i/-/ɪ/, /u/-/ʊ/ were also recorded from subjects. The subjects (N=43) were divided into pronunciation trainings. The first group was taught explicitly (N=10), with tense and lax categories; the second group learnt pronunciation implicitly (N=15); the third group learnt length-based vowel categories (N=18). Linear Mixed Models were run to analyze the perception and the production data. The perception analysis revealed a significant reliance on vowel duration at some steps of the continuum, and on vowel quality to a lesser extent. The analysis of the production data found an incipient categorization of /i/ and /ɪ/ albeit differing in native F1-F2 values, and of /u/-/ʊ/ to a lesser extent."
   ],
   "p1": 88,
   "pn": 93,
   "doi": "10.21437/ISAPh.2024-17",
   "url": "isaph_2024/salcedo24_isaph.html"
  },
  "wu24_isaph": {
   "authors": [
    [
     "Vanessa Shih-Han",
     "Wu"
    ],
    [
     "Ying Hsun",
     "Liu"
    ],
    [
     "Shaoren",
     "Lyu"
    ],
    [
     "Ho-hsien",
     "Pan"
    ],
    [
     "Susan Shur-Fen",
     "Gau"
    ]
   ],
   "title": "Backchannel and Filled Pause by Taiwan Mandarin Speakers with Autism",
   "original": "ISAPh2024_paper_52",
   "order": 25,
   "page_count": 6,
   "abstract": [
    "This study examines how native Mandarin speakers with Autistic Spectrum Disorder (ASD) produce the discourse marker [ən] “嗯” which functions pragmatically either as backchannel (BC) or filled pauses (FP). Acoustic cues, including f0 range and Harmonic-to-Noise-Ratio up to 2500 Hz (HNR25), were extracted from the [ən] syllables produced by speakers with ASD or gender- and age-matched comparison groups. Intragroup results showed that some comparison subgroups produced significantly smaller f0 ranges or larger HNR25 for FP than for BC. However, autistic females and children did not distinguish FP and BC at all. Only autistic male youths exhibited significantly higher HNR25 for FP than BC. Inter-group results showed that the autistic youths produced both FP and BC with significantly larger f0 ranges and higher HNR25 than non-ASD youths. In summary, speakers with ASD tend not to distinguish the pragmatic FP and BC functions of [ən]. However, in general, they exhibited a more curved pitch contours and more periodic voice quality for both FP and BC. It is suggested that speakers with ASD speakers produce canonical form but non-autistic speakers may reduce articulatory efforts and produced weakened form for the highfrequency discourse marker [ən]."
   ],
   "p1": 131,
   "pn": 136,
   "doi": "10.21437/ISAPh.2024-25",
   "url": "isaph_2024/wu24_isaph.html"
  },
  "toro24_isaph": {
   "authors": [
    [
     "Tuukka",
     "Törö"
    ],
    [
     "Antti",
     "Suni"
    ],
    [
     "Juraj",
     "Šimko"
    ]
   ],
   "title": "Quantifying sociolinguistic change: Effects of age and gender on dialectal variation in a large corpus of spontaneous Finnish speech",
   "original": "ISAPh2024_paper_53",
   "order": 20,
   "page_count": 5,
   "abstract": [
    "Languages change in multiple ways, from syntax and lexicon to prosody and local phonetic features. The indexicality of those forms depends both on the given social context and what other forms are present. With multiple sources of variation, studying sociolinguistic change is challenging. Instead of analyzing variation of specific phonetic features in a small set of ‘representative’ speakers, this paper presents a purely speech signal-based analysis of Finnish dialects and how gender and age contribute to dialectal variation by analyzing the latent embedding space of a large self-supervised model fine-tuned for language identification. Our results show that the embedding space contains meaningful relationships on the dialect level and suggest that males tend to exhibit clearer dialectal traits than females, with young women on one end of the continuum and older men on the other. The study shows promise for quantifying sociolinguistic change with data from the ‘wild’ on a large scale, complementing the established methodologies."
   ],
   "p1": 105,
   "pn": 109,
   "doi": "10.21437/ISAPh.2024-20",
   "url": "isaph_2024/toro24_isaph.html"
  },
  "malmi24_isaph": {
   "authors": [
    [
     "Anton",
     "Malmi"
    ],
    [
     "Katrin",
     "Leppik"
    ]
   ],
   "title": "Practicing Estonian with SayEst: vowel perception and annotation of the data",
   "original": "ISAPh2024_paper_54",
   "order": 10,
   "page_count": 5,
   "abstract": [
    "This study assesses the efficacy of short, unsupervised speech training with the mobile app SayEst. The data from production, perception, and self-assessment questionnaires of 30 Russian L1 speakers from different proficiency levels were collected before and after using the app. Although there were no significant differences between the pre- and post-test conditions, the results showed that learners&#x27; confidence in speaking in Estonian rose after the training. The beginner learners, in general, made more mistakes than the intermediate and advanced learners. The learners’ mistakes in perception and production reflected the differences and similarities in the phoneme inventories between Estonian and Russian.\nThe pre- and post-test recordings were analyzed by four expert phoneticians who rated the accentedness of each of the phonemes in words on a scale from 1-3. The participants’ recordings and ratings of the annotators will be used to train an L2 speech verifier system that will give the user feedback on each of the segments in a word. The annotators noted that the same vowels that were perceptually difficult for the learners were also difficult to produce. With consonants, the annotators noted problems with plosives, /h/, /l/ and /j/.\nSayEst helps to raise learners’ awareness of their pronunciation and build up their confidence. SayEst is recommended as supplementary material as unsupervised training did not have the hoped effect in perception training. In future studies, we will focus on production and describe the effects of unsupervised training."
   ],
   "p1": 49,
   "pn": 53,
   "doi": "10.21437/ISAPh.2024-10",
   "url": "isaph_2024/malmi24_isaph.html"
  }
 },
 "sessions": [
  {
   "title": "Oral and Poster Presentations",
   "papers": [
    "crison24_isaph",
    "deme24_isaph",
    "dimitrova24_isaph",
    "diskinholdaway24_isaph",
    "francolino24_isaph",
    "greisbach24_isaph",
    "huang24_isaph",
    "kallio24_isaph",
    "kleen24_isaph",
    "malmi24_isaph",
    "matthews24_isaph",
    "mixdorff24_isaph",
    "nance24_isaph",
    "puggaardrode24_isaph",
    "romero24_isaph",
    "romero24b_isaph",
    "salcedo24_isaph",
    "skarnitzl24_isaph",
    "teras24_isaph",
    "toro24_isaph",
    "tsukada24_isaph",
    "vurma24_isaph",
    "wan24_isaph",
    "wang24_isaph",
    "wu24_isaph"
   ]
  }
 ],
 "doi": "10.21437/ISAPh.2024"
}