{
 "title": "International Symposium on Applied Phonetics (ISAPh 2016)",
 "location": "Nagoya, Japan",
 "startDate": "25/3/2016",
 "endDate": "28/3/2016",
 "URL": "http://www.isc.chubu.ac.jp/ISAPh2016/",
 "chair": "Chair: Toshiko Isei-Jaakkola",
 "conf": "ISAPh",
 "year": "2016",
 "name": "isaph_2016",
 "series": "ISAPh",
 "SIG": "",
 "title1": "International Symposium on Applied Phonetics",
 "title2": "(ISAPh 2016)",
 "date": "25-28 March 2016",
 "booklet": "isaph_2016.pdf",
 "papers": {
  "vance16_isaph": {
   "authors": [
    [
     "Timothy J.",
     "Vance"
    ]
   ],
   "title": "JFL Learners and Big Numbers: Pitch-Accent and Phrasing",
   "original": "1",
   "page_count": 4,
   "order": 1,
   "p1": 1,
   "pn": 4,
   "abstract": [
    "﻿Japanese numbers display a bewildering variety of pitch-accent behavior, and textbooks that address this problem at all provide pitch patterns only for small numbers and for large round numbers. Most large numbers in actual conversation, of course, have to be assembled on the fly rather than retrieved from memory. Nonetheless, the pitch patterns that occur on large numbers are quite systematic. Native speakers of Japanese generally produce the same number with the same pitch pattern. Most large numbers are treated like prosodically non-unified compounds in Japanese, that is, as a single major phrase consisting of more than one accent phrase. The pitch patterns that result are strikingly different from the intonation patterns that large numbers carry in English. Not surprisingly, JFL learners who are native speakers of English typically do not produce big numbers in Japanese with anything like the native pitch patterns, which are probably beyond the threshold of what most students can learn without explicit instruction. The question that arises for teachers is whether such instruction is worth the effort.\n"
   ],
   "doi": "10.21437/ISAPh.2016-1"
  },
  "ashby16_isaph": {
   "authors": [
    [
     "Patricia",
     "Ashby"
    ]
   ],
   "title": "Sound Foundations. What’s General in Applied Phonetics?",
   "original": "2",
   "page_count": 10,
   "order": 2,
   "p1": 5,
   "pn": 14,
   "abstract": [
    "﻿Focusing on general phonetics and its role in the world today, this paper explores what the term really means. Against a historical background, it outlines the development of general phonetics from its Victorian inception to the present day. It looks at the theoretical and practical sides of the subject (including ear-training and production training), and summarizes the IPA Certificate examination syllabus [1, 2]. The paper considers the impact of reduced training opportunities and asks what this means for availability of expertise in terms of the widening demand for qualified practitioners.\nArguing the importance of general phonetics in the modern world, the paper further seeks to encourage and promote the subjects’ future security. It asks whether general phonetics is the same today as a century ago and whether we need it. Additionally, the paper seeks to clarify the confusion which seems to exist for some people today between the ‘pure’and‘applied’forms of the subject [3]. "
   ],
   "doi": "10.21437/ISAPh.2016-2"
  },
  "minematsu16_isaph": {
   "authors": [
    [
     "Nobuaki",
     "Minematsu"
    ]
   ],
   "title": "OJAD: Web-based Prosodic Reading Tutor of Japanese",
   "original": "3",
   "page_count": 7,
   "order": 3,
   "p1": 15,
   "pn": 21,
   "abstract": [
    "﻿Learning prosodic control for speaking Japanese is effective to reduce syntactic and lexical ambiguity and to improve the comprehensibility of learners’spoken Japanese. Good prosody can also improve its naturalness. In the conventional curriculum however, prosody training has not been provided satisfactorily for learners partly because of scarcity of teaching materials. To facilitate prosody training with speech\ntechnologies, we developed a web-based system called OJAD (Online Japanese Accent Dictionary) [1] and in OJAD, a prosodic reading tutor of Japanese, Suzuki-kun, is provided. In the current paper, technical development of Suzuki-kun and its effectiveness is described. Experiments show that Suzukikun’s visualized prosody can help learners more effectively than model utterances.  \n"
   ],
   "doi": "10.21437/ISAPh.2016-3"
  },
  "hirose16_isaph": {
   "authors": [
    [
     "Keikichi",
     "Hirose"
    ]
   ],
   "title": "Speech Prosody in Phonetics and Technology",
   "original": "4",
   "page_count": 4,
   "order": 4,
   "p1": 22,
   "pn": 25,
   "abstract": [
    "﻿As features unique to spoken language, speech prosody plays an important role in human communication. Although the acoustic features of speech are viewed most frequently in a frame-by-frame manner, this is not always appropriate for prosodic features, since they are tightly related to higher level linguistic information, such as syntactic and discourse structures, and spread to wide time spans, such as syllables, words, and phrases. In order to handle the situation, models for prosody have been developed. Among many models, the generation process model of fundamental frequency contours is attractive, since it can relate well to the linguistic information of utterances. The model was successfully applied to hidden Markov model (HMM) based speech synthesis and a listening test\nto determine the (perceptual) categorical boundaries of Japanese accent types.\n"
   ],
   "doi": "10.21437/ISAPh.2016-4"
  },
  "munro16_isaph": {
   "authors": [
    [
     "Murray J.",
     "Munro"
    ]
   ],
   "title": "Pronunciation Learning and Teaching: What can Phonetics Research Tell Us?",
   "original": "5",
   "page_count": 4,
   "order": 5,
   "p1": 26,
   "pn": 29,
   "abstract": [
    "﻿Contemporary research on the learning and teaching of second language (L2) pronunciation indicates that “applied phonetics” must be defined as something more than simply “phonetics applied.” Rather, pronunciation teaching has evolved into a separate field of inquiry with its own priorities and methodologies. Here I synthesize concepts and findings from adult L2 pronunciation research that can inform teaching practices. In doing so, I take the view that evidence-based pronunciation teaching is both possible and effective, but that it must be rooted in research that is specifically focused on pedagogy, rather than on notions extrapolated from general observations about speech. Such a position requires that we dismiss certain conventional “commonsense” notions about the L2 learning process and replace them with empirically-motivated principles. In the first place learners are more apt to be judged successful in L2 phonetic learning if we take a pragmatic view based on practical communication skills rather than emphasize the achievement of a high degree of phonetic accuracy, which is neither necessary nor likely to occur. Second, while pronunciation instruction can be effective, it must accommodate large variation in individual learning trajectories. Contrary to some popular opinion, particular learners’ segmental and prosodic difficulties are, for the most part, not predictable from their L1 backgrounds in any useful way. Rather, they are subject to a wide range of social and cognitive influences. Consequently, the best pedagogy is not a fixed curriculum that surveys all or most of the L2 sound system, but one that is easily adapted to individual learner differences.  \n"
   ],
   "doi": "10.21437/ISAPh.2016-5"
  },
  "cao16_isaph": {
   "authors": [
    [
     "Wen",
     "Cao"
    ]
   ],
   "title": "When and How shall Tones Be Taught in Chinese Learning?",
   "original": "6",
   "page_count": 4,
   "order": 6,
   "p1": 30,
   "pn": 33,
   "abstract": [
    "﻿Chinese is one of the tonal languages. It has 4 syllabo-morphemic contour tones. Many CSL learners and teachers take tones as the most difficult part in mastering pronunciation. Traditionally, teachers tend to emphasize the initial-final-tone or vowel-consonant-tone orders in teaching. However, in my opinion, tones should be clearly and fully taught from the very beginning. In brief, I call it “Tones First”. After explicitly describing the foundational reasons, I will put forth what should be basically considered for enacting the TF principle. In short, the following factors must be taken into consideration: (1) the common segmental units that both L1 and L2 have; (2) tone combinations; (3) the interaction of tone and intonation; (4) the interaction of tone and stress. Reasonable arrangement or design will make teaching and learning more effective. Some examples are given in this article.\n",
    ""
   ],
   "doi": "10.21437/ISAPh.2016-6"
  },
  "shi16_isaph": {
   "authors": [
    [
     "Shuju",
     "Shi"
    ],
    [
     "Nobuaki",
     "Minematsu"
    ],
    [
     "Yutaka",
     "Yamauchi"
    ]
   ],
   "title": "A Corpus-based Analysis of Shadowing Speech: Case of L2 English by Japanese Learners",
   "original": "7",
   "page_count": 4,
   "order": 7,
   "p1": 34,
   "pn": 37,
   "abstract": [
    "﻿In this study we intend to investigate the typical phenomena in shadowing speech and work out a tentative scheme for shadowing speech labeling. Our aim is two-fold: a) to give useful feedback to students and teachers who are using shadowing as a way of language learning; b) to explore the possibility of automatic assessment and error detection of shadowing speech. We firstly labeled a shadowing corpus, which includes data from 10 male and 10 female students, where their speaking proficiency ranges from low, to intermediate to high level. Then we did statistical analysis on the labeled phenomena and our preliminary results are: 1) roughly defining ten prototypes of speech phenomena in shadowing, including substitution, insertion, omission, filled pause, repetition, grammatical errors (tense, voice, etc.), whispering, rearrangement of words’ order, prosodic shadowing (shadowing without grasping the actual content of the speech) and combing parts from several words into one; 2) analyzing the subtypes within each prototype and finding that some types are gender/speaker dependent, and others are gender/speaker independent; 3) finding good correlation between our defined phenomena and shadowers’ overall language proficiency.\n",
    ""
   ],
   "doi": "10.21437/ISAPh.2016-7"
  },
  "uchida16_isaph": {
   "authors": [
    [
     "Yoko",
     "Uchida"
    ],
    [
     "Junko",
     "Sugimoto"
    ]
   ],
   "title": "A Survey of Japanese English Teachers' Attitudes Towards Pronunciation Teaching and Knowledge on Phonetics: Confidence and Teaching",
   "original": "8",
   "page_count": 5,
   "order": 8,
   "p1": 38,
   "pn": 42,
   "abstract": [
    "﻿In light of the significant role of teachers in pronunciation, we conducted a questionnaire survey in the summer of 2015 in an attempt to reveal the problem areas in English pronunciation faced by Japanese teachers of English. A total of 100 public junior high school teachers in Tokyo responded to the survey. The preliminary analysis revealed positive correlations between “emphasis on pronunciation instruction” and “confidence,” while a negative correlation was　established between “do not know how to teach” and “confidence.” As expected, there was a negative correlation between “do not know how to teach” and “emphasis on instruction,” and those who “do not know how to teach” tended to claim “no time to teach” and “students show no interest.” The results point to the possible existence of two types of teachers: those who are comfortable teaching pronunciation in class and those who are not. \n   Further analysis will be necessary to provide clarity about the two groups by finding out their profiles in detail. Data concerning the major phonetic features taught in class and/or the extent of knowledge that teachers have should be incorporated into the analysis as well. Personal interviews will also be necessary to investigate any assistance teachers may require.\n"
   ],
   "doi": "10.21437/ISAPh.2016-8"
  },
  "sugimoto16_isaph": {
   "authors": [
    [
     "Junko",
     "Sugimoto"
    ],
    [
     "Yoko",
     "Uchida"
    ]
   ],
   "title": "A Variety of English Accents Used in Teaching Materials Targeting Japanese Learners",
   "original": "9",
   "page_count": 5,
   "order": 9,
   "p1": 43,
   "pn": 47,
   "abstract": [
    "﻿The present study analyzes the audio materials that accompany six government-approved textbooks for Japanese junior high school students to determine the variety of English accents used and to discuss the choice of pronunciation and listening models for Japanese learners. Despite the fact that the textbooks introduce various characters, not only from the Inner Circle but also from the Outer and Expanding Circles, a small-scale accent identification experiment reveals discrepancy between the textbook characters’ descriptions and their accents. In other words, the diversity of English speakers is reflected in the content of the textbooks, but not in their audio materials. Although pronunciation and listening models are not specified in the Course of Study (i.e., the government’s curriculum guidelines), the North American accent is observed to be predominant. Apart from the teachers’ pronunciation, textbook audio materials are the primary source for listening study in classrooms. Although careful attention is required when choosing pronunciation and listening models for students, teachers must also be aware of the importance of exposing students to a variety of accents, both to enhance students’ awareness of English diversity and to build their confidence as English speakers. "
   ],
   "doi": "10.21437/ISAPh.2016-9"
  },
  "lei16_isaph": {
   "authors": [
    [
     "Hsiang-Yu",
     "Lei"
    ]
   ],
   "title": "An Acoustic Analysis on the Allotonic Variation of the Initial Rise in Tokyo Japanese in Native Speakers and Learners",
   "original": "10",
   "page_count": 4,
   "order": 10,
   "p1": 48,
   "pn": 51,
   "abstract": [
    "﻿Tokyo Japanese is characterized by an initial rise in pitch, which has an allotonic variation: the rise is weakened or flattened when the initial syllable includes a special mora (i.e. CVN̲ or CVV̲; geminate excluded). The present study tested and measured the pitch rise of native speakers and learners in read speech. Results showed that both native speakers and learners demonstrated dependency on the existence of the special morae when realizing the initial syllable. Pitch height successfully helped learners enlarge the distinction between the two allotones.\n"
   ],
   "doi": "10.21437/ISAPh.2016-10"
  },
  "abel16_isaph": {
   "authors": [
    [
     "Jennifer",
     "Abel"
    ],
    [
     "Heather",
     "Bliss"
    ],
    [
     "Bryan",
     "Gick"
    ],
    [
     "Masaki",
     "Noguchi"
    ],
    [
     "Murray",
     "Schellenberg"
    ],
    [
     "Noriko",
     "Yamane"
    ]
   ],
   "title": "Comparing Instructional Reinforcements in Phonetics Pedagogy",
   "original": "11",
   "page_count": 4,
   "order": 11,
   "p1": 52,
   "pn": 55,
   "abstract": [
    "﻿This study contrasts different instructional reinforcements in the teaching of phonetics, i.e., learning tasks that supplement a classroom lecture on a phonetic contrast. 152 introductory linguistics students were split into four groups, each of which received the same lecture but a different instructional reinforcement, as follows: (1) a baseline textbook-style handout explaining the contrast, (2) classroom production practice, repeating after an instructor in unison, (3) pairwise production practice, in which students practice contrasts and give each other feedback, and (4) watching enhanced ultrasound videos illustrating the contrast [1]. Students were given a quiz evaluating their comprehension of the places of articulation and their perception of the contrast immediately after the activities and again one week later. We found that there were no large differences between the groups. While phonetics learning is argued to be improved through student engagement [2, 3, 4], interactivity [5], and pairwise practice [6], group 4 did not receive any of these but nevertheless performed as well as the other groups. We conclude that reinforcement using non-interactive enhanced ultrasound videos can be as effective as traditional classroom reinforcements at teaching phonetic contrasts.\n"
   ],
   "doi": "10.21437/ISAPh.2016-11"
  },
  "lee16_isaph": {
   "authors": [
    [
     "Wai-Sum",
     "Lee"
    ]
   ],
   "title": "Gender-related Frequency Characteristics in Children’s Speech",
   "original": "12",
   "page_count": 6,
   "order": 12,
   "p1": 56,
   "pn": 61,
   "abstract": [
    "﻿This study investigates the two frequency characteristics, F0 and F1F2, of the speech of Cantonese children, male and female, of nine age groups from 4 to 12. The F0 data on the Cantonese tones [55 33 22] from children show that (i) the patterns of the age-related decrease in F0 are similar between male and female children before age 12; (ii) at age 12, there is a large drop in F0 in male children, but not female children; and (iii) a significant difference in F0 between the two genders occurs only at age 12. The formant data on the five Cantonese vowels [i u ɛ ɔ a] show that the patterns of the overall drop in F1F2 as a function of age between male and female children are similar. The gender differences in F1F2 emerge at age 7 and increase significantly at age 12. Generally speaking, for Cantonese children, the gender-related difference lies mainly in F1F2 not F0, similar to the frequency data from English children reported in previous studies, which suggests a possible universal pattern of frequency development in children’s speech.\n"
   ],
   "doi": "10.21437/ISAPh.2016-12"
  },
  "ooigawa16_isaph": {
   "authors": [
    [
     "Tomohiko",
     "Ooigawa"
    ]
   ],
   "title": "Japanese Listeners’ Perception of American English Intervocalic /l/, /r/ and Flapped /t/",
   "original": "13",
   "page_count": 6,
   "order": 13,
   "p1": 62,
   "pn": 67,
   "abstract": [
    "﻿In order to apply the principles of perception to EFL phonetic education, the present study examined perception of American English intervocalic /l/ ([l]), /r/ ([ɹ]) and flapped/tapped /t/ ([ɾ]) by Japanese listeners. The results indicated that the listeners discriminated the [ɹ]-[ɾ] contrast better than the [l]-[ɹ] and [l]-[ɾ] contrasts. Most of both English [l] and [ɹ] stimuli were perceptually assimilated to Japanese /r/ or sounds that include /r/, while [ɾ] was mostly assimilated to Japanese /d/ and /r/. English [ɾ] was rated as the most Japanese-like sound of the three consonants.\n"
   ],
   "doi": "10.21437/ISAPh.2016-13"
  },
  "yang16_isaph": {
   "authors": [
    [
     "Li-chiung",
     "Yang"
    ]
   ],
   "title": "Optimizing Pronunciation and Prosody Teaching in Second Language Learning",
   "original": "14",
   "page_count": 6,
   "order": 14,
   "p1": 68,
   "pn": 73,
   "abstract": [
    "﻿There has been a growing realization of the importance of authentic human interactions attendant to both first and second language learning. By contrast to L1 learners, the older L2 learner faces a greatly changed learning environment and more adult-oriented communicative opportunities, and must overcome loss of aural sensitivity and limited exposure to the prosodic systems of expressiveness appropriate to the target language. Research has shown that exposure to the suprasegmental levels of authentic speech has significant positive effects on learners’ fluency in production. The current paper reports preliminary results on the experience of adopting a 2nd language teaching method for medium to advanced learners of English that focuses on improving phonetic pronunciation and prosodic competence towards native-like competency. The method adopted prioritizes shadowing and training in aural sensitivity to authentic language at the suprasegmental level.\n"
   ],
   "doi": "10.21437/ISAPh.2016-14"
  },
  "takahashi16_isaph": {
   "authors": [
    [
     "Kinuko",
     "Takahashi"
    ],
    [
     "Tomohiko",
     "Ooigawa"
    ]
   ],
   "title": "Perception of American and Australian English “can” and “can’t” by Japanese Listeners:How to Teach “can” and “can’t”",
   "original": "15",
   "page_count": 6,
   "order": 15,
   "p1": 74,
   "pn": 79,
   "abstract": [
    "﻿In order to follow up on a past study ([1]), the present research examined Japanese listeners’ perception of American and Australian English utterance-final “can” and “can’t” ([kæ̃n]-[kæ̃ʔ] and [kæ̃n]-[kɐ̃ʔ], respectively).¹ The results showed that Japanese listeners discriminated the Australian contrast better than the American contrast because of their ability to detect the differences in the vowel quality between [kæ̃n] and [kɐ̃ʔ]. The results of the present study are eventually going to be applied to teach Japanese EFL students how to discriminate the contrast, as they tend to misunderstand messages due to poor discrimination between the two.\n"
   ],
   "doi": "10.21437/ISAPh.2016-15"
  },
  "hsu16_isaph": {
   "authors": [
    [
     "Chieh-hsin",
     "Hsu"
    ],
    [
     "Hsin-yi",
     "Hung"
    ]
   ],
   "title": "The Effects of the Nasal Duration and the Position of the Moraic Nasals on the Perception of /N/: A Study of TJL2",
   "original": "16",
   "page_count": 4,
   "order": 16,
   "p1": 80,
   "pn": 83,
   "abstract": [
    "﻿This study aims to examine how the nasal duration and the position of the moraic nasals would influence the learners’ perception of Japanese moraic nasals (/N/). The subjects of the study are seventy-two university learners who are learning Japanese as a second language in Taiwan (TJL2). Fifty-four of the subjects have passed Japanese-Language Proficiency Test level N1-N2, while the other subjects are with the Japanese proficiency level between N3-N5. Through the test of this study, we can also understand if learners with different Japanese proficiency levels would have different patterns in perceiving Japanese moraic nasals. The results were shown as follows: 1. The moraic nasals in the final position were perceived with shorter nasal duration. 2. The learners with higher Japanese language proficiency perceived the moraic nasals with shorter nasal duration. 3. The manner of articulation might be more crucial than the nasal duration when the moraic nasal is not adjacent to a nasal sound. "
   ],
   "doi": "10.21437/ISAPh.2016-16"
  },
  "guerry16_isaph": {
   "authors": [
    [
     "Marine",
     "Guerry"
    ],
    [
     "Takaaki",
     "Shochi"
    ],
    [
     "Albert",
     "Rilliard"
    ],
    [
     "Donna",
     "Erickson"
    ]
   ],
   "title": "Perception of Prosodic Social Affects in Japanese by American Learners of Japanese",
   "original": "17",
   "page_count": 5,
   "order": 17,
   "p1": 84,
   "pn": 88,
   "abstract": [
    "﻿This study investigates whether people can infer a speaker's social affective expressions in a language that is not their native language, by examining the variable lexical labels used to identify them. A free labeling paradigm shows evidence of cultural specificity in the perceptual behavior of listeners. Subjects were 16 US English listeners, asked to name the affective expressions carried by a set of stimuli. The results showed that their perceptual behavior was quite coherent relative to the expressions intended by the speakers. Also, despite the fact that \"kyoshuku\" is not a conventionalized expression in US culture, listeners' terms to describe it were in accordance with the intended expression. The Japanese prosodic expression of seduction was described as “happy” or “joy” by native listeners whereas “flirtatious” was a term used by US English listeners; a so-called “seductive” expression may be more conventionalized in western cultures than in Japan.\n"
   ],
   "doi": "10.21437/ISAPh.2016-17"
  },
  "nealy16_isaph": {
   "authors": [
    [
     "Marcellus",
     "Nealy"
    ]
   ],
   "title": "SIP (Simplicity, Imagination and Physicality): A Teaching Approach for Improving Student Engagement and Learning Outcomes in the Pronunciation Classroom",
   "original": "18",
   "page_count": 6,
   "order": 18,
   "p1": 89,
   "pn": 94,
   "abstract": [
    "﻿Many pronunciation teachers today face the dilemma of how to teach pronunciation in a way that allows students to get the repetitive practice they need without diminishing student motivation. The SIP approach aims to explore this question. SIP stands for simplicity, imagination and physicality. It is a pedagogical protocol that was inspired by Kieran Egan who wrote, “to bring knowledge to life in students’ minds, we must introduce it to students in the context of the human hopes, fears and passions in which it finds its fullest meaning. The best tool for this is the imagination” [1]. Cognitive learning theory and experiential learning theory also contributed to the SIP framework. Two SIP based classroom activities were given to the students to complete in the classroom. 70 students were surveyed to determine how they defined imaginative teaching and how much they valued it. They were also asked to evaluate the SIP activities. The results showed that 100% of those surveyed believed imaginative lessons helped them feel motivated. A majority of the respondents also stated that the two SIP based activities helped them to better visualize and recall the key pronunciation points that had been taught and practiced through the activities. "
   ],
   "doi": "10.21437/ISAPh.2016-18"
  },
  "yokomoto16_isaph": {
   "authors": [
    [
     "Katsuya",
     "Yokomoto"
    ]
   ],
   "title": "Teacher Training and Approaches to EFL Pronunciation Teaching",
   "original": "19",
   "page_count": 6,
   "order": 19,
   "p1": 95,
   "pn": 100,
   "abstract": [
    "﻿Although previous studies have shown that many language teachers neglect pronunciation teaching, only a few of those studies have been conducted in EFL contexts. This study is therefore designed to investigate current pronunciation teaching practice, particularly teachers’ instructional decision-making and their backgrounds, at universities in Tokyo, Japan. In total 92 teachers participated in an online survey, and results showed that most respondents were teaching pronunciation as opposed previous studies where many in-service teachers reported to be neglecting pronunciation teaching. Furthermore, length of training in pronunciation teaching and confidence in knowledge about effective pronunciation teaching methods were significantly correlated. Respondents’ confidence in knowledge about effective pronunciation teaching methods was also found to be a significant predictor of the frequencies of use of explicit pronunciation teaching and mechanical drills, and confidence in diagnosing learners’ pronunciation significantly predicted the frequency of providing pronunciation models. As explicit instruction and providing feedback have been found to be effective in pronunciation teaching, teacher training with an emphasis on pedagogical pronunciation should be encouraged to foster knowledge of pronunciation instructional techniques in language teachers. With the knowledge through teacher training, they further gain confidence in teaching pronunciation and can then make informed instructional decisions."
   ],
   "doi": "10.21437/ISAPh.2016-19"
  },
  "saunders16_isaph": {
   "authors": [
    [
     "Gladys E.",
     "Saunders"
    ]
   ],
   "title": "Teaching an Undergraduate Course on French Phonetics in the Era of Globalization : Complex Concerns",
   "original": "20",
   "page_count": 6,
   "order": 20,
   "p1": 101,
   "pn": 106,
   "abstract": [
    "﻿This paper takes up some of the challenges involved in teaching an undergraduate course on French phonetics in the era of globalization. The challenges or concerns that are mentioned here fall into two categories—those external to the classroom, such as the role and place of phonetics in the French curriculum today; and those internal to the classroom, pertaining more directly to what is being taught and learned in the phonetics course. The paper also looks at student views and opinions on the French phonetics course. These were taken from three sources: (1) comments written by the students on their ‘first-day-of-courses’ survey forms, (2) their end-of-term phonetics projects and (3) their anonymously written student course evaluations, filed at the end of the semester. Overwhelmingly, students viewed the phonetics course as a tool to help them improve their own pronunciation and accent; and expressed little interest in learning general phonetic principles.\n"
   ],
   "doi": "10.21437/ISAPh.2016-20"
  },
  "wah16_isaph": {
   "authors": [
    [
     "Michelle Ma Ka",
     "Wah"
    ]
   ],
   "title": "The Effectiveness of Using IPA in Early English Phonetic Education to Japanese Preschoolers",
   "original": "21",
   "page_count": 6,
   "order": 21,
   "p1": 107,
   "pn": 112,
   "abstract": [
    "﻿This study examines the effectiveness of using the International Phonetic Alphabet (IPA) as a teaching tool in improving the English vowels produced by the Japanese preschoolers aged 4 and 5. Based on the assessments on vowel production of the same target groups in the previous study in Ma (2016), 10 lessons were given in attempt to address their common weakness at pronouncing English back vowels including /u:/, /ʊ/, /ɔ:/, and /ɒ/ in monosyllabic words. IPA is used to teach pronunciation in the experimental group, whereas the children of a control group are given the common teaching practice by using spelling. Individual pronunciation performances are collected before and after the education program is given. An acoustic analysis is conducted by SUGI Speech Analyzer to measure the learners’ formant frequencies and plot the vowel spaces. After that, the native children’s data collected by Hillenbrand et al was employed as a standard to compare changes in vowel quality between the two groups. The results show the improvements of back vowels in the majority of IPA group, while the decent changes in the spelling group are relatively minimal.\n"
   ],
   "doi": "10.21437/ISAPh.2016-21"
  },
  "hiraishi16_isaph": {
   "authors": [
    [
     "Nobuhisa",
     "Hiraishi"
    ]
   ],
   "title": "The Use of 2D Real-Time Visual Feedback Software in Foreign Vowel Sound Production Training",
   "original": "22",
   "page_count": 4,
   "order": 22,
   "p1": 113,
   "pn": 116,
   "abstract": [
    "﻿SonicPrint™, a free 2D real-time visual feedback software for windows was adjusted and installed in a CALL room at a university in Japan and applied for English vowel pronunciation training with a total of 97 students for four times. The vowel sounds produced by the students were recorded on three occasions, pre-training, post-training, and one month after the post-training. The formant frequency measurements of eight randomly-selected students were analysed and mapped on F1-F2 vowel charts. Although a powerful L1 vowel influence was observed, the vowel training software has shown promising results.\n"
   ],
   "doi": "10.21437/ISAPh.2016-22"
  },
  "song16_isaph": {
   "authors": [
    [
     "Renshuang",
     "Song"
    ]
   ],
   "title": "Using Venn Diagram and Sensory Integration in Chinese EFL Learners’ Pronunciation Drill",
   "original": "23",
   "page_count": 5,
   "order": 23,
   "p1": 117,
   "pn": 121,
   "abstract": [
    "﻿Foreign language learners tend to mispronounce sounds in the target language by subconsciously searching and substituting with “similar corresponding sounds” in their native dialects. Correction of EFL pronunciation is thus difficult for both instructors and learners. Yet Critical Period Hypothesis is being increasingly misused by Chinese teachers and researchers as an excuse for not paying attention to learners’ pronunciation habits. To address this problem with an effective learning strategy, the paper proposes a two-step approach, i.e., Step 1, the use of Venn diagram as visual organizer by mapping the phones of native language and target language into the sets in a clear and logical manner; and Step 2, the use of sensory integration pronunciation exercise to realize self-monitored oral-motors of the learners. An intensive five-minute instruction with the aid of Venn diagram and sensory integration pronunciation exercise of diphthongs is given to Chinese learners to elicit differences in diphthongs between target language and native language. Results of phonetic data analyses show that learners made significant improvements in accuracy after the two-step intensive training. Language instructors should therefore be aware of the effects of a) Venn diagram visual aid as a prototype to compare and differentiate the seemingly similar “corresponding sounds” against native language interference, and b) sensory integration in pronunciation training as a positive habit-forming practice.\n"
   ],
   "doi": "10.21437/ISAPh.2016-23"
  }
 },
 "sessions": [
  {
   "title": "Keynote Lecture Papers",
   "papers": [
    "vance16_isaph",
    "ashby16_isaph",
    "minematsu16_isaph",
    "hirose16_isaph",
    "munro16_isaph",
    "cao16_isaph"
   ]
  },
  {
   "title": "Selected Papers",
   "papers": [
    "shi16_isaph",
    "uchida16_isaph",
    "sugimoto16_isaph",
    "lei16_isaph",
    "abel16_isaph",
    "lee16_isaph",
    "ooigawa16_isaph",
    "yang16_isaph",
    "takahashi16_isaph",
    "hsu16_isaph",
    "guerry16_isaph",
    "nealy16_isaph",
    "yokomoto16_isaph",
    "saunders16_isaph",
    "wah16_isaph",
    "hiraishi16_isaph",
    "song16_isaph"
   ]
  }
 ],
 "doi": "10.21437/ISAPh.2016"
}