{
 "series": "ISSP",
 "title": "ISSP 2024 - 13th International Seminar on Speech Production",
 "location": "Autrans, France",
 "startDate": "13/05/2024",
 "endDate": "17/05/2024",
 "URL": "http://issp24.sciencesconf.org",
 "chair": "Cécile Fougeron and Pascal Perrier",
 "conf": "issp",
 "name": "issp_2024",
 "year": "2024",
 "title1": "ISSP 2024 - 13th International Seminar on Speech Production",
 "booklet": "intro.pdf",
 "date": "13-17 May 2024",
 "month": 5,
 "day": 13,
 "now": 1719734271123587,
 "papers": {
  "kochetov24_issp": {
   "authors": [
    [
     "Alexei",
     "Kochetov"
    ],
    [
     "Pierre",
     "Badin"
    ]
   ],
   "title": "A constriction geometry analysis of place contrasts in Malayalam nasals",
   "original": "006",
   "order": 1,
   "page_count": 4,
   "abstract": [
    "This study examines the constriction geometry of a typologically rare 6-way place contrast in Malayalam nasals. This is done using static MRI data obtained from two speakers. The measures of tongue constriction angle (higher for more posterior places) and tongue constriction length (higher for laminals and dorsals) were found to provide a relatively good characterization of the contrast. Altogether, all pairs of consonants were statistically distinguished by a combination of these variables except for the dental vs. alveolar contrast (and two other pairs for one of the speakers). The nasal consonants were realized as apico-laminal dental /n̪ /, apical alveolar /n/, laminal alveolar or alveolopalatal /ɲ/, subapical palatal (retroflex) /ɳ/, fronted velar /ŋj/ and (plain) velar /ŋ/. This is largely consistent with previous phonetic descriptions of the sounds and earlier palatographic data available for coronals. Finally, the results for dental and retroflex nasals are compared to similar consonants in Kannada (another Dravidian language), pointing to potential language-particular differences in the realization of the contrast."
   ],
   "p1": 1,
   "pn": 4,
   "doi": "10.21437/issp.2024-1",
   "url": "issp_2024/kochetov24_issp.html"
  },
  "loucks24_issp": {
   "authors": [
    [
     "Torrey",
     "Loucks"
    ],
    [
     "Daniel",
     "Aalto"
    ]
   ],
   "title": "Speech onset kinematics predict sentence level variability in adults who stutter",
   "original": "008",
   "order": 21,
   "page_count": 4,
   "abstract": [
    "The onset of speech involves a state change that could be susceptible to disfluency and higher overall kinematic variability in adults who stutter (AWS). However, the relationship between the susceptibility and kinematic variability has not been explained. In this study, we evaluated the kinematic profile of the initial syllable of a multisyllabic utterance in relation to the variability of the whole phrase. 27 AWS displayed reductions in kinematic amplitude and peak opening velocity and higher initial variability of the lower lip opening gesture compared to 26 adults who speak fluently (AWF). A regression model indicated that initial syllable dynamics of the lower lip predicted higher phrase variability for the AWS group but not the AWF. Atypical speech onset kinematics could propagate into higher overall kinematic variability across an utterance in stuttering."
   ],
   "p1": 79,
   "pn": 82,
   "doi": "10.21437/issp.2024-21",
   "url": "issp_2024/loucks24_issp.html"
  },
  "terband24_issp": {
   "authors": [
    [
     "Hayo",
     "Terband"
    ],
    [
     "Caroline",
     "Cross"
    ],
    [
     "Joel",
     "Berger"
    ],
    [
     "Shawn",
     "Goodman"
    ]
   ],
   "title": "Speaking-induced Middle Ear Muscle Reflex (MEMR): suppression of auditory feedback during self-vocalization",
   "original": "010",
   "order": 30,
   "page_count": 4,
   "abstract": [
    "The aim of the present study was to test a novel, non-invasive method to measure the middle ear muscle reflex (MEMR) during self-vocalization compared to when presented with external speech, to allow the quantification of its contribution to the reduced response in auditory cortex found in speaking- induced suppression (SIS). MEMR responses were measured utilizing the principle of change in impedance and thus reflectance characteristics of the eardrum, quantified by amplitudes of continuously presented low-level click sounds. Data from 15 healthy young adult speakers show 1) that MEMR was activated prior to the onset of speech, but not prior to the playback of the recorded utterances and 2) that MEMR is stronger for self-generated sound. As MEMR reduces low- frequency excitation in the cochlea, SIS may need to be corrected for MEMR."
   ],
   "p1": 115,
   "pn": 118,
   "doi": "10.21437/issp.2024-30",
   "url": "issp_2024/terband24_issp.html"
  },
  "terband24b_issp": {
   "authors": [
    [
     "Hayo",
     "Terband"
    ],
    [
     "Bhavana",
     "Bhat"
    ],
    [
     "Anniek",
     "van Doornik"
    ]
   ],
   "title": "Task effects and phonological error patterns in Australian English-Dutch bilingual children",
   "original": "011",
   "order": 60,
   "page_count": 4,
   "abstract": [
    "Determining if suspected speech ‘abnormalities’ in bilingual children are due to bilingual language acquisition or due to a speech sound disorder is a challenging task for speech- language pathologists (SLPs). This study aims to investigate how the productions on non-word imitation (NWI) of English- Dutch bilingual children differ from other speech tasks, both in direct comparison and relative to norm data. 77 typically developing Australian English-Dutch bilingual children ages 4 to 12 years, participated in this study. All children completed the Dutch test battery, the Computer Articulation Instrument (CAI). Data on language exposure were collected through parent/caregiver questionnaires. The English-Dutch bilingual children scored lower than the norm data on picture naming and consistency task but not on non-word imitation and MRR tasks, confirming these tasks as the most language-neutral. A detailed phonological error analysis indicates that VOT, fricatives, and vowels need attention of SLPs assessing English-Dutch bilingual children."
   ],
   "p1": 238,
   "pn": 241,
   "doi": "10.21437/issp.2024-60",
   "url": "issp_2024/terband24b_issp.html"
  },
  "kim24_issp": {
   "authors": [
    [
     "Daejin",
     "Kim"
    ]
   ],
   "title": "Spatiotemporal coordination of tongue dorsum characterizes the voicing contrast of American English bilabial coda obstruents",
   "original": "013",
   "order": 35,
   "page_count": 5,
   "abstract": [
    "This study explores the articulation of the tongue dorsum (TD) in voicing contrasts of bilabial coda obstruents in American English (AE) using the ultrasound tongue imaging method. TD, where the tongue curvature begins, is known to constrict during the bilabial closure to create a sufficient amount of aerodynamic pressure indicating voicing. Also, its movement direction and duration should correlate to the acoustic properties of coda voicing due to the linkage to the laryngeal structure creating these attributes. The qualitative and quantitative analysis of ultrasound recordings of seven AE speakers found that TD is more likely to constrict with /b/ with the longer moving distance and duration, but the movement direction is mostly affected by the phonetic quality of the preceding Vs. TD constrictions of C2 and V occur earlier with /b/, resulting greater lingual-laryngeal gestural aggregation, making V more like V and C2 more overlapped with V. This study suggests that the intricate temporal adjustment of the lingual and laryngeal articulation implicates the AE bilabial voicing consonantal contrasts.\n"
   ],
   "p1": 135,
   "pn": 139,
   "doi": "10.21437/issp.2024-35",
   "url": "issp_2024/kim24_issp.html"
  },
  "huang24_issp": {
   "authors": [
    [
     "Yaqian",
     "Huang"
    ]
   ],
   "title": "Exploration and classification of vocal fry, period doubling, and modal voice using acoustic and EGG measures",
   "original": "014",
   "order": 36,
   "page_count": 4,
   "abstract": [
    "How subtypes of creaky voice such as vocal fry and period\ndoubling can be classified according to their acoustic as well\nas phonatory correlates is not entirely clear. This study\nexplores the distinctions of the above-mentioned creaky voice\ntypes as compared to modal voice, using machine\nclassification methods to investigate the importance of source\nand filter characteristics represented by acoustic and\nelectroglottographic (EGG) measures. Tokens of vocal fry,\nperiod doubling, and modal voice were visually identified in a\nscripted Mandarin corpus using EGG as these non-modal\nvoice qualities were found abundantly across Mandarin tones.\nTo control for the multicollinearity and overfitting issues, an\nl1 regularization (Lasso) was used to fit the multinomial\nlogistic regression. Random forest models were also used to\npredict these voicing types and compared with the logistic\nmodels. Adding the EGG measures largely improved all model\nperformances, both supported by the separable clusters shown\nby explorative visualization and the macro average precision\nand recall scores. The most important measures according to\nthe random forest models were f0, H1-H2, H1, SoE, H2, and\nHNR (0-500Hz), as well as the duration of the decontacting\nphase and contact quotient of the glottal pulse. Implications\nbetween human perception and phonatory measures are\ndiscussed."
   ],
   "p1": 140,
   "pn": 143,
   "doi": "10.21437/issp.2024-36",
   "url": "issp_2024/huang24_issp.html"
  },
  "pagel24_issp": {
   "authors": [
    [
     "Lena",
     "Pagel"
    ],
    [
     "Simon",
     "Roessig"
    ],
    [
     "Doris",
     "Mücke"
    ]
   ],
   "title": "An experimental setup for capturing multimodal accommodation using dual electromagnetic articulography, audio, and video",
   "original": "017",
   "order": 31,
   "page_count": 4,
   "abstract": [
    "When engaging in a conversation, interlocutors frequently accommodate to each other in their speech patterns and co- speech movements. However, only a small number of studies have investigated both domains in a multimodal approach. An additional challenge for studies is accounting for information structure, which not only influences the production of speech and co-speech motion in a speaker but also affects the patterns of accommodation between speakers. Due to the high complexity of the required experimental design, it has not yet been comprehensively studied whether speakers accommodate to each other in their strategies of encoding information structure. This paper present a methodological approach for capturing multimodal focus marking patterns in dyads, which allows to address this research question. We introduce DiCE, a cooperative game to elicit lexically and prosodically controlled data in German, and present details of the experimental setup involving dual EMA, audio, and video.\n"
   ],
   "p1": 119,
   "pn": 122,
   "doi": "10.21437/issp.2024-31",
   "url": "issp_2024/pagel24_issp.html"
  },
  "bjorelius24_issp": {
   "authors": [
    [
     "Helena",
     "Björelius"
    ],
    [
     "Jonny",
     "Trang"
    ],
    [
     "Fredrik",
     "Johansson"
    ],
    [
     "Georgios",
     "Tsilingaridis"
    ],
    [
     "Royne",
     "Thorman"
    ],
    [
     "Hayo",
     "Terband"
    ]
   ],
   "title": "Chewing Efficiency and Oral developmental functions in Children with Oral- and Speech Motor Disorders Compared to Peers",
   "original": "019",
   "order": 22,
   "page_count": 4,
   "abstract": [
    "The purpose of this study was to investigate chewing efficiency and oral sensory and motor developmental symptoms and habits in a clinical population of 210 Swedish children between 4 to 9 years old. The children were referred to Oral Motor Centre (OMC), Danderyd Hospital in Stockholm questioning oral- and/or speech motor disorders. Comparison was made with 77 typically developing children (TD). Chewing efficiency was performed with the Hue-CheckÓ chewing gum test and analyzed with the outcome measure SDHue. Statistical analysis with multiple linear regression showed that children with oral developmental delay (OD) and motor speech disorders (MSD) chewed less efficient than the TD children. The children with OD, MSD and language disorders (PDL) also showed larger frequencies of oral sensory and motor symptoms and habits compared to the TD children. Impaired chewing and oral symptoms and habits can possibly be part of a larger symptom complex. Inability to chew efficiently can affect quality of life."
   ],
   "p1": 83,
   "pn": 86,
   "doi": "10.21437/issp.2024-22",
   "url": "issp_2024/bjorelius24_issp.html"
  },
  "soberanes24_issp": {
   "authors": [
    [
     "Montserrat",
     "Soberanes"
    ],
    [
     "Carlos A.",
     "Pérez-Ramírez"
    ],
    [
     "M. Florencia",
     "Assaneo"
    ]
   ],
   "title": "Insights into phonemes' articulation time",
   "original": "020",
   "order": 64,
   "page_count": 3,
   "abstract": [
    "It has been reported that the time needed to produce a phoneme is highly variable, even for the same speaker, yet the causes of this variability have not been thoroughly studied. In this direction, the present work explored the effect of three factors on phoneme articulation time: attention, coarticulation and intentional speech rate (fast/slow). More precisely, the muscular activity of participants' lips was recorded while they produced the syllables /pɑ/ and /pu/, which made it possible to calculate each phoneme articulation time. In addition, this protocol was complemented with different tasks that made it possible to measure the subject's attentional state and to condition the intended speech speed. Two linear mixed models were performed to predict the duration of the produced phonemes and how they were affected by the previously mentioned factors. Results indicate that attention is an influencing factor in both consonants and vowels, with higher levels of attention resulting in longer production times. For the studied consonant (/p/), it was observed that its duration is longer when it is coarticulated with a rounded vowel than when with an unrounded vowel. For vowels, no difference was found in the duration between /ɑ/ and /u/, nevertheless, both modify their duration according to speech rate, with longer times for slower rates."
   ],
   "p1": 255,
   "pn": 257,
   "doi": "10.21437/issp.2024-64",
   "url": "issp_2024/soberanes24_issp.html"
  },
  "deme24_issp": {
   "authors": [
    [
     "Andrea",
     "Deme"
    ],
    [
     "Kornélia",
     "Juhász"
    ],
    [
     "Zsuzsa",
     "Szánthó"
    ],
    [
     "Szabina",
     "Zsoldos"
    ],
    [
     "Reinhold",
     "Greisbach"
    ]
   ],
   "title": "Segmental durations and the vowel length contrast in fast speech in Hungarian",
   "original": "022",
   "order": 48,
   "page_count": 4,
   "abstract": [
    "In fast speech, speech sounds are produced shorter. However,\naccording to previous studies, i) vowels are more\ncompressible, and reduce more than consonants. In languages\nthat show phonemic vowel length contrast, like Japanese, and\nHungarian, vowels are also expected to vary in the extent of\nreduction as a function of their phonological length: in fast\nspeech, ii) long vowels are expected to reduce more than short\nvowels, while iii) the vowel length contrast (as expressed in\nduration ratio) does not neutralize completely, as shown for\nJapanese. In this study, we analyzed consonant and vowel\ndurations produced by 15 Hungarian speakers at comfortable\nand fast speech rates and tested these three hypotheses.\nWe found that in fast speech in Hungarian, i) vowels\nreduced more in their duration than consonants; ii) long\nvowels reduced more than short vowels; and iii) duration\ndifferences of long and short vowels reduced, but duration\nratio of the relevant pairs decreased only in the high front\npair, while it did not reach complete neutralization in any of\nthe pairs, meaning that the phonologically relevant contrast\nwas maintained across speech rates."
   ],
   "p1": 189,
   "pn": 192,
   "doi": "10.21437/issp.2024-48",
   "url": "issp_2024/deme24_issp.html"
  },
  "foley24_issp": {
   "authors": [
    [
     "Sean",
     "Foley"
    ],
    [
     "Bowei",
     "Shao"
    ],
    [
     "Matthew",
     "Faytak"
    ]
   ],
   "title": "Relating frication to articulation in Standard Mandarin apical vowels",
   "original": "024",
   "order": 37,
   "page_count": 4,
   "abstract": [
    "Sibilants are characterized by the production of turbulent air- flow, which involves both a narrow constriction in the vocal tract and a certain volume velocity of the airflow. Despite both conditions being necessary for sibilant production, studies of constriction degree predominate in the literature. Using acous- tic and articulatory data, we show that in certain sequences Standard Mandarin apical vowels exhibit minimal lingual ad- justment compared to adjacent sibilants, while also exhibiting a considerable drop in frication noise. The same result was found for the vowel /i/. We hypothesize that the change in frication noise could be due to a number of different non-lingual factors and discuss the potential implications for models of sibilants."
   ],
   "p1": 144,
   "pn": 147,
   "doi": "10.21437/issp.2024-37",
   "url": "issp_2024/foley24_issp.html"
  },
  "vantellingen24_issp": {
   "authors": [
    [
     "Mirjam",
     "van Tellingen"
    ],
    [
     "Joost",
     "Hurkmans"
    ],
    [
     "Anne Marie",
     "van de Zande"
    ],
    [
     "Hayo",
     "Terband"
    ],
    [
     "Ben A.",
     "Maassen"
    ],
    [
     "Roel",
     "Jonkers"
    ]
   ],
   "title": "Music in the treatment of childhood motor speech disorders: Using music to cue gestural timing",
   "original": "025",
   "order": 23,
   "page_count": 4,
   "abstract": [
    "Speech-Music Therapy for Aphasia (SMTA) is applied in the treatment of childhood apraxia of speech. A single-subject design study into the effect of SMTA was conducted, showing a striking improvement in the realization of initial consonant clusters after treatment. Musical scores of the target items with initial consonant clusters were analysed to determine the musical manipulations that were used. In all target items with initial consonant clusters an anacrusis was used. This musical manipulation may have provided an auditory rhythmic cue for the phasing relationships of speech gestures in consonant clusters. Further research is needed to determine effective musical manipulations that are used in SMTA"
   ],
   "p1": 87,
   "pn": 90,
   "doi": "10.21437/issp.2024-23",
   "url": "issp_2024/vantellingen24_issp.html"
  },
  "neuberger24_issp": {
   "authors": [
    [
     "Tilda",
     "Neuberger"
    ]
   ],
   "title": "Acoustic correlates of the nasal vs. plosive quantity contrast in Hungarian",
   "original": "032",
   "order": 57,
   "page_count": 4,
   "abstract": [
    "This study investigates the phonetic realization of consonant\nlength in Hungarian. It is hypothesized that spectral structure\ndifferences between obstruents and sonorants may lead to\ndistinct strategies in expressing quantity contrast. To test this\nhypothesis, intervocalic nasals (/n ɲ/) and plosives (/t k/) were\nanalyzed in spontaneous speech from 20 monolingual\nHungarian-speaking adults. Linear mixed-effects models and\ndecision trees were applied to explore the effect of quantity,\nconsonant type, and their interaction on various acoustic\nparameters, such as the durations of the target consonants and\nneighboring vowels, relative durations, and geminate-to-\nsingleton ratio. Our findings indicate that nasals require more\nrobust adjustments compared to plosives in the realization of\nthe consonant length contrast. This study contributes to the\nunderstanding of phonetic variation in Hungarian and the\ndistribution of geminates across languages."
   ],
   "p1": 226,
   "pn": 229,
   "doi": "10.21437/issp.2024-57",
   "url": "issp_2024/neuberger24_issp.html"
  },
  "munasinghe24_issp": {
   "authors": [
    [
     "Thushani",
     "Munasinghe"
    ],
    [
     "Deepthi",
     "Crasta"
    ],
    [
     "Kaila L",
     "Stipancic"
    ],
    [
     "Mili",
     "Kuruvilla-Dugdale"
    ]
   ],
   "title": "Use of Natural Anchors for Improving Rater Reliability in Dysarthria Assessment: An Exploratory Study",
   "original": "033",
   "order": 7,
   "page_count": 4,
   "abstract": [
    "The aim of this project was to determine whether the use of\nanchors improves interrater and intrarater reliability when\nnonexpert listeners rated five features salient to hypokinetic\ndysarthria: overall severity, reduced loudness, articulatory\nimprecision, short rushes of speech, and monotony. Fourteen\nnonexperts rated 82 sentences recorded from individuals with\nParkinson’s disease and healthy controls using five separate\nequal appearing interval (EAI) scales to indicate their\nperception of the five features mentioned above. The listeners\nrated the samples twice, once without and once with external\nanchors. Interrater reliability and intrarater reliability were\ncalculated using intraclass correlation coefficients (ICCs).\nFindings revealed an overall increase in both interrater and\nintrarater reliability for most features in the anchor condition,\nexcept for monotony, where a decrease in single-measures ICC\nwas noted for the anchor compared to non-anchor condition.\nThese preliminary findings highlight how external anchors can\nbenefit interrater and interrater reliability when rating\nperceptual dimensions of dysarthria."
   ],
   "p1": 23,
   "pn": 26,
   "doi": "10.21437/issp.2024-7",
   "url": "issp_2024/munasinghe24_issp.html"
  },
  "blandin24_issp": {
   "authors": [
    [
     "Rémi",
     "Blandin"
    ],
    [
     "Vincent",
     "Didone"
    ],
    [
     "Peter",
     "Birkholz"
    ],
    [
     "Angélique",
     "Remacle"
    ]
   ],
   "title": "Perceptual evaluation of the naturalness of broadband articulatory speech synthesis using a 1D versus a 3D acoustic model",
   "original": "043",
   "order": 4,
   "page_count": 4,
   "abstract": [
    "Articulatory synthesis is a useful tool to explore the re- lationship between the speech production and perception pro- cesses. However, including the high frequencies (HF, above about 5 kHz) requires a three-dimensional (3D) acoustical model for realistic simulations. In this frequency range, one- dimensional (1D) acoustic models fail to predict additional res- onances and anti-resonances related to the 3D properties of the acoustic field. While articulatory synthesis based on 3D acoustic models is nowadays achievable for isolated phonemes, the impact of such models on the perception by human listeners remains largely unknown. The objective of this work was to determine whether a more realistic computation of transfer functions with a frequency domain approach results in phonemes perceived as more natural. For this purpose, a perception experiment using a 4-points Likert scale was conducted to evaluate the naturalness of seven static phonemes, /a, e, i, @, f, s, S/, synthesized with a 1D and a 3D models. No significant influence of the acoustic model was found, however, significant differences between the phonemes were perceived."
   ],
   "p1": 12,
   "pn": 15,
   "doi": "10.21437/issp.2024-4",
   "url": "issp_2024/blandin24_issp.html"
  },
  "tienkamp24_issp": {
   "authors": [
    [
     "Thomas B",
     "Tienkamp"
    ],
    [
     "Teja",
     "Rebernik"
    ],
    [
     "Jidde",
     "Jacobi"
    ],
    [
     "Martijn",
     "Wieling"
    ],
    [
     "Defne",
     "Abur"
    ]
   ],
   "title": "The Impact of Electromagnetic Articulography Sensors on the Articulatory Acoustic Vowel Space in Speakers with and without Parkinson's Disease",
   "original": "044",
   "order": 24,
   "page_count": 4,
   "abstract": [
    "The somatosensory effect of electromagnetic articulography (EMA) sensors on speech remains relatively unexplored. Moreover, EMA sensors may be more disruptive to speech in individuals with somatosensory deficits (e.g., persons with Parkinson’s Disease; PwPD). Thus, we investigated the effect of EMA sensors on the articulatory-acoustic vowel space (AAVS) in both typical speakers (n=23) and PwPD (n=23). The AAVS was calculated before EMA sensor placement, directly after, and after approximately one hour to assess habituation. The AAVS significantly decreased following sensor placement and did not change with habituation, regardless of speaker group. PwPD had a smaller AAVS compared to typical speakers, but were not differentially impacted by EMA sensors. EMA sensor placement led to average reductions of the AAVS of 13.5% for PwPD and 14.2% for typical speakers, which suggests that articulatoryacoustics from studies with and without the use of EMA sensors may not be fully comparable."
   ],
   "p1": 91,
   "pn": 94,
   "doi": "10.21437/issp.2024-24",
   "url": "issp_2024/tienkamp24_issp.html"
  },
  "tienkamp24b_issp": {
   "authors": [
    [
     "Thomas B",
     "Tienkamp"
    ],
    [
     "Teja",
     "Rebernik"
    ],
    [
     "Raoul",
     "Buurke"
    ],
    [
     "Katharina M.",
     "Polsterer"
    ],
    [
     "Rob",
     "van Son"
    ],
    [
     "Martijn",
     "Wieling"
    ],
    [
     "Max J. H.",
     "Witjes"
    ],
    [
     "Sebastiaan",
     "de Visscher"
    ],
    [
     "Defne",
     "Abur"
    ]
   ],
   "title": "The Effect of Speaking Style on the Articulatory-Acoustic Vowel Space in Individuals with Tongue Cancer Before and After Surgical Treatment",
   "original": "046",
   "order": 25,
   "page_count": 4,
   "abstract": [
    "The impact of surgical treatment for tongue cancer is traditionally assessed with vowel formant metrics from read speech or sustained vowels. However, isolated speech might not fully reflect a speaker’s typical speech. Here, we assessed the effect of speaking style (read vs. semi-spontaneous) on vowel acoustics of individuals preand post-surgery for tongue cancer. Eight individuals (3 females and 5 males) were recorded preand approximately six months post-surgery. We calculated the articulatory-acoustic vowel space (AAVS) during read speech (sentences) and semi-spontaneous speech (picture description). Results showed that the AAVS did not differ significantly preand post-surgery. Picture descriptions yielded a significantly smaller AAVS compared to the reading task, which was consistent preand post-surgery. Our findings suggest that both read and semi-spontaneous speech styles would be suitable to quantify the impact of surgical intervention for tongue cancer on vowel acoustics."
   ],
   "p1": 95,
   "pn": 98,
   "doi": "10.21437/issp.2024-25",
   "url": "issp_2024/tienkamp24b_issp.html"
  },
  "hoekzema24_issp": {
   "authors": [
    [
     "Nikki",
     "Hoekzema"
    ],
    [
     "Teja",
     "Rebernik"
    ],
    [
     "Thomas B",
     "Tienkamp"
    ],
    [
     "Sasha",
     "Chaboksavar"
    ],
    [
     "Valentina",
     "Ciot"
    ],
    [
     "Annetje",
     "Gleichman"
    ],
    [
     "Roel",
     "Jonkers"
    ],
    [
     "Aude",
     "Noiray"
    ],
    [
     "Martijn",
     "Wieling"
    ]
   ],
   "title": "Assessing differences in articulatory-acoustic vowel space in Parkinson's disease phenotypes",
   "original": "055",
   "order": 26,
   "page_count": 4,
   "abstract": [
    "The goal of this study was to determine whether articulatory-\nacoustics differ between individuals in the tremor-dominant\n(TD) and postural instability/gait difficulty (PIGD) phenotypes\nof Parkinson's disease (PD). The study included 31 individuals\nwith PD (21 TD, 10 PIGD) and 29 control speakers (CS) who\nwere all Dutch native speakers. A read speech task and a\nsemi-spontaneous speech task were completed, and the\nArticulatory-Acoustic Vowel Space (AAVS) was calculated for\nboth tasks. Results showed no significant difference in AAVS\nbetween the overall control group and PD for either phenotype.\nFollow-up analyses, pooling speech data from our prior study\n(+27 PD, +23 CS), demonstrated a significantly lower AAVS\nin males with PD compared to controls and no group differences\nfor females. Thus, articulatory-acoustic changes may be more\npronounced for male compared to female speakers with PD, but\nmay not differ by PD phenotype."
   ],
   "p1": 99,
   "pn": 102,
   "doi": "10.21437/issp.2024-26",
   "url": "issp_2024/hoekzema24_issp.html"
  },
  "thies24_issp": {
   "authors": [
    [
     "Tabea",
     "Thies"
    ],
    [
     "Philipp",
     "Buech"
    ],
    [
     "Anne",
     "Hermes"
    ]
   ],
   "title": "Advancing Speech Breathing Analysis: Benefits of Using EMA",
   "original": "056",
   "order": 32,
   "page_count": 4,
   "abstract": [
    "This study presents an innovative approach to speech breathing\nanalysis, emphasizing the potential of Electromagnetic\nArticulography (EMA) as a viable tool. We compared the\nwidely used Respiratory Inductive Plethysmography (RIP) with\nEMA by collecting speech breathing data from 18 speakers\nduring sustained vowel productions of /a/ under habitual and\nloud speech conditions. Our findings indicate that EMA signals\ncan effectively track temporal patterns of speech breathing\nmovements, which do not differ from the RIP system. With this\nstudy, we would like to emphasize the potential of using\n(existing) EMA systems in laboratories to analyze speech\nbreathing patterns. This paper explores the advantages and\nopportunities that arise from integrating EMA systems into\nspeech breathing research. The findings suggest that such\nintegration can enhance our understanding of speech\nproduction and contribute to advancements in related fields."
   ],
   "p1": 123,
   "pn": 126,
   "doi": "10.21437/issp.2024-32",
   "url": "issp_2024/thies24_issp.html"
  },
  "du24_issp": {
   "authors": [
    [
     "Shihao",
     "Du"
    ],
    [
     "Indranil",
     "Dutta"
    ],
    [
     "Adamantios",
     "Gafos"
    ]
   ],
   "title": "Articulatory timing in Hindi CV sequences",
   "original": "058",
   "order": 15,
   "page_count": 4,
   "abstract": [
    "This short report presents some preliminary results from\nelectromagnetic articulography (EMA) recordings of Hindi\nConsonant-Vowel (CV) sequences. We specifically asked if and\nhow articulatory timing in CV, quantified by the interval from\nV-target to C-offset, is modulated by consonant phonation,\nconsonant place of articulation and vowel quality. Results show\nthat vowel height and frontness and C place of articulation\nexert significant effects on CV timing, whereas C phonation\n(voicing and aspiration) has no significant effect on the interval\nwe chose to quantify CV timing here. Potential explanations of\nthe disparity between vowel-related and consonant-related\neffects are suggested."
   ],
   "p1": 55,
   "pn": 58,
   "doi": "10.21437/issp.2024-15",
   "url": "issp_2024/du24_issp.html"
  },
  "jesus24_issp": {
   "authors": [
    [
     "Luis",
     "Jesus"
    ],
    [
     "Sara",
     "Castilho"
    ],
    [
     "Aníbal JS",
     "Ferreira"
    ],
    [
     "Maria Conceição",
     "Costa"
    ]
   ],
   "title": "Features Used to Discriminate Vowel Height in Voiced and Whispered Speech",
   "original": "059",
   "order": 49,
   "page_count": 4,
   "abstract": [
    "The purpose of this study was to define acoustic cues used to\ndiscriminate vowel height in voiced and whispered speech.\nSeventeen speakers produced sustained oral vowels, disyllabic\nwords, sentences and read a phonetically balanced text. These\ntasks were repeated in voiced and whispered speech and\nanalysed using the following parameters: Fundamental\nfrequency, formant frequencies, spectral slope, sound pressure\nlevel and durations. Kernell density estimation plots and Pillai\nscores were used to characterise the vowel spaces and the\ndegree of overlap between vowels. First formant frequency\nand relative duration were consistently used as height cues\nacross the two speech modes (voiced and whispered).\nWhispered vowel spaces shifted downward (relative to\nvoiced), and vowel pairs /i-a/, /a-ɔ/, /ɔ-u/ and /u-i/ were\ndistinct when produced in both speech modes. The evidence\npresented can be used to restore voiced speech signals and to\ninform rehabilitation strategies."
   ],
   "p1": 193,
   "pn": 196,
   "doi": "10.21437/issp.2024-49",
   "url": "issp_2024/jesus24_issp.html"
  },
  "jesus24b_issp": {
   "authors": [
    [
     "Luis",
     "Jesus"
    ],
    [
     "Sara",
     "Castilho"
    ],
    [
     "Aníbal JS",
     "Ferreira"
    ],
    [
     "Maria Conceição",
     "Costa"
    ]
   ],
   "title": "Attributes Associated with Consonantal Place and Voicing in Whispered Speech",
   "original": "060",
   "order": 50,
   "page_count": 4,
   "abstract": [
    "Not much is known about acoustic cues concerning consonant\nplace and voicing of whispered fricatives, so the productions\nof sustained sibilants, disyllabic words, sentences and reading\nof a phonetically balanced text, were compared in voiced and\nwhispered speech modes. Spectral peak frequencies and levels,\nspectral slopes, sound pressure level and durations were\ncalculated. A Functional Principal Component Analysis\n(FPCA) of Power Spectral Density (PSD) estimates of voiced,\nwhispered, and whistled fricatives was developed. The broad\npeak frequency was used to discriminate /s/ and /ʃ/. Spectral\nslope and broad peak frequency were associated with place.\nFPCA scores revealed various sources of variation. PSD was\nsignificantly different in voiced, whispered, and whistled\nfricatives. The relative duration of same-place voiceless\nfricatives was higher than voiced fricatives both in voiced and\nwhispered speech. This evidence can be used to restore voiced\nspeech signals from aphonic patients."
   ],
   "p1": 197,
   "pn": 200,
   "doi": "10.21437/issp.2024-50",
   "url": "issp_2024/jesus24b_issp.html"
  },
  "weigerber24_issp": {
   "authors": [
    [
     "Marie-Theres",
     "Weißgerber"
    ]
   ],
   "title": "Schwa optionality in verbal inflection in German: the effects of stress and phonetic context",
   "original": "069",
   "order": 16,
   "page_count": 4,
   "abstract": [
    "Speech sounds serve the function of distinguishing meaning. However, in German, schwa sometimes has no such semantic function and is optional in certain cases, like first-person singular inflectional suffixes. Nonetheless, this optionality has not yet led to a total removal, or obligation to articulate, schwa in these suffixes. The present study investigates the effects of phonetic context and stress on schwa optionality. The data set consists of two registers, formal and informal, of German spoken in Germany and Namibian German. The following speech sound and the stress of the following syllable, which are thought to affect the likelihood of word-final schwa production, were analysed for 44 speakers using Praat. Significant effects were found for stress, with less schwa productions before unstressed syllables. Significantly less schwa instances were observed before vowels. Overall, register had a significant effect, with more schwa productions in the formal condition. The impact of stress and the effect of register were more marked in the subset of Namibian German. These findings highlight the importance of investigating the interaction of phonetic features and register and emphasise the value of exploring different varieties in the study of speech production phenomena.\n"
   ],
   "p1": 59,
   "pn": 62,
   "doi": "10.21437/issp.2024-16",
   "url": "issp_2024/weigerber24_issp.html"
  },
  "weng24_issp": {
   "authors": [
    [
     "Caihong",
     "Weng"
    ],
    [
     "Ioana",
     "Chitoran"
    ],
    [
     "Alexander",
     "Martin"
    ]
   ],
   "title": "Sibilant contrast production by bilingual speakers of Quanzhou Southern Min and Mandarin",
   "original": "072",
   "order": 65,
   "page_count": 4,
   "abstract": [
    "The merger of the Mandarin [s]~[ù] contrast, known as “deretroflexion”, frequently occurs in Mandarin spoken by bilingual Southern Min speakers, whose L1 lacks the retroflex category. This study explores the production of the Mandarin alveolar-retroflex contrast by bilingual speakers of Quanzhou Southern Min (L1) and Mandarin (L2) in two different vowel contexts ([a] vs. [u]). Our bilingual speakers’ contrast production was evaluated using a perceptual identification task by L1 Mandarin speakers, showing only a small subset of our sample who maintained the [s]~[ù] contrast. We found significant Center of Gravity (CoG) differences between the two target fricatives for “distinctive” speakers, with this difference being larger in the context of [a] than [u]. For all speakers, the acoustic difference between the target fricatives increased with increased exposure to and use of Mandarin.\n"
   ],
   "p1": 258,
   "pn": 261,
   "doi": "10.21437/issp.2024-65",
   "url": "issp_2024/weng24_issp.html"
  },
  "marchini24_issp": {
   "authors": [
    [
     "Gilly",
     "Marchini"
    ]
   ],
   "title": "An exploration of pitch in Afro-Mexican Spanish",
   "original": "074",
   "order": 55,
   "page_count": 5,
   "abstract": [
    "This paper presents a descriptive analysis of pitch in AfroMexican Spanish, a largely unexplored variety of Spanish spoken by mixed indigenous-African communities in Southwestern Mexico. Sociolinguistic interview data was collected from one female speaker (51 years old), with a total of 122 broad focus, declarative Intonational Phrases annotated according to Sp_ToBI protocol.\nResults reveal that whilst Afro-Hispanic language employs pitch at a word-level, i.e., as cue to lexical stress, pitch is phrasal in Afro-Mexican Spanish, thus aligning with nonAfro Mexican varieties: broad focus declaratives are signalled through their low tone pre-nuclear pitch accents and circumflex nuclear accents. However, whilst peaks align on the stressed syllable across open and closed syllables, there is an interaction with the nasality of the following sound: if present on the segmental string, peaks align on the following, post-vocalic nasals (/n, m, N, ñ/ in the current dataset) regardless of intervening syllable boundaries. In the case of closed syllables, i.e., with coda /N/, e.g., descendiente [de.sen.\"djen.te] (‘descendent’) , peaks align tonically (90.5% of instances). For open syllables, i.e., with /N/ as following onset, e.g., mexicano [me.xi.\"ka.no] (‘mexican’), peaks align post-tonically (100% of instances).\nAlthough tonic peak alignment is common across AfroHispanic varieties, the role of the nasal is unexpected. Nor is it common in non-Afro Mexican Spanishes, where instead peaks are often displaced, reaching their maxima on the following, post-tonic syllable. Despite established theoretical claims that peak alignment should not vary according to segments (The Segmental Anchoring Hypothesis, or SAH), these preliminary results indicate that this does not occur for this dialect. I therefore consider the bearing of this upon the dialect-specific nature of the SAH, with reference to control experimentation required to test whether such features are unique to the dialect.\n"
   ],
   "p1": 217,
   "pn": 221,
   "doi": "10.21437/issp.2024-55",
   "url": "issp_2024/marchini24_issp.html"
  },
  "sering24_issp": {
   "authors": [
    [
     "Konstantin",
     "Sering"
    ],
    [
     "Harald",
     "Baayen"
    ]
   ],
   "title": "Articulatory speech synthesis without phones?",
   "original": "076",
   "order": 2,
   "page_count": 3,
   "abstract": [
    "With this work we show how speech production can be modelled on the word level without any symbolic units, neither on the acoustic side like phonemes, nor on the semantic side like word types, nor on the motor side like gestures or articulatory targets. We present and discuss a computational model of articulatory speech production, which implements a predictive planning approach, known from hand and arm movements, into the articulatory domain. This computational model is named Predictive Articulatory speech synthesis Utilizing Lexical Embeddings (PAULE). As articulatory speech synthesizer the VocalTractLab speech synthesizer is used, which simulates the human speech system on a geometrical level with 30 different control parameters (channels) and with a time resolution of 401 Hertz. As the synthesis quality of the PAULE shows decent results, we conclude that human speech production can be modelled without the use of any symbolic units like phones and gestures on the word level.\n"
   ],
   "p1": 5,
   "pn": 7,
   "doi": "10.21437/issp.2024-2",
   "url": "issp_2024/sering24_issp.html"
  },
  "aalto24_issp": {
   "authors": [
    [
     "Eija",
     "Aalto"
    ],
    [
     "Minoru",
     "Yoshida"
    ],
    [
     "Lucie",
     "Menard"
    ],
    [
     "Walcir",
     "Cardoso"
    ],
    [
     "Catherine",
     "Laporte"
    ]
   ],
   "title": "Effects of an ultrasound biofeedback session on maximal tongue movements ",
   "original": "085",
   "order": 17,
   "page_count": 4,
   "abstract": [
    "Ultrasound (US) imaging is a promising visual articulatory biofeedback device for second language (L2) pedagogy, allowing visualization of tongue movements. Despite its potential benefits, uncertainties persist regarding the specific learner profiles that may derive the greatest advantages from US biofeedback. This pilot study aims to provide a means to evaluate L2 learners’ ability to effectively utilize visual biofeedback by assessing maximal tongue retraction and lowering immediately before and after a short US biofeedback session. Six participants completed a short learning task, two with previous exposure to US biofeedback and four without. Participants without previous exposure to US biofeedback improved their maximal tongue movements to some extent, while those with previous exposure to US biofeedback showed little improvement. This suggests that this type of task may help characterize learners’ receptivity to visual articulatory biofeedback."
   ],
   "p1": 63,
   "pn": 66,
   "doi": "10.21437/issp.2024-17",
   "url": "issp_2024/aalto24_issp.html"
  },
  "demosthenes24_issp": {
   "authors": [
    [
     "Isabelle",
     "Démosthènes"
    ],
    [
     "Lucie",
     "Ménard"
    ]
   ],
   "title": "Auditory Feedback Perturbation of F2 in French-speaking Children",
   "original": "087",
   "order": 66,
   "page_count": 4,
   "abstract": [
    "In an auditory feedback perturbation, five children and five\nadults produced the French vowel /ø/ for which F2 in the\nreturning signal was lowered toward /o/. They were also\npresented with an auditory identification task. Our goal was to\ninvestigate if children would show the same pattern of response\nas adults following a lowering of F2 as they did for different\nperturbations in previous studies, and if their performance at\nan identification task, or their production variability would\nallow us to predict their production in reaction to the\nperturbation. Surprisingly, the response pattern exhibited by\nour children didn’t follow the recognizable compensatory\nresponse displayed by the adults. A bigger sample is needed to\ndetermine if this difference can be attributed to variability, to\nthe vowel under study or to the direction of the perturbation."
   ],
   "p1": 262,
   "pn": 265,
   "doi": "10.21437/issp.2024-66",
   "url": "issp_2024/demosthenes24_issp.html"
  },
  "rakhangi24_issp": {
   "authors": [
    [
     "Hanna",
     "Rakhangi"
    ],
    [
     "Dema",
     "Herzallah"
    ],
    [
     "Olumide",
     "Oyebode"
    ],
    [
     "Jennifer",
     "Peterson"
    ],
    [
     "Caroline",
     "Menezes"
    ]
   ],
   "title": "The effect of concurrent linguistic and nonlinguistic task on speech motor performance in Parkinson's Disease",
   "original": "088",
   "order": 27,
   "page_count": 4,
   "abstract": [
    "This preliminary study tested the effect of speech therapy on\nhypophonia and its potential to counteract micrographia in\npeople diagnosed with Parkinson’s disease. Data was collected\nfrom 3 subjects undergoing speech diagnostics at University of\nToledo Speech Clinic. Subjects were asked to speak and write\na series of syllables in both a single and dual task paradigm. In\nthe dual task they were asked to speak in their normal, soft, and\nloud voice. Data was recorded before and after an intensive 12\nsession speech treatment protocol, where they were trained to\nspeak with intent. Average speech intensity and handwriting\nstroke area were calculated. Average speech amplitude\nincreased from normal dual task to loud dual task before and\nafter therapy. Following therapy, speech amplitude for soft\nvoice decreased indicating therapy was helpful in modulating\namplitude. Handwriting did not show facilitation from speech\ntherapy regarding micrographia. However, variability between\nrepetitions reduced after therapy, showing some coordination\nbetween speech and hand movements but coordination is\naffected by complexity of task and primacy of task."
   ],
   "p1": 103,
   "pn": 106,
   "doi": "10.21437/issp.2024-27",
   "url": "issp_2024/rakhangi24_issp.html"
  },
  "percival24_issp": {
   "authors": [
    [
     "Maida",
     "Percival"
    ]
   ],
   "title": "Perception of a four-way stop laryngeal contrast in Eastern Oromo",
   "original": "091",
   "order": 51,
   "page_count": 4,
   "abstract": [
    "The goal of this paper is to identify perceptual cues to the fourway coronal stop contrast in Eastern Oromo. 25 listeners took part in a forced choice identification task with a real-word minimal quadruplet where the closure, burst, and following vowel were systematically alternated and where the burst intensity was manipulated. Results indicated that listener responses were influenced by each acoustic dimension, but that the burst was the most important cue. The other cues were used less consistently, and tended to group based on voicing or constricted glottis status."
   ],
   "p1": 201,
   "pn": 204,
   "doi": "10.21437/issp.2024-51",
   "url": "issp_2024/percival24_issp.html"
  },
  "kye24_issp": {
   "authors": [
    [
     "Ted",
     "Kye"
    ]
   ],
   "title": "Acoustic Analysis of Fricatives in Lushootseed",
   "original": "092",
   "order": 18,
   "page_count": 4,
   "abstract": [
    "Although acoustic analysis of fricatives in Salish languages has\nfocused on languages of the Interior Salish branch, there has\nbeen little acoustic research on fricatives for Coast Salish. In\nthis study, I examine the acoustic properties of fricatives from\narchival recordings dating to the 1950s for the Coast Salish\nlanguage Lushootseed. Spectral moments and intensity of\nfricatives were examined. The findings suggest that spectral\nmoments differentiated fricative contrasts in Lushootseed by\nusing time-averaging. The findings also provide implications on\nacoustic-articulatory correlates of fricative contrasts, as well\nas methodological limitations on the analysis of fricatives from\narchival recordings dating to the 1950s."
   ],
   "p1": 67,
   "pn": 70,
   "doi": "10.21437/issp.2024-18",
   "url": "issp_2024/kye24_issp.html"
  },
  "herbig24_issp": {
   "authors": [
    [
     "Elisa",
     "Herbig"
    ],
    [
     "Tabea",
     "Thies"
    ],
    [
     "Michael",
     "Barbe"
    ],
    [
     "Doris",
     "Mücke"
    ]
   ],
   "title": "The Role of Executive Functions and Levodopa on Articulatory Timing",
   "original": "096",
   "order": 28,
   "page_count": 4,
   "abstract": [
    "The study investigates the interplay between speech motor\ncontrol and cognitive executive dysfunction by looking at inter-\narticulatory coordination patterns between consonants and\nvowels in the production of syllables with high (CCV) and low\n(CV) complexity. Kinematic speech data (EMA) of 25 people\nwith Parkinson’s disease (PwPD) and 25 healthy controls (HC)\nwere recorded. Further, the influence of levodopa on syllable\ncoordination as well as the relationship to cognitive executive\ndysfunctions were tested. Results showed preserved\narticulatory coordination on the level of intra-syllabic\ncoordination. On the intra-gestural level, consonantal and\nvocalic movements were prolonged in the PD group and\npositively affected by the intake of levodopa. For the PD group,\na correlation between the shift pattern of the second consonant\nand scores on the executive function test is found, indicating\nthat executive dysfunctions possibly give rise to changes in\narticulatory timing patterns."
   ],
   "p1": 107,
   "pn": 110,
   "doi": "10.21437/issp.2024-28",
   "url": "issp_2024/herbig24_issp.html"
  },
  "makarov24_issp": {
   "authors": [
    [
     "Yury",
     "Makarov"
    ]
   ],
   "title": "Why do palatographic data have to be taken seriously?",
   "original": "102",
   "order": 33,
   "page_count": 4,
   "abstract": [
    "In this paper, I argue that palatography is a highly informative tool despite its apparent simplicity. The paper begins with an overview of the evolution of palatography, highlighting its intricate detail and variations. Following this, various techniques of palatography are introduced, along with associated challenges, which partly question established views. Subsequently, I suggest linguistic applications of palatography, focusing on its potential to describe place of articulation and inform phonological typology. Moreover, I propose that the inclusion of palatographic data in linguistic accounts can explain contact-induced changes in phonological systems and intra- and inter-speaker articulatory variation. This proposition is supported by a preliminary panel study of a Shughni speaker who demonstrated changes in articulation over one year."
   ],
   "p1": 127,
   "pn": 130,
   "doi": "10.21437/issp.2024-33",
   "url": "issp_2024/makarov24_issp.html"
  },
  "moraeslimadossantos24_issp": {
   "authors": [
    [
     "João Paulo",
     "Moraes Lima dos Santos"
    ]
   ],
   "title": "Influence of stress and sequence position on vowel sandhi in Brazilian Portuguese",
   "original": "103",
   "order": 19,
   "page_count": 4,
   "abstract": [
    "This paper presents an analysis of how the variables of word\nstress, intonational phrase stress, and the position of the vowel\nsequence within the phrase affect the production of vowel\nsequences across word boundaries, generating some external\nsandhi phenomena. Based on semi-spontaneous data from\nBrazilian Portuguese speakers, the study suggests that the\nstress pattern of a word can influence the occurrence of sandhi\nphenomena or the maintenance of hiatus. However, this also\ndepends on whether the sequence carries the main stress of the\nintonational phrase, as in \"no próximo ano,\" and if it is located\nat the rightmost phrase boundary, as in \"isso que é.\" It is\nobserved that the probability of a sandhi phenomenon\noccurring is higher in contexts where at least the first vowel is\nunstressed, when neither of the vowels receives the main stress\nof the intonational phrase, and when they are not at the phrase\nboundary."
   ],
   "p1": 71,
   "pn": 74,
   "doi": "10.21437/issp.2024-19",
   "url": "issp_2024/moraeslimadossantos24_issp.html"
  },
  "erickson24_issp": {
   "authors": [
    [
     "Donna M",
     "Erickson"
    ],
    [
     "Plinio A",
     "Barbosa"
    ],
    [
     "Gustavo",
     "Silveira"
    ]
   ],
   "title": "The Interplay between Acoustics and Syllable Articulation Organized by Mandible Movement",
   "original": "104",
   "order": 38,
   "page_count": 4,
   "abstract": [
    "This pilot study explores how the mandible times its vocalic opening movements with acoustic vowel onsets (AVO). 3-D Electromagnetic Articulographic along with acoustic data were recorded for three North American English speakers producing utterances with one word in the utterance produced with contrastive emphasis. Analysis of the acoustic and articulatory data used a newly-implemented Praat algorithm. The timing of four mandible movement landmarks in the articulatory data were measured relative to AVO in the acoustic signal: (1) minimum value of acceleration curve (minAcc); (2) minimum value of velocity curve (minVel); (3) maximum value of acceleration curve (maxAcc) and (4) minimum mandible position (maxDisp). The results showed that minVel closely matched AVO timing for two of the three speakers, while maxAcc showed the closest timing to AVO for the other speaker; interestingly, the emphasized word starting with an initial voiceless aspirated consonant [kh] showed a significantly closer timing to AVO with maxAcc than minVel."
   ],
   "p1": 148,
   "pn": 151,
   "doi": "10.21437/issp.2024-38",
   "url": "issp_2024/erickson24_issp.html"
  },
  "morimoto24_issp": {
   "authors": [
    [
     "Maho",
     "Morimoto"
    ],
    [
     "Takayuki",
     "Nagamine"
    ]
   ],
   "title": "Spatio-temporal properties of Japanese coronal consonants: An ultrasound study of /d/ and /r/",
   "original": "109",
   "order": 9,
   "page_count": 4,
   "abstract": [
    "The current study investigates the articulation of coronal consonants /d/ and /r/ in Japanese. Using ultrasound, we obtained midsagittal tongue images for /d/ and /r/ in three phonological contexts from one male Japanese speaker. Based on the tongue shapes, time-varying changes were analyzed quantitatively using the Principal Component Analysis (PCA). Results suggest that /d/ and /r/ may differ in terms of tongue retraction and dorsal stabilization, while also supporting previous results showing the effect of the surrounding environment. The study demonstrates that quantitative articulatory analysis combining ultrasound and PCA is a useful approach to the spatio-temporal characteristics of Japanese coronal consonants, with implications for future research.\n"
   ],
   "p1": 31,
   "pn": 34,
   "doi": "10.21437/issp.2024-9",
   "url": "issp_2024/morimoto24_issp.html"
  },
  "puggaardrode24_issp": {
   "authors": [
    [
     "Rasmus",
     "Puggaard-Rode"
    ]
   ],
   "title": "praatpicture: A library for making flexible Praat Picture-style figures in R",
   "original": "110",
   "order": 34,
   "page_count": 4,
   "abstract": [
    "This paper introduces praatpicture, a library in R for mak- ing figures in the style of Praat Picture, showing one or more sound signals and a range of possible derived signals with time- aligned annotations. The library provides easy out-of-the-box solutions but also a high degree of flexibility, in many cases giv- ing users straightforward access to changing graphical param- eters that are either unavailable or relatively inaccessible in Praat. Derived signals (such as spectrograms or pitch tracks) can either be calculated on the fly using R or imported from Praat; annotations can be made interactively in R or imported from Praat. Options are available for embedding audio in fig- ures, animating figures, and plotting annotated data directly from an EMU-SDMS database. This provides an opportunity for phoneticians who use R extensively to keep more of their workflow in a general purpose software environment."
   ],
   "p1": 131,
   "pn": 134,
   "doi": "10.21437/issp.2024-34",
   "url": "issp_2024/puggaardrode24_issp.html"
  },
  "chen24_issp": {
   "authors": [
    [
     "Po-Rong",
     "Chen"
    ],
    [
     "Feng-fan",
     "Hsieh"
    ],
    [
     "Yueh-chin",
     "Chang"
    ]
   ],
   "title": "C-G vs. C-V Timing Differences in Hong Kong Cantonese",
   "original": "113",
   "order": 10,
   "page_count": 4,
   "abstract": [
    "This study explores the articulatory underpinnings of the\nalleged contrast between labialized velar stops /kwai/ and\nonglides /kui/ in Hong Kong Cantonese, as represented in the\nJyutping transliteration system. We analyzed the coordination\npatterns of onsets and vocoids in these syllable types as well as\nin canonical CV syllables. Our findings indicate that the onsets\nand vocoids in labialized velar stops, onglides, and CV syllables\nare timed synchronously, showing no variation in stiffness.\nThese results challenge the assumed distinctions between\nlabialized velar stops and onglides, confirming the presence of\nCV synchrony in Hong Kong Cantonese."
   ],
   "p1": 35,
   "pn": 38,
   "doi": "10.21437/issp.2024-10",
   "url": "issp_2024/chen24_issp.html"
  },
  "tiede24_issp": {
   "authors": [
    [
     "Mark",
     "Tiede"
    ],
    [
     "Suzanne",
     "Boyce"
    ],
    [
     "Michael",
     "Stern"
    ],
    [
     "Teja",
     "Rebernik"
    ],
    [
     "Martijn",
     "Wieling"
    ]
   ],
   "title": "Production Allophones of North American English Liquids",
   "original": "114",
   "order": 67,
   "page_count": 4,
   "abstract": [
    "The syllabic liquids [ɚ] (as in “purr”) and [əɫ] (as in “pull”)\nhave well-defined acoustic targets but are produced with a\nwide range of heterogenous tongue postures. This work\nsurveys midsagittal tongue shapes from a large (N=78)\nnumber of speakers producing these sounds, to illustrate their\nvariety, and to determine systematically how this variety can\nbe quantified. In particular we propose that a categorization\nbased on just two parameters––degree of tongue dorsum\nconvexity and tip orientation––is sufficient to classify\nobserved shapes, and superior to defining ad hoc prototypes."
   ],
   "p1": 266,
   "pn": 269,
   "doi": "10.21437/issp.2024-67",
   "url": "issp_2024/tiede24_issp.html"
  },
  "saito24_issp": {
   "authors": [
    [
     "Motoki",
     "Saito"
    ]
   ],
   "title": "Contrasting phonetic effects of morphological boundaries for vowel and consonant suffixes",
   "original": "117",
   "order": 11,
   "page_count": 4,
   "abstract": [
    "Affixes (e.g., free+s) are sometimes found to be longer and other times shorter than pseudo-affixes (e.g., freeze). These opposite effects may be due to different degrees of sonority of the target segments being investigated. Vowels (or affixes containing vowels) may be easier to make acoustically more salient and articulatorily clearer, while consonants, especially stop consonants, may be more difficult to do so. The current study focused on the word-final -er [-ɐ] and -t [-t] in German, the former of which was expected to have a higher degree of sonority than the latter. Both of them can be suffixal (e.g., Arbeit+er [aʁbaıt+ɐ] “worker”) and pseudo-suffixal (e.g., Vater [fa:tɐ] “father”) in German. The suffixal -er was found to be longer in duration and more clearly articulated than the pseudo-suffixal -er, while no such difference was found between the suffixal and pseudo-suffixal -t. These findings support the morphology-phonetics interaction and help to resolve the opposite findings regarding morphological effects on phonetic realizations."
   ],
   "p1": 39,
   "pn": 42,
   "doi": "10.21437/issp.2024-11",
   "url": "issp_2024/saito24_issp.html"
  },
  "possamaidemenezes24_issp": {
   "authors": [
    [
     "João Vítor",
     "Possamai de Menezes"
    ],
    [
     "Maria",
     "Mendes Cantoni"
    ],
    [
     "Hani C",
     "Yehia"
    ],
    [
     "Denis",
     "Burnham"
    ],
    [
     "Adriano Vilela",
     "Barbosa"
    ]
   ],
   "title": "The role of face and head movement in the production of lexical tones in Cantonese",
   "original": "119",
   "order": 8,
   "page_count": 4,
   "abstract": [
    "Speech is a multimodal phenomenom at the perception and production ends, and that includes the suprasegmental level of speech. This paper focuses on the auditory-visual nature of lexical tones, a suprasegmental unit of speech that characterises tone languages. A multimodal corpus consisting of audio and Optotrak recordings of 33 markers in the face and head was recorded with 3 native speakers of Cantonese. The recorded trajectories of the Optotrak markers were parameterized as polynomial coefficients and used as input to Linear Discriminant Analysis models for classification between the 6 Cantonese lexical tones. Face and head motion were able to classify between lexical tones with above-chance accuracy for each speaker individually and for all speakers combined. Other analyses were carried out to determine which face regions and types of head motion had a stronger influence of the lexical tone classification accuracy, and the movement of the eyebrows and of the larynx stood out."
   ],
   "p1": 27,
   "pn": 30,
   "doi": "10.21437/issp.2024-8",
   "url": "issp_2024/possamaidemenezes24_issp.html"
  },
  "rubertus24_issp": {
   "authors": [
    [
     "Elina",
     "Rubertus"
    ],
    [
     "Aude",
     "Noiray"
    ]
   ],
   "title": "Children's coarticulation patterns as a window to the phonology-phonetics interface",
   "original": "125",
   "order": 12,
   "page_count": 4,
   "abstract": [
    "This paper presents and discusses implications for the phonology-phonetics interface that can be drawn from three of our studies on coarticulatory development across childhood. Vocalic coarticulation towards the left (anticipatory) as well as towards the right side (carryover) was investigated in children between 3 and 9 years of age as well as in adults. To monitor horizontal tongue movements during pseudoword production, we used ultrasound tongue imaging. Our data provides evidence for a developmental decrease of coarticulation degree both in anticipatory as well as in carryover coarticulation that cannot easily be explained by look-ahead models positing complex translation mechanisms between discrete phonological and dynamic articulatory units. Instead, we argue that the developmental decrease as well as a finding of discontinuous vocalic anticipation in children can best be modeled within the coproduction framework, and therefore Articulatory Phonology."
   ],
   "p1": 43,
   "pn": 46,
   "doi": "10.21437/issp.2024-12",
   "url": "issp_2024/rubertus24_issp.html"
  },
  "popescu24_issp": {
   "authors": [
    [
     "Anisia",
     "Popescu"
    ],
    [
     "Ioana",
     "Chitoran"
    ]
   ],
   "title": "Laterals in simplex vs. complex syllable codas: a comparison of four languages",
   "original": "129",
   "order": 13,
   "page_count": 4,
   "abstract": [
    "English dark /l/ in coda clusters has been shown to exhibit nonlocal coordination patterns (i.e., vowel shortening when going from singleton to complex codas e.g., gull-gulp). The unpredicted organization has been attributed to the articulatory complexity and timing of the coda dark /l/. The present study further investigates this issue by analyzing coda coordination patterns as a function of /l/ darkness in Russian, English, Romanian and Georgian, four languages that differ in the gestural synergies of the coda lateral. The acoustic analysis shows that while predictions on coda coordination patterns based on the gestural composition of the /l/ are confirmed for Russian, English and Romanian, they are not confirmed in the case of Georgian.\n"
   ],
   "p1": 47,
   "pn": 50,
   "doi": "10.21437/issp.2024-13",
   "url": "issp_2024/popescu24_issp.html"
  },
  "mcguire24_issp": {
   "authors": [
    [
     "Paul",
     "McGuire"
    ],
    [
     "Feng-fan",
     "Hsieh"
    ],
    [
     "Yueh-chin",
     "Chang"
    ]
   ],
   "title": "Articulatory Dynamics of Lexical Stress in L2 English: A Case Study of Taiwanese Mandarin Speakers ",
   "original": "131",
   "order": 61,
   "page_count": 4,
   "abstract": [
    "In this study involving ten participants, we simultaneously recorded acoustic and articulatory data using electromagnetic articulography (EMA) to investigate lexical stress production in L2 English among Taiwanese Mandarin (TWM) speakers. Analysis of dynamic time series data uncovered hyper-articulation of lingual articulators and the jaw in stressed syllables, alongside distinct tonal contours related to stress and syllable position. Furthermore, a gestural analysis revealed longer consonant gesture plateaus and longer CV lag in stressed syllables but no difference in gesture velocity."
   ],
   "p1": 242,
   "pn": 245,
   "doi": "10.21437/issp.2024-61",
   "url": "issp_2024/mcguire24_issp.html"
  },
  "geissler24_issp": {
   "authors": [
    [
     "Christopher A",
     "Geissler"
    ],
    [
     "Jyothiraditya",
     "Nellakra"
    ]
   ],
   "title": "Predicting articulatory landmarks with critically-damped oscillators and General Tau Theory",
   "original": "136",
   "order": 44,
   "page_count": 4,
   "abstract": [
    "Dynamical systems are useful for bridging discrete and continuous aspects of speech. In this paper, we compare the ability of two models, critically-damped oscillators and General Tau Theory, to predict gestural landmarks.Predictions of the two models were compared with each other and with original kinematic data. The data consisted of electromagnetic articulography recordings of Tibetan collected as part of Geissler (2021). In addition to the landmarks-based approach, this study also uses a a language with a different phonological typology. As compared to results from kinematic thresholds, the critically-damped oscillator model tended to predict that landmarks would take place earlier in time and closer to the target. The General Tau model generally predicted that landmarks would take place later and farther from the target. These results highlight the differences in, and invite further comparison on, the trajectory shape generated by the two models."
   ],
   "p1": 173,
   "pn": 176,
   "doi": "10.21437/issp.2024-44",
   "url": "issp_2024/geissler24_issp.html"
  },
  "shibata24_issp": {
   "authors": [
    [
     "Kye",
     "Shibata"
    ],
    [
     "Feng-fan",
     "Hsieh"
    ],
    [
     "Yueh-chin",
     "Chang"
    ]
   ],
   "title": "Allophones of Korean /l/: a classification using EMA",
   "original": "141",
   "order": 5,
   "page_count": 4,
   "abstract": [
    "In this paper, an electromagnetic articulography (EMA) study is conducted on four standard Korean speakers to examine their articulation of Korean /l/. Their articulation of /l/ is compared to another sonorant, /n/, in the context of the vowels /a/, /i/, and /u/. Lateralization is quantified by calculating the lateralization angles of both the leftand right-side parasagittal sensors, and retroflexion is examined by observing the angle of elevation seen in the tongue-tip sensor. Considerable intraand inter-speaker variance is observed in the articulation of /l/, with a general tendency for /l/ to be asymmetrically lateralized in coda position, suggesting a lateral approximant articulation. Lateralization appears to be optional in onset position, but the tongue tip is generally raised, indicating a flap, retroflex lateral, or lateral flap articulation. Coda /l/ is also observed to have a tendency to have a raised tongue tip in the context of /a/, suggesting it is a retroflex lateral approximant in this environment.\n"
   ],
   "p1": 16,
   "pn": 19,
   "doi": "10.21437/issp.2024-5",
   "url": "issp_2024/shibata24_issp.html"
  },
  "kirkham24_issp": {
   "authors": [
    [
     "Sam",
     "Kirkham"
    ]
   ],
   "title": "Discovering dynamical models of speech using physics-informed machine learning",
   "original": "143",
   "order": 45,
   "page_count": 4,
   "abstract": [
    "Spoken language is characterised by a high-dimensional and highly variable set of physical movements that unfold over time. What are the fundamental dynamical principles that underlie this signal? In this study, we demonstrate the use of physicsinformed machine learning (sparse symbolic regression) for discovering new dynamical models of speech articulation. We first demonstrate the model discovery procedure on simulated data and show that the algorithm is able to discover the original model with near-perfect accuracy, even when the data contain extensive variation in duration, initial conditions and target positions, as well as in the presence of added noise. We then demonstrate a proof-of-concept applying the same technique to empirical data, which reveals a small set of candidate dynamical models with increasing levels of complexity and accuracy.\n"
   ],
   "p1": 177,
   "pn": 180,
   "doi": "10.21437/issp.2024-45",
   "url": "issp_2024/kirkham24_issp.html"
  },
  "burroni24_issp": {
   "authors": [
    [
     "Francesco",
     "Burroni"
    ],
    [
     "Sireemas",
     "Maspong"
    ],
    [
     "Nicole",
     "Benker"
    ],
    [
     "Philip A",
     "Hoole"
    ],
    [
     "James",
     "Kirby"
    ]
   ],
   "title": "Spatiotemporal features of bilabial geminate and singleton consonants in Italian",
   "original": "146",
   "order": 46,
   "page_count": 4,
   "abstract": [
    "We investigate the production of Italian bilabial geminate and singleton consonants using electromagnetic articulography. The results reveal differences in closure duration, peak velocity, movement amplitude, and stiffness between geminate and singleton consonants. Timing analyses suggest earlier closure initiation and shorter trans-consonantal vocalic lags for geminates. Taken together, these findings suggest a distinct gestural specification for geminates, beyond longer gestural activations, and shed light on their acoustic manifestations, particularly the well-known shortening of vowels before geminate consonants and previously reported differences in how rate affects lags of geminates and singletons.\nKeywords: articulation, geminates, Italian, speech production, electromagnetic articulography"
   ],
   "p1": 181,
   "pn": 184,
   "doi": "10.21437/issp.2024-46",
   "url": "issp_2024/burroni24_issp.html"
  },
  "kirkham24b_issp": {
   "authors": [
    [
     "Sam",
     "Kirkham"
    ],
    [
     "Patrycja",
     "Strycharczuk"
    ]
   ],
   "title": "A dynamic neural field model of vowel diphthongisation",
   "original": "147",
   "order": 52,
   "page_count": 4,
   "abstract": [
    "We advance a computational model of vowel diphthongisation that situates phonological representations in dynamic neural fields (DNFs), which represent the time-varying activation of neural populations that are sensitive to a given phonetic parameter range. We model all long vowels as two separate inputs to the DNF, with input timing governed by a coupled oscillator model that generates an anti-phase relationship between inputs. The location of time-varying maximum activation in the DNF forms a noisy dynamic target, which is used as input to a task dynamic model of gestural coordination. We find that spatial characteristics of long vowels are well captured by the model, which exhibits gradient variation between monophthongs and diphthongs. We also show that a simplified model of production/perception can simulate changes in a speaker’s phonological planning representations, which could represent a mechanism behind sound change if transmitted across a community."
   ],
   "p1": 205,
   "pn": 208,
   "doi": "10.21437/issp.2024-52",
   "url": "issp_2024/kirkham24b_issp.html"
  },
  "chen24b_issp": {
   "authors": [
    [
     "Xuejing",
     "Chen"
    ],
    [
     "Rachid",
     "Ridouane"
    ],
    [
     "Pierre A",
     "Hallé"
    ]
   ],
   "title": "Sonority patterns and onset cluster production in Mandarin",
   "original": "148",
   "order": 3,
   "page_count": 4,
   "abstract": [
    "This study examined the role of the Sonority Sequencing\nPrinciple (SSP) in the production of word-initial clusters by\nChinese speakers. We conducted an imitation experiment in\nwhich Chinese participants had to imitate “model” speech\nstimuli of the form C1C2a or C1əC2a, with 3 types of sonority\nprofile for C1C2: rising (e.g., kla), plateau (e.g., kpa), falling\n(e.g., lka). If the SSP influences the production of these\nclusters, one would expect a higher incidence of vowel\ninsertion for more marked sonority profiles. Our results are\nconsistent with this prediction: more epenthetic vowels were\nproduced within more marked C1C2 clusters, suggesting SSP\neffects in their production. The acoustic characteristics of the\nepenthetic vowels suggest they were all the more “intended”\n(i.e., targeted) that the model clusters were marked. This\npattern suggests that the observed SSP effects in terms of\nincidence of vowel insertion do not solely reflect perceptual\neffects during the imitation task. "
   ],
   "p1": 8,
   "pn": 11,
   "doi": "10.21437/issp.2024-3",
   "url": "issp_2024/chen24b_issp.html"
  },
  "abuoudeh24_issp": {
   "authors": [
    [
     "Mohammad",
     "Abuoudeh"
    ],
    [
     "Jalal",
     "Al-Tamimi"
    ],
    [
     "Olivier",
     "Crouzet"
    ]
   ],
   "title": "Speaking style influence on vowel length opposition in Jordanian Arabic",
   "original": "149",
   "order": 53,
   "page_count": 4,
   "abstract": [
    "This study examines the impact of changes in two speaking styles –story reading vs. storytelling– on the spectral and temporal properties of long and short vowels in Jordanian Arabic. The transition from one register to another may generate temporal spectral modifications. This is why a particular interest has been paid to the behavior of long and short vowels in the context of these two types of variations. Ten speakers of Jordanian Arabic read and then narrated the same short story. Contrary to what was expected, spectral and temporal vowel properties were not influenced by the change in speaking style. These results indicate that in Jordanian Arabic, the transition from one register to the other had little impact on vowel quality and quantity. However, the conditions under scrutiny in this study may be too close to one another to enable such expected differences to emerge. Additional components of the currently collected corpus may be more appropriate to let differences between controlled and more spontaneous speech styles be revealed."
   ],
   "p1": 209,
   "pn": 212,
   "doi": "10.21437/issp.2024-53",
   "url": "issp_2024/abuoudeh24_issp.html"
  },
  "svenssonlundmark24_issp": {
   "authors": [
    [
     "Malin",
     "Svensson Lundmark"
    ]
   ],
   "title": "Timing of acceleration peaks and acceleration changes ",
   "original": "152",
   "order": 39,
   "page_count": 4,
   "abstract": [
    "Articulators accelerate and decelerate continuously during speech. Previous research reveals a structured pattern of deceleration peaks aligning with segment onset and acceleration peaks with segment offset. This study reports on previous EMA findings on 18 speakers while also sets out to explain why the deceleration peak lags behind at onset boundary, as previously reported. A qualitative analysis is made on acceleration changes (jerk) of constrictions by one speaker. Preliminary results reveal significant differences between the kinematics of segment onset at constriction closure, which align to the jerk of the deceleration phase, and segment offset at the release, which coincide with the acceleration peak.\n"
   ],
   "p1": 152,
   "pn": 155,
   "doi": "10.21437/issp.2024-39",
   "url": "issp_2024/svenssonlundmark24_issp.html"
  },
  "dehaisunderdown24_issp": {
   "authors": [
    [
     "Alexis",
     "Dehais-Underdown"
    ],
    [
     "Lise",
     "Crevier-Buchman"
    ],
    [
     "Didier",
     "Demolin"
    ],
    [
     "Pierre André",
     "Vuissoz"
    ],
    [
     "Marc",
     "Fauvel"
    ],
    [
     "Jacques",
     "Felblinger"
    ],
    [
     "Yves",
     "Laprie"
    ]
   ],
   "title": "Are glottalic mechanisms in Human Beatboxing really glottalic?",
   "original": "155",
   "order": 40,
   "page_count": 5,
   "abstract": [
    "This communication focuses on the production of ejectives and implosives in Human Beatboxing (HBB). To investigate ejectives and implosives (i.e. glottalic mechanisms), real-time Magnetic Resonance Imaging data was collected on one professional subject. MRI recordings were analyzed via a functional Principal Component Analysis of vocal tract contours. The findings show that glottalic mechanisms for this subject are produced with tongue root and velo-pharyngeal maneuvers to change the volume of the pharyngeal cavity rather than laryngeal raising or lowering. We think ejectives and implosives might better be described as obstruent consonants produced with pharyngeal compression or expansion and a closed glottis at least in Beatboxing."
   ],
   "p1": 156,
   "pn": 160,
   "doi": "10.21437/issp.2024-40",
   "url": "issp_2024/dehaisunderdown24_issp.html"
  },
  "schroer24_issp": {
   "authors": [
    [
     "Marin",
     "Schröer"
    ],
    [
     "Bogdan",
     "Ludusan"
    ]
   ],
   "title": "Examining the Link between the Perception and Production of Phonetic Convergence of Laughter in Interaction",
   "original": "156",
   "order": 20,
   "page_count": 4,
   "abstract": [
    "Convergence, i.e. the process of two people adjusting their behaviour to become more similar to each other, has been found in most aspects of human interaction by now. However, most of the studies investigating convergence have so far considered mostly linguistic aspects while taking into account only production or perception rather than both. In this paper, we expand on previous work to examine paralinguistic phenomena, namely laughter, by integrating an analysis of differences between several acoustic cues extracted from laughter in spontaneous interaction with a perceptual experiment in order to determine their perceptual relevance."
   ],
   "p1": 75,
   "pn": 78,
   "doi": "10.21437/issp.2024-20",
   "url": "issp_2024/schroer24_issp.html"
  },
  "boilley24_issp": {
   "authors": [
    [
     "Claire",
     "Boilley"
    ],
    [
     "Patricia",
     "Pires"
    ],
    [
     "Hélène",
     "Lœvenbruck"
    ],
    [
     "Anne",
     "Vilain"
    ]
   ],
   "title": "Phoneme monitoring and articulatory suppression in French-speaking adults",
   "original": "159",
   "order": 58,
   "page_count": 4,
   "abstract": [
    "Segmenting words into their individual phonemes (explicit phonemic awareness) might require the use of abstract representations. To explore this hypothesis, we designed a phoneme monitoring task and examined how articulatory suppression and auditory interference affected performance in French-speaking adults with typical reading abilities. We controlled for the cognitive cost of dual-tasking by adding a semantic task. Contrary to our expectations, participants’ scores were lower and reaction times longer under articulatory suppression, a finding that could not be attributed to interference from auditory feedback during articulation. We discuss potential linguistic and individual factors that might account for these unexpected results."
   ],
   "p1": 230,
   "pn": 233,
   "doi": "10.21437/issp.2024-58",
   "url": "issp_2024/boilley24_issp.html"
  },
  "rasskazova24_issp": {
   "authors": [
    [
     "Oksana",
     "Rasskazova"
    ],
    [
     "Christine",
     "Mooshammer"
    ],
    [
     "Susanne",
     "Fuchs"
    ]
   ],
   "title": "Temporal coordination of articulatory and respiratory events during utterance - initial and inter-speech pauses",
   "original": "169",
   "order": 41,
   "page_count": 4,
   "abstract": [
    "Understanding the temporal organization of articulatory and respiratory events prior to speech initiation is crucial for encoding the complexities of speech planning and speech production. This study builds on a pilot study (Rasskazova et al. 2019), which demonstrated temporal alignment between oral articulators and exhalation onset for alveolar consonants of 6 speakers. In the current study, we investigate 11 speakers, five initial segments and two sentence conditions: utterance-initial silent interval and inter-speech pauses. Our results indicate a tight coupling between the onset of exhalation with the velocity peak of the closing gesture and the nucleus onset of the initial segment, shown by latencies with very low variability. This suggests a synchronized timing between respiratory and articulatory events. Preparatory events were more variable during utterance-initial positions compared to inter-speech pauses.\n"
   ],
   "p1": 161,
   "pn": 164,
   "doi": "10.21437/issp.2024-41",
   "url": "issp_2024/rasskazova24_issp.html"
  },
  "gorman24_issp": {
   "authors": [
    [
     "Emily",
     "Gorman"
    ]
   ],
   "title": "Dialect specific patterns of gestural timing? Evidence from lateral clusters.",
   "original": "173",
   "order": 68,
   "page_count": 4,
   "abstract": [
    "This study explores the relationship between articulatory variation and speech timing, focussing on patterns of onset cluster timing in articulatorily distinct productions of /l/. Motivated by findings of variable cross-linguistic patterns of lateral cluster timing, this study compares lateral onset clusters across two closely related dialects of British English which differ in lateral darkness. Durational measures are used to determine the stable intervals and temporal movements across singleton and cluster pairs. Unexpectedly, the study finds no effects of lateral darkness on lateral onset cluster timing. Possible explanations for these results are explored."
   ],
   "p1": 270,
   "pn": 273,
   "doi": "10.21437/issp.2024-68",
   "url": "issp_2024/gorman24_issp.html"
  },
  "vaughanwilliams24_issp": {
   "authors": [
    [
     "Katherine",
     "Vaughan-Williams"
    ],
    [
     "Steven",
     "Moran"
    ],
    [
     "Sam",
     "Kirkham"
    ]
   ],
   "title": "Dimensions of structure and variability in the human vocal tract",
   "original": "174",
   "order": 69,
   "page_count": 4,
   "abstract": [
    "A defining characteristic of the human vocal tract is a complex dynamic between structure and variability. Across a population we observe considerable variability in vocal tract dimensions, but variation in one dimension is rarely independent of other dimensions. Are some of these relationships more variable than others, or do there exist invariants in the morphology of the vocal tract? In this study, we report a data-driven investigation into the relationship between vocal tract dimensions based on multi-speaker real-time magnetic resonance imaging data. We discover different sub-populations in the data, which correspond to groups of speakers that share a common relationship between vocal tract parameters. This suggests a range of complex patterns of co-variation in the morphology of the human vocal tract. We conclude by speculating on the possible implications of these results for understanding individual differences in speech production.\n"
   ],
   "p1": 274,
   "pn": 277,
   "doi": "10.21437/issp.2024-69",
   "url": "issp_2024/vaughanwilliams24_issp.html"
  },
  "mertz24_issp": {
   "authors": [
    [
     "Justine",
     "Mertz"
    ],
    [
     "Lena",
     "Pagel"
    ],
    [
     "Pamela",
     "Perniss"
    ],
    [
     "Giuseppina",
     "Turco"
    ],
    [
     "Doris",
     "Mücke"
    ]
   ],
   "title": "Coarticulation in sign language: A kinematic study on French Sign Language (LSF) using Electromagnetic Articulography (EMA)",
   "original": "185",
   "order": 14,
   "page_count": 4,
   "abstract": [
    "Speakers tend to modulate the amount of coarticulatory cues according to the communicative needs at hand. Coarticulation has also been observed in the visual-gestural modality. Despite this, little is known about the use of coarticulatory strategies in sign language, probably partly because access to this finegrained information can be very challenging. While the use of 3D electromagnetic articulography (EMA), a highly sophisticated experimental technique, has been widely (and successfully) tested on speech, the present studies are the first to provide precise kinematic measurements in the production of one deaf signer. In Study 1, we recorded signs produced in various locations on the signer’s body in different setups (height of articulograph, hands’ resting position, signer’s position). After having identified locations and setups that can be used to optimize testing of sign kinematics, we ran an experiment on coarticulation (Study 2) in French Sign Language (LSF) to capture articulatory overlap between signs occurring next to each other. In this novel approach, we recorded a deaf native signer (EMA/video) while signing phonological pairs composed of ‘1’and/or ‘3’-handshape. In a dynamical framework, we examine the kinematics of our sign data, revealing systematic patterns of overlapping organization driven by the phonological system. Our preliminary data showed both temporal and spatial dimensions of coarticulation in signing: (1) The anticipation of the ‘3’-handshape before the end of its immediately preceding ‘1’handshape sign (and vice versa); (2) the truncation of the repetitive movement of the sign. Our findings speak in favor of the acquisition of kinematic data for capturing contextual variation phenomena."
   ],
   "p1": 51,
   "pn": 54,
   "doi": "10.21437/issp.2024-14",
   "url": "issp_2024/mertz24_issp.html"
  },
  "maspong24_issp": {
   "authors": [
    [
     "Sireemas",
     "Maspong"
    ],
    [
     "Francesco",
     "Burroni"
    ]
   ],
   "title": "Are long and short vowels articulatorily different?: Spatial and durational effects of vowel length in Thai",
   "original": "186",
   "order": 42,
   "page_count": 4,
   "abstract": [
    "In Thai, vowel length contrasts have been reported to be primarily distinguished by differences in acoustic duration, with limited differences in vowel quality. Little is known about the articulatory characteristics of vowel length contrasts. In this paper, we presents an investigation into the articulatory features of long and short vowels in Thai, drawing upon results obtained from electromagnetic articulography (EMA). Our study reveals distinct spatial and durational characteristics associated with the production of long vowels, compared to their short counterparts. These findings challenge conventional assumptions regarding Thai vowel length, which typically assume that long vowels are short vowels associated with longer durations, thus our accounts also question the target undershoot model.\n"
   ],
   "p1": 165,
   "pn": 168,
   "doi": "10.21437/issp.2024-42",
   "url": "issp_2024/maspong24_issp.html"
  },
  "jiang24_issp": {
   "authors": [
    [
     "Song",
     "Jiang"
    ],
    [
     "Alexei",
     "Kochetov"
    ]
   ],
   "title": "Variability in the articulation of Beijing Mandarin rhotic vowels",
   "original": "187",
   "order": 70,
   "page_count": 4,
   "abstract": [
    "One of the most documented characteristics of the North American English rhotic /ɹ/ (including its vocalic variant [ɚ]) is its contextual and/or inter-speaker variability in the choice of tongue shapes – bunched or retroflex. In contrast, the situation with Mandarin rhotic vowels (e.g. [ɚ, u˞]) is much less clear. To further explore the individual and contextual variability, we have been conducting an extensive ultrasound investigation of Beijing Mandarin rhotic vowels. Preliminary results presented in this paper show both individual and contextual variation in the realization of these segments. First, the speakers we examined varied in using either a retroflex or a bunched tongue configuration. Second, we found some within-speaker variation conditioned by vocalic contexts, albeit not observed systematically. Third, the data also showed that rhotic vowels in Beijing Mandarin tend to be more similar to each other compared to their non-rhotic counterparts. These results demonstrate a greater than previously reported variability in the articulation of Beijing Mandarin rhotic vowels."
   ],
   "p1": 278,
   "pn": 281,
   "doi": "10.21437/issp.2024-70",
   "url": "issp_2024/jiang24_issp.html"
  },
  "juhasz24_issp": {
   "authors": [
    [
     "Kornélia",
     "Juhász"
    ],
    [
     "Huba",
     "Bartos"
    ]
   ],
   "title": "Mandarin Chinese tonal coarticulation in the production of learners with an atonal L1",
   "original": "188",
   "order": 62,
   "page_count": 5,
   "abstract": [
    "This preliminary analysis aims to shed light on how tonal coarticulation surfaces in the production of learners with an atonal L1, that is, Hungarian learners of Mandarin Chinese. In Mandarin assimilatory carry-over coarticulation is more salient, compared to dissimilatory anticipatory effect, besides, the realization of lexical tones and coarticulation also interacts with sentence type (i.e., intonation). Thus, in this analysis, we aim to investigate how the concatenation of lexical tones surfaces in two sentence types, i.e., declarative and syntactically marked yes/no interrogatives in the production of Hungarian learners of Mandarin and a native speaker group. All combination of the four Mandarin lexical tones appeared in the recorded tone sequences. F0-contours of utterance-initial sequences of 4 syllables were compared by GAMMs. The results show that although L2 learners’ f0 curves differ from the native realizations, but carry-over effect can be observed if the target tone is either T1 or T4 (i.e., the affected tonal target is H), whereas the same effect on T2 and T3 targets (with initial L tones) is not in line with native patterns, that is, does not show clear sign of trigger-dependent carry-over influence."
   ],
   "p1": 246,
   "pn": 250,
   "doi": "10.21437/issp.2024-62",
   "url": "issp_2024/juhasz24_issp.html"
  },
  "lara24_issp": {
   "authors": [
    [
     "Andres F",
     "Lara"
    ],
    [
     "Didier",
     "Demolin"
    ],
    [
     "Claire",
     "Pillot-Loiseau"
    ]
   ],
   "title": "Effects of phonetic contexts on aerodynamic conditions for uvular trills in French",
   "original": "193",
   "order": 6,
   "page_count": 3,
   "abstract": [
    "This study examines the impact of vowel quality and syllabic position on the aerodynamic requirements for producing the French uvular trill. The findings suggest that using the vowel [a] when producing rhotics is more likely to result in trills, whether in word-initial or intervocalic positions. This is followed by [u], while rhotics produced with [i] tend to favor fricatives rather than trills. Trill production is more advantageous in word-initial positions compared to intervocalic positions. Furthermore, the results demonstrate that as the duration of sustained productions above a 2 hPa threshold increases, the conditions for trilling become more favorable in the [a] and [u] contexts. The recommended time limits for trilling in these contexts are 110 ms for [a] and 140 ms for [u]. Additionally, voiceless trills are significantly longer than other modes of articulation for French rhotics (i.e. approximants and fricatives), suggesting that duration can be employed as a distinguishing factor for voiceless trills."
   ],
   "p1": 20,
   "pn": 22,
   "doi": "10.21437/issp.2024-6",
   "url": "issp_2024/lara24_issp.html"
  },
  "bourhis24_issp": {
   "authors": [
    [
     "Morgane",
     "Bourhis"
    ],
    [
     "Yosra",
     "Jelassi"
    ],
    [
     "Christophe",
     "Savariaux"
    ],
    [
     "Pascal",
     "Perrier"
    ],
    [
     "Takayuki",
     "Ito"
    ]
   ],
   "title": "Compensatory response to tongue perturbation occurs similarly with normal and altered auditory feedback",
   "original": "197",
   "order": 54,
   "page_count": 4,
   "abstract": [
    "Somatosensory and auditory feedback contribute to speech motor control, but it is unclear how they interact in on-line feedback control. In previous studies, we showed evidence for a somatosensory-based response to tongue-stretch perturbation in vowel production, which ensures tongue posture stabilization and preserves the auditory characteristics of the sound. In this study, we combined the tongue perturbation with an alteration of the auditory feedback, which induced formant shifts that were either consistent or inconsistent with the auditory impact of the tongue perturbation. We investigated how the compensation for the auditory perturbation interacts with the somatosensory response to the tongue perturbation. We did not find any interaction. The latency of the compensation for the formant shift was longer than the one of the somatosensory responses, suggesting that somatosensory feedback control could be the fastest one to preserve crucial auditory characteristics of vowels."
   ],
   "p1": 213,
   "pn": 216,
   "doi": "10.21437/issp.2024-54",
   "url": "issp_2024/bourhis24_issp.html"
  },
  "palo24_issp": {
   "authors": [
    [
     "Pertti",
     "Palo"
    ],
    [
     "Steven",
     "Lulich"
    ]
   ],
   "title": "Some Effects of Framerate on Gesture Detection in Tongue Ultrasound",
   "original": "217",
   "order": 59,
   "page_count": 4,
   "abstract": [
    "We study how decreasing ultrasound frame rate affects automated speech gesture detection. The gesture detection is performed on Pixel Difference contours with simulated stepping down of the frame rate from ≈122Hz down to ≈17Hz. We report how this affects the number of peaks detected and the accuracy of peak locations for Pixel Difference calculated using six different vector norms. The results point to a steady degradation of detection results as the frame rate is decreased.\n"
   ],
   "p1": 234,
   "pn": 237,
   "doi": "10.21437/issp.2024-59",
   "url": "issp_2024/palo24_issp.html"
  },
  "stern24_issp": {
   "authors": [
    [
     "Michael",
     "Stern"
    ],
    [
     "Jason A",
     "Shaw"
    ]
   ],
   "title": "Towards a minimal dynamics for gestures: a law relating velocity and position",
   "original": "222",
   "order": 47,
   "page_count": 4,
   "abstract": [
    "Dynamical models of articulatory gestures relate the velocity of a vocal tract variable to its position via a function with one or more control parameters. In this paper we propose a minimal dynamical model of gestures. The model is empirically motivated by observations of the timecourse of the ratio of velocity to position in bilabial constriction movements by English and Mandarin speakers. We discovered that this ratio tends to follow an exponential growth curve over the course of a movement. A dynamical formalization of this empirical discovery, in combination with an assumption of point attractor dynamics, constitutes the core of our model. The model has only two parameters, T and r. T corresponds to the target position of the vocal tract variable and r corresponds to rapidity. Simulations from the model capture key elements of gesture kinematics, performing much better than the damped mass-spring model. Our model achieves these improvements despite having fewer control parameters. Future work will extend our model to other kinds of gestures besides bilabial consonant constrictions."
   ],
   "p1": 185,
   "pn": 188,
   "doi": "10.21437/issp.2024-47",
   "url": "issp_2024/stern24_issp.html"
  },
  "zhang24_issp": {
   "authors": [
    [
     "Yubin",
     "Zhang"
    ],
    [
     "Yijing",
     "Lu"
    ],
    [
     "Annie",
     "Rialland"
    ],
    [
     "Sarah",
     "Harper"
    ],
    [
     "Louis",
     "Goldstein"
    ]
   ],
   "title": "Intensity downtrends in Embosi intonation",
   "original": "226",
   "order": 56,
   "page_count": 4,
   "abstract": [
    "Previous studies on utterance-level intonational trends have focused mainly on fundamental frequency (f0), but there is some evidence that other phonetic properties also play a role. The subglottal pressure and intensity variations have been argued to be involved in intonational trends. However, little is known about the dynamics of the intensity trend in intonational contrasts and its relationship with the f0 trend. The current study examines the dynamical patterns of intensity and f0 in declarative and polar question utterances in a Bantu language called Embosi. The results show that both f0 and intensity exhibit initial rising and final lowering, but their kinematic profiles do not always match. To account for the current findings under the framework of articulatory phonology, we propose a pulmonic pressure initiation unit in addition to intonational tone units at the utterance level."
   ],
   "p1": 222,
   "pn": 225,
   "doi": "10.21437/issp.2024-56",
   "url": "issp_2024/zhang24_issp.html"
  },
  "faytak24_issp": {
   "authors": [
    [
     "Matthew",
     "Faytak"
    ],
    [
     "Mariana",
     "Quintana Godoy"
    ],
    [
     "Tianle",
     "Yang"
    ]
   ],
   "title": "Lingual and epilaryngeal articulation of vowels in Mundabli",
   "original": "227",
   "order": 43,
   "page_count": 4,
   "abstract": [
    "The vowel system of Mundabli (Yemne-Kimbi, Cameroon) is rich in contrasts involving lower vocal tract activity. In this study, we aim to characterize the acoustics and articulation of the three sets of vowels in the language, which we refer to as pharyngeal, plain, and lax. Acoustic time series data reveal that pharyngealization raises F1 and lowers F2 and F3; it also conditions tense or creaky voice quality relative to the plain and lax vowels. Ultrasound data suggest that these acoustic properties can typically be attributed to a lower pharyngeal or epilaryngeal constriction. The data also suggest that the lax and plain vowels may exhibit an advanced tongue root contrast. Variation in the articulatory implementation of pharyngealization observed in the ultrasound data is discussed."
   ],
   "p1": 169,
   "pn": 172,
   "doi": "10.21437/issp.2024-43",
   "url": "issp_2024/faytak24_issp.html"
  },
  "kuruvilladugdale24_issp": {
   "authors": [
    [
     "Mili",
     "Kuruvilla-Dugdale"
    ],
    [
     "Antje",
     "Mefferd"
    ]
   ],
   "title": "Spatiotemporal Coupling of the Jaw and Lower Lip: Comparing Talkers with Parkinson's Disease and Amyotrophic Lateral Sclerosis",
   "original": "228",
   "order": 29,
   "page_count": 4,
   "abstract": [
    "This study sought to determine the differences in temporal\ncoupling between the lower lip and jaw for two gestures i.e., the\nvowel /ʌ/ and the labiodental fricative /f/ in the word ‘muffin.’\nBecause articulatory timing can be disrupted by impairments to\nthe basal ganglia and its role in intrinsic timing and the dynamic\nstate of the articulatory system, interarticulator timing was\ncompared between tallkers with amyotrphic lateral sclerosis\n(ALS) and Parkinson’s disease (PD) relative to healthy controls.\nElectromagnetic articulography was used to record lower lip\nand jaw movements from six talkers with ALS, nine with PD,\nand 10 healthy controls. Lag values were obtained by\nsubtracting the timepoint of the lower lip from the timepoint of\nthe jaw for each gesture based on the timepoints of the\npositional minima for the jaw and lower lip during /ʌ/ and the\npositional maxima for the jaw and lower lip during /f/. Absolute\nlag times, percent lag (relative to total word duration), and\ncoefficient of variation (CoV) values were compared between\nthe three groups, as were effect sizes. Our results show a trend\ntowards greater interarticulator timing differences (i.e., less\ntemporal coupling) in talkers with ALS, whereas talkers with\nPD showed similar timing patterns to healthy controls. CoV\nvalues tended to be lower in the clinicial groups, with the ALS\ngroup showing more consistent lag times than even the PD\ngroup. Although preliminary, these results provide evidence of\na mismatch between intrinsic timing and the physical state of\nthe articulators in talkers with ALS. Despite basal ganglia\npathology, the relative timing patterns among articulators\nappeared to be intact in talkers with PD."
   ],
   "p1": 111,
   "pn": 114,
   "doi": "10.21437/issp.2024-29",
   "url": "issp_2024/kuruvilladugdale24_issp.html"
  },
  "hitchcock24_issp": {
   "authors": [
    [
     "Elaine R.",
     "Hitchcock"
    ],
    [
     "Laura L.",
     "Koenig"
    ]
   ],
   "title": "Examining Speech Perception of Non-Errored Pronunciations in Children with Speech Sound Disorders",
   "original": "239",
   "order": 63,
   "page_count": 4,
   "abstract": [
    "Do children with speech-sound disorders (SSDs) also differ in\ntheir speech perception? Past results suggest that perceptual\ndifficulties are limited to sounds produced in error. Here, we\nassessed labeling accuracy and reaction times [RTs] in\nchildren with SSD (without voicing errors) and typical-\ndeveloping [TD] peers. Stimuli were words 'boo, Pooh, doe,\ntoe’ produced by TD 2-year-olds, with VOTs that were\n\"appropriate\" (expected for the target) or inappropriate.\nListener judgments were considered accurate if they matched\nthe child's target. Results showed high listener accuracy for\nappropriate VOTs with no group differences. For inappropriate\nVOTs, children with SSD showed higher accuracy than TD,\nreaching significance for one comparison. RTs were faster for\naccurate labeling in both groups and were overall shorter\nchildren with SSD than TD peers, suggesting that children with\nSSD may demonstrate some differences in speech perception\nbehavior, even for sounds not produced in error."
   ],
   "p1": 251,
   "pn": 254,
   "doi": "10.21437/issp.2024-63",
   "url": "issp_2024/hitchcock24_issp.html"
  }
 },
 "sessions": [
  {
   "title": "Biomechanical modeling & Acoustic-to-articulatory inversion",
   "papers": [
    "kochetov24_issp",
    "sering24_issp",
    "chen24b_issp"
   ]
  },
  {
   "title": "Aerodynamic models & Articulatory synthesis",
   "papers": [
    "blandin24_issp",
    "shibata24_issp",
    "lara24_issp"
   ]
  },
  {
   "title": "Audio-visual speech perception",
   "papers": [
    "munasinghe24_issp",
    "possamaidemenezes24_issp"
   ]
  },
  {
   "title": "Coarticulation",
   "papers": [
    "morimoto24_issp",
    "chen24_issp",
    "saito24_issp",
    "rubertus24_issp",
    "popescu24_issp",
    "mertz24_issp"
   ]
  },
  {
   "title": "Connected speech processes",
   "papers": [
    "du24_issp",
    "weigerber24_issp",
    "aalto24_issp",
    "kye24_issp",
    "moraeslimadossantos24_issp"
   ]
  },
  {
   "title": "Communication and human interaction",
   "papers": [
    "schroer24_issp"
   ]
  },
  {
   "title": "Disorders of speech motor control",
   "papers": [
    "loucks24_issp",
    "bjorelius24_issp",
    "vantellingen24_issp",
    "tienkamp24_issp",
    "tienkamp24b_issp",
    "hoekzema24_issp",
    "rakhangi24_issp",
    "herbig24_issp",
    "kuruvilladugdale24_issp"
   ]
  },
  {
   "title": "Instrumental techniques",
   "papers": [
    "terband24_issp",
    "pagel24_issp",
    "thies24_issp",
    "makarov24_issp",
    "puggaardrode24_issp"
   ]
  },
  {
   "title": "Mapping between articulatory and acoustic events",
   "papers": [
    "kim24_issp",
    "huang24_issp",
    "foley24_issp",
    "erickson24_issp",
    "svenssonlundmark24_issp",
    "dehaisunderdown24_issp",
    "rasskazova24_issp",
    "maspong24_issp",
    "faytak24_issp"
   ]
  },
  {
   "title": "Models of motor control",
   "papers": [
    "geissler24_issp",
    "kirkham24_issp",
    "burroni24_issp",
    "stern24_issp"
   ]
  },
  {
   "title": "Plasticity of speech production and perception",
   "papers": [
    "deme24_issp",
    "jesus24_issp",
    "jesus24b_issp",
    "percival24_issp",
    "kirkham24b_issp",
    "abuoudeh24_issp",
    "bourhis24_issp"
   ]
  },
  {
   "title": "Prosody",
   "papers": [
    "marchini24_issp",
    "zhang24_issp"
   ]
  },
  {
   "title": "Rhythm and timing",
   "papers": [
    "neuberger24_issp",
    "boilley24_issp",
    "palo24_issp"
   ]
  },
  {
   "title": "Speech and language acquisition",
   "papers": [
    "terband24b_issp",
    "mcguire24_issp",
    "juhasz24_issp",
    "hitchcock24_issp"
   ]
  },
  {
   "title": "Intra- and inter-speaker variability",
   "papers": [
    "soberanes24_issp",
    "weng24_issp",
    "demosthenes24_issp",
    "tiede24_issp",
    "gorman24_issp",
    "vaughanwilliams24_issp",
    "jiang24_issp"
   ]
  }
 ],
 "doi": "10.21437/issp.2024"
}
