{
 "series": "JEP",
 "title": "XXXIVe Journées d'Études sur la Parole -- JEP 2022",
 "location": "Île de Noirmoutier, France",
 "startDate": "13/06/2022",
 "endDate": "17/06/2022",
 "URL": "https://jep2022.univ-nantes.fr/",
 "chair": "Chairs: Olivier Crouzet, Elisabeth Delais-Roussarie, Agnieszka Duniec, Loriane Leprieur, Patrick Louis Rohrer, Marie Tahon, Jane Wottawa, Mano Brabant, Hugo Riguidel, Nelly Barbot, Sylvie Gibet, Damien Lolive and Aghilas Sini",
 "intro": "intro.pdf",
 "ISSN": "XXXX-XXXX",
 "conf": "JEP",
 "year": "2022",
 "name": "jep_2022",
 "SIG": "AFCP",
 "title1": "XXXIVe Journées d'Études sur la Parole -- JEP 2022",
 "date": "13-17 June 2022",
 "booklet": "jep_2022.pdf",
 "papers": {
  "astesano22_jep": {
   "authors": [
    [
     "Corine",
     "Astésano"
    ]
   ],
   "title": "De la supramodalité du rythme : Implications pour la description prosodique, la remédiation linguistique et l’apprentissage des langues",
   "original": "astesano",
   "page_count": 14,
   "order": 1,
   "p1": 1,
   "pn": 14,
   "abstract": [
    "La prosodie est souvent décrite comme la « musique de la langue ». Elle joue une fonction essentielle dans la planification et le traitement de la parole, en facilitant le découpage du signal en unités hiérarchiquement organisées. Dans l’approche métrique du langage, le rythme est considéré comme l’élément fondateur, « l’ossature » de l’organisation prosodique, prééminent à l’intonation. De nom- breux travaux ont d’ailleurs été consacrés à la distinction rythmique des langues sur une dimension d’isochronie syllabique (typiquement, le français) vs. accentuelle (typiquement l’anglais). Dans ces travaux, la dimension temporelle du rythme prédomine. En prenant l’exemple du français, cette présentation discutera de l’intérêt de prendre également en considération la dimension métrique à différents niveaux d’actualisation du rythme, afin d’optimiser les mesures du rythme langagier. Par ailleurs, le rythme a une réalité psychologique, cognitive, motrice et neuronale. Je discuterai de l’intérêt de développer une réflexion interdisciplinaire, à la croisée de la linguistique, des sciences de la motricité, des sciences informatiques et de la psychologie cognitive, pour définir les contours du rythme dans sa dimension supramodale. Cette réflexion permettrait d’éclairer les pratiques des orthophonistes en remédiation langagière, et des formateurs pour l’apprentissage d’une L2, qui utilisent intuitivement le rythme moteur corporel pour améliorer l’appréhension du rythme langagier."
   ],
   "doi": "10.21437/JEP.2022-1"
  },
  "pierrard22_jep": {
   "authors": [
    [
     "Alexis",
     "Pierrard"
    ],
    [
     "Philippe",
     "Boula de Mareüil"
    ]
   ],
   "title": "Étude acoustique préliminaire des /r/ fricatifs en espagnol des hautes terres de Bolivie",
   "original": "22",
   "page_count": 10,
   "order": 2,
   "p1": 15,
   "pn": 24,
   "abstract": [
    "Cette étude préliminaire s’intéresse aux caractéristiques acoustiques de deux variantes fricatives de /r/ en compétition dans les hautes terres de Bolivie ; une variante dominante post-alvéolaire avec ou sans battement initial, [r̝, ʐ], en coprésence avec une variante [z] discriminée. Afin de mener à terme une étude sociolinguistique plus poussée en production et en perception, nous analysons ici les productions de 4 locutrices provenant de la lecture de phrases dans lesquelles ont été insérés des mots incluant différents contextes syllabiques et vocaliques où apparaît le /r/. Les résultats indiquent une proportion de 12–15 % de la variante [z] en contexte surveillé. La variante à battement initial [r̝] est relativement rare et favorisée par le contexte initial (#_), tandis que l’apparition de [z] est favorisée par un contexte vocalique antérieur. Enfin, le centre de gravité apparaît comme une mesure efficace pour distinguer [r̝, ʐ] d’une part et [z] d’autre part."
   ],
   "doi": "10.21437/JEP.2022-2"
  },
  "meynadier22_jep": {
   "authors": [
    [
     "Yohann",
     "Meynadier"
    ],
    [
     "Alain",
     "Ghio"
    ],
    [
     "Alexendra",
     "Césari-Liétard"
    ]
   ],
   "title": "Phonologie des voyelles nasales du français méridional à la lumière de l’aérophonométrie",
   "original": "23",
   "page_count": 9,
   "order": 3,
   "p1": 25,
   "pn": 33,
   "abstract": [
    "Le manque d’études sur les voyelles nasales du méridional via un corpus et une population représentatifs en phonologie et en phonétique instrumentale motive ce travail. La question de leur variation phonétique contextuelle, inter- et intra-locuteur, diatopique, sociolinguistique et de leur représentation sous-jacente est encore en chantier. Adoptant l’approche de la phonologie expérimentale, une investigation aérodynamique reposant sur une réduction de données menant au calcul d’un quotient de nasalité tente de capter la spécificité phonétique de ces voyelles dans les parlers de France, afin d’alimenter le débat sur leur nature et statut phonologique. Confrontée aux données connues et proposées dans cette étude, cette mesure est évaluée pour en tracer les limites et les perspectives"
   ],
   "doi": "10.21437/JEP.2022-3"
  },
  "rakotomalala22_jep": {
   "authors": [
    [
     "Tsiky",
     "Rakotomalala"
    ],
    [
     "Pierre",
     "Baraduc"
    ],
    [
     "Pascal",
     "Perrier"
    ]
   ],
   "title": "Optimalité dans la production de parole: quel rôle sur la formation de trajectoires ?",
   "original": "37",
   "page_count": 10,
   "order": 4,
   "p1": 34,
   "pn": 43,
   "abstract": [
    "Le contrôle optimal, une théorie largement répandue en contrôle moteur, est encore rarement employée pour éclairer le contrôle neuromusculaire de la production de parole, probablement en raison de la complexité biomécanique du système orofacial. Dans ce papier, nous souhaitons confronter cette théorie avec l’hypothèse, que l’un de nous a beaucoup étudiée, selon laquelle les trajectoires seraient majoritairement influencées par les contraintes biomécaniques des articulateurs de la parole. Pour cela, nous analysons la production de voyelles depuis une position de repos avec deux modèles de contrôle :le modèle GEPPETO pour lequel les trajectoires résultent de la spécification d’une posture finale et des caractéristiques biomécaniques du système de production de la parole, et un modèle de contrôle optimal où la formation de trajectoires dépend non seulement des contraintes biomécaniques, mais aussi d’un choix optimal des activations musculaires. Nos simulations permettent une comparaison directe des résultats dans les domaines acoustique, cinématique et moteur."
   ],
   "doi": "10.21437/JEP.2022-4"
  },
  "le22_jep": {
   "authors": [
    [
     "Hang",
     "Le"
    ],
    [
     "Sina",
     "Alisamir"
    ],
    [
     "Marco",
     "Dinarelli"
    ],
    [
     "Fabien",
     "Ringeval"
    ],
    [
     "Solène",
     "Evain"
    ],
    [
     "Ha",
     "Nguyen"
    ],
    [
     "Marcely Zanon",
     "Boito"
    ],
    [
     "Salima",
     "Mdhaffar"
    ],
    [
     "Ziyi",
     "Tong"
    ],
    [
     "Natalia",
     "Tomashenko"
    ],
    [
     "Titouan",
     "Parcollet"
    ],
    [
     "Allauzen",
     "Alexandre"
    ],
    [
     "Yannick",
     "Estève"
    ],
    [
     "Benjamin",
     "Lecouteux"
    ],
    [
     "François",
     "Portet"
    ],
    [
     "Solange",
     "Rossato"
    ],
    [
     "Didier",
     "Schwab"
    ],
    [
     "Laurent",
     "Besacier"
    ]
   ],
   "title": "LeBenchmark, un référentiel d'évaluation pour le français oral",
   "original": "54",
   "page_count": 10,
   "order": 5,
   "p1": 44,
   "pn": 53,
   "abstract": [
    "L'apprentissage auto-supervisé (SSL) a apporté des améliorations remarquables dans de nombreux domaines, notamment la vision par ordinateur, le traitement de la langue et de la parole, en exploitant de grandes quantités de données non étiquetées. Dans le contexte spécifique de la parole, cependant, et malgré des résultats prometteurs, il existe un manque évident de normalisation dans le processus d'évaluation pour des comparaisons complètes de ces modèles en particulier pour les autres langues que l'anglais. Nous présentons ici à la communauté francophone {\\nameproject}, un cadre de référence en sources ouvertes et reproductible pour évaluer des modèles SSL à partir de corpus de parole en français. Il est composé de quatre tâches : reconnaissance automatique de la parole, compréhension du langage parlé, traduction automatique de la parole et reconnaissance automatique des émotions. Nous encourageons la communauté francophone à utiliser ce référentiel dans ses futures expérimentations, notamment pour tester des modèles auto-supervisés."
   ],
   "doi": "10.21437/JEP.2022-5"
  },
  "mdhaffar22_jep": {
   "authors": [
    [
     "Salima",
     "Mdhaffar"
    ],
    [
     "Jean François",
     "Bonastre"
    ],
    [
     "Marc",
     "Tommasi"
    ],
    [
     "Natalia",
     "Tomashenko"
    ],
    [
     "Yannick",
     "Estève"
    ]
   ],
   "title": "Extraction d'informations liées au locuteur depuis un modèle acoustique personnalisé",
   "original": "57",
   "page_count": 9,
   "order": 6,
   "p1": 54,
   "pn": 62,
   "abstract": [
    "Plusieurs services intégrés dans notre vie quotidienne utilisent la reconnaissance automatique de la parole(Apple-Siri, Amazon-Alexa...). Ces services s'appuient sur des modèles entraînés sur une grande quantité de données pour assurer leur efficacité. Les données utilisées sont collectées via les applications, à partir des interactions des utilisateurs. Elles contiennent souvent des informations sensibles, ce qui peut créer d'importants problèmes de confidentialité. Dans ce contexte, de nouveaux paradigmes d'apprentissage automatique ont été proposés, comme l'apprentissage fédéré et distribué. Tous deux permettent de créer des modèles personnalisés à partir de données privées. Seuls les modèles sont alors partagés, sans exposer les données elles-mêmes.Une question cruciale est de savoir si la diffusion de ces modèles acoustiques(MA) personnalisés peut aussi entraîner une fuite d'informations personnelles. Les résultats montrent qu'il est possible de retrouver des informations liées au locuteur en s'appuyant sur les modifications de poids d'un MA induites par l'adaptation locale sur ce locuteur."
   ],
   "doi": "10.21437/JEP.2022-6"
  },
  "quintas22_jep": {
   "authors": [
    [
     "Sebastião",
     "Quintas"
    ],
    [
     "Alberto",
     "Abad"
    ],
    [
     "Julie",
     "Mauclair"
    ],
    [
     "Virginie",
     "Woisard"
    ],
    [
     "Julien",
     "Pinquier"
    ]
   ],
   "title": "Utilisation de réseaux de neurones profonds avec attention pour la prédiction de l’intelligibilité de la parole de patients atteints de cancers ORL",
   "original": "67",
   "page_count": 9,
   "order": 7,
   "p1": 63,
   "pn": 71,
   "abstract": [
    "La prédiction automatique de l’intelligibilité de la parole est un sujet pertinent pour l'évaluation de la parole pathologique. Cette automatisation permet de limiter les biais et la subjectivité liés aux évaluations perceptuelles, évaluations très courantes en pratique clinique, et ainsi rendre plus robuste l'évaluation du patient. Dans ce travail, nous calculons un score d'intelligibilité basé sur une tâche de décodage acoustique-phonétique, où un ensemble de pseudo-mots est prononcé par des patients atteints de cancer ORL. Notre approche est fondée sur des réseaux de neurones profonds avec attention. Nous obtenons un score automatique d'intelligibilité fortement corrélé à l'évaluation perceptive ($\\rho=0,87$), ainsi qu'une diminution de l'erreur par rapport aux approches concurrentes. En étudiant la fiabilité de notre prédiction sur un sous-ensemble de notre corpus, nous montrons qu'il est possible d'obtenir des résultats très similaires en utilisant de faibles quantités de données."
   ],
   "doi": "10.21437/JEP.2022-7"
  },
  "embarki22_jep": {
   "authors": [
    [
     "Mohamed",
     "Embarki"
    ],
    [
     "Jonathan",
     "Owens"
    ]
   ],
   "title": "Sonorité, resyllabation et ‘syndrome gahawa’ en arabe",
   "original": "1",
   "page_count": 9,
   "order": 8,
   "p1": 72,
   "pn": 80,
   "abstract": [
    "Les contraintes de sonorité dans le processus de (re)syllabation ont été largement décrites dans des études translinguistiques. Dans le domaine arabe, des études antérieures ont montré la sensibilité de certains dialectes au degré de sonorité des consonnes et des voyelles. La présente étude s’intéresse à la sonorité et son interaction avec la resyllabification dans trois variétés dialectales arabes, éloignées géographiquement, l’arabe de Fès (Maroc), l’arabe du Najd (Arabie Saoudite) et l’arabe du Lac Tchad (Nigeria). Si les trois variétés montrent une sensibilité certaine à la sonorité, les manifestations de celle-ci lors de la resyllabification sont différentes. Si la sonorité montante dans les groupes consonantiques est évitée, les processus de réparation sont spécifiques à chaque variété. Des interactions morphophonologiques particulières apparaissent. Le ‘syndrome gahawa’ révèle des différences entre les trois variétés dans leur traitement de la classe des consonnes gutturales. "
   ],
   "doi": "10.21437/JEP.2022-8"
  },
  "pepiot22_jep": {
   "authors": [
    [
     "Erwan",
     "Pépiot"
    ],
    [
     "Aron",
     "Arnold"
    ]
   ],
   "title": "Différences acoustiques inter-genres chez des bilingues Anglais/Français : une étude du Voice Onset Time",
   "original": "2",
   "page_count": 9,
   "order": 9,
   "p1": 81,
   "pn": 89,
   "abstract": [
    "Cette étude s’intéresse aux productions de locutrices et locuteurs bilingues anglais/français. Les Voice Onset Time (VOT) des consonnes occlusives sourdes et voisées ont été mesurés dans les deux langues, lors d’une tâche de lecture de mots. Les résultats indiquent un effet significatif des facteurs langue et genre sur ce paramètre. Le VOT des occlusives sourdes est plus long chez les locutrices dans les deux langues, avec une différence inter-genre accrue sur l’anglais. Les occlusives voisées présentent un pré-voisement plus long chez les femmes en français, et un VOT proche de zéro pour les deux genres en anglais. Le contraste de VOT entre les consonnes sourdes et leurs contreparties voisées est significativement plus long chez les locutrices dans les deux langues. Ce phénomène est légèrement plus marqué sur l’anglais. Ces données attestent l’existence de normes phonétiques socialement construites et dépendantes du genre et de la langue parlée, auxquelles se conforment les locutrices et locuteurs bilingues. "
   ],
   "doi": "10.21437/JEP.2022-9"
  },
  "briand22_jep": {
   "authors": [
    [
     "Thalassio",
     "Briand"
    ],
    [
     "Camille",
     "Fauth"
    ],
    [
     "Hélène",
     "Vassiliadou"
    ]
   ],
   "title": "Marques de l’émotion dans la fluence d’un patient cérébrolésé : Étude préliminaire de faisabilité",
   "original": "17",
   "page_count": 9,
   "order": 10,
   "p1": 90,
   "pn": 98,
   "abstract": [
    "La thérapie de régulation émotionnelle (Gremo) auprès de patients atteints d’une lésion cérébrale acquise soulève la question de l’évaluation de l’émotion dans le discours clinique. En effet, une meilleure régulation émotionnelle serait le signe de l’efficacité de la thérapie ce qui devrait se traduire dans le discours des patients. Le présent travail est une étude préliminaire de faisabilité où il s’agit d’étudier le discours d’un patient. Nous souhaitons voir si la fluence et l’organisation du discours sont des marqueurs phonétiques congruents avec l’annotation lexicale permettant d’identifier des parties du discours comme étant porteuses d’émotion, en particulier négatives. Les premiers résultats indiquent un discours plus lent et moins hésitant, supposant une meilleure régulation émotionnelle après la prise en charge thérapeutique ce qui valide partiellement notre protocole expérimental. Il s’agira de compléter ces données avec une plus grande cohorte de patients et des locuteurs-contrôle."
   ],
   "doi": "10.21437/JEP.2022-10"
  },
  "lancien22_jep": {
   "authors": [
    [
     "Mélanie",
     "Lancien"
    ]
   ],
   "title": "Documenter la variabilité en français québécois : une description acoustique des allophones lénifiés de /R/",
   "original": "18",
   "page_count": 9,
   "order": 11,
   "p1": 99,
   "pn": 107,
   "abstract": [
    "Cet article explore les caractéristiques acoustiques des allophones approximantisés et vocalisés de/R/. En français, la substance sonore des allophones de /R/ est encore peu documentée et leur qualité est généralement établie par la perception des linguistes. Sur la base des 58 083 occurrences de/R/ annotées à la main du jeu de données créé par (Côté & Lancien, 2019, 2021) nous décrivons ces /R/ perçus comme lénifiés en portant une attention particulière aux valeurs de F2 (Hz), F3(Hz), et F3-F2(Hz) moyennées sur la durée totale des phones et prises aux 5/5 de la durée des phones. L’observation et l’analyse par modèle linéaire mixte de ces valeurs montrent que les variantes perçues comme approximantisés ne sont pas différentes de celles perçues comme vocalisées bien que leurs trajectoires soient légèrement différentes. Ces résultats apportent des informations descriptives sur la substance des /R/ lénifiés mais remet également en question leur classification perceptive."
   ],
   "doi": "10.21437/JEP.2022-11"
  },
  "champion22_jep": {
   "authors": [
    [
     "Pierre",
     "Champion"
    ],
    [
     "Anthony",
     "Larcher"
    ],
    [
     "Denis",
     "Jouvet"
    ]
   ],
   "title": "Anonymisation de parole par quantification vectorielle",
   "original": "19",
   "page_count": 9,
   "order": 12,
   "p1": 108,
   "pn": 116,
   "abstract": [
    "L'utilisation de la reconnaissance de parole se répand de plus en plus dans les assistants virtuels.Cependant, les signaux de parole contiennent de nombreuses informations sensibles telles que l'identité du locuteur, ce qui soulève des préoccupations quant à la protection des données personnelles.Les expériences présentées montrent que les représentations extraites par les couches profondes des réseaux de reconnaissance de la parole contiennent cette information.Dans cet article, nous cherchons à produire une représentation anonyme tout en préservant les performances de reconnaissance de la parole.Dans ce but, nous proposons d'utiliser la quantification vectorielle pour contraindre l'espace de représentation, et inciter le réseau à supprimer l'identité du locuteur.Le choix de la taille du dictionnaire de quantification permet d'ajuster le compromis entre l'utilité (reconnaissance de la parole) et le respect de la vie privée (masquage de l'identité du locuteur)."
   ],
   "doi": "10.21437/JEP.2022-12"
  },
  "roger22_jep": {
   "authors": [
    [
     "Vincent",
     "Roger"
    ],
    [
     "Jérôme",
     "Farinas"
    ],
    [
     "Virginie",
     "Woisard"
    ],
    [
     "Julien",
     "Pinquier"
    ]
   ],
   "title": "Création d’une mesure entropique de la parole pour évaluer l’intelligibilité de patients atteints de cancers des voies aérodigestives supérieures",
   "original": "20",
   "page_count": 9,
   "order": 13,
   "p1": 117,
   "pn": 125,
   "abstract": [
    "L’évaluation de la sévérité de la parole, valeur fortement corrélée à l’intelligibilité de prononciation, est importante pour les cliniciens afin de mesurer l’impact des cancers des voies aérodigestives supérieures. Nous proposons une nouvelle méthode de mesure entropique, fondée sur des représentations de la parole, qui produit un score semblable à l’indice de sévérité. Cette méthode est fondée sur l’Inception Score (généralement utilisé en image pour évaluer la qualité des images générées par les modèles). Sur le corpus cancer C2SI, nous obtenons une corrélation de Spearman de 0,87 avec un indice de sévérité évalué manuellement par un groupe d’experts cliniques. Cette forte corrélation nous permet d’envisager des applications cliniques."
   ],
   "doi": "10.21437/JEP.2022-13"
  },
  "abuoudeh22_jep": {
   "authors": [
    [
     "Mohammad",
     "Abuoudeh"
    ],
    [
     "Olivier",
     "Crouzet"
    ]
   ],
   "title": "L’influence des variations de débit de parole sur les informations temporelles et spectrales associées à la longueur vocalique en arabe jordanien",
   "original": "21",
   "page_count": 9,
   "order": 14,
   "p1": 126,
   "pn": 134,
   "abstract": [
    "Les variations temporelles d'une voyelle peuvent être intrinsèques comme l’opposition phonologique de la longueur et extrinsèque comme les variations de débit de parole. L’objectif de cette étude est d’examiner l’influence de ces deux types de variations temporelles sur les informations spectrales lorsqu’ils se réunissent dans un même contexte. Pour ce faire, deux locuteurs de l’arabe jordanien ont produit des séquences CVC avec des voyelles longues et courtes dans trois débits différents (lent,moyen,rapide). Les résultats indiquent que les changements de débit conduisent à des chevauchements temporels entre la durée des voyelles longues et courtes. De plus, un chevauchement spectral important est remarqué dans le plan F1-F2 et il est maximum quand les voyelles longues et courtes sont réalisées dans le débit rapide. Ces résultats laissent suggérer que les modifications spectrales provoquées par les changements temporels extrinsèques engendrent des difficultés de discrimination et potentiellement de perception entre les voyelles longues et courtes."
   ],
   "doi": "10.21437/JEP.2022-14"
  },
  "delaisroussarie22_jep": {
   "authors": [
    [
     "Elisabeth",
     "Delais-Roussarie"
    ],
    [
     "Cyrille",
     "Granget"
    ]
   ],
   "title": "La prosodie de la L1 contraint-elle l’acquisition de la morphologie verbale en français L2 ?",
   "original": "25",
   "page_count": 10,
   "order": 15,
   "p1": 135,
   "pn": 144,
   "abstract": [
    "Dans une étude sur l’acquisition de la morphologie verbale chez des enfants bilingues français/suédois, Schlyter (1995) note des différences qualitatives de développement morphologique entre enfants selon leur dominance linguistique (français/suédois). Cela l’a conduite à formuler l’hypothèse du transfert prosodique selon laquelle l’acquisition de la morphologie de la langue non-dominante est influencée par la prosodie de la langue dominante.L’étude prélimaire proposée ici s’appuie sur l’analyse de quatre récits en français L2 produits par des apprenants de niveau A2 et ayant l’allemand ou le japonais comme L1 (pour deux d’entre eux à chaque fois). Ce travail vise à proposer une méthode pour évaluer dans quelle mesure l’hypothèse du transfert prosodique peut rendre compte du développement morphologique flexionnel en français L2. L’analyse des données laisse penser que la prosodie, et surtout la structure métrique, explique l’occurrence de formes verbales auxiliées et à voyelle finale chez les japonophones."
   ],
   "doi": "10.21437/JEP.2022-15"
  },
  "fougeron22_jep": {
   "authors": [
    [
     "Cecile",
     "Fougeron"
    ],
    [
     "Nicolas",
     "Audibert"
    ]
   ],
   "title": "Variabilité intra-individuelle en parole lue",
   "original": "34",
   "page_count": 9,
   "order": 16,
   "p1": 145,
   "pn": 153,
   "abstract": [
    "Nos connaissances sur la parole sont historiquement construites sur des données comparant différents locuteurs ou moyennées entre locuteurs. On sait donc peu de choses sur la variabilité de la parole chez un même individu : dans quelle mesure varie-t-on d'une répétition à l'autre et sur quelles dimensions ? Dans cette étude, nous documentons la stabilité des caractéristiques de parole chez 9 individus, sur la lecture de deux textes enregistrés sur une dizaine de sessions des jours différents sur une période de deux mois. 21 indicateurs liés à des aspects temporels, spectraux, de f0, d’harmonicité ainsi que leur modulation au cours de la lecture sont étudiés. La stabilité de ces indicateurs entre sessions est évaluée en comparaison avec leur variabilité entre locuteurs et entre textes. Les caractéristiques de parole variant le plus d’une session à l’autre sont aussi celles qui séparent le mieux les différents locuteurs dans cette cohorte"
   ],
   "doi": "10.21437/JEP.2022-16"
  },
  "glikman22_jep": {
   "authors": [
    [
     "Julie",
     "Glikman"
    ],
    [
     "Camille",
     "Fauth"
    ]
   ],
   "title": "Un nouvel accès à la parole spontanée : les vocaux",
   "original": "35",
   "page_count": 9,
   "order": 17,
   "p1": 154,
   "pn": 162,
   "abstract": [
    "Le projet Les Vocaux vise la constitution d’un grand corpus de données inédites de français parlé spontané : les messages audio échangés dans des fils de conversation, le plus souvent appelés « des vocaux » par les utilisateurs. Dans cette contribution, nous présentons les premiers résultats d’une étude exploratoire sur les vocaux, nous permettant de tester la faisabilité et l’intérêt de la constitution d’un corpus de ces données inédites de français parlé spontané. Nous avons ainsi recueilli près d’une heure de données de vocaux, auprès de sept participantes. Nous présentons ici la méthodologie mise en place, ainsi que les principales caractéristiques phonétique, lexicale, syntaxique et discursive de ces vocaux. Les analyses montrent à la fois la diversité et la richesse des données, qui peuvent intéresser différents domaines d’étude de la parole."
   ],
   "doi": "10.21437/JEP.2022-17"
  },
  "hirsch22_jep": {
   "authors": [
    [
     "Fabrice",
     "Hirsch"
    ],
    [
     "Ivana",
     "Didirková"
    ],
    [
     "Slim",
     "Ouni"
    ],
    [
     "Shakeel Ahmad",
     "Sheikh"
    ],
    [
     "Yves",
     "Laprie"
    ],
    [
     "Marie-Claude",
     "Monfrais-Pfauwadel"
    ],
    [
     "Eleonor",
     "Burkhardt"
    ]
   ],
   "title": "La vélocité des mouvements labiaux et mandibulaires : un indice pour différencier les disfluences typiques du bégaiement et les disfluences normales? Une étude pilote",
   "original": "38",
   "page_count": 10,
   "order": 18,
   "p1": 163,
   "pn": 172,
   "abstract": [
    "Le bégaiement est un trouble de la communication qui se caractérise notamment par la présence de disfluences dans la parole. Si ces disfluences ont fait l'objet d'un grand nombre de recherches, peu d'entre elles portent sur leur dimension articulatoire. Partant de ce constat, l'objectif de cette proposition est de fournir des connaissances supplémentaires sur le bégaiement à l'aide de données EMA. Plus précisément, cet article vise à savoir si la vélocité des mouvements de la mandibule, des lèvres inférieure et supérieure permet de distinguer les accidents de parole typiques du bégaiement de ceux produits par des personnes ne présentant aucun trouble de la communication. Les résultats de cette étude pilote montrent que la vitesse de déplacement des articulateurs est généralement plus lente pendant les interruptions du flux de la parole liées à un bégaiement."
   ],
   "doi": "10.21437/JEP.2022-18"
  },
  "xi22_jep": {
   "authors": [
    [
     "Lei",
     "Xi"
    ],
    [
     "Rachid",
     "Ridouane"
    ]
   ],
   "title": "Quand la syntaxe a besoin de la prosodie : comment les indices prosodiques en français aident des apprenants sinophones à traiter l’information syntaxique – une étude perceptive",
   "original": "43",
   "page_count": 10,
   "order": 19,
   "p1": 173,
   "pn": 182,
   "abstract": [
    "La prosodie joue un rôle fondamental dans la perception de la parole, notamment lors de la désambiguïsation syntaxique. Dans cette étude, nous avons demandé à 40 apprenants sinophones du français de niveaux intermédiaires et avancés de compléter une série de phrases localement ambiguës (e.g., « Chaque fois que le serpent {mangeait le rat, … / mangeait, le rat…} ») afin de déterminer s’ils pouvaient assigner correctement les mots cibles (ici « rat ») à leurs catégories syntaxiques (sujet ou complément d’objet direct) sur la base des indices prosodiques disponibles. Nos résultats ont montré que les apprenants avaient des difficultés à établir la bonne relation syntaxique entre le mot cible et le verbe qui le précède. Nous avons interprété les résultats à la lumière des prédictions de l’Informative Boundary Hypothesis et de Late Closure Preference."
   ],
   "doi": "10.21437/JEP.2022-19"
  },
  "chen22_jep": {
   "authors": [
    [
     "Xuejing",
     "Chen"
    ],
    [
     "Rachid",
     "Ridouane"
    ],
    [
     "Pierre André",
     "Hallé"
    ]
   ],
   "title": "Perception des clusters selon leur profil de sonorité : le cas des auditeurs du mandarin confrontés à des clusters russes",
   "original": "44",
   "page_count": 10,
   "order": 20,
   "p1": 183,
   "pn": 192,
   "abstract": [
    "Le Principe de Sonorité Séquentielle (PSS) pourrait expliquer une préférence universelle pour les clusters en attaque syllabique bien formés du point de vue du profil de sonorité. Pour tester cette possibilité, nous examinons les préférences perceptives des auditeurs du mandarin pour des clusters du russe avec des profils de sonorité allant de montant (bien-formé) à tombant (mal-formé). L'expérience 1 est une tâche de transcription en pinyin de syllabes C1C2V(n). Les transcriptions reflètent des réparations phonologiques – surtout par épenthèse vocalique – en accord avec le PSS. Dans l’expérience 2, les auditeurs sont testés sur leur discrimination de contrastes kCa-kVCa ou lka-lVka (C=/l,r,n,p/, V=/ə,u/). Les performances sont conformes au PSS dans la mesure où elles sont meilleures pour kl que kp. Cependant, elles sont aussi meilleures pour lk que kp, ce qui est contraire au PSS. Dans l'expérience 3, la voyelle V est raccourcie. Les résultats confirment ceux de l’expérience 2."
   ],
   "doi": "10.21437/JEP.2022-20"
  },
  "mariotte22_jep": {
   "authors": [
    [
     "Théo",
     "Mariotte"
    ],
    [
     "Anthony",
     "Larcher"
    ],
    [
     "Silvio",
     "Montrésor"
    ],
    [
     "Jean-Hugh",
     "Thomas"
    ]
   ],
   "title": "Détection de Parole Superposée Multicanal à l'aide de Mécanismes d'Auto-Attention",
   "original": "56",
   "page_count": 9,
   "order": 21,
   "p1": 193,
   "pn": 201,
   "abstract": [
    "La parole superposée correspond à l'activité simultanée de plusieurs locuteurs dans un enregistrement audio. Elle est source de dégradation des performances des modèles de traitement automatique de la parole. C'est notamment le cas dans le contexte de la segmentation et du regroupement en locuteurs. La détection de parole superposée détermine les instants où ces évènements interviennent. La généralisation de l'utilisation des réseaux de neurones a permis un gain significatif en performances sur cette tâche. La détection tend cependant à se dégrader en conditions de parole distante. Les travaux présentés étudient l'utilisation de mécanismes d'auto-attention pour combiner les canaux issus des différents microphones d'une antenne. Cette approche est mise en œuvre dans le contexte de la détection de parole superposée distante et permet de s'approcher des performances obtenues en champ proche."
   ],
   "doi": "10.21437/JEP.2022-21"
  },
  "bodur22_jep": {
   "authors": [
    [
     "Kübra",
     "Bodur"
    ],
    [
     "Christine",
     "Meunier"
    ],
    [
     "Corinne",
     "Fredouille"
    ]
   ],
   "title": " Formes réduites en conversation: caractéristiques des séquences et des locuteurs",
   "original": "59",
   "page_count": 10,
   "order": 22,
   "p1": 202,
   "pn": 211,
   "abstract": [
    "Dans le langage parlé, une partie non négligeable de mots sont produits avec des formes phonétiques lacunaires ou sous-spécifiées. Ce phénomène s'appelle la réduction phonétique. Cette étude vise à mieux comprendre son fonctionnement. Pour cela nous analysons 13 formes réduites (mots et combinaisons de mots) dans un corpus de conversations en français. En s’appuyant sur une Transcription Orthographique Enrichie pour l’extraction des items réduits, nous avons observé leur distribution et leur durée dans un corpus de parole conversationnelle. Les résultats montrent que la fréquence de réduction des items est variable et dépend de l’item lui-même mais aussi du locuteur. Les analyses post-hoc ont révélé une faible corrélation entre le taux de réduction de chaque locuteur et son débit dans le corpus. Enfin, une analyse sur 3 items nous a permis de constater que les items réduits le sont d'environ 37% par rapport à la durée des formes non réduites."
   ],
   "doi": "10.21437/JEP.2022-22"
  },
  "evain22_jep": {
   "authors": [
    [
     "Solene",
     "Evain"
    ],
    [
     "Solange",
     "Rossato"
    ],
    [
     "Benjamin",
     "Lecouteux"
    ],
    [
     "François",
     "Portet"
    ]
   ],
   "title": "Typologie de la parole spontanée à des fins d'analyse linguistique et de développement de systèmes de reconnaissance automatique de la parole",
   "original": "60",
   "page_count": 10,
   "order": 23,
   "p1": 212,
   "pn": 221,
   "abstract": [
    "Les systèmes de Reconnaissance Automatique de la Parole (RAP) ont montré ces dernières années des performances toujours plus impressionnantes. Néanmoins, la RAP spontanée reste un problème ouvert : la littérature a pu montrer qu’il est difficile de la définir (pas de consensus) et combien elle est difficile à modéliser. Dans notre travail, nous revenons sur la notion même de parole spontanée avant de nous appuyer sur les dénominations et définitions trouvées pour proposer une typologie de la parole spontanée sur quatre axes (contexte situationnel, type et canal de communication, degré d’intimité entre les locuteurs). Cette catégorisation offre la possibilité de rassembler des situations propices à une parole plus ou moins spontanée. Les objectifs sont multiples: créer une nouvelle typologie des corpus oraux de parole spontanée pour faciliter son analyse linguistique et améliorer les performances de systèmes de RAP sur ce type de parole."
   ],
   "doi": "10.21437/JEP.2022-23"
  },
  "charuau22_jep": {
   "authors": [
    [
     "Delphine",
     "Charuau"
    ],
    [
     "Béatrice",
     "Vaxelaire"
    ],
    [
     "Rudolph",
     "Sock"
    ]
   ],
   "title": "La variation des patterns respiratoires en parole chez l'enfant",
   "original": "66",
   "page_count": 9,
   "order": 24,
   "p1": 222,
   "pn": 230,
   "abstract": [
    "Les objectifs de cette étude sont d’une part, d’enrichir la description des patterns respiratoires chez l’enfant, et d’autre part, d’observer les différents facteurs de variabilité pouvant affecter son organisation. Quinze locuteurs, âgés de 8 à 11 ans, ont été enregistrés en parole lue et semi-spontanée. Nous avons mesuré l’évolution des périmètres thoracique et abdominal à l’aide de ceintures respiratoires électromagnétiques. Ces données ont été synchronisées avec le signal acoustique. Si l’amplitude des mouvements inspiratoires ne semble affectée ni par la tâche ni par sa position au sein du discours, la durée est sensible au style de parole et, dans une moindre mesure, à sa localisation syntaxique. Une partie de la forte variabilité inter- et intra-individuelle observée résulte des différentes stratégies mobilisées par les locuteurs dans la distribution des groupes de souffle."
   ],
   "doi": "10.21437/JEP.2022-24"
  },
  "yoon22_jep": {
   "authors": [
    [
     "Dayeon",
     "Yoon"
    ],
    [
     "Nicolas",
     "Audibert"
    ],
    [
     "Cécile",
     "Fougeron"
    ]
   ],
   "title": "Différences mélodiques et spectrales entre sexes comparées chez les locuteurs coréens et français",
   "original": "68",
   "page_count": 10,
   "order": 25,
   "p1": 231,
   "pn": 240,
   "abstract": [
    "Cette étude examine la variation entre langues des différences entre sexes dans la production de la parole. Un ensemble de paramètres acoustiques liés à la fréquence fondamentale et sa variation, à la forme du spectre et au degré de périodicité sont analysés sur les productions de 70 hommes et femmes coréens et français. Les résultats montrent un effet du sexe sur la plupart des paramètres avec des valeurs plus élevées chez les femmes (f0, H1*-H2*, H1*-A1*, H1*-A2*, et HNR) excepté une valeur plus importante de H2kHz*-H5kHz chez les hommes, ce qui indique une voix perçue comme plus soufflée chez les femmes. Pour H1*-A1*, H1*-A2*, H1*-A3*, les différences entre sexes ne sont significatives que dans le groupe français. Ces résultats suggèrent qu’au-delà du dimorphisme sexuel dans les deux langues, les différences entre voix d’hommes et voix de femmes seraient moins marquées en coréen qu’en français."
   ],
   "doi": "10.21437/JEP.2022-25"
  },
  "mohammadamini22_jep": {
   "authors": [
    [
     "Mohammad",
     "Mohammadamini"
    ],
    [
     "Driss",
     "Matrouf"
    ],
    [
     "Sandipana",
     "Dowerah"
    ],
    [
     "Romain",
     "Serizel"
    ],
    [
     "Denis",
     "Jouvet"
    ],
    [
     "Jean-François",
     "Bonastre"
    ]
   ],
   "title": "Le comportement des systèmes de reconnaissance du locuteur de l'état de l'art face aux variabilités acoustiques",
   "original": "70",
   "page_count": 9,
   "order": 26,
   "p1": 241,
   "pn": 249,
   "abstract": [
    "Dans cet article nous étudions la résistance des systèmes de reconnaissance du locuteur de l'état de l'art face aux variabilités acoustiques, telles que le bruit additif et la réverbération. Deux systèmes seront comparés, le premier est fondé sur TDNN et le second est fondé sur ResNet. Nous montrerons que globalement et sans utilisation de techniques de compensation le ResNet est plus robuste aux bruit que le TDNN. Les techniques de compensation dans le cas des TDNN sont efficaces dans le cas de bruits ajouté, alors qu'elles n'apporte aucun gain dans le cas du ResNet. En outre, les performances obtenues avec ResNet sans compensation restent supérieures à celles d'un TDNN, même avec compensation. Les expériences sont réalisées en utilisant les corpus Fabiol et Voices. Des visualisations graphiques et des expériences complémentaires sont réalisées afin de donner des explications à ces différences de comportement face aux bruits du TDNN et du ResNet."
   ],
   "doi": "10.21437/JEP.2022-26"
  },
  "bogaert22_jep": {
   "authors": [
    [
     "Lucie Van",
     "Bogaert"
    ],
    [
     "Laura",
     "Machart"
    ],
    [
     "Anne",
     "Vilain"
    ],
    [
     "Loevenbruck",
     "Helene"
    ]
   ],
   "title": "Perception de parole chez l’enfant porteur d’implant(s) cochléaire(s) : Étude sur l’Auditory Verbal Therapy et la Langue française Parlée Complétée",
   "original": "74",
   "page_count": 10,
   "order": 27,
   "p1": 250,
   "pn": 259,
   "abstract": [
    "La perte auditive chez l’enfant peut entrainer un retard sur le développement du langage oral. L’Auditory Verbal Therapy (AVT) est une méthode uni-sensorielle qui se base uniquement sur le canal auditif pour permettre aux enfants sourds implantés de développer de bonnes capacités auditives. La Langue française Parlée Complétée (LfPC) est un outil multimodal qui permet de désambiguïser la lecture labiale par l’ajout d’un geste manuel. Cette étude s’intéresse à l’apport de ces outils sur la perception de parole chez l’enfant porteur d’implant cochléaire, à partir d’une tâche de jugement de lexicalité. Les résultats montrent des performances similaires chez les enfants avec un bon niveau de LfPC, les enfants inscrits dans un programme AVT, et les enfants normo-entendants, mais des performances plus faibles chez les enfants avec un faible niveau de LfPC . Ainsi, une prise en charge précoce et adaptée à l’enfant est nécessaire pour le développement de la parole."
   ],
   "doi": "10.21437/JEP.2022-27"
  },
  "chardenon22_jep": {
   "authors": [
    [
     "Estelle",
     "Chardenon"
    ],
    [
     "Christine",
     "Meunier"
    ],
    [
     "Cécile",
     "Fougeron"
    ]
   ],
   "title": "Variations de débit articulatoire sur un corpus conversationnel avec différents types d'interactions",
   "original": "83",
   "page_count": 10,
   "order": 28,
   "p1": 260,
   "pn": 269,
   "abstract": [
    "Des questions actuelles (robotiques, judiciaires, etc.) recourent au besoin de mieux comprendre les caractéristiques de la parole des individus. Les recherches, dans ce domaine se heurtent régulièrement aux questions de variabilité (intra et inter-locuteurs), tout particulièrement en situation de parole spontanée. Cette étude vise à mieux cerner les variations de débit des locuteurs dans un corpus de parole spontanée en prenant en compte différents facteurs pouvant influencer leur production (sexe, type d’interaction etc.). 16 locuteurs sont analysés dans un corpus de dialogues conversationnels. Nos résultats montrent que les locuteurs ont en moyenne un débit plus élevé en parole conversationnelle qu’en parole lue avec une variation inter-locuteurs assez forte. On observe malgré tout un important chevauchement des valeurs pour l’ensemble des locuteurs. Une observation plus fine des dialogues ne montre pas d’influence du type d’interaction mais confirme une adaptation du débit à l’interlocuteur."
   ],
   "doi": "10.21437/JEP.2022-28"
  },
  "larotonda22_jep": {
   "authors": [
    [
     "Sara",
     "Larotonda"
    ],
    [
     "Véronique",
     "Delvaux"
    ],
    [
     "Bernard",
     "Harmegnies"
    ],
    [
     "Myriam",
     "Piccaluga"
    ],
    [
     "Sophie",
     "Van Malderen"
    ],
    [
     "Kathy",
     "Huet"
    ]
   ],
   "title": "Étude du rôle de l’incongruité contextuelle et de la prosodie dans la compréhension de l’ironie chez des adultes tout venants.",
   "original": "85",
   "page_count": 10,
   "order": 29,
   "p1": 270,
   "pn": 279,
   "abstract": [
    "Le travail présenté ici investigue l’influence de l’incongruité contextuelle et de la prosodie sur la compréhension de l’ironie, en français dans un population tout-venants. L’objectif est d’étudier dans quelle mesure les participants s’appuient sur le contexte et/ou sur la prosodie pour détecter l’ironie. Les 13 participants ont été soumis à une tâche de compréhension de l’ironie constituée de 48 stimuli composés d’une histoire courte présentant un contexte et d’une phrase cible, présentés avec et sans pression temporelle. La phrase cible était prononcée soit avec une prosodie neutre ou une prosodie ironique. Les stimuli étaient construits de manière à présenter différents degrés d’incongruité contextuelle entre l’information de contexte et la phrase cible. Les participants devaient juger du caractère ironique de chaque stimulus. Les principaux résultats révèlent que tant le degré d'incongruité contextuelle que la prosodie peuvent avoir un impact sur la mesure avec laquelle l'ironie est comprise."
   ],
   "doi": "10.21437/JEP.2022-29"
  },
  "ferre22_jep": {
   "authors": [
    [
     "Sandrine",
     "Ferré"
    ],
    [
     "Océane",
     "Mahé"
    ],
    [
     "Marta",
     "Manenti"
    ],
    [
     "Heglyn",
     "Pimenta"
    ],
    [
     "Philippe",
     "Prévost"
    ]
   ],
   "title": "Détecter un déficit phonologique chez les adultes - un module adulte pour LITMUS-QU-NWR-FR",
   "original": "3",
   "page_count": 9,
   "order": 30,
   "p1": 280,
   "pn": 288,
   "abstract": [
    "Les tâches de répétition de non-mots sont faciles à utiliser tout en permettant une évaluation précise d’aspects divers du langage des enfants. Leurs facteurs de construction peuvent cibler différents domaines cognitifs ou langagiers. Le test LITMUS-NWR-QU-FR est conçu pour détecter un déficit phonologique à partir de 4 ans dans tout contexte d’acquisition. Les scores plafonnent autour de 6 ans chez les enfants au développement typique. Cette étude propose de piloter un module adapté aux adultes selon les variables de construction initiales, en augmentant la complexité phonologique. Les résultats de 27 participants adultes sans diagnostic de trouble montrent une performance plus faible dans le module adulte, attestant de sa complexité. Deux participants ont montré des difficultés phonologiques et de mémoire de travail. Ces résultats témoignent d’une sensibilité manifeste du test au déficit phonologique, laissant supposer son efficacité à être utilisé pour une évaluation du langage formel chez des sujets en contexte de pathologie."
   ],
   "doi": "10.21437/JEP.2022-30"
  },
  "delvaux22_jep": {
   "authors": [
    [
     "Véronique",
     "Delvaux"
    ],
    [
     "Bernard",
     "Harmegnies"
    ],
    [
     "Kathy",
     "Huet"
    ],
    [
     "Myriam",
     "Piccaluga"
    ],
    [
     "Virginie",
     "Roland"
    ],
    [
     "Clémence",
     "Verhaegen"
    ]
   ],
   "title": "Les personnes atteintes de la maladie de Parkinson font preuve de flexibilité phonétique",
   "original": "8",
   "page_count": 9,
   "order": 31,
   "p1": 289,
   "pn": 297,
   "abstract": [
    "La flexibilité phonétique est définie comme l’aptitude du locuteur-auditeur à adapter son comportement de parole aux contraintes internes et externes pesant sur la situation de communication. Cette étude exploratoire traite de la flexibilité phonétique chez les personnes âgées atteintes de la maladie de Parkinson (MP). Douze participants âgés entre 57 et 79 ans, dont la moitié était atteints de la MP, ont produit les 25 phrases du corpus dans 6 conditions expérimentales successives : (i) lecture ; (ii) répétition d’un modèle oral (= voix cible); (iii) jeu interactif ; (iv) répétition d’un modèle oral ; (v) répétition avec pour instruction explicite d’imiter le modèle oral ; (vi) répétition avec pour instruction explicite d’inhiber tant que possible l’imitation du modèle oral. Les résultats montrent que les participants, sans distinction d’appartenance ou non au groupe ‘MP’, ont massivement fait preuve de flexibilité phonétique puisque les pitchs et durées mesurés s’éloignaient systématiquement de ceux mesurés en lecture pour se rapprocher de ceux de la voix cible en fonction de la condition expérimentale, à savoir: modérément en répétition (convergence phonétique), largement en imitation, presque pas en inhibition."
   ],
   "doi": "10.21437/JEP.2022-31"
  },
  "rebourg22_jep": {
   "authors": [
    [
     "Marie",
     "Rebourg"
    ],
    [
     "Muriel",
     "Lalain"
    ],
    [
     "Alain",
     "Ghio"
    ],
    [
     "Corinne",
     "Fredouille"
    ],
    [
     "Laura",
     "Monestier"
    ],
    [
     "Nicolas",
     "Fakhry"
    ],
    [
     "Virginie",
     "Woisard"
    ]
   ],
   "title": "Évaluation de l’intelligibilité des segments vocaliques de patients traités pour un cancer des VADS et de locuteurs contrôles",
   "original": "89",
   "page_count": 9,
   "order": 32,
   "p1": 298,
   "pn": 306,
   "abstract": [
    "Dans le cadre de l’évaluation clinique de l’intelligibilité après un cancer des VADS, cancer susceptible d’entrainer des troubles de la production de la parole (TPP), mesurer l’étendue des déficits phonético-phonologiques est essentiel pour l’évaluation de l’intelligibilité générale. Classiquement, cette mesure repose sur une évaluation perceptive globale jugée peu satisfaisante, et son manque de précision qui conduisent à une surévaluation de l’intelligibilité ne reflétant que partiellement le handicap. Nous proposons une mesure fiable et objective au moyen de pseudo-mots, produits par les locuteurs, transcrits par plusieurs cohortes d’auditeurs et dont le score est calculé au travers d’une matrice de confusion basée sur la théorie des traits articulatoires. Dans cette étude nous comparons les scores locaux (phonème à phonème) des phonèmes vocaliques entre deux groupes de locuteurs. Nos résultats montrent que pour les deux groupes de locuteurs, ce sont les mêmes segments qui sont dégradés, et que la pathologie accentue les dégradations. "
   ],
   "doi": "10.21437/JEP.2022-32"
  },
  "vaysse22_jep": {
   "authors": [
    [
     "Robin",
     "Vaysse"
    ],
    [
     "Alain",
     "Ghio"
    ],
    [
     "Corine",
     "Astésano"
    ],
    [
     "Jérôme",
     "Farinas"
    ],
    [
     "François",
     "Viallet"
    ]
   ],
   "title": "Analyse macroscopique des variations et modulations de F0 en lecture dans la maladie de Parkinson : données sur 320 locuteurs",
   "original": "94",
   "page_count": 9,
   "order": 33,
   "p1": 307,
   "pn": 315,
   "abstract": [
    "Les personnes atteintes de la maladie de Parkinson (MDP) souffrent généralement de troubles d’origine laryngée impliquant des anomalies de fréquence fondamentale (F0). Malgré le nombre important d’études de la F0 chez les patients MDP, aucun consensus global n’existe concernant les effets de cette maladie. Cette étude cherche à clarifier ces effets grâce à un large corpus de parole lue (320 locuteurs). Les résultats montrent une élévation de F0 chez les hommes MDP. Nous observons également une réduction des modulations de F0 chez les patients indépendamment du sexe.L’effet du traitement dopaminergique induit une légère augmentation de F0 et réduit la perte  des modulations de F0 chez les patients sévèrement atteints. L’âge des patients semble avoir le même impact sur la F0 des personnes MDP et saines. Nos résultats sont en accord partiel avec les modèles physiopathologiques et contredisent sur certains aspects des études faites sur des corpora plus petits."
   ],
   "doi": "10.21437/JEP.2022-33"
  },
  "blondel22_jep": {
   "authors": [
    [
     "Marion",
     "Blondel"
    ]
   ],
   "title": "Prosodie et langue(s) des signes : un aperçu poétique",
   "original": "Blondel",
   "page_count": 13,
   "order": 34,
   "p1": 316,
   "pn": 328,
   "abstract": [
    "Les langues des signes ont une structure prosodique qui permet de segmenter et d’organiser le flux gestuel. On peut décrire cette structure en s’appuyant sur les paramètres de durée et d’amplitude, qui s’appliquent aux articulateurs manuels et non manuels, eux-mêmes se combinant dans la simultanéité et la séquentialité. Dans le registre poétique, les contours prosodiques sont éventuellement soulignés, détournés, alignés pour élaborer des patrons rythmiques et ‘spatio- mélodiques’. La licence poétique permet alors de repousser les frontières de la langue à l’interface langue / ‘musique gestuelle’. Cette présentation sera l’occasion d’illustrer une proposition d’approche intermodale (audio-vocale / visuo-gestuelle) de la prosodie, et de mettre en lumière les phénomènes de (dé)synchronisation entre articulateurs, entre signeurs (chœurs et slogans), et entre modalités (quand les performances se prêtent à une traduction entre langue vocale et langue gestuelle)."
   ],
   "doi": "10.21437/JEP.2022-34"
  },
  "bigot22_jep": {
   "authors": [
    [
     "Benjamin",
     "Bigot"
    ],
    [
     "Hélène",
     "Devulder"
    ],
    [
     "Matthieu",
     "Puigt"
    ]
   ],
   "title": "Amélioration de l’intelligibilité de la parole dans des enregistrements de « boîtes noires aéronautiques » à l’aide de méthodes de Séparation Aveugle de Sources",
   "original": "5",
   "page_count": 8,
   "order": 35,
   "p1": 329,
   "pn": 336,
   "abstract": [
    "Le BEA est l’autorité française en charge des enquêtes de sécurité en cas d’incidents ou d’accidents d’aéronefs civils, et dans ce contexte procède à l’analyse des fichiers audio des enregistreurs de conversations (CVR). Les contraintes de conception des CVR ont pour conséquence la présence d’une quantité importante de zones de parole superposée, ce qui complique l’exploitation de ces données. Dans cet article nous présentons une première étude sur l’apport potentiel de la Séparation Aveugle de Sources afin d’améliorer l’intelligibilité des enregistrements CVR."
   ],
   "doi": "10.21437/JEP.2022-35"
  },
  "canocordoba22_jep": {
   "authors": [
    [
     "Paula Alejandra",
     "Cano-Cordoba"
    ],
    [
     "Thi Thuy Hien",
     "Tran"
    ],
    [
     "Nathalie",
     "Vallée"
    ],
    [
     "Christophe",
     "Savariaux"
    ],
    [
     "Silvain",
     "Gerber"
    ],
    [
     "Nicha",
     "Yamlamai"
    ]
   ],
   "title": "Caractérisation des consonnes plosives non relâchées en thaï : Une étude glottographique",
   "original": "10",
   "page_count": 10,
   "order": 36,
   "p1": 337,
   "pn": 346,
   "abstract": [
    "Dans leur grande majorité, les plosives sont réalisées avec un relâchement audible de l’occlusion articulatoire. Dans certaines langues d’Asie, les cas de plosives sans bruit de relâchement sont fréquents et allophones des premières. Le thaï est concerné avec ses plosives sourdes très communément réalisées sans bruit lorsqu’elles sont en coda de syllabe. Notre étude cherche à vérifier, à partir de données acoustiques, aérodynamiques et électroglottographiques recueillies auprès de 4 locuteurs natifs, la présence d’une action laryngée qui accompagnerait l’articulation des plosives non relâchées en l’absence de fuite nasale ou de fermeture glottique. Notre hypothèse est qu’une descente du larynx pendant la tenue de l’occlusion serait le principal contributeur à l’absence de la montée de la pression intra-orale en arrière du lieu d’articulation. Bien qu’une variabilité ait été observée, l’abaissement du larynx est différent selon la position de la consonne dans la syllabe, le lieu d’articulation et le genre du locuteur."
   ],
   "doi": "10.21437/JEP.2022-36"
  },
  "gallitre22_jep": {
   "authors": [
    [
     "Laurence",
     "Gallitre"
    ],
    [
     "Solange",
     "Rossato"
    ]
   ],
   "title": "Organisation temporelle des silences  dans le discours en situation de crise : une étude de cas dans l’aéronautique",
   "original": "11",
   "page_count": 10,
   "order": 37,
   "p1": 347,
   "pn": 356,
   "abstract": [
    "Ce travail de recherche s'appuie sur une étude de cas dans le domaine de l’aéronautique. Le vol qui devait effectuer la distance  de Zurich à destination de Shanghai est filmé depuis la cabine de pilotage en temps réel par une agence de production audiovisuelle, lorsqu’un incident survient. L’analyse des interactions multimodales entre les pilotes et les différents opérateurs et contrôleurs au sol nous permet de repérer quelques indices de tension émotionnelle. Nous tâcherons de comprendre en quoi certains silences constituent des signaux révélateurs de cette tension."
   ],
   "doi": "10.21437/JEP.2022-37"
  },
  "richard22_jep": {
   "authors": [
    [
     "Amélie",
     "Richard"
    ],
    [
     "Karen",
     "Reilly"
    ],
    [
     "Sophie",
     "Jacquin-Courtois"
    ]
   ],
   "title": "Que révèlent les disfluences sur le manque du mot rapporté par les patientes ayant un cancer du sein",
   "original": "13",
   "page_count": 9,
   "order": 38,
   "p1": 357,
   "pn": 365,
   "abstract": [
    "Le trouble cognitif subtil induit par un cancer du sein et ses traitements est caractérisé par une atteinte attentionnelle, exécutive ou mnésique. Les patientes se plaignent de difficultés à trouver leurs mots entraînant des répercussions sur leur vie sociale. Pourtant, ces difficultés ne sont que partiellement révélées par les tests neuropsychologiques, probablement par manque de sensibilité et de validité écologique. À travers cette étude préliminaire, nous souhaitons identifier le manque du mot rapporté par les patientes en oncologie. Nous avons analysé la fréquence, la durée et la localisation des disfluences dans les discours narratif et spontané de huit patientes. Les résultats suggèrent que le manque du mot de ces patientes est caractérisé par la présence de disfluences anormales."
   ],
   "doi": "10.21437/JEP.2022-38"
  },
  "smith22_jep": {
   "authors": [
    [
     "Caroline",
     "Smith"
    ]
   ],
   "title": "Réalisation de syntagmes accentuels avec différents nombres de syllabes : Différences entre locutrices L1 et L2",
   "original": "15",
   "page_count": 9,
   "order": 39,
   "p1": 366,
   "pn": 374,
   "abstract": [
    "En français, un adjectif post-nominal peut ou non faire partie du même syntagme accentuel (AP) que le nom qui le précède. La nature facultative de l’incorporation de l’adjectif peut donc donner lieu à des différences entre les locuteurs L1 et L2. Les réalisations des AP ont été comparées dans des énoncés lus par cinq locutrices L1 et cinq locutrices L2 de niveau avancé. Des groupes de phrases ont été construits avec des noms cibles d'une à quatre syllabes; pour chaque groupe, la seule différence entre les phrases était la longueur des adjectifs. Les mesures de durée montrent que les noms suivis d'adjectifs à quatre syllabes sont plus allongés par rapport aux adjectifs plus courts chez les L2 que chez les L1, ce qui suggère la présence, chez les L2, d’une frontière AP entre les noms et les adjectifs. Les mesures de F0 montraient moins de différences entre les deux groupes."
   ],
   "doi": "10.21437/JEP.2022-39"
  },
  "weng22_jep": {
   "authors": [
    [
     "Caihong",
     "Weng"
    ],
    [
     "Alexander",
     "Martin"
    ],
    [
     "Ioana",
     "Chitoran"
    ]
   ],
   "title": "Perceptual assimilation of Mandarin non-sibilant fricatives by speakers of Quanzhou Southern Min",
   "original": "24",
   "page_count": 10,
   "order": 40,
   "p1": 375,
   "pn": 384,
   "abstract": [
    "Non-native speech sounds are often assimilated to native sound categories. According to the Perceptual Assimilation Model (PAM), non-native speech sounds are classified as exemplars of native sound categories. The present study examines the perception of Mandarin non-sibilant fricatives by Quanzhou Southern Min (QSM) native speakers. We explore the perceptual assimilation of non-sibilant fricatives by QSM speakers through an experimental study of contextual effects. QSM is one of the most widely spoken regional languages in China. QSM speakers mainly use QSM in daily life and learn Mandarin in school. This study examines perceptual assimilation between Mandarin and QSM, and looks at how QSM speakers perceive and assimilate a non-native contrast in different phonetic contexts and according to their degree of exposure to Mandarin."
   ],
   "doi": "10.21437/JEP.2022-40"
  },
  "hamma22_jep": {
   "authors": [
    [
     "Badreddine",
     "Hamma"
    ],
    [
     "Lassâad",
     "Oueslati"
    ]
   ],
   "title": "Valeurs aspectuelles et modales du verbe finir dans ses emplois comme semi-auxiliaire et dans ses emplois libres",
   "original": "28",
   "page_count": 10,
   "order": 41,
   "p1": 385,
   "pn": 394,
   "abstract": [
    "Nous nous proposons de traiter des emplois du verbe, dit « terminatif », finir dans les périphrases verbales où il sélectionne l’une des deux prépositions par ou de et un verbe à l’infinitif, ainsi que dans ses emplois libres, avec un SN. Nous nous intéresserons particulièrement à ses visées aspectuelles marquant la « phase finale » et à ses valeurs modales, surtout de « soulagement », dans par exemple : Il a fini par accepter notre proposition. Le but est de considérer les propriétés linguistiques de ces combinaisons, compte tenu de l’apport des éléments du cotexte sélectionnés. Il en découlera que « finir par + Vinf » fonctionne comme un vrai semi-auxiliaire, tout comme son concurrent finir de (déjà répertorié) et que sa visée « terminative » semble curieusement annoncer une phase plutôt initiale ou pré-processuelle d’un tiers procès tout en marquant la fin d’une attente ou d’un premier procès."
   ],
   "doi": "10.21437/JEP.2022-41"
  },
  "wottawa22_jep": {
   "authors": [
    [
     "Jane",
     "Wottawa"
    ],
    [
     "Martine",
     "Adda-Decker"
    ],
    [
     "Frédéric",
     "Isel"
    ]
   ],
   "title": "La perception de [h] et [ʔ] chez des bilingues  français-allemand tardifs. Et si c'était juste du souffle ?",
   "original": "32",
   "page_count": 10,
   "order": 42,
   "p1": 395,
   "pn": 404,
   "abstract": [
    "La perception des phonèmes diffère de celle d'autres événements acoustiques tels que les bruits ou la respiration. Dans quelle mesure la perception est-elle affectée si un phonème non-natif ressemble à un tel bruit extra-linguistique ? Pour examiner cette question, nous avons étudié la perception de [h] et de [ʔ] dans des mots allemands chez des apprenants francophones en utilisant l’encéphalographie (EEG). L’activité cérébrale des sujets est enregistrée lors d'un paradigme auditif passif de type oddball, connu pour susciter une Mismatch Negativity (MMN). En somme, 40 participants ont été recrutés: 20 en Allemagne et 20 en France. Les résultats montrent que l’opposition [h]-[ʔ] ne suscite pas de réponse MMN chez les participants: ni chez les natifs, ni chez les apprenants. Cependant, en description, nous observons des négativités. Modifier le calcul de la MMN par la suite pourrait nous permettre de mieux exploiter les enregistrements EEG."
   ],
   "doi": "10.21437/JEP.2022-42"
  },
  "tranngoc22_jep": {
   "authors": [
    [
     "Anais",
     "Tran Ngoc"
    ],
    [
     "Julien",
     "Meyer"
    ],
    [
     "Fanny",
     "Meunier"
    ]
   ],
   "title": "Bénéfices de la pratique musicale sur la catégorisation de la parole sifflée : analyse des processus de transferts",
   "original": "33",
   "page_count": 9,
   "order": 43,
   "p1": 405,
   "pn": 413,
   "abstract": [
    "Dans cette étude nous avons cherché à comprendre l’effet de la pratique instrumentale sur la perception et la catégorisation de la parole sifflée. Nous nous sommes intéressés à la spécificité instrumentale avec une focalisation sur 4 instruments : la voix, le violon, le piano et la flûte. Bien que le bénéfice de la pratique musicale sur la perception de la parole modifiée soit vérifié dans nos résultats, il apparait clairement que l’instrument pratiqué ainsi que le niveau de pratique ont un effet sur la perception de la parole sifflée. Ces résultats suggèrent que, lors de ce processus de catégorisation, les effets observés s’expliquent plus par un traitement modifié du signal sonore, grâce à une familiarisation acoustique spécifique chez les musiciens expérimentés, plutôt que par des fonctions générales (fonctions exécutives, mémoire ou attention) plus performantes."
   ],
   "doi": "10.21437/JEP.2022-43"
  },
  "guieugrandsire22_jep": {
   "authors": [
    [
     "Clémence",
     "Guieu-Grandsire"
    ],
    [
     "Naomi",
     "Yamaguchi"
    ],
    [
     "Shigeko",
     "Shinohara"
    ]
   ],
   "title": "Perception des rhotiques chez des enfants monolingues et bilingues franco-grecs",
   "original": "40",
   "page_count": 10,
   "order": 44,
   "p1": 414,
   "pn": 423,
   "abstract": [
    "L’acquisition phonologique bilingue est-elle similaire à celle des monolingues ? Cette étude tente de répondre à cette question toujours en suspens en comparant la perception des rhotiques du français /ʁ/ et du grec /ɾ/, par une tâche d’identification des réalisations cibles et de leurs variantes passée par 24 enfants monolingues et bilingues franco-grecs (dominants en français ou grec) âgés de 3 à 5 ans. Les résultats montrent des différences de comportement entre les monolingues et bilingues mais aussi entre les bilingues. Les variantes acceptées par les bilingues indiquent un potentiel transfert unidirectionnel, lié aux interférences entre les deux systèmes. Enfin, la complexité inhérente aux rhotiques semble jouer un rôle : toutes les populations confondent plus l’alvéolaire que l’uvulaire et mettent plus de temps à en identifier les substitutions. Bien que les bilingues ne se comportent pas complètement comme leurs pairs monolingues, la complexité structurelle des segments semblent toutefois guider l’acquisition."
   ],
   "doi": "10.21437/JEP.2022-44"
  },
  "evain22b_jep": {
   "authors": [
    [
     "Solène",
     "Evain"
    ],
    [
     "Ha",
     "Nguyen"
    ],
    [
     "Hang",
     "Le"
    ],
    [
     "Marcely Zanon",
     "Boito"
    ],
    [
     "Salima",
     "Mdhaffar"
    ],
    [
     "Sina",
     "Alisamir"
    ],
    [
     "Ziyi",
     "Tong"
    ],
    [
     "Natalia",
     "Tomashenko"
    ],
    [
     "Marco",
     "Dinarelli"
    ],
    [
     "Titouan",
     "Parcollet"
    ],
    [
     "Alexandre",
     "Allauzen"
    ],
    [
     "Yannick",
     "Estève"
    ],
    [
     "Benjamin",
     "Lecouteux"
    ],
    [
     "François",
     "Portet"
    ],
    [
     "Solange",
     "Rossato"
    ],
    [
     "Fabien",
     "Ringeval"
    ],
    [
     "Didier",
     "Schwab"
    ],
    [
     "Laurent",
     "Besacier"
    ]
   ],
   "title": "Modèles neuronaux pré-appris par auto-supervision sur des enregistrements de parole en français",
   "original": "48",
   "page_count": 10,
   "order": 45,
   "p1": 424,
   "pn": 433,
   "abstract": [
    "L'apprentissage auto-supervisé a ouvert des perspectives prometteuses dans de nombreux domaines comme la vision par ordinateur, le traitement automatique de la langue ou celui de la parole. Les modèles pré-appris sur de grandes quantités de données non étiquetées peuvent être ajustés sur de petits ensembles de données transcrites manuellement. Ceux de type wav2vec2.0 ont montré des performances remarquables pour la reconnaissance automatique de la parole. Les premiers modèles partagés à la communauté ayant été appris sur des données en anglais ou multilingues, nous proposons dans cet article sept modèles de type wav2vec2.0, appris sur 1 000, 2 600, 3 000 et 7 000 heures de parole en français. Leur entraînement nécessitant des capacités de calcul très importantes, et dans un esprit de science ouverte, ceux-ci sont librement accessibles. Des résultats expérimentaux sur la reconnaissance automatique de la parole sont également présentés et confirment le bénéfice de l'utilisation de tels modèles."
   ],
   "doi": "10.21437/JEP.2022-45"
  },
  "xiao22_jep": {
   "authors": [
    [
     "Xiao",
     "Xiao"
    ],
    [
     "Nicolas",
     "Audibert"
    ],
    [
     "Christophe",
     "d'Alessandro"
    ],
    [
     "Grégoire",
     "Locqueville"
    ],
    [
     "Barbara",
     "Kuhnert"
    ],
    [
     "Rébecca",
     "Kleinberger"
    ],
    [
     "Claire",
     "Pillot-Loiseau"
    ]
   ],
   "title": "Évaluation de la stylisation chironomique pour l'apprentissage de l'intonation du français L2",
   "original": "51",
   "page_count": 9,
   "order": 46,
   "p1": 434,
   "pn": 442,
   "abstract": [
    "Cet article présente l'analyse statistique d’une étude pilote sur l'apprentissage prosodique du français L2 à l'aide de synthèse vocale chironomique.  Des locuteurs natifs et non-natifs utilisent une interface gestuelle de contrôle de la synthèse vocale pour désambiguïser par l'intonation des énoncés lexicalement ambiguës. L'interface permet le contrôle en temps-réel de la prosodie d'une phrase cible par le tracé de contours mélodiques sur une tablette tactile. Ce travail propose une analyse des données de l’étude en utilisant des modèles mixtes additifs généraux (GAMM), afin de comparer directement les trajectoires chironomiques et les courbes de f0 (et non des chiffres comme par exemple des distances entre courbes). Cette approche confirme les résultats antérieurs : la chironomie guidée paraît comparable à l'imitation vocale, et le contrôle temporel fin est difficile pour tous les sujets. Elle suggère en plus des différences notables entre locuteurs natifs et non-natifs pour certaines phrases sous certaines conditions."
   ],
   "doi": "10.21437/JEP.2022-46"
  },
  "lebourdais22_jep": {
   "authors": [
    [
     "Martin",
     "Lebourdais"
    ],
    [
     "Marie",
     "Tahon"
    ],
    [
     "Antoine",
     "Laurent"
    ],
    [
     "Anthony",
     "Larcher"
    ],
    [
     "Sylvain",
     "Meignier"
    ]
   ],
   "title": "Parole superposée et genre, étude des annotations pour les médias audiovisuels.",
   "original": "53",
   "page_count": 9,
   "order": 47,
   "p1": 443,
   "pn": 451,
   "abstract": [
    "Notre objectif consiste à caractériser les représentations du genre dans les médias français au travers des interactions entre locuteurs en fonction de leur rôle.Cet article propose une étude des annotations en genre et en parole superposée dans plusieurs corpus dédiés à la segmentation en locuteurs et à la transcription, et met en évidence le problème d'hétérogénéité des protocoles d'annotations pour ces deux catégories.De plus, nous analysons l'influence du format des émissions sur la distribution des segments de parole superposée.Sur un sous-corpus de 93 enregistrements de la chaîne LCP, nous cherchons à caractériser les interactions entre locuteurs en fonction de leurs genres.Enfin, nous proposons une méthode qui vise à mettre en valeur les zones de parole fortement interactives. Une telle visualisation améliorerait l'efficacité des études qualitatives menées par les chercheurs en sciences humaines."
   ],
   "doi": "10.21437/JEP.2022-47"
  },
  "hutin22_jep": {
   "authors": [
    [
     "Mathilde",
     "Hutin"
    ],
    [
     "Caihong",
     "Weng"
    ],
    [
     "Martine",
     "Adda-Decker"
    ],
    [
     "Ioana",
     "Vasilescu"
    ],
    [
     "Lori",
     "Lamel"
    ]
   ],
   "title": "Disfluences et erreurs d’alignement au niveau du phonème :  le cas des consonnes de liaison en français",
   "original": "62",
   "page_count": 10,
   "order": 48,
   "p1": 452,
   "pn": 461,
   "abstract": [
    "Les disfluences (pauses, hésitations, répétitions...) sont caractéristiques de l’oralité mais représentent encore un défi pour le traitement automatique des langues. Nous proposons d’analyser plus de 100h de français en combinant alignement automatique avec variantes de prononciation et jugement humain pour identifier les causes des erreurs d’alignement sur des phonèmes particuliers du français: les consonnes de liaison. Les résultats montrent que les disfluences sont en effet la deuxième source d’erreurs. La plus représentée est la répétition (chez les femmes comme chez les hommes), qui favorise l’alignement erroné avec [t] ou [z], suivi de la pause silencieuse, qui favorise [p]. En comparant ces données mal alignées à un ensemble similaire de données bien alignées, nous montrons que la présence de disfluences dans un empan de quatre mots est corrélée aux erreurs d’alignement, mais que cet effet s’annule si la disfluence est à un mot de distance ou plus du site de liaison."
   ],
   "doi": "10.21437/JEP.2022-48"
  },
  "abderrazek22_jep": {
   "authors": [
    [
     "Sondes",
     "Abderrazek"
    ],
    [
     "Corinne",
     "Fredouille"
    ],
    [
     "Alain",
     "Ghio"
    ],
    [
     "Muriel",
     "Lalain"
    ],
    [
     "Christine",
     "Meunier"
    ],
    [
     "Virginie",
     "Woisard"
    ]
   ],
   "title": "Interprétation des représentations profondes des traits phonétiques via l'approche NCD - Neuro-based Concept Detector : Application aux troubles de la parole",
   "original": "63",
   "page_count": 9,
   "order": 49,
   "p1": 462,
   "pn": 470,
   "abstract": [
    "La popularité des réseaux de neurones profonds (DNN) ne cesse de croître, tout comme l'intérêt de mieux comprendre leur fonctionnement. Dans ce papier, nous présentons un cadre de travail général, nommé Neuro-based Concept Detector (NCD), pour interpréter les représentations profondes d'un DNN. Basé sur les schémas d'activation des unités cachées, ce cadre met en évidence la capacité des neurones à détecter un concept implicite en lien avec la tâche finale visée. Appliqué à la parole normale, le NCD révèle l'émergence de traits phonétiques (concept cible ici) dans les couches d'un modèle entraîné sur la tâche de classification des phonèmes français. Nous montrons également que, sur un corpus de cancers de la tête et du cou, les connaissances issues du NCD permettent de caractériser les troubles de parole des patients en terme d'altération des traits phonétiques, fournissant ainsi de premières informations très pertinentes pour la pratique clinique telle que la rééducation."
   ],
   "doi": "10.21437/JEP.2022-49"
  },
  "guan22_jep": {
   "authors": [
    [
     "Qianwen",
     "Guan"
    ],
    [
     "Yaru",
     "Wu"
    ],
    [
     "Ioana",
     "Chitoran"
    ]
   ],
   "title": "Rôle du contexte prosodique et segmental dans la variation phonétique des séquences consonantiques en /ʁ/ en français",
   "original": "65",
   "page_count": 10,
   "order": 50,
   "p1": 471,
   "pn": 480,
   "abstract": [
    "Nous examinons les variations de production des séquences consonantiques en /ʁ/ dans le corpus français LOCAS-F (Degand et al., 2014) en fonction des facteurs : frontières prosodiques, contexte post-lexical, style de parole, fréquence des mots. Nous constatons que pour le /Cʁ#/ final de mot, 17% des /ʁ/ sont supprimés, et 39% du temps un schwa est inséré. Pour /ʁC#/ final, le schwa épenthétique est observé dans 20% des cas. Une classification automatique par forêt aléatoire nous permet de comprendre l’influence des facteurs mentionnés sur la réalisation de /Cʁ#/ et de /ʁC#/. Le modèle prédit avec précision les variantes de production pour /Cʁ#/ et /ʁC#/ avec une F-mesure de 86%. Le contexte post-lexical est le facteur le plus important dans la classification des variantes des deux séquences. La réalisation de /Cʁ#/ est également influencée par les frontières prosodiques, le style de parole et la fréquence des mots."
   ],
   "doi": "10.21437/JEP.2022-50"
  },
  "laperriere22_jep": {
   "authors": [
    [
     "Gaëlle",
     "Laperrière"
    ],
    [
     "Valentin",
     "Pelloin"
    ],
    [
     "Antoine",
     "Caubrière"
    ],
    [
     "Salima",
     "Mdhaffar"
    ],
    [
     "Nathalie",
     "Camelin"
    ],
    [
     "Sahar",
     "Ghannay"
    ],
    [
     "Bassam",
     "Jabaian"
    ],
    [
     "Yannick",
     "Estève"
    ]
   ],
   "title": "Le benchmark MEDIA revisité : données, outils et évaluation dans un contexte d’apprentissage profond",
   "original": "78",
   "page_count": 10,
   "order": 51,
   "p1": 481,
   "pn": 490,
   "abstract": [
    "Nous discutons ici du jeu de données françaises de référence MEDIA, créé en 2005 et distribuépar ELRA gratuitement pour la recherche académique depuis 2020. Bien que parmi les plus richeset complexes à traiter, ces données sont rarement utilisées au-delà de la communauté scientifiquefrançaise. Pour en faciliter l’usage dans un contexte d’apprentissage profond, une recette complètea été intégrée à SpeechBrain, une boite à outils logicielle dédiée au traitement de la parole par desapproches neuronales, de plus en plus populaire au niveau international. De plus, des corrections ontété apportées aux annotations manuelles, proposées par différents chercheurs ayant régulièrementtravaillé sur ces données. Cette nouvelle version du corpus sera intégrée au catalogue de ELRA. Unnouvel ensemble de données jamais utilisées jusqu’à présent mais collectées durant la création ducorpus original, est également décrit. Enfin, nous abordons des considérations liées à l’évaluation dela tâche MEDIA."
   ],
   "doi": "10.21437/JEP.2022-51"
  },
  "guillaume22_jep": {
   "authors": [
    [
     "Severine",
     "Guillaume"
    ],
    [
     "Guillaume",
     "Wisniewski"
    ],
    [
     "Cécile",
     "Macaire"
    ],
    [
     "Guillaume",
     "Jacques"
    ],
    [
     "Alexis",
     "Michaud"
    ],
    [
     "Benjamin",
     "Galliot"
    ],
    [
     "Maximin",
     "Coavoux"
    ],
    [
     "Solange",
     "Rossato"
    ],
    [
     "Minh-Châu",
     "Nguyên"
    ],
    [
     "Maxime",
     "Fily"
    ]
   ],
   "title": "Les modèles pré-entraînés à l'épreuve des langues rares : expériences de reconnaissance de mots sur la langue japhug (sino-tibétain)",
   "original": "79",
   "page_count": 10,
   "order": 52,
   "p1": 491,
   "pn": 500,
   "abstract": [
    "Nous décrivons dans ce travail les résultats obtenus dans le cadre du développement d'outils de reconnaissance de la parole pour l'aide à la documentation linguistique en prenant comme cas d'étude le japhug. L'objectif consiste à réduire l'effort de transcription  fourni les linguistes au fil de leur travail de documentation de  langues rares. Nous montrons comment une approche neuronale fondée  sur la spécialisation d'un modèle de représentation générique  pré-entrainé (XSLR) reposant sur une architecture de type  Transformer permet d'améliorer significativement la qualité  de la transcription phonémique automatique dans le cas où seules  quelques heures de données annotées sont disponibles, et surtout de  progresser jusqu'à la reconnaissance automatique de mots. Les  expériences que nous décrivons montrent toutefois les difficultés à  mettre en œuvre ce type d'approche que ça soit en terme de stabilité  de l'apprentissage ou en terme de l'évaluation de leur qualité et de  leur intérêt pour les linguistes de terrain."
   ],
   "doi": "10.21437/JEP.2022-52"
  },
  "cordier22_jep": {
   "authors": [
    [
     "Thibault",
     "Cordier"
    ],
    [
     "Fabrice",
     "Lefèvre"
    ],
    [
     "Tanguy",
     "Urvoy"
    ],
    [
     "Lina Maria",
     "Rojas-Barahona"
    ]
   ],
   "title": "Et la robustesse ?... bordel ! Comment les stratégies de dialogue par apprentissage structuré résistent aux bruits des entrées ?",
   "original": "80",
   "page_count": 10,
   "order": 53,
   "p1": 501,
   "pn": 510,
   "abstract": [
    "A l'instar du film dont s'inspire notre titre (\"Et la tendresse?... bordel!\") qui interrogeait sur les conséquences de la révolution sexuelle des années 70, nous souhaitons questionner la baisse d'intérêt pour une problématique toujours fondamentale aux systèmes d'interaction vocale : la robustesse aux entrées bruitées. Les causes de ces bruits sont multiples ; l'indécision du locuteur générant agrammaticalité, répétitions... s'ajoute aux traitements automatiques. Cette étude est menée dans le contexte des systèmes de dialogue orienté tâche multi-domaines dont l'intérêt est leur sensibilité accrue aux erreurs tout au long de la conversation et leur complexité en terme d'exploration et de planification. Nous constatons que les approches structurées par des réseaux de neurones graphiques (GNN) combinées avec l'apprentissage par imitation peuvent efficacement gérer des dialogues multi-domaines. Mais l'étude de leur robustesse aux entrées bruitées, plus friable qu'avec une approche à base de règles, confirme qu'un travail spécifique reste à faire."
   ],
   "doi": "10.21437/JEP.2022-53"
  },
  "degand22_jep": {
   "authors": [
    [
     "Mathilde",
     "Degand"
    ],
    [
     "Véronique",
     "Delvaux"
    ],
    [
     "Bernard",
     "Harmegnies"
    ],
    [
     "Kathy",
     "Huet"
    ],
    [
     "Myriam",
     "Piccaluga"
    ],
    [
     "Clémence",
     "Verhaegen"
    ],
    [
     "Virginie",
     "Roland"
    ]
   ],
   "title": "Activités de réminiscence dans la maladie d’Alzheimer : analyse des gestes en situation d’échanges dyadiques.",
   "original": "81",
   "page_count": 9,
   "order": 54,
   "p1": 511,
   "pn": 519,
   "abstract": [
    "Les troubles de la communication font partie des premiers symptômes à se manifester dans la maladie d’Alzheimer (MA). L’objectif de notre étude était d’étudier les stratégies de communication mises en place par une personne atteinte de la MA lors d’échanges dyadiques suscitant des réminiscences, en tenant compte de variables personnelles, telles que la personnalité du participant ou le stade de la maladie. Pour cela, six images chargées émotionnellement et issues de la base de données GAPED ont été sélectionnées.Nos résultats mettent en évidence une augmentation des comportements non-verbaux, positifs aux échanges, entre les deux premiers entretiens, telle qu’une apparition ou une augmentation de gestes illustrateurs et une diminution de gestes adaptateurs (par exemple, diminution marquée de balancements ou de manifestations d’agitation). Ces comportements se maintiennent également durant la dernière rencontre, et ce pour les cinq participantes. L’implication émotionnelle reste également marquée lors de la dernière rencontre."
   ],
   "doi": "10.21437/JEP.2022-54"
  },
  "gelin22_jep": {
   "authors": [
    [
     "Lucile",
     "Gelin"
    ],
    [
     "Thomas",
     "Pellegrini"
    ],
    [
     "Julien",
     "Pinquier"
    ],
    [
     "Morgane",
     "Daniel"
    ]
   ],
   "title": "Améliorations d’un système Transformer de reconnaissance de phonèmes appliqué à la parole d'enfants apprenants lecteurs",
   "original": "90",
   "page_count": 10,
   "order": 55,
   "p1": 520,
   "pn": 529,
   "abstract": [
    "Les performances des systèmes de reconnaissance automatique de la parole d'enfants n'égalent pas celles des systèmes adultes: la parole d'enfant est difficile à reconnaître et peu de données sont disponibles en Français. Nous faisons de plus face ici à la présence d'erreurs de lecture de jeunes enfants. Nous adaptons un système Transformer end-to-end à la parole d'enfants apprenants lecteurs. Un entraînement multi-objectif avec une fonction Connectionist Temporal Classification (CTC) et un décodage joint CTC/attention réduit le taux d'erreur phonème (PER) de 22,9% à 19,6%. Nous combinons également une augmentation par ajout de bruit de salle de classe et une augmentation innovante par simulation d'erreurs de lecture pour améliorer la robustesse du système, et atteignons un PER de 15,1%. Des analyses détaillées montrent que le système est plus robuste au bruit, et que l'ajout de la fonction CTC et l'augmentation d'erreurs synthétiques aident à mieux reconnaître les erreurs des enfants."
   ],
   "doi": "10.21437/JEP.2022-55"
  },
  "noe22_jep": {
   "authors": [
    [
     "Paul-Gauthier",
     "Noé"
    ],
    [
     "Andreas",
     "Nautsch"
    ],
    [
     "Driss",
     "Matrouf"
    ],
    [
     "Pierre-Michel",
     "Bousquet"
    ],
    [
     "Jean-François",
     "Bonastre"
    ]
   ],
   "title": "Faire le pont entre l’observation et la preuve : Application au respect de la vie privée",
   "original": "91",
   "page_count": 9,
   "order": 56,
   "p1": 530,
   "pn": 538,
   "abstract": [
    "Le respect de la vie privée dans les technologies de la parole consiste généralement à dissimuler l’identité du·de la locuteur·rice. Dans cet article, nous traitons du respect de la vie privée dit contrôlé où un·e utilisateur·rice aurait la possibilité de dissimuler un ou plusieurs de ses attributs comme son sexe, son age ou ses origines tout en préservant le reste de sa personnalité vocale. Lorsque l’attribut est binaire, le secret parfait, défini par Claude Shannon, nécessite d’avoir le log-ratio de vraisemblances (LRV) à zero. Cet article propose donc une approche qui permet, dans une representation du·de lalocuteur·rice, de manipuler le LRV relatif à l’attribut et donc de l’annihiler. Nos expériences sur des x-vecteurs issus des bases de données VoxCeleb2 montrent que notre méthode est capable de dissimuler le sexe du·de la locuteur·rice tout en maintenant la possibilité de faire de la vérification automatique du·de la locuteur·rice."
   ],
   "doi": "10.21437/JEP.2022-56"
  },
  "marchand22_jep": {
   "authors": [
    [
     "Aline",
     "Marchand"
    ]
   ],
   "title": "Acquisition de la prosodie en L2 : une étude acoustique de l'accentuation en français par des adultes turcophones",
   "original": "92",
   "page_count": 10,
   "order": 57,
   "p1": 539,
   "pn": 548,
   "abstract": [
    "Cette étude expérimentale exploratoire porte sur l’appropriation des accents final (AF) et initial (AI) en français L2 par 19 adultes plurilingues turcophones vivant en France, de niveau A1 à C2 en français. Vu les convergences et divergences entre les AF et AI en français et les accents primaire et secondaire en turc, comment sont réalisés les accents en français L2 par les locuteurs turcs ? L’analyse des syllabes accentuées (F0 et durée) dans des énoncés produits en lecture oralisée d’un corpus contrôlé a montré une sur-utilisation d’AF (sur chaque mot lexical voire sur les mots grammaticaux) vs un accent de groupe (Syntagme Prosodique) chez les natifs ; le recours aux paramètres accentuels pertinents (F0 et durée), mais une tendance à allonger davantage que les natifs.Il semble y avoir une interférence avec l’accentuation en turc (un accent primaire sur chaque Mot Prosodique et non pertinence du paramètre de la durée). "
   ],
   "doi": "10.21437/JEP.2022-57"
  },
  "lalain22_jep": {
   "authors": [
    [
     "Muriel",
     "Lalain"
    ],
    [
     "Laura",
     "Monestier"
    ],
    [
     "Alain",
     "Ghio"
    ],
    [
     "Corinne",
     "Fredouille"
    ],
    [
     "Marie",
     "Rebourg"
    ],
    [
     "Nicolas",
     "Fakhry"
    ],
    [
     "Virginie",
     "Woisard"
    ]
   ],
   "title": "Prédiction du degré d'altération de l'intelligibilité chez des patients traités pour un cancer de la cavité buccale ou de l'oropharynx",
   "original": "100",
   "page_count": 10,
   "order": 58,
   "p1": 549,
   "pn": 558,
   "abstract": [
    "Les progrès des traitements ont augmenté l’espérance de vie des patients traités pour un cancer de la cavité buccale ou de l’oropharynx et il est primordial de s’intéresser aux séquelles post-thérapeutiques. Cette étude propose de caractériser le lien entre une région anatomique et le déficit fonctionnel de parole. Nous avons examiné la relation entre les métadonnées cliniques (taille et région tumorales) de 85 patients et leur score d’intelligibilité global (sPPD global) et local (sPPD local) calculés à partir d’une tâche de décodage acoustico-phonétique de pseudomots. Les résultats des analyses du sPPD global ont montré que la taille de la tumeur, mais pas sa localisation, permet de prédire le degré d’altération de l’intelligibilité. L’examen du sPPD local a permis d’identifier les voyelles nasales, voyelles postérieures et consonnes palatales et vélaires comme les segments les plus altérés, quelle que soit la région anatomique de la tumeur"
   ],
   "doi": "10.21437/JEP.2022-58"
  },
  "li22_jep": {
   "authors": [
    [
     "Jinyu",
     "Li"
    ],
    [
     "Leonardo",
     "Lancia"
    ]
   ],
   "title": "Restructuration rythmique de la parole produite sous feedback auditif retardé",
   "original": "103",
   "page_count": 10,
   "order": 59,
   "p1": 559,
   "pn": 568,
   "abstract": [
    "Sous delayed auditory feedback (DAF) les durées des gestes de parole deviennent moins uniformes, alors que les cibles atteintes deviennent plus uniformes. Nous proposons que ces effets ne soient pas simplement le résultat des ralentissements locaux, permettant d’atteindre plus précisément les cibles acoustiques, mais qu’ils soient dus à une réorganisation des structures coordinatrices sous-jacentes au rythme de la parole. 10 femmes françaises ont répété trois phrases avec trois degrés de DAF. Nous avons analysé comment le DAF affecte le degré de coordination entre les modulations d’amplitude observées à l’échelle temporelle des syllabes et à l’échelle de la proéminence supra-syllabique dans cinq bandes spectrales séparées. Conformément à notre hypothèse, cette coordination est positivement corrélée au retard du retour auditif dans la quatrième bande (1719 ~ 3913Hz), liée principalement aux gestes vocaliques. En d'autres termes, la coordination entre patrons rythmiques syllabiques et supra- syllabiques dépend du retard auditif."
   ],
   "doi": "10.21437/JEP.2022-59"
  },
  "ferre22b_jep": {
   "authors": [
    [
     "Gaëlle",
     "Ferré"
    ]
   ],
   "title": "Les pauses gestuelles correspondent-elles à des dysfluences verbales chez les personnes aphasiques ?",
   "original": "4",
   "page_count": 9,
   "order": 60,
   "p1": 569,
   "pn": 577,
   "abstract": [
    "Cet article se propose d’étudier les pauses gestuelles (appelées les 'tenues gestuelles' dans la littérature spécialisée) chez les personnes aphasiques fluentes et non-fluentes en comparaison avec des locuteurs contrôles à partir du corpus AphasiaBank. Nous répondons à trois questions de recherche : a) Les tenues gestuelles sont-elles plus nombreuses chez certains groupes de locuteurs, b) Le nombre d’indices de dysfluence dans la chaîne parlée, en co-occurrence avec les tenues gestuelles est il plus élevé chez certains groupes de locuteurs, et c) Quels sont les marqueurs de (dys)fluence co-occurrents avec les tenues gestuelles ? Comme nous pouvions le prédire, nous observons des différences entre les trois groupes, essentiellement pour les questions (b) et (c), mais pas pour la question (a)."
   ],
   "doi": "10.21437/JEP.2022-60"
  },
  "contrerasroa22_jep": {
   "authors": [
    [
     "Leonardo",
     "Contreras Roa"
    ],
    [
     "Paolo",
     "Mairano"
    ],
    [
     "Caroline",
     "Moreau"
    ],
    [
     "Anahita",
     "Basirat"
    ]
   ],
   "title": "Impact de l’amorçage rythmique sur la production de la parole chez des personnes atteintes de la maladie de Parkinson : Étude pilote",
   "original": "29",
   "page_count": 10,
   "order": 61,
   "p1": 578,
   "pn": 587,
   "abstract": [
    "Dans cette contribution, nous présentons les résultats d’une étude pilote sur l’impact de l’amorçage rythmique, c’est-à-dire l’écoute des stimuli auditifs rythmiques, sur la production de la parole dans la maladie de Parkinson. Nous nous sommes intéressés à la prosodie qui est l’un des aspects souvent signalés comme étant fortement altérés dans la maladie de Parkinson. La tâche consistait à écouter des stimuli auditifs et à lire des phrases. Trois conditions ont été étudiées : une condition où le rythme était cohérent avec la structure rythmique de la phrase cible, une condition où le rythme était incohérent avec la phrase cible et une condition sans amorçage. Différents aspects tels que les métriques basées sur la durée des voyelles et des consonnes, la proéminence et le délai d’initialisation ont été analysés. Nous discutons des résultats préliminaires et la pertinence de notre approche."
   ],
   "doi": "10.21437/JEP.2022-61"
  },
  "rohrer22_jep": {
   "authors": [
    [
     "Patrick Louis",
     "Rohrer"
    ],
    [
     "Pilar",
     "Prieto"
    ],
    [
     "Elisabeth",
     "Delais-Roussarie"
    ]
   ],
   "title": "Le rythme prosodique guide le rythme gestuel",
   "original": "64",
   "page_count": 9,
   "order": 62,
   "p1": 588,
   "pn": 596,
   "abstract": [
    "Bien que les gestes soient souvent associés aux proéminences prosodiques, certaines études montrent que les Groupes Rythmiques de Gestes (GRG) composés de gestes non-référentiels sont plus isochrones que ceux composés de gestes référentiels, et que leur nature rythmique n’est pas gouvernée par l’accentuation, mais qu’ils suivent leur propre rythme. Par ailleurs, peu d’études traitent du français, langue dans laquelle le groupe accentuel (AP) joue un rôle primordial pour le rythme prosodique. Cette étude analyse l’influence de l’AP sur le rythme gestuel et les effets de la référentialité sur l'isochronie des GRG dans le corpus M3D-TED. Les résultats montrent que bien qu’il n’existe pas de relation exclusive entre geste et AP, le phrasé prédit significativement le rythme gestuel. Par ailleurs, la référentialité des GRG n’influe pas sur l’isochronie. Ces résultats suggèrent qu’en français, le groupe accentuel joue un rôle régulateur pour la nature rythmique des gestes."
   ],
   "doi": "10.21437/JEP.2022-62"
  },
  "ferragne22_jep": {
   "authors": [
    [
     "Emmanuel",
     "Ferragne"
    ],
    [
     "Anne",
     "Guyot-Talbot"
    ],
    [
     "Margaux",
     "Cecchini"
    ],
    [
     "Martine",
     "Beugnet"
    ],
    [
     "Emmanuelle",
     "Delanoë-Brun"
    ],
    [
     "Laurianne",
     "Georgeton"
    ],
    [
     "Christophe",
     "Stécoli"
    ],
    [
     "Jean-François",
     "Bonastre"
    ],
    [
     "Corinne",
     "Fredouille"
    ]
   ],
   "title": "Représentations de l’expertise vocale dans les séries policières : quand la fiction s’invite dans les enquêtes et au tribunal",
   "original": "46",
   "page_count": 9,
   "order": 63,
   "p1": 597,
   "pn": 605,
   "abstract": [
    "À travers le prisme pluridisciplinaire de la phonétique, du traitement du signal et des études visuelles, et sous l’œil des experts de la police scientifique, nous avons analysé plus d’une centaine de scènes de séries américaines impliquant une expertise du signal audio et, en particulier, de la voix. Nous tentons d’identifier des schémas récurrents qui contribuent à entretenir certains mythes liés à l’identification d’un individu par sa voix. Nous évaluons le degré de plausibilité de certains extraits et proposons les prémisses d’une esthétique de l’expertise vocale. Nous souhaitons ainsi mieux comprendre comment le grand public se représente les applications criminalistiques des sciences de la parole et espérons, en confrontant la fiction à la réalité, faire passer un message pédagogique à destination non seulement des téléspectateurs, mais également des professionnels de la police et de la justice."
   ],
   "doi": "10.21437/JEP.2022-63"
  },
  "joseph22_jep": {
   "authors": [
    [
     "Camille",
     "Joseph"
    ],
    [
     "Ivana",
     "Didirková"
    ],
    [
     "Claudia",
     "Schweitzer"
    ],
    [
     "Christelle",
     "Dodane"
    ]
   ],
   "title": "Les premières archives de la parole (1890-1940) ",
   "original": "61",
   "page_count": 10,
   "order": 64,
   "p1": 606,
   "pn": 615,
   "abstract": [
    "A la fin du XIXe siècle, de nouvelles technologies permettent l’enregistrement et la reproduction intégrale du son. Ces innovations sont rapidement adoptées par les phonéticiens, les dialectologues et les ethnologues, qui voient là une manière de limiter la subjectivité dans la description des données, déclenchant un vaste mouvement de collecte de documents sonores. Cette étude présente un panorama des institutions créées entre 1890 et 1940 avec pour objectif de produire, centraliser et conserver ces enregistrements. Nous replaçons la création de ces archives, qui sont bien des espaces scientifiques n’ayant pas à l’origine de vocation strictement historique, dans le contexte scientifique et technologique de l’époque avant d’étudier les pionniers de ce mouvement international. Puis nous évoquons leurs liens avec les différentes disciplines participant à leur naissance - la musicologie, l'ethnographie, la phonétique et la dialectologie -, avant de conclure sur la volonté de documenter le monde qui sous-tend ces projets."
   ],
   "doi": "10.21437/JEP.2022-64"
  },
  "barkatdefradas22_jep": {
   "authors": [
    [
     "Melissa",
     "Barkat-Defradas"
    ],
    [
     "Camille",
     "Fauth"
    ],
    [
     "Didier",
     "Demolin"
    ],
    [
     "Alexandre",
     "Suire"
    ]
   ],
   "title": "Évolution de la voix humaine (France, période 1940 – 2019)",
   "original": "93",
   "page_count": 9,
   "order": 65,
   "p1": 616,
   "pn": 624,
   "abstract": [
    "Cette communication a pour objet l’étude de l’évolution des caractéristiques vocales au cours du temps. Dans le cadre d’une collaboration scientifique avec l'INA, nous avons eu accès à des enregistrements audio-vidéos de micros-trottoirs acquis dans le cadre d’émissions télévisuelles entre 1940 et 2019. Ces données nous a permis d’analyser les voix de 779 locuteurs et locutrices et de suivre l’évolution de différents paramètres acoustiques (i.e., F0mean, F0min et F0max F0sd et F0CV) sur 8 décennies. Les analyses statistiques que nous avons menées pour chaque sexe nous ont permis d’observer que si la voix des hommes est restée relativement stable au cours du temps, celle des femmes a remarquablement évolué pour se rapprocher sensiblement de celle des hommes. Les résultats sont discutés à la lumière de différents concepts tant culturels qu’évolutifs. Ils étayent l’hypothèse d’une masculinisation des femmes dont l’origine est à rechercher dans la conjugaison de facteur biologiques et environnementaux."
   ],
   "doi": "10.21437/JEP.2022-65"
  },
  "dalessandro22_jep": {
   "authors": [
    [
     "Christophe",
     "D'Alessandro"
    ]
   ],
   "title": "Une nouvelle organologie de la voix : chironomie et prosodie de la parole et du chant",
   "original": "CdA",
   "page_count": 12,
   "order": 66,
   "p1": 625,
   "pn": 636,
   "abstract": [
    "La synthèse vocale performative offre une nouvelle approche pour l’analyse et la synthèse de la parole expressive et du chant. Deux instruments vocaux, à la confluence entre nouvelles interfaces pour l’expression musicale, traitement du signal vocal et phonétique acoustique, sont présentés. Cantor Digitalis est un synthétiseur à formants muni d’un modèle spectral de la source glottique, piloté par des gestes bimanuels sur une surface tactile et un stylet. Voks est un vocodeur piloté par des gestes bimanuels, sur une surface tactile et un stylet, ou par un thérémine, augmenté d’un contrôle biphasique du séquencement syllabique. Les unités prosodiques et leur organisation et leur contrôle pour la construction des instruments vocaux sont discutés suivant trois lignes : la stylisation chironomique de l’intonation et de l’effort vocal, le contrôle biphasique du rythme syllabique. En conclusion, les applications musicales, pédagogiques, voire cliniques de cette nouvelle organologie de la voix sont évoquées."
   ],
   "doi": "10.21437/JEP.2022-66"
  },
  "nourtel22_jep": {
   "authors": [
    [
     "Hubert",
     "Nourtel"
    ],
    [
     "Pierre",
     "Champion"
    ],
    [
     "Denis",
     "Jouvet"
    ],
    [
     "Anthony",
     "Larcher"
    ],
    [
     "Marie",
     "Tahon"
    ]
   ],
   "title": "Analyse de l'anonymisation du locuteur sur de la parole émotionnelle",
   "original": "30",
   "page_count": 9,
   "order": 67,
   "p1": 637,
   "pn": 645,
   "abstract": [
    "Les données vocales contiennent des informations personnelles, telles que l'identité du locuteur ou son état émotionnel, pouvant être utilisées à des fins malveillantes.Parmi les études ayant abordé le sujet de la préservation de la confidentialité de la parole, l'initiative VoicePrivacy vise à promouvoir le développement d'outils de préservation de la vie privée pour les technologies vocales. L'objectif du VoicePrivacy Challenge 2020 (VPC) était de cacher l'identité du locuteur source tout en préservant les informations linguistiques.Cet article étudie l'impact du système d'anonymisation du locuteur du VPC sur les informations émotionnelles de la parole. Des modifications du système ont aussi été ajoutées pour essayer de masquer les émotions tout en limitant la dégradation du signal.Nos résultats montrent que la baseline du VPC masque légèrement les émotions des locuteurs mais certaines modifications permettent de masquer plus efficacement les émotions tout en conservant une bonne intelligibilité."
   ],
   "doi": "10.21437/JEP.2022-67"
  },
  "bonastre22_jep": {
   "authors": [
    [
     "Jean-François",
     "Bonastre"
    ],
    [
     "Imen",
     "Ben Amor"
    ]
   ],
   "title": "BA-LR : une approche transparente de comparaison de voix en criminalistique",
   "original": "58",
   "page_count": 9,
   "order": 68,
   "p1": 646,
   "pn": 654,
   "abstract": [
    "Le rapport de vraisemblance (LR) est un paradigme largement adopté en criminalistique  pour représenter la conclusion d’un rapport d’expertise. Cependant, le LR seul ne facilite pas pleinement la prise de décision des juges et des jurés, qui doivent l’associer à d’autres connaissances liées à l’affaire mais manquent d’informations pour cela. Expliciter les éléments qui ont contribué à ce LR, leur permettrait de mieux intégrer la preuve scientifique dans la décision finale. À cet égard, nous proposons une approche pour la comparaison de la voix en criminalistique où le LR est obtenu comme la composition des LRs partiels, chacun dédié à une caractéristique vocale. Une implémentation de notre approche est évaluée sur VoxCeleb1&2. Les résultats obtenus montrent l’efficacité de cette approche et donnent l’espoir à une comparaison de voix automatique pleinement transparente et explicable."
   ],
   "doi": "10.21437/JEP.2022-68"
  },
  "girin22_jep": {
   "authors": [
    [
     "Laurent",
     "Girin"
    ],
    [
     "Xiaoyu",
     "Bie"
    ],
    [
     "Simon",
     "Leglaive"
    ],
    [
     "Thomas",
     "Hueber"
    ],
    [
     "Xavier",
     "Alameda-Pineda"
    ]
   ],
   "title": "Les auto-encodeurs variationnels dynamiques et leur application à la modélisation de spectrogrammes de parole",
   "original": "88",
   "page_count": 9,
   "order": 69,
   "p1": 655,
   "pn": 663,
   "abstract": [
    "L'auto-encodeur variationnel (AEV) est un modèle génératif profond permettant d'apprendre de façon auto-supervisé des représentations latentes compactes, à partir de données complexes de grande dimension. Dans le modèle AEV original, les vecteurs de données d'entrée sont traités indépendamment. Ces dernières années, plusieurs travaux ont proposé différentes extensions de l'AEV afin de traiter des données séquentielles (notamment temporelles). Ces modèles utilisent classiquement des réseaux de neurones récurrents pour tenir compte non seulement des dépendances entre les vecteurs d'une séquence d'entrée, mais également celles entre les représentations latentes correspondantes. Nous avons récemment effectué une revue complète de ces modèles et les avons unifiés en une classe générale appelée auto-encodeurs variationnels dynamiques (AEVDs). Dans le présent article, nous présentons cette classe de modèles et illustrons leur fort potentiel pour la modélisation des (spectrogrammes de) signaux de parole avec des expériences en analyse-resynthèse."
   ],
   "doi": "10.21437/JEP.2022-69"
  },
  "goeseels22_jep": {
   "authors": [
    [
     "Eva",
     "Goeseels"
    ],
    [
     "Bernard",
     "Harmegnies"
    ],
    [
     "Kathy",
     "Huet"
    ],
    [
     "Myriam",
     "Piccaluga"
    ],
    [
     "Virginie",
     "Roland"
    ],
    [
     "Clémence",
     "Verhaegen"
    ],
    [
     "Véronique",
     "Delvaux"
    ]
   ],
   "title": "Etude du phénomène de convergence phonétique : comparaison enfants adultes",
   "original": "26",
   "page_count": 10,
   "order": 70,
   "p1": 664,
   "pn": 673,
   "abstract": [
    "La convergence phonétique est définie comme la tendance au rapprochement des caractéristiques des productions de parole de locuteurs interagissant entre eux ou avec des dispositifs technologiques vocaux. Ce phénomène a été peu étudié chez les enfants et se heurte à deux hypothèses concurrentes : les enfants convergeraient soit davantage soit moins que les adultes. Cette étude traite donc la convergence phonétique, en comparant des dyades enfants à des dyades adultes. 36 sujets (20 adultes, 16 enfants), ont produit des phrases dans 5 conditions (4 individuelles + un jeu en duo) successives. La fréquence fondamentale et le débit de parole des énoncés ont été évalués. Les résultats indiquent que les deux groupes montrent de la convergence lors des tâches individuelles (rapprochement de la cible), mais pour des mesures acoustiques différentes. Lors du jeu, la convergence a pu être mise en évidence dans les deux groupes, avec une grande variabilité."
   ],
   "doi": "10.21437/JEP.2022-70"
  },
  "boram22_jep": {
   "authors": [
    [
     "Lee",
     "Boram"
    ],
    [
     "Yamaguchi",
     "Naomi"
    ],
    [
     "Cécile",
     "Fougeron"
    ]
   ],
   "title": "Perception des occlusives du coréen L2 : reorganisation du cue weighting au cours du temps",
   "original": "42",
   "page_count": 9,
   "order": 71,
   "p1": 674,
   "pn": 682,
   "abstract": [
    "Une difficultés chez les apprenants francophones du coréen est l’acquisition des consonnes aspirée, lenis et fortis, qui contrastent phonétiquement par des différences de VOT, mais aussi de f0. Ces indices pertinents doivent être appris, et leur poids relatif ou « cue weighting » doit être réorganisé par rapport à la L1. Nous explorons l’évolution du cue weighting en coréen chaque mois chez 21 apprenantes, sur 8 sessions. Les résultats montrent des difficultés à identifier la lenis, sans amélioration au cours de l’année alors que l’identification des deux autres catégories s’améliore. Les apprenantes présentent des stratégies différentes selon les catégories en termes de cue weighting : le VOT sert à distinguer aspirée vs. fortis/lenis, et la f0 sert à distinguer fortis vs lenis, suggérant une organisation en deux catégories au lieu de trois. Cette étude montre l'influence de la L1 en termes de cue weighting sur la perception de la L2. "
   ],
   "doi": "10.21437/JEP.2022-71"
  },
  "dodane22_jep": {
   "authors": [
    [
     "Christelle",
     "Dodane"
    ],
    [
     "Corine",
     "Astésano"
    ]
   ],
   "title": "Mise en place de l’accentuation initiale et finale chez deux enfants monolingues français âgés de 18 à 36 mois",
   "original": "84",
   "page_count": 10,
   "order": 72,
   "p1": 683,
   "pn": 692,
   "abstract": [
    "This study focuses on the prosodic characteristics of the productions of two monolingual French children aged 12 to 36 months. More specifically, we explore the influence of age and language development (MLU; mean length of utterance in morphemes) on the acoustic realization of initial stress (AI) and afinal stress (AF) in utterances containing a filler or a determiner followed by a bisyllabic noun. For the two children, the results show that the fillers disappear quickly in favor of the determinants and that there is an increase in the proportion of AI through the ages, as well as a stabilization of the duration of AF and duration ratios between AI and AF. The shape of the intonation contours is taken into account in order to report on the acoustic variation of the phonological representations of the stress. Moreover, the differences in MLU explain the inter-individual variation between the two children."
   ],
   "doi": "10.21437/JEP.2022-72"
  },
  "fino22_jep": {
   "authors": [
    [
     "Verdiana De",
     "Fino"
    ],
    [
     "Lionel",
     "Fontan"
    ],
    [
     "Julien",
     "Pinquier"
    ],
    [
     "Corentin",
     "Barcat"
    ],
    [
     "Isabelle",
     "Ferrané"
    ],
    [
     "Sylvain",
     "Detey"
    ]
   ],
   "title": "Mesures automatiques de parole non-native : exploration pilote d’un corpus d’apprenants japonais de français et différenciation de niveaux",
   "original": "95",
   "page_count": 10,
   "order": 73,
   "p1": 693,
   "pn": 702,
   "abstract": [
    "Cette étude s'intéresse à l’évaluation automatique de la parole de Japonais apprenant le français. Nos données sont des productions orales semi-spontanées, issues du corpus CLIJAF. Nous évaluons différents niveaux linguistiques (prononciation, lexique, syntaxe, discours) à l’aide de mesures automatiques. Notre premier objectif est d’étudier si ces mesures sont en adéquation avec le niveau général des apprenants, tel que défini par le CECRL (A2 à C2). Notre deuxième objectif est d’explorer la possibilité de prédire ledit niveau en utilisant les paramètres linguistiques les plus pertinents, avec un algorithme d’apprentissage automatique non-supervisé. Les résultats obtenus valident la pertinence de nos objectifs et montrent que des paramètres extraits automatiquement tels que la diversité lexicale, la longueur moyenne des tours de parole (niveau syntaxique), la proportion de marqueurs du discours et plusieurs paramètres liés à la fluence peuvent contribuer à la prédiction du niveau des apprenants."
   ],
   "doi": "10.21437/JEP.2022-73"
  },
  "martin22_jep": {
   "authors": [
    [
     "Vincent P.",
     "Martin"
    ],
    [
     "Jean-Luc",
     "Rouas"
    ],
    [
     "Agathe",
     "Basse"
    ],
    [
     "Benoît",
     "Caudron"
    ],
    [
     "Marie",
     "Huillet"
    ],
    [
     "Pierre",
     "Philip"
    ]
   ],
   "title": "Est-il possible d’annoter la naturalité des pauses lors de la lecture d’un texte à haute voix ?",
   "original": "6",
   "page_count": 9,
   "order": 74,
   "p1": 703,
   "pn": 711,
   "abstract": [
    "L'utilisation de biomarqueurs vocaux est une des technologies les plus prometteuses pour l'implémentation de systèmes de santé numérique en conditions écologiques. En effet, de nombreuses et diverses pathologies sont maintenant diagnostiquées automatiquement de manière fiable grâce à des marqueurs vocaux.  Cet article étudie et discute la faisabilité d'annoter des textes -- qui seront ensuite lus à voix haute par des patients hypersomniaques -- afin de concevoir des descripteurs basés sur la naturalité des pauses faites par ceux-ci. Pour cela, trois spécialistes ont annoté six textes extraits du Petit prince.   Nous étudions à la fois à travers des mesures statistiques mais aussi sous le prisme du rapport des annotateurs, deux axes : les différences entres les méthodes d'annotation ; et les lieux de désaccord dans les textes.  Enfin, nous concluons quand à la fiabilité d'utiliser de telles annotations comme vérité terrain dans un système automatique."
   ],
   "doi": "10.21437/JEP.2022-74"
  },
  "crouzet22_jep": {
   "authors": [
    [
     "Olivier",
     "Crouzet"
    ],
    [
     "Agnieszka",
     "Duniec"
    ],
    [
     "Elisabeth",
     "Delais-Roussarie"
    ]
   ],
   "title": "Analyse Factorielle de signaux musicaux : comparaison avec les données de parole dans la perspective de l'hypothèse de codage efficace.",
   "original": "7",
   "page_count": 9,
   "order": 75,
   "p1": 712,
   "pn": 720,
   "abstract": [
    "Essai"
   ],
   "doi": "10.21437/JEP.2022-75"
  },
  "cattan22_jep": {
   "authors": [
    [
     "Oralie",
     "Cattan"
    ],
    [
     "Sahar",
     "Ghannay"
    ],
    [
     "Christophe",
     "Servan"
    ],
    [
     "Sophie",
     "Rosset"
    ]
   ],
   "title": "Etude comparative de modèles Transformers en compréhension de la parole en Français",
   "original": "14",
   "page_count": 10,
   "order": 76,
   "p1": 721,
   "pn": 730,
   "abstract": [
    "Au cours des cinq dernières années, les approches par transfert utilisant les modèles de type Transformers ont établit l'Etat de l'Art sur de nombreuses tâches du Traitement Automatique des Langues. Ces approches deviennent de plus en plus populaires et nécessitent une grande quantité de données et de ressources computationnelles.La plupart des modèles de langue pré-entraînés ont fait l'objet de nombreuses études en anglais et seulement quelques-uns d'entre eux ont été évalués sur une tâche de compréhension de la parole en français. Dans cet article, nous proposons un tour d'horizon de référence, axé sur l'évaluation de la qualité de treize modèles bien établis basés sur les modèles Transformers. Les deux tâches de compréhension de la parole considérées sont MEDIA et ATIS-FR."
   ],
   "doi": "10.21437/JEP.2022-76"
  },
  "alazard22_jep": {
   "authors": [
    [
     "Charlotte",
     "Alazard"
    ],
    [
     "Leonardo",
     "Contreras Roa"
    ],
    [
     "Marie",
     "Philippart de Foy"
    ],
    [
     "Lionel",
     "Fontan"
    ],
    [
     "Nadia",
     "Yassine-Diab"
    ],
    [
     "Julien",
     "Pinquier"
    ],
    [
     "Isabelle",
     "Ferrané"
    ]
   ],
   "title": "Apport du geste dans l'acquisition de la prononciation en L2 : quand la réalité ne correspond pas aux attentes",
   "original": "16",
   "page_count": 10,
   "order": 77,
   "p1": 731,
   "pn": 740,
   "abstract": [
    "Nous présentons une réflexion méthodologique à la suite d' une expérimentation réalisée dans le cadre d’un projet interdisciplinaire où nous avons voulu tester l’impact de la gestualité corrective sur l’acquisition du segmental et du suprasegmental. Pour cela, nous avons mis en place un protocole pré-test/post-test dans trois conditions expérimentales : un groupe test qui a reçu des  gestes correctifs appropriés aux erreurs réalisées, un groupe test qui a reçu des gestes correctifs inadaptés et un groupe contrôle qui n'a pas reçu de correction multimodale. Nous avons enregistré 45 étudiants japonophones de FLE, équitablement répartis entre les trois groupes. Les analyses des 7200 productions orales (160*45) n’ont pas permis de différencier les groupes ni de valider nos hypothèses de recherche. En revanche, les limites observées soulèvent non seulement des réflexions méthodologiques liées au protocole expérimental et à sa passation, mais elles nous amènent également vers une nouvelle proposition de design expérimental."
   ],
   "doi": "10.21437/JEP.2022-77"
  },
  "caillol22_jep": {
   "authors": [
    [
     "Coline",
     "Caillol"
    ],
    [
     "Emmanuel",
     "Ferragne"
    ]
   ],
   "title": "Américanisation de la prononciation de l'anglais en voix chantée: le cas des voyelles de TRAP-BATH et LOT",
   "original": "41",
   "page_count": 10,
   "order": 78,
   "p1": 741,
   "pn": 750,
   "abstract": [
    "S’inscrivant dans la lignée de Trudgill (1983), cet article vise à comprendre le phénomène d’américanisation de la prononciation dans la voix chantée des artistes britanniques des années 1980. Le Heavy Metal a été sélectionné comme genre musical typiquement britannique à son origine, et étudié à l'aune de deux points de référence: la pop britannique et la pop américaine. Les voyelles de TRAP-BATH et LOT, dont les réalisations divergent entre les deux variétés d'anglais (britannique et américaine), ont fait l'objet d'analyses acoustiques chez six artistes. Nos résultats montrent qu'il existe un certain degré d'américanisation dans les productions chantées des artistes britanniques, qui est cependant plus marqué chez les groupes de Heavy Metal que chez les chanteurs de pop. La Discussion revient sur les divers types de paramètres (sociophonétiques, articulatoires, etc.) qui contraignent ce phénomène d'américanisation, et analyse la fiabilité des mesures acoustiques (formants et MFCC) calculées."
   ],
   "doi": "10.21437/JEP.2022-78"
  },
  "lara22_jep": {
   "authors": [
    [
     "Andres Felipe",
     "Lara"
    ],
    [
     "Claire",
     "Pillot-Loiseau"
    ]
   ],
   "title": "L’interférence interlinguistique : étude comparant le VOT chez des apprenants tardifs, des bilingues simultanés et des monolingues",
   "original": "45",
   "page_count": 9,
   "order": 79,
   "p1": 751,
   "pn": 759,
   "abstract": [
    "La présence de différences systématiques entre les monolingues d’une part, les bilingues et apprenants tardifs d’autre part est suggestive d'une interférence interlinguistique. Cette étude préliminaire analyse le Voice Onset Time (VOT) des occlusives bilabiales chez des bilingues simultanés anglais-français vivant en France. Nous avons comparé les productions bilingues à celles de monolingues et des Américains apprenant le français tardivement. Une interférence interlinguistique s’est manifestée pour les productions françaises des apprenants tardifs. Aucune différence significative n'a été trouvée pour les bilingues ni en anglais, ni en français. Les bilingues maitrisent la production de VOT dans les deux langues sans aucun signe de surcharge cognitive. De plus, cette recherche soutient les affirmations d’études précédentes qui avancent que les voyelles fermées /i, y, u/ sont particulièrement sujettes à des valeurs de VOT plus longues, et dans certains cas à l'aspiration de /p/. Aucune tendance n'a été trouvée pour les contextes vocaliques en anglais."
   ],
   "doi": "10.21437/JEP.2022-79"
  },
  "dalessandro22b_jep": {
   "authors": [
    [
     "Daria",
     "D'Alessandro"
    ],
    [
     "Alice",
     "Yildiz"
    ],
    [
     "Cécile",
     "Fougeron"
    ]
   ],
   "title": "Variation individuelle de la coarticulation en fonction de la frontière prosodique",
   "original": "47",
   "page_count": 10,
   "order": 80,
   "p1": 760,
   "pn": 769,
   "abstract": [
    "Cette étude teste comment les variation inter- et intra- individuelles dans le phrasé prosodique affectent la coarticulation anticipatoire voyelle-à-voyelle chez cinq locutrices. Nous examinons la coarticulation dans trois positions : entre deux syllabes d’un mot,  à travers une frontière de mot et à travers une frontière de proposition relative sur 45 répétitions par position par locutrice. Les données montrent que, si le degré de coarticulation voyelle à voyelle varie en fonction de la position syntaxique, avec plus de coarticulation entre syllabe qu’entre phrase, différentes patterns émergent par locuteurs pour la frontière entre mots. Certaine mais pas toute la variation inter-locutrice peut s’expliquer par une variation dans le degré de frontière produit, tel que mesuré en termes perceptifs comme le degré de séparation entre les mots par 6 juges. Les résultats sont discutés en termes de variabilité individuelle dans la planification de la coordination entre unités de parole.   "
   ],
   "doi": "10.21437/JEP.2022-80"
  },
  "miras22_jep": {
   "authors": [
    [
     "Grégory",
     "Miras"
    ],
    [
     "Claire",
     "Pillot-Loiseau"
    ]
   ],
   "title": "Discrimination des voyelles par des apprenants du français comme langue étrangère : effets de l’exposition et de la pratique de la musique instrumentale",
   "original": "49",
   "page_count": 9,
   "order": 81,
   "p1": 770,
   "pn": 778,
   "abstract": [
    "Les travaux en neurocognition montrent que l’entrainement musical provoque des modifications dans tout le système perceptif. Cette étude évalue les effets d’une exposition courte à de la musique instrumentale et d’une pratique musicale à long terme en s’appuyant sur un test de discrimination AXB (ISI=200ms) de sept paires de voyelles françaises proches articulatoirement et/ou acoustiquement. Le taux de bonnes réponses (pC) et les temps de réaction (TR) sont collectés pour 30 apprenants du français dont la moitié sont des musiciens. Les résultats montrent que les TR sont significativement plus courts chez les musiciens en dépit du fait que les pC présentent un effet seuil à des niveaux élevés. Cependant, il n’y a pas de différence significative sur le rôle d’une exposition à court terme à de la musique instrumentale. Cela suggère que seule une pratique sur le long terme peut impacter le traitement acoustique des sons de la parole."
   ],
   "doi": "10.21437/JEP.2022-81"
  },
  "kim22_jep": {
   "authors": [
    [
     "Lila",
     "Kim"
    ],
    [
     "Cédric",
     "Gendrot"
    ]
   ],
   "title": "Classification automatique de voyelles nasales pour une caractérisation de la qualité de voix des locuteurs par des réseaux de neurones convolutifs",
   "original": "52",
   "page_count": 9,
   "order": 82,
   "p1": 779,
   "pn": 787,
   "abstract": [
    "L’objectif de cette étude est d’évaluer, au moyen de réseaux de neurones convolutifs (CNN pour Convolutional Neural Networks), la capacité à discriminer acoustiquement une voyelle orale d’une voyelle nasale (voyelles /a/ et /ɑ̃/) sur un corpus de 45 locuteurs francophones. Pour une classification voyelle nasale vs. voyelle orale, les résultats obtenus peuvent atteindre 96% d’identification correcte. Ces résultats sont détaillés en fonction du locuteur, du contexte phonémique et de la durée. Dans la discussion, nous présentons une comparaison de ces résultats avec une mesure physiologique de nasalance. Une technique de visualisation (Grad-cam) est également mise en avant pour comprendre les zones du spectrogramme utilisées par le CNN."
   ],
   "doi": "10.21437/JEP.2022-82"
  },
  "lenglet22_jep": {
   "authors": [
    [
     "Martin",
     "Lenglet"
    ],
    [
     "Olivier",
     "Perrotin"
    ],
    [
     "Gérard",
     "Bailly"
    ]
   ],
   "title": "Modélisation de la Parole avec Tacotron2 : Analyse acoustique et phonétique des plongements de caractère",
   "original": "55",
   "page_count": 9,
   "order": 83,
   "p1": 788,
   "pn": 796,
   "abstract": [
    "Les réseaux de neurones bouleversent depuis plusieurs années les applications de traitement automatique de la parole. Cependant, le bon de performances rendu possible par ces technologies se fait généralement au détriment de la compréhensibilité et de l'interprétabilité de ces nouveaux modèles. Pourtant, l'apprentissage statistique, au coeur de ces nouveaux usages, constitue une source potentielle d'informations importante sur le langage, à condition de réussir à identifier et localiser ces paramètres dans des réseaux de plusieurs millions de neurones. Ce papier propose une étude des plongements internes d'un modèle de synthèse vocale de type Tacotron2 entraîné sur le Français. Cette analyse suggère que le réseau apprend à représenter sa séquence d'entrée en une suite de cibles acoustiques et phonétiques, dépendantes de leur contexte. La mise en évidence de l'encodage de ces paramètres permet d'imaginer leur contrôle de manière plus naturelle."
   ],
   "doi": "10.21437/JEP.2022-83"
  },
  "vegarodriguez22_jep": {
   "authors": [
    [
     "Jenifer",
     "Vega Rodriguez"
    ],
    [
     "Nathalie",
     "Vallée"
    ],
    [
     "Thiago",
     "Chacón"
    ]
   ],
   "title": "Glottalisation en korebaju : la question d’un trait mixte segmental et suprasegmental",
   "original": "69",
   "page_count": 9,
   "order": 84,
   "p1": 797,
   "pn": 805,
   "abstract": [
    "Le korebaju est une langue amazonienne de Colombie. Quatre enquêtes de terrain réalisées entre 2017 et 2022 auprès six locuteurs d'un même village ont permis de dégager un ensemble de productions glottales qui semble relever des niveaux segmental et suprasegmental. Ici on analyse la production et le statut phonologique de trois types de segment glottalisés ou glottaux : cinq voyelles dont trois phonémiques /aˀ, eˀ, oˀ/, une obstruante [ʔ] et une approximante craquée voisée [*]. En nous appuyant sur des analyses acoustiques et sur une tâche de syllabation des morphèmes, la glottalisation comme un trait de la voyelle est confirmée, alors que les deux autres segments trouvés uniquement en position intervocalique (et sans lien avec les voyelles glottales) comporteraient plutôt un trait suprasegmental [constricted glottis] qui surface au milieu des hiatus de séquence tonale BH (V̀1.V́2)  et opère comme une stratégie de réparation de la  syllabe canonique CV."
   ],
   "doi": "10.21437/JEP.2022-84"
  },
  "guan22b_jep": {
   "authors": [
    [
     "Qianwen",
     "Guan"
    ],
    [
     "Pierrick",
     "Philippe"
    ]
   ],
   "title": "Influence de la similarité acoustique entre L1 et L2 dans la production des voyelles anglaises par les natifs français",
   "original": "71",
   "page_count": 8,
   "order": 85,
   "p1": 806,
   "pn": 813,
   "abstract": [
    "La langue maternelle influence la façon dont nous produisons un discours non natif, conduisant à des accents étrangers. Le modèle d’apprentissage de la parole (Flege, 1995; Flege et al., 2003) propose que la similarité acoustique entre les langues maternelle et cible est prédictive des motifs de parole non native. Cette affirmation est vérifiée à l’aide d’un apprentissage supervisé et d’une analyse acoustique pour les monophtongues anglaises produites par des francophones natifs. Les résultats montrent que les voyelles / ɪ, æ, ʌ, ʊ / sont fréquemment confondues avec les voyelles françaises. La similarité acoustique entre la catégorie phonétique des voyelles anglaises et françaises est essentielle à la production des voyelles non natives, mais la connaissances orthographiques en L1 jouent aussi un rôle important."
   ],
   "doi": "10.21437/JEP.2022-85"
  },
  "wadoux22_jep": {
   "authors": [
    [
     "Lily",
     "Wadoux"
    ],
    [
     "Nelly",
     "Barbot"
    ],
    [
     "Jonathan",
     "Chevelu"
    ],
    [
     "Damien",
     "Lolive"
    ]
   ],
   "title": "Impact du contenu phonétique sur les plongements de locuteurs pour le clonage de voix : vers l'application aux pathologies vocales",
   "original": "75",
   "page_count": 9,
   "order": 86,
   "p1": 814,
   "pn": 822,
   "abstract": [
    "Dans le domaine de la synthèse vocale, le clonage de voix correspond à la production de parole imitant la voix d'un locuteur cible, à partir de texte et d'un échantillon audio du locuteur. Les systèmes de clonage de voix se basent sur des approches neuronales de Text-to-Speech, entraînées sur de grands corpus multi-locuteurs. Couplées à des encodeurs de locuteurs, elles peuvent produire de la parole de bonne qualité avec peu de données du locuteur cible. Or, si la voix de ce locuteur est abîmée, son contenu phonétique peut être limité. À notre connaissance, l'impact de telles contraintes reste à étudier. Cet article présente les résultats d'expériences préliminaires sur le sujet, ainsi que des spécifications à propos des modèles et des données utilisées."
   ],
   "doi": "10.21437/JEP.2022-86"
  },
  "pelloin22_jep": {
   "authors": [
    [
     "Valentin",
     "Pelloin"
    ],
    [
     "Nathalie",
     "Camelin"
    ],
    [
     "Antoine",
     "Laurent"
    ],
    [
     "Renato",
     "De Mori"
    ],
    [
     "Sylvain",
     "Meignier"
    ]
   ],
   "title": "Architectures neuronales bout-en-bout pour la compréhension de la parole",
   "original": "76",
   "page_count": 10,
   "order": 87,
   "p1": 823,
   "pn": 832,
   "abstract": [
    "Dans cet article, nous nous intéressons au problème de la compréhension de la parole et à sa résolution dans le cadre d'architectures dites bout en bout. Les différentes architectures proposées, basées sur des modèles neuronaux encodeurs-décodeurs avec mécanisme d'attention permettent d'émettre des hypothèses de contenus sémantiques directement à partir des caractéristiques acoustiques. Une première architecture a été conçue afin d'extraire à la fois les mots prononcés et les concepts. Testée sur le corpus MEDIA, elle permet une réduction d'erreur en absolu de 2,8 points par rapport à l'état de l'art. Avec cette même architecture, nous proposons une configuration originale permettant d'émettre également des hypothèses sur les valeurs des concepts. Enfin, une architecture composée de plusieurs décodeurs neuronaux chaînés pour un seul encodeur est testée dans l'objectif d'enrichir le décodeur d'informations linguistiques en plus des informations acoustiques."
   ],
   "doi": "10.21437/JEP.2022-87"
  },
  "fagniart22_jep": {
   "authors": [
    [
     "Sophie",
     "Fagniart"
    ],
    [
     "Brigitte",
     "Charlier"
    ],
    [
     "Véronique",
     "Delvaux"
    ],
    [
     "Bernard",
     "Harmegnies"
    ],
    [
     "Anne",
     "Huberlant"
    ],
    [
     "Myriam",
     "Piccaluga"
    ],
    [
     "Kathy",
     "Huet"
    ]
   ],
   "title": "Développement langagier d’enfants porteurs d’implants cochléaires et normo-entendants : lien avec différents indices acoustiques de nasalité vocalique.",
   "original": "77",
   "page_count": 10,
   "order": 88,
   "p1": 833,
   "pn": 842,
   "abstract": [
    "Notre étude investigue les compétences réceptives (traitement de morphèmes grammaticaux et lexicaux), la structuration phonologique et les capacités de production du trait de nasalité acoustique, ainsi que le lien entre ces deux types de compétences, auprès d’un groupe d’enfants porteurs d’implants cochléaires et de paires normo-entendants. Les résultats montrent des compétences réceptives plus faibles, associées à davantage d’erreurs phonologiques en production, chez les enfants implantés, ainsi que des différences dans l’utilisation des différents indices acoustiques portant la nasalité vocalique, tendant à suggérer un profil perceptivo-productif davantage axé sur les indices saillants visuellement. Ces profils peuvent être mis en lien avec les compétences linguistiques, l’utilisation d’indices purement acoustiques étant associés à de meilleures performances linguistiques."
   ],
   "doi": "10.21437/JEP.2022-88"
  },
  "henrichbernardoni22_jep": {
   "authors": [
    [
     "Nathalie",
     "Henrich Bernardoni"
    ],
    [
     "Raphaël",
     "Girault"
    ],
    [
     "Hamid",
     "Yousefi-Mashouf"
    ],
    [
     "Paul",
     "Luizard"
    ],
    [
     "Laurent",
     "Orgéas"
    ],
    [
     "Lucie",
     "Bailly"
    ]
   ],
   "title": "Développement d’un banc in vitro pour la caractérisation vibratoire de plis vocaux biomimétiques et pré-déformés",
   "original": "87",
   "page_count": 8,
   "order": 89,
   "p1": 843,
   "pn": 850,
   "abstract": [
    "Pour avancer sur la compréhension physique de la parole, un banc de test a été élaboré dans uneapproche biomimétique. Il permet actuellement d’étudier le comportement vibromécanique de plisvocaux extensibles et isotropes en interaction fluide-structure. Cet article décrit les différents constituantsdu banc test et présente les premiers résultats obtenus sur des plis homogènes et isotropes.La réplique du larynx consiste en une enveloppe en silicone déformable dans laquelle des répliquesde plis vocaux extensibles peuvent être insérées pour être testées. Le matériau et les propriétésstructurelles des plis sont ajustables. Trois silicone-élastomères de rigidité différentes ont été testés,ainsi qu’un hydrogel reticulé. L’auto-oscillation des plis est contrôlée par le débit d’air en amont. Lesplis testés ont auto-oscillé sur une large gamme de débits et pour divers degrés d’étirement."
   ],
   "doi": "10.21437/JEP.2022-89"
  },
  "depaolis22_jep": {
   "authors": [
    [
     "Bianca Maria",
     "De Paolis"
    ],
    [
     "Fabian",
     "Santiago"
    ],
    [
     "Cecilia",
     "Andorno"
    ]
   ],
   "title": "Syntaxe ou prosodie? Une étude préliminaire sur l'expression de la focalisation étroite par les apprenants italophones de français L2",
   "original": "96",
   "page_count": 10,
   "order": 90,
   "p1": 851,
   "pn": 860,
   "abstract": [
    "L’expression de la structure informationnelle représente un problème pour les apprenants d’une L2. En effet, les stratégies prosodiques et syntaxiques exploitées pour organiser l’information dans la phrase ne sont pas identiques dans toutes les langues. Nous analysons un échantillon de parole élicitée afin de répertorier les moyens employés dans l’expression de la focalisation étroite chez des locuteurs natifs et non-natifs. Nous examinons si les apprenants utilisent des moyens similaires à ceux employés en français L1, et dans quelle mesure l’influence de leur L1 se manifeste dans leurs productions. Les résultats montrent que les apprenants se rapprochent de la langue cible en ce qui concerne l’emploi des marqueurs syntaxiques. Toutefois, ils produisent des patrons prosodiques différents de ceux observés dans la langue cible et dans leur L1. Cela suggère que l’acquisition de la prosodie et de la syntaxe ne se développent pas en parallèle en français L2."
   ],
   "doi": "10.21437/JEP.2022-90"
  },
  "tomashenko22_jep": {
   "authors": [
    [
     "Natalia",
     "Tomashenko"
    ],
    [
     "Salima",
     "Mdhaffar"
    ],
    [
     "Marc",
     "Tommasi"
    ],
    [
     "Yannick",
     "Estève"
    ],
    [
     "Jean-François",
     "Bonastre"
    ]
   ],
   "title": "Sur la vérification du locuteur à partir de traces d'exécution de modèles acoustiques personnalisés",
   "original": "97",
   "page_count": 10,
   "order": 91,
   "p1": 861,
   "pn": 870,
   "abstract": [
    "Les modèles acoustiques  personnalisés sont construits par entraînement à partir de données provenant d’un locuteur unique en raffinant un modèle générique. Une question importante est de savoir si l’accès à ces modèles personnalisés permet facilement de construire une attaque permettant d’identifier le locuteur associé. Ce problème est important dans le contexte de l’apprentissage fédéré de modèles pour la reconnaissance de la parole où un modèle global est appris sur un serveur à partir des modifications des paramètres des modèles reçues de plusieurs clients. Nous proposons une méthode qui consiste à construire des empreintes de ces modèles à partir des traces de leur application sur un jeu de données fixe et indépendant que nous appelons indicateur. Grâce à ces empreintes, nous développons deux modèles  d’attaques  très efficaces qui visent à inférer l’identité du locuteur."
   ],
   "doi": "10.21437/JEP.2022-91"
  },
  "zeroual22_jep": {
   "authors": [
    [
     "Chakir",
     "Zeroual"
    ],
    [
     "Abdelatif",
     "Belkadi"
    ],
    [
     "Laura",
     "Abou-Haidar"
    ]
   ],
   "title": "Effet de l’anxiété et de la motivation langagières sur le niveau de prononciation du FLE chez des universitaires marocains",
   "original": "101",
   "page_count": 10,
   "order": 92,
   "p1": 871,
   "pn": 880,
   "abstract": [
    "Pour mesurer l’anxiété et la motivation, 31 étudiants marocains (3ème année, filière Etudes Françaises, Université d’Oujda) ont rempli l’AMTB de Gardner (1985, 2010). Pour évaluer leur prononciation en FLE, ces étudiants ont lu un texte de 83 mots (projet IPFC). Leurs enregistrements ont été intégrés dans un questionnaire élaboré avec Google Form, puis envoyé à 22 juges français. Ces juges ont attribué (à distance) aux 31 étudiants un niveau de prononciation intermédiaire qui est positivement (et significativement) corrélé à la motivation, mais négativement (et significativement) corrélé à l’anxiété. Ces relations montrent que les mesures de notre méthode d’évaluation de la prononciation semblent cohérentes. Nos résultats montrent que l’anxiété langagière a l’effet prédictif le plus élevé du niveau de prononciation en FLE. Ce résultat s’accorde avec ceux de Liu & Huang (2011) qui a constaté que ce facteur a le plus d’effet, mais négatif, sur la performance en L2."
   ],
   "doi": "10.21437/JEP.2022-92"
  },
  "ito22_jep": {
   "authors": [
    [
     "Makoto",
     "Ito"
    ]
   ],
   "title": "La perception du schwa en français par les apprenants japonophones et les natifs francophones",
   "original": "104",
   "page_count": 10,
   "order": 93,
   "p1": 881,
   "pn": 890,
   "abstract": [
    "Cette recherche a pour objectif d’analyser dans quelle mesure les apprenants japonophones du français parviennent à identifier les deux variantes allophoniques d'un même mot en français, avec et sans schwa réalisé (ex: /pəti/ /pti/ ‘petit’). 10 apprenants japonophones ayant appris le français pendant moins d’une année (groupe JP-) et 15 apprenants japonophones l’ayant appris pendant plus d’une année (groupe JP+) durant leur scolarité au Japon, ainsi que 35 francophones natifs de France métropolitaine et des territoires d’outre-mer (groupe FR) ont participé à une expérience de discrimination. Les participants devaient répondre, pour chacune des 150 paires de mots présentées, si elle représentait le même mot ou deux mots différents. Le groupe FR a reconnu les deux variantes d’un même mot réel, avec et sans schwa, comme un seul mot à 78,25%, suivi des groupes JP+ et JP- à 64,57% et 47,67% respectivement."
   ],
   "doi": "10.21437/JEP.2022-93"
  },
  "gendrot22_jep": {
   "authors": [
    [
     "Cedric",
     "Gendrot"
    ],
    [
     "Emmanuel",
     "Ferragne"
    ],
    [
     "Anaïs",
     "Chanclu"
    ]
   ],
   "title": "Analyse phonétique de la variation inter-locuteurs au moyen de réseaux de neurones convolutifs : voyelles seules et séquences courtes de parole",
   "original": "27",
   "page_count": 9,
   "order": 94,
   "p1": 891,
   "pn": 899,
   "abstract": [
    "Des réseaux de neurones convolutifs ont été entraînés sur des spectrogrammes de voyelles /ɑ̃/ et de séquences aléatoires de 2 secondes extraites à partir de 45 locuteurs du corpus NCCFr afin d’obtenir une classification de ces derniers. Ces deux modèles présentent une répartition équivalente des locuteurs dans l'espace acoustique, ce qui suggère que la classification a été faite sur des critères indépendants des phonèmes précis extraits. De multiples mesures phonétiques ont été effectuées afin de tester leur corrélation avec les représentations obtenues : la f0 apparait comme le paramètre le plus pertinent, suivie par plusieurs paramètres liés à la qualité de la voix. Des zones d’activation ont été calculées a posteriori afin de montrer les zones spectrales et temporelles utilisées par le réseau. Une analyse quantitative de ces cartes d'activation a donné lieu à des représentations des locuteurs qui ne sont pas corrélées aux mesures phonétiques."
   ],
   "doi": "10.21437/JEP.2022-94"
  },
  "wu22_jep": {
   "authors": [
    [
     "Yaru",
     "Wu"
    ],
    [
     "Ivana",
     "Didirková"
    ],
    [
     "Anne-Catherine",
     "Simon"
    ]
   ],
   "title": "Disfluences en parole continue en français : paramètres prosodiques des pauses pleines et des allongements vocaliques",
   "original": "36",
   "page_count": 10,
   "order": 95,
   "p1": 900,
   "pn": 909,
   "abstract": [
    "Cette étude examine les mesures prosodiques et le débit articulatoire de deux types de disfluences en français continu:les allongements vocaliques et les pauses pleines. Un sous-ensemble du corpus LOCAS-F (≈2,5 heures) a été utilisé. Les valeurs moyennes de f0 et les intervalles mélodiques ont été analysées afin de comparer les corrélats prosodiques des disfluences par rapport aux syllabes environnantes fluentes. Le débit articulatoire est également évalué. Les résultats montrent que la f0 moyenne est plus basse dans les pauses pleines et les allongements vocaliques disfluents qu'en parole exempte de disfluences. Les pauses pleines sont produites avec une f0 plus basse que les allongements vocaliques. Des intervalles mélodiques plus importants sont observés dans les transitions entre l’unité disfluente et la syllabe précédente/suivante de cette unité, par rapport à l'intervalle mélodique entre deux syllabes fluentes. En outre, la disfluence se produit davantage dans les énoncés dont le débit articulatoire est plus bas."
   ],
   "doi": "10.21437/JEP.2022-95"
  },
  "judkins22_jep": {
   "authors": [
    [
     "Lucie",
     "Judkins"
    ],
    [
     "Charlotte",
     "Alazard"
    ],
    [
     "Corine",
     "Astésano"
    ]
   ],
   "title": "Phénomènes de groupement et pause en parole native vs non-native",
   "original": "98",
   "page_count": 10,
   "order": 96,
   "p1": 910,
   "pn": 919,
   "abstract": [
    "Cette étude concerne les phénomènes de groupement et pause (quantité, distribution, durée) en parole spontanée native (L1) et non-native (L2). Le corpus comprend les productions orales de 12 locuteurs (6 L1 anglais/ L2 français et 6 L1 français/L2 anglais). Chaque locuteur a passé deux tâches de conversation (L1 + L2). L'originalité de cette étude réside dans l’analyse intra-sujets sur l'effet L2 (comparaison L1 vs L2) et sur celui de la L1 (comparaison inter-sujets français vs anglais).Les résultats montrent un effet L2 dans les deux groupes : groupements plus courts et plus nombreux en L2, pauses voisées plus longues et plus nombreuses en L2. Mais cet effet est nuancé par la L1 puisque l'on note des différences inter-groupes : quantité et durée des groupements plus marquées dans le groupe français L1, pauses voisées plus impactées en quantité chez les anglais L1 - plus impactées en durée chez les français L1. "
   ],
   "doi": "10.21437/JEP.2022-96"
  },
  "amazouz22_jep": {
   "authors": [
    [
     "Djegdjiga",
     "Amazouz"
    ],
    [
     "Martine",
     "Adda-Decker"
    ],
    [
     "Lori",
     "Lamel"
    ]
   ],
   "title": "Variation du voisement des occlusives orales en code-switching: analyses par ABX automatique et mesures acoustiques",
   "original": "99",
   "page_count": 10,
   "order": 97,
   "p1": 920,
   "pn": 929,
   "abstract": [
    "Le code-switching (CS) est potentiellement soumis à une variation due aux changements de langues. Ce papier compare les occlusives orales du français et de l'arabe algérien par des locuteurs bilingues. L'arabe et le français ne partagent que /t,k,b,d/. Néanmoins, le bilinguisme favorise les emprunts avec [p,g] en arabe.  Les occlusives d'un corpus CS de 7h sont comparées à des occlusives monolingues. La variation est étudiée de deux manières: (i)méthode ABX  avec un alignement forcé de deux modèles acoustiques voisés et non-voisés; (ii)une mesure acoustique de v-ratio. L'approche(i) montre que pour le français, le CS varie de 7% de plus que les monolingues. L'arabe en CS possède le taux de variation le plus élevé avec 27%. Concernant /p,g/, les emprunts du français sont les plus touchés avec 30\\% de variation (méthode(i)) et un changement du v-ratio par rapport au français de 25% 13% et pour /g,p/ (méthode(ii))."
   ],
   "doi": "10.21437/JEP.2022-97"
  },
  "tillman22_jep": {
   "authors": [
    [
     "Barbara",
     "Tillman"
    ]
   ],
   "title": "Musique et langage : Effets d’amorçage rythmique sur le traitement du langage",
   "original": "tillman",
   "page_count": 3,
   "order": 98,
   "p1": 930,
   "pn": 932,
   "abstract": [
    "Des recherches en neurosciences cognitives ont révélé des similarités et des recouvrements des corrélats neuronaux et cognitifs du traitement de la musique et du langage. Certaines recherches ont focalisé sur le traitement temporel, notamment rythmique et métrique. Ces observations ont mené à la proposition de plusieurs cadres théoriques et à des hypothèses sur le fonctionnement sous-jacent, motivant ainsi des applications vers la recherche clinique. Je présenterai des recherches qui ont permis de montrer des effets bénéfiques d’une stimulation ou d’un entrainement musical, en particulier rythmique, pour améliorer le traitement langagier auprès de populations d’adultes et d’enfants à développement typique et avec des troubles développementaux du langage (notamment la dyslexie et le trouble spécifique du langage oral (dysphasie)). Une hypothèse récente défend l’intérêt d’un dépistage précoce de traitements rythmiques atypiques, indices d’un risque accru pour des troubles langagiers, et qui permettrait d’intervenir tôt afin de diminuer le déficit au cours du développement."
   ],
   "doi": "10.21437/JEP.2022-98"
  },
  "maddieson22_jep": {
   "authors": [
    [
     "Ian",
     "Maddieson"
    ]
   ],
   "title": "Le ton, est-il originel ? – Le lien musique-langage",
   "original": "12",
   "page_count": 10,
   "order": 99,
   "p1": 933,
   "pn": 942,
   "abstract": [
    "Une origine commune de la musique et du langage n'est pas une proposition nouvelle, mais a été récemment réaffirmée par Brown, entre autres. Brown postule un musilangage original évolutif qui se divise en musique (chanson) et en langue(s) à tons lexicaux (le chinois comme prototype). Les langues non tonales sont supposées avoir perdu le ton. Brown argumente du point de vue du vote majoritaire puisque «[la plupart] des langues parlées… aujourd'hui sont lexico-tonales». Cet article parcourit ce que l'on sait sur le développement du ton dans les principales familles de langues et montre que la tonogenèse est beaucoup plus souvent documentée que la perte de tons, jetant un doute sur une hypothèse de proto-tonalité. La revendication d'une majorité tonale des langues est examinée de manière critique à l'aide de plusieurs bases de données, et les problèmes méthodologiques impliqués sont discutés. Les meilleures estimations suggèrent que les langues tonales sont minoritaires."
   ],
   "doi": "10.21437/JEP.2022-99"
  },
  "vegerpaganelli22_jep": {
   "authors": [
    [
     "Christelle",
     "Veger-Paganelli"
    ],
    [
     "Claire",
     "Pillot-Loiseau"
    ]
   ],
   "title": "Caractéristiques acoustiques des voyelles parlées et chantées en langue corse : comparaison de textes interprétés en 1916 et 2020",
   "original": "50",
   "page_count": 9,
   "order": 100,
   "p1": 943,
   "pn": 951,
   "abstract": [
    "Existe-t-il des modifications acoustiques entre les voyelles parlées et chantées corses produites en 1916 et 2020 ? Sont comparés la fréquence fondamentale, les quatre premiers formants (F) et la corrélation f0/F1 de voyelles extraites de quatre textes parlés et chantés provenant de huit enregistrements anciens (de combattants corses en 1916/1917 pour une enquête ethnolinguistique et musicologique menée dans les camps de prisonniers allemands) et actuels (chanteurs corsophones). Les résultats montrent une augmentation de F1 et une diminution de F2 et F3 (ouverture mandibulaire, centralisation de l'espace vocalique et arrondissement en corse par rapport aux valeurs de référence françaises). F1 est plus élevé sur les enregistrements anciens. F2 et F3 des anciens enregistrements ne sont pas exploitables. F1 des voyelles chantées augmente par rapport à la parole. F4 diminue. Il existe une corrélation f0/F1 pour les chanteurs du centre de l'île, et une réduction de la différenciation acoustique des voyelles chantées."
   ],
   "doi": "10.21437/JEP.2022-100"
  },
  "paroni22_jep": {
   "authors": [
    [
     "Annalisa",
     "Paroni"
    ],
    [
     "Nathalie",
     "Henrich Bernardoni"
    ],
    [
     "Hélène",
     "Loevenbruck"
    ],
    [
     "Silvain",
     "Gerber"
    ],
    [
     "Pierre",
     "Baraduc"
    ],
    [
     "Christophe",
     "Savariaux"
    ]
   ],
   "title": "Etude comparative acoustique et articulatoire de la plosion entre parole et beatbox",
   "original": "102",
   "page_count": 9,
   "order": 101,
   "p1": 952,
   "pn": 960,
   "abstract": [
    "Au coeur de la pratique du Human Beatbox, les trois sons de percussion vocale kick, hi-hat et rimshot sont souvent introduits par le dévoisement des syllabes /pu/, /ti/ et /ka/ dans les débuts de l'apprentissage. Nous nous intéressons ici à comparer les caractéristiques acoustiques et articulatoires de la plosion entre ces consonnes parlées et leurs homologues beatboxés. Des séquences de répétition de ces sons produits par quatre beatboxeurs expérimentés ont été analysées. Nous montrons que la durée de la consonne est  plus courte pour les consonnes parlées que pour celles beatboxées. La plosion est plus intense en beatbox qu'en parole. Les signatures temporelles et spectrales diffèrent nettement. Si le lieu d'articulation est similaire, la dynamique articulatoire les distinguent. Ces résultats pointent du doigt le fait que, même si les beatboxers parlent et partent de sons de la parole, ils aboutissent à des mécanismes de production sonore bien différents en beatbox."
   ],
   "doi": "10.21437/JEP.2022-101"
  },
  "jin22_jep": {
   "authors": [
    [
     "Yishan",
     "Jin"
    ],
    [
     "Damien",
     "Chabanal"
    ]
   ],
   "title": "Perception et production des consonnes occlusives orales du français par des sinophones de groupes dialectaux wu et non wu",
   "original": "31",
   "page_count": 10,
   "order": 102,
   "p1": 961,
   "pn": 970,
   "abstract": [
    "Notre objectif est de comparer les performances des sinophones de groupes dialectaux wu et non wu en perception et en production vis-à-vis des occlusives du français. Après avoir effectué une tâche d’identification et une tâche de lecture oralisée de 45 paires de mots par 30 locutrices du wu et du mandarin, nous analysons les erreurs, la durée de l’occlusion, le VOT et le v-ratio. Les résultats montrent que les deux groupes sont capables de maîtriser l’opposition de voisement. Cependant, les locuteurs du wu ont une meilleure réception et production. Par ailleurs, nous remarquons une nasalisation des occlusives sonores en initiale et une production aspirée des occlusives sourdes pour les deux groupes. Nos résultats indiquent que la position médiane ne facilite pas l’apprentissage de la distinction de sonorité par les locuteurs du wu. Il semblerait qu’une longue exposition à la L2 ne permet pas une meilleure perception, mais une meilleure production."
   ],
   "doi": "10.21437/JEP.2022-102"
  },
  "schwartz22_jep": {
   "authors": [
    [
     "Jean-Luc",
     "Schwartz"
    ],
    [
     "Pierre",
     "Bessière"
    ],
    [
     "Pascal",
     "Perrier"
    ],
    [
     "Marc-Antoine",
     "Georges"
    ],
    [
     "Mamady",
     "Nabé"
    ],
    [
     "Julien",
     "Diard"
    ],
    [
     "Marie-Lou",
     "Barnaud"
    ],
    [
     "Raphaël",
     "Laurent"
    ],
    [
     "Jean-François",
     "Patri"
    ],
    [
     "Clément",
     "Moulin-Frier"
    ]
   ],
   "title": "COSMO : un modèle bayésien des fondements sensorimoteurs de la perception et de la production de la parole",
   "original": "39",
   "page_count": 9,
   "order": 103,
   "p1": 971,
   "pn": 979,
   "abstract": [
    "Nous avons développé un cadre de modélisation des processus de la communication parlée, COSMO (« Communicating Objects by Sensory-Motor Operations »), qui s’applique à la fois aux modèles de perception et de production de parole en installant les relations sensori-motrices au cœur de son programme. COSMO permet de formaliser conjointement deux cadres théoriques majeurs des recherches sur la communication parlée, les théories auditives et motrices – mais aussi de les intégrer au sein de théories perceptuo-motrices. Ceci conduit ainsi à de nouveaux modèles de perception alliant traitements auditifs et prise en compte de connaissances motrices, ou de nouveaux modèles de contrôle moteur de la parole orientés vers la réalisation de buts sensoriels multimodaux. Nous présentons ces avancées ainsi que des pistes de développement sur le traitement temporel et l’implémentation deep learning permettant d’aller vers l’apprentissage sur des données réelles."
   ],
   "doi": "10.21437/JEP.2022-103"
  },
  "baraduc22_jep": {
   "authors": [
    [
     "Pierre",
     "Baraduc"
    ],
    [
     "Coriandre",
     "Vilain"
    ]
   ],
   "title": "Retours acoustiques de la production de parole : caractérisation des différences informationnelles entre le son aérien et le son par conduction osseuse",
   "original": "72",
   "page_count": 9,
   "order": 104,
   "p1": 980,
   "pn": 988,
   "abstract": [
    "Lorsqu’on parle, le retour auditif se décompose en une voie aérienne et une voie interne ou 'par conduction osseuse’. Un locuteur entend les deux composantes, contrairement au récepteur. Alors que la moitié du signal cochléaire est interne, on connaît mal l’information qu’il véhicule et comment elle impacte le contrôle moteur oral. Dans cette étude, nous considérons le son émis par le conduit auditif pendant la production de parole comme indicateur du signal interne. Après enregistrement des signaux internes et aériens, une méthode de conversion de voix nous permet d’évaluer leurs différences informationnelles. Comme anticipé, les voyelles et consonnes nasales corrèlent avec plus d’intensité et d’information osseuse; de manière moins attendue, on observe également plus d'information osseuse pour les consonnes bilabiales et alvéolaires. De façon globale, la somme des retours acoustiques aérien et osseux amène une lisibilité supérieure des trajectoires formantiques qui pourrait faciliter le contrôle de la production de parole."
   ],
   "doi": "10.21437/JEP.2022-104"
  }
 },
 "sessions": [
  {
   "title": "Communication invitée",
   "papers": [
    "astesano22_jep"
   ]
  },
  {
   "title": "Production",
   "papers": [
    "pierrard22_jep",
    "meynadier22_jep",
    "rakotomalala22_jep"
   ]
  },
  {
   "title": "Reconnaissance Automatique de la Parole",
   "papers": [
    "le22_jep",
    "mdhaffar22_jep",
    "quintas22_jep"
   ]
  },
  {
   "title": "Communications affichées - 1",
   "papers": [
    "embarki22_jep",
    "pepiot22_jep",
    "briand22_jep",
    "lancien22_jep",
    "champion22_jep",
    "roger22_jep",
    "abuoudeh22_jep",
    "delaisroussarie22_jep",
    "fougeron22_jep",
    "glikman22_jep",
    "hirsch22_jep",
    "xi22_jep",
    "chen22_jep",
    "mariotte22_jep",
    "bodur22_jep",
    "evain22_jep",
    "charuau22_jep",
    "yoon22_jep",
    "mohammadamini22_jep",
    "bogaert22_jep",
    "chardenon22_jep",
    "larotonda22_jep"
   ]
  },
  {
   "title": "Troubles de la Parole",
   "papers": [
    "ferre22_jep",
    "delvaux22_jep",
    "rebourg22_jep",
    "vaysse22_jep"
   ]
  },
  {
   "title": "Communication invitée",
   "papers": [
    "blondel22_jep"
   ]
  },
  {
   "title": "Communications affichées - 2",
   "papers": [
    "bigot22_jep",
    "canocordoba22_jep",
    "gallitre22_jep",
    "richard22_jep",
    "smith22_jep",
    "weng22_jep",
    "hamma22_jep",
    "wottawa22_jep",
    "tranngoc22_jep",
    "guieugrandsire22_jep",
    "evain22b_jep",
    "xiao22_jep",
    "lebourdais22_jep",
    "hutin22_jep",
    "abderrazek22_jep",
    "guan22_jep",
    "laperriere22_jep",
    "guillaume22_jep",
    "cordier22_jep",
    "degand22_jep",
    "gelin22_jep",
    "noe22_jep",
    "marchand22_jep",
    "lalain22_jep",
    "li22_jep"
   ]
  },
  {
   "title": "Geste, Rythme",
   "papers": [
    "ferre22b_jep",
    "contrerasroa22_jep",
    "rohrer22_jep"
   ]
  },
  {
   "title": "Archives",
   "papers": [
    "ferragne22_jep",
    "joseph22_jep",
    "barkatdefradas22_jep"
   ]
  },
  {
   "title": "Communication invitée",
   "papers": [
    "dalessandro22_jep"
   ]
  },
  {
   "title": "Locuteur",
   "papers": [
    "nourtel22_jep",
    "bonastre22_jep",
    "girin22_jep"
   ]
  },
  {
   "title": "Apprentissage & Acquisition L1/L2",
   "papers": [
    "goeseels22_jep",
    "boram22_jep",
    "dodane22_jep",
    "fino22_jep"
   ]
  },
  {
   "title": "Communications affichées - 3",
   "papers": [
    "martin22_jep",
    "crouzet22_jep",
    "cattan22_jep",
    "alazard22_jep",
    "caillol22_jep",
    "lara22_jep",
    "dalessandro22b_jep",
    "miras22_jep",
    "kim22_jep",
    "lenglet22_jep",
    "vegarodriguez22_jep",
    "guan22b_jep",
    "wadoux22_jep",
    "pelloin22_jep",
    "fagniart22_jep",
    "henrichbernardoni22_jep",
    "depaolis22_jep",
    "tomashenko22_jep",
    "zeroual22_jep",
    "ito22_jep"
   ]
  },
  {
   "title": "Variation & Disfluences",
   "papers": [
    "gendrot22_jep",
    "wu22_jep",
    "judkins22_jep",
    "amazouz22_jep"
   ]
  },
  {
   "title": "Communication invitée",
   "papers": [
    "tillman22_jep"
   ]
  },
  {
   "title": "Musique, Rythme, Langage",
   "papers": [
    "maddieson22_jep",
    "vegerpaganelli22_jep",
    "paroni22_jep"
   ]
  },
  {
   "title": "Production / Perception",
   "papers": [
    "jin22_jep",
    "schwartz22_jep",
    "baraduc22_jep"
   ]
  }
 ],
 "doi": "10.21437/JEP.2022"
}