{
 "title": "LARYNX 1997",
 "location": "Marseille, France",
 "startDate": "16/6/1997",
 "endDate": "18/6/1997",
 "conf": "Larynx",
 "year": "1997",
 "name": "larynx_1997",
 "series": "",
 "SIG": "",
 "title1": "LARYNX 1997",
 "date": "16-18 June 1997",
 "papers": {
  "fourcin97_larynx": {
   "authors": [
    [
     "Adrian",
     "Fourcin"
    ]
   ],
   "title": "The larynx signal: aspects of production and perception",
   "original": "lar7_001",
   "page_count": 9,
   "order": 1,
   "p1": "1",
   "pn": "10",
   "abstract": [
    "The two main aims of this brief discussion of the larynx signal are to: use continous speech as the basis of measurement rather than to rely solely on sustained voice tokens base quantitative appraisal on the use of unsmoothed larynx period by period analyses These approaches may help to make it feasible to examine patterned structures of voice activity which are otherwise difficult to discern. Particular examples are given of the application of these methods to normal and pathological speech in regard to range, regularity and an aspect of voice quality.\n",
    ""
   ]
  },
  "hammarberg97_larynx": {
   "authors": [
    [
     "Britta",
     "Hammarberg"
    ]
   ],
   "title": "Perceptual evaluation of dysphonic voices",
   "original": "lar7_011",
   "page_count": 8,
   "order": 2,
   "p1": "11",
   "pn": "18",
   "abstract": [
    "Cette présentation porte sur la définition et la description des critères régissant la qualité de la voix ainsi que leurs techniques d'évaluation. Un accent particulier est porté sur les techniques d'évaluation perceptuelles à travers deux études offrant des perspectives prometteuses. La première a pour référence le Modèle d'évaluation de la voix de Stockolm corélé avec des mesures acoustiques. La seconde porte sur l'amélioration de la procédure d'évaluation perceptive grâce à l'utilisation d'une base de données et de modifications spectrales par filtrage sur différentes qualités de voix.\n",
    ""
   ]
  },
  "crevierbuchman97_larynx": {
   "authors": [
    [
     "L.",
     "Crevier-Buchman"
    ],
    [
     "O.",
     "Laccourreye"
    ],
    [
     "M. C.",
     "Monfrais-Pfauwadel"
    ],
    [
     "C.",
     "Pillot"
    ],
    [
     "C.",
     "Tessier"
    ],
    [
     "Z.",
     "Brasnu"
    ]
   ],
   "title": "Speech evaluation after supracricoid partial laryngectomy: preliminary results",
   "original": "lar7_019",
   "page_count": 2,
   "order": 3,
   "p1": "19",
   "pn": "20",
   "abstract": [
    "Data documenting speech after supracricoid partial laryngectomy (SCPL) with cricohyoidoepiglottopexy (CHEP) are scarce in the English language literature. Furthermore, the reported studies [1,2] only concerned the frequential and temporal acoustic parameters of voice after SCPL. The present perceptual evaluation was designed as an attempt to investigate the speech of ten patients after SCPL over the first six postoperative months.\n",
    ""
   ]
  },
  "doskov97_larynx": {
   "authors": [
    [
     "D.",
     "Doskov"
    ],
    [
     "T.",
     "Hadjieva"
    ]
   ],
   "title": "Objective voice analysis after radiotherapy for early glottic cancer",
   "original": "lar7_021",
   "page_count": 4,
   "order": 4,
   "p1": "21",
   "pn": "24",
   "abstract": [
    "Radiotherapy has become a treatment of choice for early glottic cancer. It is so because providing long term tumour control [1] it preserves vocal function [2]. Patients' resocialißation and reintegration after treatment rely on the restored voice quality. Routine classical diagnostic methods as indirect laryngoscopy and laryngostroboscopy give the necessary information, but they are insufficient for a precise vocal function analysis and the dynamic follow-up. Specific methods were introduced for this purpose during the last decade ( phonetography, sonography, computer voice analysis) which enable an objective quantitative assessment of the degree of dysphony. Our investigation aimed the possibilities for an objective vocal function evaluation regarding patients who have undergone either radiotherapy or partial laryngeal resection as a curative treatment for early glottic cancer.\n",
    ""
   ]
  },
  "morsomme97_larynx": {
   "authors": [
    [
     "D.",
     "Morsomme"
    ],
    [
     "A.",
     "Orban"
    ],
    [
     "M.",
     "Remacle"
    ],
    [
     "J.",
     "Jamart"
    ]
   ],
   "title": "Comparison of a vibrato study by a panel of judges and spectral voice analyser",
   "original": "lar7_025",
   "page_count": 4,
   "order": 5,
   "p1": "25",
   "pn": "28",
   "abstract": [
    "Cet exposé porte sur la comparaison entre l'évaluation perceptive d'un jury et la mesure acoustique objective du vibrato chez le chanteur. Trois juges experts en voix chantée ont évalué le vibrato de trente chanteurs à travers plusieurs critères sur une échelle à cinq niveaux. Une mesure de six paramètres acoustiques a été effectuée au moyen du logiciel MDVP. Une étude de cohérence intra et inter juges ainsi que des corrélations avec les mesures acoustiques sont présentées.\n",
    ""
   ]
  },
  "verdonckdeleeuw97_larynx": {
   "authors": [
    [
     "Irma M.",
     "Verdonck-de Leeuw"
    ],
    [
     "Florien J.",
     "Koopmans-van Beinum"
    ],
    [
     "Frans J. M.",
     "Hilgers"
    ],
    [
     "Ronald",
     "Keus"
    ]
   ],
   "title": "The development of an instrument to analyse voice quality of male patients with early glottic cancer",
   "original": "lar7_029",
   "page_count": 4,
   "order": 6,
   "p1": "29",
   "pn": "32",
   "abstract": [
    "La qualité de la voix a été évaluée par des analyses perceptuelles et acoustiques et par une analyse stroboscopique des cordes vocales. Les résultats démontrent des corrélations entres les analyses perceptuelles, acoustiques et strobos-copiques qui sont moyennes à bonnes. En outre, l'âge a un effet négatif sur les résultats des analyses perceptuelles et acoustiques, aussi bien chez les malades que chez les contrôles; \"stripping\" au lieu d'une biopsie des cordes vocales, une dose de radiothérapie plus élevée, fumer après le traitement sont aussi des factors négatifs pour les résultats stroboscopiques.\n",
    ""
   ]
  },
  "lindsey97_larynx": {
   "authors": [
    [
     "L. A.",
     "Lindsey"
    ],
    [
     "C.",
     "Watson"
    ],
    [
     "M. N.",
     "Vieira"
    ],
    [
     "A. G. D.",
     "Maran"
    ]
   ],
   "title": "The edinburgh voice clinic manager - a practical multimedia acquisition and data base management system for the voice clinic",
   "original": "lar7_033",
   "page_count": 4,
   "order": 7,
   "p1": "33",
   "pn": "36",
   "abstract": [
    "Un service moderne d'observation de la voix procède pour notre compte à toute une série de mesures et d'observations de la voix pathologique, y compris une analyse acoustique, une électroglottographie et une stroboscopie vidéo. Nous avons donc, à cette fin, développé un système intégré, adapté à l'analyse acoustique et électroglottographique, ainsi qu'à la capture d'images vidéo fixes. Les résultats sont automatiquement stockés, en tant qu'informations électroniques sur les patients, dans une base de données.\n",
    ""
   ]
  },
  "schoentgen97_larynx": {
   "authors": [
    [
     "Jean",
     "Schoentgen"
    ],
    [
     "Fabrizio",
     "Bucella"
    ]
   ],
   "title": "Acoustic analysis of dysphonic voices: descriptors and methods",
   "original": "lar7_037",
   "page_count": 10,
   "order": 8,
   "p1": "37",
   "pn": "46",
   "abstract": [
    "The theory of phonatory settings suggests that laryngeal pathologies become apparent in speech when they remove from their normal ranges one or several features of phonatory quality. Examples of relevant acoustic phenomena are additive noise due to turbulence, jitter of the glottis signal, shimmer, the spectral slope of the voice source signal, the frequencies and bandwidths of the formants, the regularity of voicing, and the range of intonation, etc. One of the goals of the study of speech produced by dysphonic speakers is the discovery of numerical attributes of the speech signal that are responsive to gradual changes in these acoustic phenomena with the link between attributes and phenomena being ideally one-to-one. A possible clinical application is the monitoring of patients' voices during treatment.\n",
    ""
   ]
  },
  "mergell97_larynx": {
   "authors": [
    [
     "P.",
     "Mergell"
    ],
    [
     "H.",
     "Herzel"
    ],
    [
     "T.",
     "Wittenberg"
    ],
    [
     "M.",
     "Tigges"
    ],
    [
     "Ulrich",
     "Eysholdt"
    ]
   ],
   "title": "Quantitative laryngoscopy combining high speed glottography and nonlinear dynamics",
   "original": "lar7_047",
   "page_count": 4,
   "order": 9,
   "p1": "47",
   "pn": "50",
   "abstract": [
    "Digital high speed glottography has been combined with nonlinear dynamics to extract essential parameters and features of complex phonatory mechanisms. We present three examples of quantitative laryngoscopy: the phonation onset and two cases of biphonation, one caused by a unilateral recurrent nerve paralysis and another induced by the strong interaction between the first vocal tract resonance and the vocal fold oscillations.\n",
    ""
   ]
  },
  "plante97_larynx": {
   "authors": [
    [
     "K.",
     "Plante"
    ],
    [
     "S.",
     "Salian"
    ],
    [
     "J.",
     "Scholder"
    ],
    [
     "B. M. G.",
     "Cheetham"
    ],
    [
     "J.",
     "Earis"
    ]
   ],
   "title": "Inverse filtering of voiced sounds for the study of laryngeal disease",
   "original": "lar7_051",
   "page_count": 4,
   "order": 10,
   "p1": "51",
   "pn": "54",
   "abstract": [
    "Dans cette étude, nous présentons quelques résultats sur l'amélioration du filtrage inverse pour l'évaluation de la voix rauque. Une méthode basée sur une estimation adaptative du conduit vocal (AIF) est comparée avec la prédiction linéaire (LP). Les deux paramètres acoustiques utilisés pour séparer les voix normales des voix rauques sont le Jîtter et le GNE. Le Jittèr permet une meilleur séparation quand il est calculé sur le résidue obtenu avec la prédiction linéaire. Le GNE, par contre, est meilleur avec la méthode AIF.\n",
    ""
   ]
  },
  "boyanov97_larynx": {
   "authors": [
    [
     "B.",
     "Boyanov"
    ],
    [
     "S.",
     "Hadjitodorov"
    ],
    [
     "Bernard",
     "Teston"
    ],
    [
     "D.",
     "Doskov"
    ]
   ],
   "title": "Robust hybrid pitch detector for pathological voice analysis",
   "original": "lar7_055",
   "page_count": 4,
   "order": 11,
   "p1": "55",
   "pn": "58",
   "abstract": [
    "A hybrid pitch period (To) detector characterized by parallel analyses of the speech signal in temporal, spectral and cepstral domains and preprocessing for periodic/aperiodic(unvoiced) separation (PAS) is proposed. The preprocessing is realized by analyses in these three domains and PAS by multilayer perceptron neural network. To evaluation is carried out by analyses in: 1. Time domain 1.1 Preprocessing by adaptive central clipping (ACC). 1.2. Calculation of the short-term autocorrelation function (Rst(T)) 1.3. Calculation of To by analysis of the distances between the maximas in Rst(t) - LADM. 2. Spectral domain: 2.1. Spectral ACC. 2.2. Calculation of Rst(x) over the power and logarithmic spectra. 2.3. To detection by LADM. 3. Cepstral domain: 3.1. Littering the cepstra to eliminate the formant structure. 3.2 Calculation of Rst(x). 3.3. To detection by LADM. Final To evaluation by a logical analysis of the results from the three domains. EXPERIMENTS Two phonations of the vowel \"a\" of 40 speakers and 62 patients were analyzed. For the proposed detector errors were significantly minimized.\n",
    ""
   ]
  },
  "titze97_larynx": {
   "authors": [
    [
     "Ingo R.",
     "Titze"
    ]
   ],
   "title": "Laryngeal mathematical modeling and pathophysiologic implications",
   "original": "lar7_059",
   "page_count": 6,
   "order": 12,
   "p1": "59",
   "pn": "64",
   "abstract": [
    "A summary and historical sketch of mathematical modeling of laryngeal function in phonation is given. First, the one-mass, two-mass, and multi-mass models are reviewed. The finite element approach is then described that solves the vibrational problem in terms of continuum mechanics. The result is a complete computation of the motion of vocal fold tissue, glottal air, and acoustic waves in the vocal tract. An update is given to show how complex vocal fold models (as well as simplified two or three mass models) can be used to predict the acoustic result of some vocal pathologies.\n",
    ""
   ]
  },
  "lindsey97b_larynx": {
   "authors": [
    [
     "L. A.",
     "Lindsey"
    ],
    [
     "M. N.",
     "Vieira"
    ]
   ],
   "title": "Modulation analysis - a new method for modelling and measurement of both the production and perception of vocal fold cycle perturbation",
   "original": "lar7_065",
   "page_count": 4,
   "order": 13,
   "p1": "65",
   "pn": "68",
   "abstract": [
    "Nous présentons une nouvelle méthode de modélisation et de mesure de la perturbation du pli des cordes vocales. Celle-ci est basée sur la mesure des spectres de modulation d'amplitude (MA) et de fréquence (MF) des voyelles continues. Il existe un rapport entre lfindex de modulation MA et MF. Il sembl- erait que ce fait corresponde à un modèle représentant AM et MF comme un ensemble orthogonal. Nous démontrons également que le type et la vitesse de modulation affectent la perception de la dureté des voyelles continues.\n",
    ""
   ]
  },
  "demolin97_larynx": {
   "authors": [
    [
     "D.",
     "Demolin"
    ],
    [
     "A.",
     "Giovanni"
    ],
    [
     "S.",
     "Hassid"
    ],
    [
     "C.",
     "Heim"
    ],
    [
     "V.",
     "Lecuit"
    ],
    [
     "A.",
     "Soquet"
    ]
   ],
   "title": "Direct and indirect measurements of subglottic pressure",
   "original": "lar7_069",
   "page_count": 4,
   "order": 14,
   "p1": "69",
   "pn": "72",
   "abstract": [
    "Nous présentons ici une expérience de mesure simultanée de pression sous-glottique et intra-orale au moyen d'une perforation trachéale. Le but de cet expérience est d'observer les relations entre la pression sous-glottique et intra-orale lors de la production des occlusives du français.\n",
    ""
   ]
  },
  "wuyts97_larynx": {
   "authors": [
    [
     "F. L.",
     "Wuyts"
    ],
    [
     "P. K. Van de",
     "Heyning"
    ],
    [
     "M. De",
     "Bodt"
    ],
    [
     "L.",
     "Heylen"
    ],
    [
     "M.",
     "Remacle"
    ]
   ],
   "title": "Dysphonia severity index: a multiparameter approach for the assessment of voice quality",
   "original": "lar7_073",
   "page_count": 4,
   "order": 15,
   "p1": "73",
   "pn": "76",
   "abstract": [
    "We here present an index which can be regarded as an objective measure of dysphonia. This index called the Dysphonia Severity Index (DSI), is based upon the combination of several complementary voice quality measurements. It is constructed by means of multivariate statistical methods. The more the index for a patient is negative, the more his vocal performance worsens. The DSI quantifies the subjective perception of the voice of a patient, and is especially useful for the evaluation of therapy for patients suffering from vocal fold pathologies.\n",
    ""
   ]
  },
  "watson97_larynx": {
   "authors": [
    [
     "C.",
     "Watson"
    ],
    [
     "A. G. D.",
     "Maran"
    ]
   ],
   "title": "Realistic and non realistic expectations for some routine objective measurements in the ENT voice clinic",
   "original": "lar7_077",
   "page_count": 4,
   "order": 16,
   "p1": "77",
   "pn": "82",
   "abstract": [
    "The expectation exists that the processes of the ENT voice clinic may be enhanced by routine instrumental qualification of laryngeal phonatory function. Objective data collection by a running hospital service is constrained by functional criteria. In addition the data must be of clinical value.\n",
    "In Edinburgh Royal Infirmary voice clinic each patient interview seeks to be completed in 20 minutes with only 5 minutes available for objective measurements. Rationalisation is necessary. Objective data is accumulated under computer management of the clinic. A single sustained /ae/ vowel is used for acoustic measurements and a single hummed tone is used for electroglottograph (EGG) measurements.\n",
    "The quality of the measured results is still fundamentally defined by the clinician's subjective evaluation of the patient's potential voice quality. The patient is challenged to phonate at the highest quality possible at an arbitrary middle speech pitch and arbitrary intensity by subjective judgement.\n",
    "The aim is not to establish voice quality by measurement nor to indicate a specific pathology by measurement but to identify the manner and degree of the functional deterioration caused by pathology or dysphonia and over its course to cure. The objective measures are being carried out in order to evaluate the mechanical functional performance of the larynx and the impact of clinical intervention.\n",
    "The emphasis is upon association with a functional model. This is what the ENT surgeon requires to understand the functional implications of phonosurgery.\n",
    "This paper presents some objective data accumulated within a six month segment of the Royal Infirmary of Edinburgh voice clinic database (CLINDAT). In order to discuss this data it will help to describe a functional model for the phonating larynx.\n",
    ""
   ]
  },
  "bleakley97_larynx": {
   "authors": [
    [
     "C. J.",
     "Bleakley"
    ]
   ],
   "title": "Improved algorithms for automatic estimation of the glottal waveform",
   "original": "lar7_083",
   "page_count": 4,
   "order": 17,
   "p1": "83",
   "pn": "86",
   "abstract": [
    "This paper proposes enhancements to the Closed Phase Inverse Filtering (CPIF) [1], Iterative Adaptive Inverse Filtering (IAIF) [2] and LF [3] fitting algorithms for the automatic estimation of the glottal waveform from the speech signal. The paper compares the performance of these algorithms and provides statistics on the dynamics of the glottal waveform during non-pathological speech.\n",
    ""
   ]
  },
  "dalessandro97_larynx": {
   "authors": [
    [
     "Christophe",
     "d'Alessandro"
    ],
    [
     "Boris",
     "Doval"
    ]
   ],
   "title": "Spectral representation and modelling of glottal flow signals",
   "original": "lar7_087",
   "page_count": 4,
   "order": 18,
   "p1": "87",
   "pn": "90",
   "abstract": [
    "Nous présentons à cet atelier de recherche nos travaux récents sur la modélisation du signal de débit glottique. Un modèle du signal comprenant une composante périodique (liée à la vibration quasipériodique des cordes vocales) et une composante apériodique (liée aux bruit d'aspiration, de frication, aux irrégularités de la vibration des cordes vocales) est considéré. Un algorithme de décomposition périodique-apériodique est présenté, ainsi que son évaluation. Un modèle spectral linéaire du débit glottique périodique est proposé, et on montre son utilité pour estimer les paramètres perceptivement pertinents de la source. Ces travaux, conçus au départ pour la synthèse de parole peuvent s'appliquer à d'autres domaines, comme l'étude des pathologies vocale ou de la voix chantée.\n",
    ""
   ]
  },
  "marasek97_larynx": {
   "authors": [
    [
     "Krzysztof",
     "Marasek"
    ],
    [
     "Manfred",
     "Pützer"
    ]
   ],
   "title": "Electroglottographical differentiation of pathological voice qualities",
   "original": "lar7_091",
   "page_count": 4,
   "order": 19,
   "p1": "91",
   "pn": "94",
   "abstract": [
    "In this study, comparative electroglottographic (EGG) measurements of the sustained vowels /i:/, /a.7 and /u:/ produced by five different speaker groups were carried out. The shapes and durations of vocal folds contact phases during each pitch period were used for parametrization of the signals. The mean and standard deviation of the parameters were used for voice quality assessment. The parametrized data were analysed statistically with respect to speaker group and vowel quality. The results of the statistical analysis lead to the conclusion that the steepness of the glottal closing and opening phases and the relative durations of open (no contact between vocal folds), opening and closed (maximal contact) phases are the most important parameters for differentiating voice qualities. The open phase duration and the durations of closing and opening phases were also good indicators of the group a speaker belonged to.\n",
    ""
   ]
  },
  "vescovi97_larynx": {
   "authors": [
    [
     "Christophe",
     "Vescovi"
    ],
    [
     "Eric",
     "Castelli"
    ]
   ],
   "title": "Control of a modified two-mass model for anthropomorphic synthesis",
   "original": "lar7_095",
   "page_count": 4,
   "order": 20,
   "p1": "95",
   "pn": "98",
   "abstract": [
    "Cet article présente une méthode d'inversion d'un modèle à deux masses modifié des cordes vocales. La méthode est ici appliquée à diffèrent types de signaux de parole où des trajectoires de commande de notre modèle sont extraites à partir d'indices acoustiques. Ces premiers résultats indiquent que l'inversion fournit des trajectoires de commandes physiologiquement cohérentes qui pourront servir de base à l'élaboration de règles pour un synthétiseur de parole basé sur une modélisation anthropomorphique de l'appareil phonatoire.\n",
    ""
   ]
  },
  "mahieu97_larynx": {
   "authors": [
    [
     "H. F.",
     "Mahieu"
    ],
    [
     "J.",
     "Algaba"
    ],
    [
     "A. D.",
     "Cheesman"
    ],
    [
     "A. S.",
     "Dagli"
    ],
    [
     "D.",
     "Dehesdin"
    ],
    [
     "M.",
     "Remacle"
    ],
    [
     "N. Santiago",
     "Silva"
    ],
    [
     "H. K.",
     "Schutte"
    ],
    [
     "I. F.",
     "Herrmann"
    ],
    [
     "A.",
     "Staffieri"
    ],
    [
     "L.",
     "Traissac"
    ],
    [
     "A.",
     "Parker"
    ],
    [
     "C. A.",
     "Meeuwis"
    ]
   ],
   "title": "Tracheo-esophageal voice after laryngectomy (BIOMED 1- BMT concerted action 94-1611)",
   "original": "lar7_099",
   "page_count": 5,
   "order": 21,
   "p1": "99",
   "pn": "104",
   "abstract": [
    "Laryngeal and pharyngeal cancers are by far the most frequent occuring cancers in the upper airway and digestive tract. Reported incidences in Europe vary between 11.4 per 100.000 inhabitants (Spain, Italy) and less than half that number in Denmark and the Netherlands. Between 5 to 20% of these cancers will require treatment with total laryngectomy, depending upon etiological background (e.g. smoking and drinking) and treatment protocols (e.g. radiotherapy vs surgery).\n",
    ""
   ]
  },
  "as97_larynx": {
   "authors": [
    [
     "Corina J. van",
     "As"
    ],
    [
     "Frans J. M.",
     "Hilgers"
    ],
    [
     "Florien J.",
     "Koopmans-van Beinum"
    ],
    [
     "Annemieke H.",
     "Ackerstaff"
    ]
   ],
   "title": "The influence of stoma occlusion on aspects of tracheoesophageal speech",
   "original": "lar7_105",
   "page_count": 4,
   "order": 22,
   "p1": "105",
   "pn": "108",
   "abstract": [
    "Une évaluation vocale a été effectuée chez 21 patients laiyngectomisés (porteurs d'une prothèse phonatoire). L'obturation du trachéostome était soit directe a l'aide de doigt, soit par un échangeur de chaleur et d'humidité (Provox® Stomafilter). Pour chacun de ces deus méthodes, les analyses acoustiques étaient effectuées, le temps maximal de phonation était enregistré et un phonétogramme était réalisé. Aucune différence statistique significative au niveau des paramètres acoustiques n'a été établie. Cependant, le temps maximal de phonation était prolongé de façon significative et la dynamique d'intensité était notoirement plus large en obturant le trachéostome par le Stomafilter.\n",
    ""
   ]
  },
  "belloc97_larynx": {
   "authors": [
    [
     "J. B.",
     "Belloc"
    ],
    [
     "Jacqueline",
     "Vaissière"
    ],
    [
     "D.",
     "Brasnu"
    ]
   ],
   "title": "Identification of consonants in tracheo-esophageal speech (phonatory implant)",
   "original": "lar7_109",
   "page_count": 5,
   "order": 23,
   "p1": "109",
   "pn": "114",
   "abstract": [
    "This study is about identification of French tracheo-esophageal consonants which has not been not well studied in the past [1,2]. In the first part, the study concerns 3 reeducated patients using tracheo-esophageal voice (phonatory implant). In the second part, voicing is studied, comparing confusions before and after reeducation. These confusions are then confrontated to the acoustic features of some consonants concerned by confusions.\n",
    ""
   ]
  },
  "vaissiere97_larynx": {
   "authors": [
    [
     "Jacqueline",
     "Vaissière"
    ]
   ],
   "title": "Phonological use of the larynx",
   "original": "lar7_115",
   "page_count": 11,
   "order": 24,
   "p1": "115",
   "pn": "126",
   "abstract": [
    "The larynx is one of the main articulators in speech production, with the tongue root, the tongue body, the tongue blade, the velum and the lips. The goal of this tutorial is to review succinctly the different uses of the larynx for communicative purposes. The first part concerns the segmental use of the larynx: (i) the phonation types for differentiating consonants and vowels, (ii) the larynx as a place of articulation for the glottal consonants* and (iii) the initiation of airstream in glottalic consonants. The second part concerns the nonsegmental (prosodic) use: the participation of the larynx for contrasting higher linguistic units such as words, phrases and sentences (tone, accent and intonation ). The third part tackles the problem of the larynx used as a carrier of paralinguistic information.\n",
    ""
   ]
  },
  "jessen97_larynx": {
   "authors": [
    [
     "Michael",
     "Jessen"
    ],
    [
     "Krzysztof",
     "Marasek"
    ]
   ],
   "title": "Voice quality correlates of word stress and tense versus lax vowels in German",
   "original": "lar7_127",
   "page_count": 4,
   "order": 25,
   "p1": "127",
   "pn": "130",
   "abstract": [
    "L'accentuation et la tension des voyelles allemandes ont été variées indépendamment l'une de l'autre et produites par 10 sujets. Le signal acoustique fut synchronisé et enregistré simultanément avec le signal électroglottographique. À l'aide des paramètres spectraux mesurés et à l'aide des mesures effectuées sur le signal électroglottographique il a pu être prouvé que l'accentuation et, à un degré moindre, la tension se manifestent dans la qualité du cycle vibratoire de la glotte.\n",
    ""
   ]
  },
  "roubeau97_larynx": {
   "authors": [
    [
     "B.",
     "Roubeau"
    ],
    [
     "J. P.",
     "Lefaucheur"
    ],
    [
     "A.",
     "Moine"
    ],
    [
     "J. Lacan St",
     "Guily"
    ]
   ],
   "title": "Laryngeal evoked responses to superior laryngeal nerve stimulation in porcine model",
   "original": "lar7_131",
   "page_count": 1,
   "order": 26,
   "p1": "131",
   "pn": "132",
   "abstract": [
    "La stimulation électrique du nerf laryngé supérieur (NLS) permet de déclencher une réponse musculaire des muscles crico- thyroïdiens (CT) et thyroarythénoïdiens (TA). Nous avons enregistré l'activité électromyographique de ces muscles en réponse à la stimulation des NLS droit et gauche chez le cochon anesthésié. L'intensité de la stimulation était augmentée progressivement afin d'étudier la persistance des réponses. On observe d'une part des réponses directe et réflexe du CT ipsilatéral et d'autre part des réponses réflexes des TA ipsi et controlatéraux. L'amplitude et le délai avec lesquels les réponses réflexes sont obtenues dépendent du côté de la stimulation et dans une moindre mesure, de celui de la réponse. La différence de longueur entre les deux nerfs récurrents ne peut expliquer cette différence et donc la voie afférente semble être principalement responsable de cette dissymétrie.\n",
    ""
   ]
  },
  "crevierbuchman97b_larynx": {
   "authors": [
    [
     "L.",
     "Crevier-Buchman"
    ],
    [
     "O.",
     "Laccourreye"
    ],
    [
     "C.",
     "Tessier"
    ],
    [
     "F. le",
     "Pimpec-Barthes"
    ],
    [
     "M.",
     "Riquet"
    ],
    [
     "D.",
     "Brasnu"
    ]
   ],
   "title": "Intracordal autologous fat injection for unilateral inferior laryngeal nerve paralysis after pneumonectomy",
   "original": "lar7_133",
   "page_count": 2,
   "order": 27,
   "p1": "133",
   "pn": "134",
   "abstract": [
    "Une évaluation des résultats fonctionnels après injection intracordale de graisse autologue, chez neuf patients ayant une paralysie récurrentielle gauche à la suite d'une pneumonectomie pour carcinome, est présentée. L'évaluation a porté sur la dysphonie et la qualité de la toux avant et un mois après Finjection de graisse. Tous les paramètres sont améliorés en post-opératoire, permettant un meilleur confort dévie.\n",
    ""
   ]
  },
  "vaxelaire97_larynx": {
   "authors": [
    [
     "Béatrice",
     "Vaxelaire"
    ],
    [
     "Rudolph",
     "Sock"
    ]
   ],
   "title": "The larynx and speech rate - an x-ray investigation of its vertical movement",
   "original": "lar7_135",
   "page_count": 4,
   "order": 28,
   "p1": "135",
   "pn": "138",
   "abstract": [
    "Cette étude porte sur la production de séquences VCV avec une attention particulière sur le déplacement de l'ensemble larynx-os hyoïde. Les données einéradiographiques obtenues pour deux locuteurs en deux vitesses d'élocution montrent : qu'il existe une corrélation entre le déplacement vertical du larynx et celui de l'os hyoïde ; que la position du larynx est plus basse pour les voyelles dites fermées par rapport à leurs homologues ouvertes ; que le larynx a une position plus haute en vitesse d'élocution rapide. La variation de la vitesse d'élocution permet de mettre à jour les trajectoires laryngales les plus robustes dans la production de telles séquences.\n",
    ""
   ]
  },
  "boyanov97b_larynx": {
   "authors": [
    [
     "B.",
     "Boyanov"
    ],
    [
     "S.",
     "Hadjitodorov"
    ],
    [
     "Bernard",
     "Teston"
    ],
    [
     "D.",
     "Doskov"
    ]
   ],
   "title": "Software system for pathological voice analysis",
   "original": "lar7_139",
   "page_count": 4,
   "order": 29,
   "p1": "139",
   "pn": "142",
   "abstract": [
    "A software system (SSPVA) for pathological voice analysis using only the resources of a personal computer is proposed. The SSPVA is written on the basis of specific methods and algorithms for pathological voice analysis and allows evaluation of: 1) Pitch period (To); 2) Degree of unvoiceness; 3) Pitch perturbation and amplitude perturbation quotients; 4) Degree of stability of To generation; 5) Degree of dissimilarity of the shapes of pitch pulses; 6) Ratio {energy in the cepstral pitch pulse}-to-{total cepstral energy}; 7) Harmonics-to-noise ratio; 8) Degree of hoarseness; 9) Ratio low-to-high frequency energies; 10) Glottal amplitude quotient.\n",
    ""
   ]
  },
  "revis97_larynx": {
   "authors": [
    [
     "Joana",
     "Revis"
    ],
    [
     "Danièle",
     "Robert"
    ],
    [
     "Marie-Dominique",
     "Guarella"
    ],
    [
     "Antoine",
     "Giovanni"
    ]
   ],
   "title": "Preliminary report of an objective evaluation of the results of microphonosurgery by the mean of simultaneous acoustical and aerodynamical measurements",
   "original": "lar7_143",
   "page_count": 4,
   "order": 30,
   "p1": "143",
   "pn": "146",
   "abstract": [
    "Les auteurs ont testé un protocole de mesures objectives (jitter, shimmer, débit d'air buccal moyen) réalisées sur des voyelles tenues pour l'évaluation du résultat d'interventions de microphonochirurgie. Le résultat était évalué par un jury d'experts sur une échelle analogique visuelle. Après normalisation, cette méthode a été considérée comme la méthode de référence. La corrélation du choix de mesures objectives avec cette méthode donnait un coefficient de détermination (r2) de 0.65 (p=0.026) avec une importante signification de la mesure du débit d'air moyen. Les tests de discrimination utilisant l'ensemble des paramètres mesurés permettait de retrouver le classement par le jury dans 88% des cas.\n",
    ""
   ]
  },
  "jessen97b_larynx": {
   "authors": [
    [
     "Michael",
     "Jessen"
    ]
   ],
   "title": "A transillumination study of the opposition between voiced and voiceless consonants in German",
   "original": "lar7_147",
   "page_count": 4,
   "order": 31,
   "p1": "147",
   "pn": "150",
   "abstract": [
    "L'ouverture glottale des obstruents allemands a été observée avec la méthode de transillumination. Les résultats montrent que les obstruents sourds sont réalisés avec une grande ouverture glottale, tandis que les obstruents sonores se réalisent avec une ouverture glottale très réduite. Certains indices indiquent que les ouvertures glottales réduites ne sont pas le résultat d'activité musculaire, mais sont dues à des facteurs aérodynamiques.\n",
    ""
   ]
  }
 },
 "sessions": [
  {
   "title": "Table of Contents and Access to Abstracts",
   "papers": [
    "fourcin97_larynx",
    "hammarberg97_larynx",
    "crevierbuchman97_larynx",
    "doskov97_larynx",
    "morsomme97_larynx",
    "verdonckdeleeuw97_larynx",
    "lindsey97_larynx",
    "schoentgen97_larynx",
    "mergell97_larynx",
    "plante97_larynx",
    "boyanov97_larynx",
    "titze97_larynx",
    "lindsey97b_larynx",
    "demolin97_larynx",
    "wuyts97_larynx",
    "watson97_larynx",
    "bleakley97_larynx",
    "dalessandro97_larynx",
    "marasek97_larynx",
    "vescovi97_larynx",
    "mahieu97_larynx",
    "as97_larynx",
    "belloc97_larynx",
    "vaissiere97_larynx",
    "jessen97_larynx",
    "roubeau97_larynx",
    "crevierbuchman97b_larynx",
    "vaxelaire97_larynx",
    "boyanov97b_larynx",
    "revis97_larynx",
    "jessen97b_larynx"
   ]
  }
 ]
}