{
 "series": "",
 "title": "The Listening Talker: an interdisciplinary workshop on natural and synthetic modification of speech in response to listening conditions",
 "location": "Edinburgh, UK",
 "startDate": "2/5/2012",
 "endDate": "3/5/2012",
 "chair": "Chairs: Martin Cooke, Simon King, Bastiaan Kleijn and Yannis Stylianou",
 "original_url": "http://www.isca-speech.org/archive/lista_2012",
 "original_title": "The Listening Talker 2012",
 "logo": "lst2.gif",
 "conf": "LISTA",
 "year": "2012",
 "name": "lista_2012",
 "SIG": "",
 "title1": "The Listening Talker: an interdisciplinary workshop on natural and synthetic modification of speech in response to listening conditions",
 "date": "2-3 May 2012",
 "papers": {
  "dau12_lista": {
   "authors": [
    [
     "Torsten",
     "Dau"
    ]
   ],
   "title": "Modeling speech intelligibility in adverse conditions",
   "original": "lst2_006",
   "page_count": 1,
   "order": 1,
   "p1": "6",
   "pn": "",
   "abstract": [
    "[pdf abstract]"
   ]
  },
  "hazan12_lista": {
   "authors": [
    [
     "Valerie",
     "Hazan"
    ]
   ],
   "title": "The effect of speaker-listener interaction on speech production in adverse listening conditions",
   "original": "lst2_007",
   "page_count": 1,
   "order": 2,
   "p1": "7",
   "pn": "",
   "abstract": [
    "[pdf abstract]"
   ]
  },
  "heusdens12_lista": {
   "authors": [
    [
     "Richard",
     "Heusdens"
    ]
   ],
   "title": "Speech intelligibility improvement using a perceptual distortion measure",
   "original": "lst2_008",
   "page_count": 1,
   "order": 3,
   "p1": "8",
   "pn": "",
   "abstract": [
    "[pdf abstract]"
   ]
  },
  "johnston12_lista": {
   "authors": [
    [
     "James",
     "Johnston"
    ]
   ],
   "title": "Articulation in the presence of noise",
   "original": "lst2_009",
   "page_count": 1,
   "order": 4,
   "p1": "9",
   "pn": "",
   "abstract": [
    "[pdf abstract]"
   ]
  },
  "kawahara12_lista": {
   "authors": [
    [
     "Hideki",
     "Kawahara"
    ]
   ],
   "title": "A new dimension of voice quality manipulation",
   "original": "lst2_010",
   "page_count": 1,
   "order": 5,
   "p1": "10",
   "pn": "",
   "abstract": [
    "[pdf abstract]"
   ]
  },
  "moore12_lista": {
   "authors": [
    [
     "Roger K.",
     "Moore"
    ]
   ],
   "title": "Some insights into talker-listener-environment coupling, energetics and the contrastive particulate structure of spoken language",
   "original": "lst2_011",
   "page_count": 2,
   "order": 6,
   "p1": "11",
   "pn": "12",
   "abstract": [
    "[pdf abstract]"
   ]
  },
  "pickering12_lista": {
   "authors": [
    [
     "Martin",
     "Pickering"
    ]
   ],
   "title": "An integrated theory of language production and comprehension",
   "original": "lst2_013",
   "page_count": 1,
   "order": 7,
   "p1": "13",
   "pn": "",
   "abstract": [
    "[pdf abstract]"
   ]
  },
  "sauert12_lista": {
   "authors": [
    [
     "Bastian",
     "Sauert"
    ],
    [
     "Peter",
     "Vary"
    ]
   ],
   "title": "Listening enhancement for mobile phones: how zo improve intelligibility in a noisy environment",
   "original": "lst2_014",
   "page_count": 1,
   "order": 8,
   "p1": "14",
   "pn": "",
   "abstract": [
    "[pdf abstract]"
   ]
  },
  "yamagishi12_lista": {
   "authors": [
    [
     "Junichi",
     "Yamagishi"
    ]
   ],
   "title": "Hmm-based speech synthesis adapted to listeners' and talkers' conditions",
   "original": "lst2_015",
   "page_count": 1,
   "order": 9,
   "p1": "15",
   "pn": "",
   "abstract": [
    "[pdf abstract]"
   ]
  },
  "boril12_lista": {
   "authors": [
    [
     "Hynek",
     "Bořil"
    ],
    [
     "Seyed Omid",
     "Sadjadi"
    ],
    [
     "John H. L.",
     "Hansen"
    ]
   ],
   "title": "A study on combined effects of reverberation and increased vocal effort on ASR",
   "original": "lst2_016",
   "page_count": 4,
   "order": 10,
   "p1": "16",
   "pn": "19",
   "abstract": [
    "This study analyzes the individual and combined effect of room reverberation and increased vocal effort on automatic speech recognition. Robustness of several state-of-the-art front-end feature extraction strategies and normalizations to these sources of speech signal variability is evaluated in the context of large and small vocabulary recognition tasks on American English and Czech speech corpora. For the large vocabulary task, speech material from the UT-Scope database comprising American English utterances is used. The Czech speech samples are drawn from the CLSD‘05 data corpus and used for the small vocabulary tasks. Both databases contain neutral as well as increased vocal effort recordings. Simulated reverberant test conditions are generated using measured room impulse responses from the AIR database and utilized in the evaluations. It is shown that the robustness of a common MFCC front-end to reverberation and increased vocal effort can be considerably improved when paired with cepstral gain normalization and modified RASTA filtering. A combination of recently proposed mean Hilbert envelope coefficients and modified RASTA is found to provide balanced performance across all reverberation and vocal effort conditions.\n",
    ""
   ]
  },
  "brungart12_lista": {
   "authors": [
    [
     "Douglas S.",
     "Brungart"
    ],
    [
     "Mary T.",
     "Cord"
    ],
    [
     "Nancy P.",
     "Solomon"
    ],
    [
     "Katie",
     "Dietrich-Burns"
    ],
    [
     "Kim",
     "Block"
    ]
   ],
   "title": "Evaluating the effects of hearing protection on speech production in noisy environments",
   "original": "lst2_020",
   "page_count": 4,
   "order": 11,
   "p1": "20",
   "pn": "23",
   "abstract": [
    "Many factors can influence the voice levels that talkers choose to use when they initiate conversations in noisy environments, including the desire to be understood clearly, the desire to communicate privately, and the distorted perception of the background noise and of their own voices that can occur when hearing protection devices are worn. In this study, we examined the impact that two different kinds of earplugs and four levels of room noise had on the voice levels of talkers who were asked to privately communicate short verbal messages to a nearby acoustic manikin. Frozen noise samples were used for the room noise, which allowed the speech samples recorded by the manikin to be extracted from the noise by direct waveform subtraction. The results show that talkers wearing earplugs consistently use lower voice levels in noise than they do when not wearing earplugs, even when the earplugs produce relatively little attenuation. This highlights the important impact that earplugrelated distortions in the perception of ones own voice (which are commonly referred to as the occlusion effect) can have on the effectiveness of speech communication in noise.\n",
    "Index Terms: shouted speech, hearing protection, occlusion effect\n",
    ""
   ]
  },
  "hamel12_lista": {
   "authors": [
    [
     "Michaela",
     "Hamel"
    ],
    [
     "Lisa",
     "Archibald"
    ],
    [
     "David W.",
     "Purcell"
    ]
   ],
   "title": "Compensation for manipulated auditory feedback in children with specific language impairment",
   "original": "lst2_024",
   "page_count": 4,
   "order": 12,
   "p1": "24",
   "pn": "27",
   "abstract": [
    "Using a real-time vowel formant filtering system, F1 of children¡¦s productions of the word ¡§head¡¨ /hɛd/ were shifted in real time and played to participants over headphones. This manipulated auditory feedback was shifted +340 Hz (/ɛ/ -> /æ/) in one condition and -230 Hz (/ɛ/ -> /ɪ/) in a second condition. Total compensation for this manipulated auditory feedback was monitored. On average, compensation occurred to oppose the manipulation. Children with Specific Language Impairment compensated significantly more than typically developing children.\n",
    "Index Terms: auditory feedback, shifted formants, Specific Language Impairment.\n",
    ""
   ]
  },
  "lelong12_lista": {
   "authors": [
    [
     "Amélie",
     "Lelong"
    ],
    [
     "Gérard",
     "Bailly"
    ]
   ],
   "title": "Characterizing phonetic convergence with speaker recognition techniques",
   "original": "lst2_028",
   "page_count": 4,
   "order": 13,
   "p1": "28",
   "pn": "31",
   "abstract": [
    "Speakers are known to accommodate to each other's behavior when interacting. Information circulates via multiple sensorymotor loops operating at various levels of the interaction and this closed-loop process induces modifications in all levels of representation from social and psychological evaluation to low-level gestural behaviors such as gaze, respiratory patterns, or speech. Various authors have proposed that these representations tend to converge or diverge according to cognitive demand. While quite plausible, claimed observations of such behavior in speech are extremely controversial. The effects are rather small, and are difficult to capture and characterize objectively. This paper focuses on the study of the convergence between phonetic representations – spectral realizations of speech sounds – using automatic classification techniques developed for speech and speaker recognition. Using data collected during a novel language game we term ‘verbal dominoes', we show that scores are comparable between global techniques and a more fine-grained analysis focused on vocalic segments.\n",
    "Index Terms: speaker recognition, phonetic convergence, speech adaptation\n",
    ""
   ]
  },
  "macdonald12_lista": {
   "authors": [
    [
     "Ewen N.",
     "MacDonald"
    ],
    [
     "Kevin G.",
     "Munhall"
    ]
   ],
   "title": "A preliminary study of individual responses to real-time pitch and formant perturbations",
   "original": "lst2_032",
   "page_count": 4,
   "order": 14,
   "p1": "32",
   "pn": "35",
   "abstract": [
    "Previous studies have demonstrated a wide range in individuals' compensations in response to real-time alterations of the auditory feedback of both pitch and formant frequencies. One potential source of this variability may be individual differences in the relative weighting of auditory and somatosensory feedback. The present study examined this variability by comparing individuals' compensations during two perturbation conditions: a pitch shift (+200 cents) and a formant shift (F1 +200 Hz, F2 -250 Hz). While no significant correlation was found between the two perturbation conditions, a modest correlation between compensations in pitch and formant frequency was observed within the pitch perturbation condition.\n",
    ""
   ]
  },
  "malisz12_lista": {
   "authors": [
    [
     "Zofia",
     "Malisz"
    ],
    [
     "Marcin",
     "Włdarczak"
    ],
    [
     "Hendrik",
     "Buschmeier"
    ],
    [
     "Stefan",
     "Kopp"
    ],
    [
     "Petra",
     "Wagner"
    ]
   ],
   "title": "Prosodic characteristics of feedback expressions in distracted and non-distracted listeners",
   "original": "lst2_036",
   "page_count": 4,
   "order": 15,
   "p1": "36",
   "pn": "39",
   "abstract": [
    "In a previous study [1] we investigated properties of communicative feedback produced by attentive and non-attentive listeners in dialogue. Distracted listeners were found to produce less feedback communicating understanding. Here, we assess the role of prosody in differentiating between feedback functions. We find significant differences across all studied prosodic dimensions as well as influences of lexical form and phonetic structure on feedback function categorisation. We also show that differences in prosodic features between attentiveness states exist, e.g., in overall intensity.\n",
    "Index Terms: communicative feedback; prosody; dialogue; distraction; engagement; attention\n",
    "",
    "",
    "H. Buschmeier, Z. Malisz, M. Włdarczak, S. Kopp, and P. Wagner, \"‘Are you sure you're paying attention?' – ‘Uh-huh'. Communicating understanding as a marker of attentiveness,\" in Proceedings of INTERSPEECH 2011, Florence, Italy, 2011, pp. 2057–2060 (ISCA Archive)\n",
    ""
   ]
  },
  "nguyen12_lista": {
   "authors": [
    [
     "Linh L. T.",
     "Nguyen"
    ],
    [
     "David W.",
     "Purcell"
    ]
   ],
   "title": "Formant compensation responses to altered auditory feedback in English and Vietnamese talkers",
   "original": "lst2_040",
   "page_count": 4,
   "order": 16,
   "p1": "40",
   "pn": "43",
   "abstract": [
    "Previous research has indicated that a person.s language history may affect their speech compensation results during altered auditory feedback. The purpose of this experiment was to determine if the interaction of first language and second language vowels will influence compensatory behavior in Vietnamese and English speakers. The experiment included a group of native Vietnamese talkers who learned English as a second language and a group of English monolinguals. F1 discrimination thresholds and vowel goodness ratings for English /ɪ/ as in \"hid\" on a continuum towards English /ɛ/ as in \"head\" were determined. Vowel spaces were collected for both languages and auditory feedback of F1 was manipulated during speech production for English and Vietnamese vowels. Results found an asymmetry in compensation between the negative and positive shifts for each vowel. Group differences in speech production were found when the F1 manipulation was dynamic. However, when the F1 manipulation was stable, English /ɪ/ did not elicit group differences, but English /æ/ did. These results suggest some differences in the auditory feedback systems for the two groups.\n",
    "Index Terms: auditory feedback, language acquisition, speech production\n",
    ""
   ]
  },
  "picart12_lista": {
   "authors": [
    [
     "Benjamin",
     "Picart"
    ],
    [
     "Thomas",
     "Drugman"
    ],
    [
     "Thierry",
     "Dutoit"
    ]
   ],
   "title": "Assessing the intelligibility and quality of HMM-based speech synthesis with a variable degree of articulation",
   "original": "lst2_044",
   "page_count": 4,
   "order": 17,
   "p1": "44",
   "pn": "47",
   "abstract": [
    "This paper focuses on the assessment of both the intelligibility and the quality of speech when using a variable degree of articulation (hypo/hyperarticulation) in the framework of HMM-based speech synthesis. Intelligibility is evaluated when the synthesizer is working in adverse conditions. The adaptation of a neutral speech synthesizer to generate hypo and hyperarticulated speech is first performed. Simulated noisy and reverberant conditions are then applied to the speech produced by the latter synthesizers. The intelligibility of the resulting speech is assessed by a Semantically Unpredictable Sentences (SUS) test. Results of this test quantify how the possibility of varying the degree of articulation improves the intelligibility of synthetic speech in various adverse conditions. In a second test, natural and synthetic speech quality is evaluated through an Absolute Category Rating (ACR) test. This test allows the assessment of hypo/hyperarticulated speech through various dimensions: comprehension, pleasantness, non-monotony, naturalness, fluidity and pronunciation.\n",
    "Index Terms: Speech Synthesis, HTS, Expressive Speech, Speaking Style Adaptation, Voice Quality, Speech Intelligibility\n",
    ""
   ]
  },
  "scheerer12_lista": {
   "authors": [
    [
     "Nichole",
     "Scheerer"
    ],
    [
     "Sarah",
     "D'Alton"
    ],
    [
     "Hanjun",
     "Liu"
    ],
    [
     "Jeffery A.",
     "Jones"
    ]
   ],
   "title": "The effects of frequency-altered feedback on the vocal productions of Canadian-English speaking children",
   "original": "lst2_048",
   "page_count": 4,
   "order": 18,
   "p1": "48",
   "pn": "51",
   "abstract": [
    "Speech motor control develops gradually as the acoustics of speech are mapped onto the positions and movements of the articulators. In this study children and adults between 4-30 years of age produced vocalizations while exposed to frequency altered feedback (FAF). The amplitude and latency of the vocal responses were found to differ as a function of age. Furthermore, neurological responses as indexed by the P1-N1-P2 ERP components were also modulated as a function of age. These results suggest that the auditory feedback system undergoes robust changes with age and vocal tract maturation.\n",
    "Index Terms: speech acquisition, auditory feedback, ERP, P1, N1, P2\n",
    ""
   ]
  },
  "alexanderson12_lista": {
   "authors": [
    [
     "Simon",
     "Alexanderson"
    ],
    [
     "Jonas",
     "Beskow"
    ]
   ],
   "title": "Can anybody read me? - motion capture recordings for an adaptable visual speech synthesizer",
   "original": "lst2_052",
   "page_count": 1,
   "order": 19,
   "p1": "52",
   "pn": "",
   "abstract": [
    "[pdf abstract]"
   ]
  },
  "astrinaki12_lista": {
   "authors": [
    [
     "Maria",
     "Astrinaki"
    ],
    [
     "Nicolas",
     "d'Alessandro"
    ],
    [
     "Thierry",
     "Dutoit"
    ]
   ],
   "title": "MAGE: a platform for performative speech synthesis - new approach in exploring applications beyond text-to-speech",
   "original": "lst2_053",
   "page_count": 1,
   "order": 20,
   "p1": "53",
   "pn": "",
   "abstract": [
    "[pdf abstract]"
   ]
  },
  "aubanel12_lista": {
   "authors": [
    [
     "Vincent",
     "Aubanel"
    ],
    [
     "Martin",
     "Cooke"
    ],
    [
     "Catherine",
     "Mayo"
    ],
    [
     "Robert",
     "Clark"
    ]
   ],
   "title": "Overlap behaviour in task-oriented dialogue",
   "original": "lst2_054",
   "page_count": 1,
   "order": 21,
   "p1": "54",
   "pn": "",
   "abstract": [
    "[pdf abstract]"
   ]
  },
  "aubanel12b_lista": {
   "authors": [
    [
     "Vincent",
     "Aubanel"
    ],
    [
     "Martin",
     "Cooke"
    ],
    [
     "Maria Luisa",
     "Garcia Lecumberri"
    ],
    [
     "Catherine",
     "Mayo"
    ],
    [
     "Robert",
     "Clark"
    ]
   ],
   "title": "Lombard and temporal effects in concurrent conversations",
   "original": "lst2_055",
   "page_count": 1,
   "order": 22,
   "p1": "55",
   "pn": "",
   "abstract": [
    "[pdf abstract]"
   ]
  },
  "buschmeier12_lista": {
   "authors": [
    [
     "Hendrik",
     "Buschmeier"
    ],
    [
     "Stefan",
     "Kopp"
    ]
   ],
   "title": "How should attentive speaker agents adapt to listener feedback?",
   "original": "lst2_056",
   "page_count": 1,
   "order": 23,
   "p1": "56",
   "pn": "",
   "abstract": [
    "[pdf abstract]"
   ]
  },
  "cabral12_lista": {
   "authors": [
    [
     "João P.",
     "Cabral"
    ],
    [
     "Julie",
     "Carson-Berndsen"
    ]
   ],
   "title": "Controlling voice source parameters to transform characteristics of synthetic voices",
   "original": "lst2_057",
   "page_count": 1,
   "order": 24,
   "p1": "57",
   "pn": "",
   "abstract": [
    "[pdf abstract]"
   ]
  },
  "christiansen12_lista": {
   "authors": [
    [
     "Thomas Ulrich",
     "Christiansen"
    ],
    [
     "Jan",
     "Heegård"
    ],
    [
     "Peter Juel",
     "Henrichsen"
    ]
   ],
   "title": "Listening talkers produce great spectral tilt contrasts",
   "original": "lst2_058",
   "page_count": 1,
   "order": 25,
   "p1": "58",
   "pn": "",
   "abstract": [
    "[pdf abstract]"
   ]
  },
  "cooke12_lista": {
   "authors": [
    [
     "Martin",
     "Cooke"
    ],
    [
     "Maria Luisa",
     "Garcia Lecumberri"
    ],
    [
     "Yan",
     "Tang"
    ],
    [
     "Mirjam",
     "Wester"
    ]
   ],
   "title": "Do non-native listeners benefit from speech modifications designed to promote intelligibility for native listeners?",
   "original": "lst2_059",
   "page_count": 1,
   "order": 26,
   "p1": "59",
   "pn": "",
   "abstract": [
    "[pdf abstract]"
   ]
  },
  "degottex12_lista": {
   "authors": [
    [
     "Gilles",
     "Degottex"
    ],
    [
     "Elizabeth",
     "Godoy"
    ],
    [
     "Yannis",
     "Stylianou"
    ]
   ],
   "title": "Identifying tenseness of Lombard speech using phase distortion",
   "original": "lst2_060",
   "page_count": 1,
   "order": 27,
   "p1": "60",
   "pn": "",
   "abstract": [
    "[pdf abstract]"
   ]
  },
  "erro12_lista": {
   "authors": [
    [
     "Daniel",
     "Erro"
    ],
    [
     "Yannis",
     "Stylianou"
    ],
    [
     "Eva",
     "Navas"
    ],
    [
     "Inma",
     "Hernaez"
    ]
   ],
   "title": "Simple spectral techniques to enhance the intelligibility of speech using a harmonic model",
   "original": "lst2_061",
   "page_count": 1,
   "order": 28,
   "p1": "61",
   "pn": "",
   "abstract": [
    "[pdf abstract]"
   ]
  },
  "escudero12_lista": {
   "authors": [
    [
     "David",
     "Escudero"
    ],
    [
     "Lourdes",
     "Aguilar"
    ],
    [
     "Juanma",
     "Garrido"
    ]
   ],
   "title": "Glissando dialogs: a corpus for the analysis of entrainment in phone services",
   "original": "lst2_062",
   "page_count": 1,
   "order": 29,
   "p1": "62",
   "pn": "",
   "abstract": [
    "[pdf abstract]"
   ]
  },
  "garnier12_lista": {
   "authors": [
    [
     "Maëva",
     "Garnier"
    ],
    [
     "Lucie",
     "Ménard"
    ],
    [
     "Gabrielle",
     "Richard"
    ]
   ],
   "title": "Do speakers make use of the visual channel to improve their intelligibility in adverse conditions? a pilot study",
   "original": "lst2_063",
   "page_count": 1,
   "order": 30,
   "p1": "63",
   "pn": "",
   "abstract": [
    "[pdf abstract]"
   ]
  },
  "gilmartin12_lista": {
   "authors": [
    [
     "Emer",
     "Gilmartin"
    ],
    [
     "Céline",
     "de Looze"
    ],
    [
     "Nick",
     "Campbell"
    ]
   ],
   "title": "Priming, timing, and the phatic component in machine-mediated dialogue",
   "original": "lst2_064",
   "page_count": 1,
   "order": 31,
   "p1": "64",
   "pn": "",
   "abstract": [
    "[pdf abstract]"
   ]
  },
  "godoy12_lista": {
   "authors": [
    [
     "Elizabeth",
     "Godoy"
    ],
    [
     "Yannis",
     "Stylianou"
    ],
    [
     "Julián",
     "Villegas"
    ]
   ],
   "title": "Unsupervised normal-to-lombard spectral envelope transformation; examining loudness, voicing & stationarity",
   "original": "lst2_065",
   "page_count": 1,
   "order": 32,
   "p1": "65",
   "pn": "",
   "abstract": [
    "[pdf abstract]"
   ]
  },
  "heeren12_lista": {
   "authors": [
    [
     "Willemijn",
     "Heeren"
    ],
    [
     "Christian",
     "Lorenzi"
    ]
   ],
   "title": "The whispering talker: production and perception of French boundary tones",
   "original": "lst2_066",
   "page_count": 1,
   "order": 33,
   "p1": "66",
   "pn": "",
   "abstract": [
    "[pdf abstract]"
   ]
  },
  "howell12_lista": {
   "authors": [
    [
     "Peter",
     "Howell"
    ]
   ],
   "title": "A comparison of the effects of alteration to auditory feedback and speech motor learning",
   "original": "lst2_067",
   "page_count": 1,
   "order": 34,
   "p1": "67",
   "pn": "",
   "abstract": [
    "[pdf abstract]"
   ]
  },
  "iyer12_lista": {
   "authors": [
    [
     "Nandini",
     "Iyer"
    ],
    [
     "John",
     "Stewart"
    ],
    [
     "Sarah",
     "Sullivan"
    ],
    [
     "Douglas S.",
     "Brungart"
    ],
    [
     "Brian",
     "Simpson"
    ]
   ],
   "title": "Characterizing listeners' performance in a speaking-while-listening task",
   "original": "lst2_068",
   "page_count": 1,
   "order": 35,
   "p1": "68",
   "pn": "",
   "abstract": [
    "[pdf abstract]"
   ]
  },
  "kim12_lista": {
   "authors": [
    [
     "Jeesun",
     "Kim"
    ],
    [
     "Chris",
     "Davis"
    ]
   ],
   "title": "Speaking in quiet and in noise: do auditory and articulatory properties pattern together?",
   "original": "lst2_069",
   "page_count": 1,
   "order": 36,
   "p1": "69",
   "pn": "",
   "abstract": [
    "[pdf abstract]"
   ]
  },
  "koutsogiannaki12_lista": {
   "authors": [
    [
     "M.",
     "Koutsogiannaki"
    ],
    [
     "Catherine",
     "Mayo"
    ],
    [
     "V.",
     "Kandia"
    ],
    [
     "Yannis",
     "Stylianou"
    ]
   ],
   "title": "On the detection of the intelligibility advantage of clear speech vs. casual speech",
   "original": "lst2_070",
   "page_count": 1,
   "order": 37,
   "p1": "70",
   "pn": "",
   "abstract": [
    "[pdf abstract]"
   ]
  },
  "lewandowski12_lista": {
   "authors": [
    [
     "Natalie",
     "Lewandowski"
    ]
   ],
   "title": "Automaticity and consciousness in phonetic convergence",
   "original": "lst2_071",
   "page_count": 1,
   "order": 38,
   "p1": "71",
   "pn": "",
   "abstract": [
    "[pdf abstract]"
   ]
  },
  "ling12_lista": {
   "authors": [
    [
     "Zhen-Hua",
     "Ling"
    ],
    [
     "Korin",
     "Richmond"
    ],
    [
     "Junichi",
     "Yamagishi"
    ]
   ],
   "title": "Vowel creation by articulatory control in HMM-based parametric speech synthesis",
   "original": "lst2_072",
   "page_count": 1,
   "order": 39,
   "p1": "72",
   "pn": "",
   "abstract": [
    "[pdf abstract]"
   ]
  },
  "macpherson12_lista": {
   "authors": [
    [
     "Alexandra",
     "MacPherson"
    ],
    [
     "Michael A",
     "Akeroyd"
    ]
   ],
   "title": "The rate of intelligibility change with level for continuous speech",
   "original": "lst2_073",
   "page_count": 1,
   "order": 40,
   "p1": "73",
   "pn": "",
   "abstract": [
    "[pdf abstract]"
   ]
  },
  "mayo12_lista": {
   "authors": [
    [
     "Catherine",
     "Mayo"
    ],
    [
     "Vincent",
     "Aubanel"
    ]
   ],
   "title": "Effect of prosodic changes on speech intelligibility",
   "original": "lst2_074",
   "page_count": 1,
   "order": 41,
   "p1": "74",
   "pn": "",
   "abstract": [
    "[pdf abstract]"
   ]
  },
  "nicolaidis12_lista": {
   "authors": [
    [
     "Katerina",
     "Nicolaidis"
    ]
   ],
   "title": "An electropalatographic study of consonant production in Greek Lombard speech",
   "original": "lst2_075",
   "page_count": 1,
   "order": 42,
   "p1": "75",
   "pn": "",
   "abstract": [
    "[pdf abstract]"
   ]
  },
  "nicolao12_lista": {
   "authors": [
    [
     "Mauro",
     "Nicolao"
    ],
    [
     "Roger K.",
     "Moore"
    ]
   ],
   "title": "Consonant production control in a computational model of Hyper & Hypo theory (C2h)",
   "original": "lst2_076",
   "page_count": 1,
   "order": 43,
   "p1": "76",
   "pn": "",
   "abstract": [
    "[pdf abstract]"
   ]
  },
  "petkov12_lista": {
   "authors": [
    [
     "Petko N.",
     "Petkov"
    ],
    [
     "W. Bastiaan",
     "Kleijn"
    ],
    [
     "Gustav Eje",
     "Henter"
    ]
   ],
   "title": "Speech intelligibility enhancement using a statistical model of clean speech",
   "original": "lst2_077",
   "page_count": 1,
   "order": 44,
   "p1": "77",
   "pn": "",
   "abstract": [
    "[pdf abstract]"
   ]
  },
  "raitio12_lista": {
   "authors": [
    [
     "Tuomo",
     "Raitio"
    ],
    [
     "Antti",
     "Suni"
    ],
    [
     "Martti",
     "Vainio"
    ],
    [
     "Paavo",
     "Alku"
    ]
   ],
   "title": "High quality synthetic speech on a wide vocal effort continuum: statistical parametric speech synthesis with glottal pulse library",
   "original": "lst2_078",
   "page_count": 1,
   "order": 45,
   "p1": "78",
   "pn": "",
   "abstract": [
    "[pdf abstract]"
   ]
  },
  "rochetcapellan12_lista": {
   "authors": [
    [
     "Amélie",
     "Rochet-Capellan"
    ],
    [
     "David J.",
     "Ostry"
    ]
   ],
   "title": "Effect of expanding vs. reducing vowel contrast on adaptation zo altered auditory feedback",
   "original": "lst2_079",
   "page_count": 1,
   "order": 46,
   "p1": "79",
   "pn": "",
   "abstract": [
    "[pdf abstract]"
   ]
  },
  "rochetcapellan12b_lista": {
   "authors": [
    [
     "Amélie",
     "Rochet-Capellan"
    ],
    [
     "Susanne",
     "Fuchs"
    ],
    [
     "Leonardo",
     "Lancia"
    ],
    [
     "Pascal",
     "Perrier"
    ]
   ],
   "title": "Does listeners' breathing change according to speaker and to loudness?",
   "original": "lst2_080",
   "page_count": 1,
   "order": 47,
   "p1": "80",
   "pn": "",
   "abstract": [
    "[pdf abstract]"
   ]
  },
  "scobbie12_lista": {
   "authors": [
    [
     "James",
     "Scobbie"
    ]
   ],
   "title": "Expanding the vowel space – direct vocal tract measurement with ultrasound tongue imaging",
   "original": "lst2_081",
   "page_count": 1,
   "order": 48,
   "p1": "81",
   "pn": "",
   "abstract": [
    "[pdf abstract]"
   ]
  },
  "sfakianaki12_lista": {
   "authors": [
    [
     "Anna",
     "Sfakianaki"
    ],
    [
     "Katerina",
     "Nicolaidis"
    ],
    [
     "Areti",
     "Okalidou"
    ]
   ],
   "title": "Intelligibility and production in Greek hearing-impaired speech",
   "original": "lst2_082",
   "page_count": 1,
   "order": 49,
   "p1": "82",
   "pn": "",
   "abstract": [
    "[pdf abstract]"
   ]
  },
  "szekely12_lista": {
   "authors": [
    [
     "Éva",
     "Székely"
    ],
    [
     "Zeeshan",
     "Ahmed"
    ],
    [
     "João P.",
     "Cabral"
    ],
    [
     "Julie",
     "Carson-Berndsen"
    ]
   ],
   "title": "Winktalk: a multimodal speech synthesis interface linking facial expressions to expressive synthetic voices",
   "original": "lst2_083",
   "page_count": 1,
   "order": 50,
   "p1": "83",
   "pn": "",
   "abstract": [
    "[pdf abstract]"
   ]
  },
  "tang12_lista": {
   "authors": [
    [
     "Yan",
     "Tang"
    ],
    [
     "Martin",
     "Cooke"
    ],
    [
     "Petko N.",
     "Petkov"
    ]
   ],
   "title": "Optimal frequency filtering for speech intelligibility boosting under a constant energy constraint",
   "original": "lst2_084",
   "page_count": 1,
   "order": 51,
   "p1": "84",
   "pn": "",
   "abstract": [
    "[pdf abstract]"
   ]
  },
  "vainio12_lista": {
   "authors": [
    [
     "Martti",
     "Vainio"
    ],
    [
     "Antti",
     "Suni"
    ],
    [
     "Anja",
     "Arnhold"
    ],
    [
     "Tuomo",
     "Raitio"
    ],
    [
     "Henri",
     "Seijo"
    ],
    [
     "Juhani",
     "Järvikivi"
    ],
    [
     "Daniel",
     "Aalto"
    ],
    [
     "Paavo",
     "Alku"
    ]
   ],
   "title": "Effect of level and type of noise on focus related prosody",
   "original": "lst2_085",
   "page_count": 1,
   "order": 52,
   "p1": "85",
   "pn": "",
   "abstract": [
    "[pdf abstract]"
   ]
  },
  "valentinibotinhao12_lista": {
   "authors": [
    [
     "Cassia",
     "Valentini-Botinhao"
    ],
    [
     "Yan",
     "Tang"
    ],
    [
     "Junichi",
     "Yamagishi"
    ],
    [
     "Simon",
     "King"
    ]
   ],
   "title": "Using an intelligibility measure to create noise robust cepstral coefficients for HMM-based speech synthesis",
   "original": "lst2_086",
   "page_count": 1,
   "order": 53,
   "p1": "86",
   "pn": "",
   "abstract": [
    "[pdf abstract]"
   ]
  },
  "villegas12_lista": {
   "authors": [
    [
     "Julián",
     "Villegas"
    ],
    [
     "Martin",
     "Cooke"
    ],
    [
     "Catherine",
     "Mayo"
    ]
   ],
   "title": "The role of durational changes in the Lombard speech advantage",
   "original": "lst2_087",
   "page_count": 1,
   "order": 54,
   "p1": "87",
   "pn": "",
   "abstract": [
    "[pdf abstract]"
   ]
  },
  "zorila12_lista": {
   "authors": [
    [
     "Tudor-Catalin",
     "Zorila"
    ],
    [
     "Yannis",
     "Stylianou"
    ]
   ],
   "title": "Improving speech intelligibility in noise environments by spectral shaping and dynamic range compression",
   "original": "lst2_088",
   "page_count": 1,
   "order": 55,
   "p1": "88",
   "pn": "",
   "abstract": [
    "[pdf abstract]"
   ]
  }
 },
 "sessions": [
  {
   "title": "Invited Papers (Abstracts Only)",
   "papers": [
    "dau12_lista",
    "hazan12_lista",
    "heusdens12_lista",
    "johnston12_lista",
    "kawahara12_lista",
    "moore12_lista",
    "pickering12_lista",
    "sauert12_lista",
    "yamagishi12_lista"
   ]
  },
  {
   "title": "Oral Sessions (Full Papers)",
   "papers": [
    "boril12_lista",
    "brungart12_lista",
    "hamel12_lista",
    "lelong12_lista",
    "macdonald12_lista",
    "malisz12_lista",
    "nguyen12_lista",
    "picart12_lista",
    "scheerer12_lista"
   ]
  },
  {
   "title": "Poster Sessions (Extended Abstracts)",
   "papers": [
    "alexanderson12_lista",
    "astrinaki12_lista",
    "aubanel12_lista",
    "aubanel12b_lista",
    "buschmeier12_lista",
    "cabral12_lista",
    "christiansen12_lista",
    "cooke12_lista",
    "degottex12_lista",
    "erro12_lista",
    "escudero12_lista",
    "garnier12_lista",
    "gilmartin12_lista",
    "godoy12_lista",
    "heeren12_lista",
    "howell12_lista",
    "iyer12_lista",
    "kim12_lista",
    "koutsogiannaki12_lista",
    "lewandowski12_lista",
    "ling12_lista",
    "macpherson12_lista",
    "mayo12_lista",
    "nicolaidis12_lista",
    "nicolao12_lista",
    "petkov12_lista",
    "raitio12_lista",
    "rochetcapellan12_lista",
    "rochetcapellan12b_lista",
    "scobbie12_lista",
    "sfakianaki12_lista",
    "szekely12_lista",
    "tang12_lista",
    "vainio12_lista",
    "valentinibotinhao12_lista",
    "villegas12_lista",
    "zorila12_lista"
   ]
  }
 ]
}