{
 "title": "Language Teaching, Learning and Technology (LTLT 2015)",
 "location": "Leipzig, Germany",
 "startDate": "4/9/2015",
 "endDate": "4/9/2015",
 "conf": "LTLT",
 "year": "2015",
 "name": "ltlt_2015",
 "series": "LTLT",
 "SIG": "CHILD",
 "title1": "Language Teaching, Learning and Technology",
 "title2": "(LTLT 2015)",
 "date": "4 September 2015",
 "booklet": "ltlt_2015.pdf",
 "papers": {
  "delmonte15_ltlt": {
   "authors": [
    [
     "Rodolfo",
     "Delmonte"
    ],
    [
     "Alessia",
     "Battisti"
    ]
   ],
   "title": "GI-tutor: grammar-checking for (Italian) students of German",
   "original": "lt15_001",
   "page_count": 8,
   "order": 1,
   "p1": "1",
   "pn": "8",
   "abstract": [
    "Computers have played a significant role in second language learning as they can offer different types of language activities and provide learners with immediate and appropriate feedbacks. In ICALL systems, learning is activated by focusing the learner's attention to the correct form and comparing it to the wrong one. Feedback offers an explicit explanation of the mistakes made by the student.   The focus of this paper is a grammar checker designed for Italian native speakers learning German - GI-tutor. The system's structure was taken from a previous study and enforced to analyse a conspicuous number of sentences, with different sentence and phrase structures. The lexicon used has been manually organized at the beginning, with some 8,000 entries overall; then, an enlargement has been obtained through an adaptation of the lexicon made available by Hamburg University Constraint Dependency Grammar (JWCDG) and downloaded from their website1. A corpus containing wrong sentences was expanded by extracting data from exams written by first-year students of the German course at the University Ca' Foscari. The errors were then classified in order to obtain a general statistical analysis of the main problems encountered when learning German.   Attention was given also to parsers and their use and functionality in language learning. Furthermore, the performance of the constituency grammar checker was evaluated to determine the types and frequencies of errors it can successfully diagnose. This was done by comparing it to ParZu - a generic German dependency parser developed at the University of Zürich2 and to Stanford Parser for German.\n",
    ""
   ]
  },
  "lavalley15_ltlt": {
   "authors": [
    [
     "Rémi",
     "Lavalley"
    ],
    [
     "Kay",
     "Berkling"
    ],
    [
     "Sebastian",
     "Stüker"
    ]
   ],
   "title": "Preparing children's writing database for automated processing",
   "original": "lt15_009",
   "page_count": 7,
   "order": 2,
   "p1": "9",
   "pn": "15",
   "abstract": [
    "This paper describes the process of anonymizing a German, publicly available children’s corpus of digitized and scanned in spontaneously written texts from Grades 1-8. After reviewing the data collection process published previously, the method for anonymization of texts and meta data are described. A revised annotation set that was added to the existing transcription is defined. This annotation supports the spelling error analysis process while adding further annotation at the syntax level to allow for separate processing of these issues. Updates to statistics for the new version of the data are reported to give the reader an idea about research potential this version of the data may provide.\n",
    "Index Terms: Orthography, Corpora, Children’s Texts, Digitization, Anonymization\n",
    ""
   ]
  },
  "sangati15_ltlt": {
   "authors": [
    [
     "Federico",
     "Sangati"
    ],
    [
     "Stefano",
     "Merlo"
    ],
    [
     "Giovanni",
     "Moretti"
    ]
   ],
   "title": "School-tagging: interactive language exercises in classrooms",
   "original": "lt15_016",
   "page_count": 4,
   "order": 3,
   "p1": "16",
   "pn": "19",
   "abstract": [
    "We present a prototype of a novel online platform for promoting playful learning exercises in classrooms, allowing teachers to engage with students in an interactive way. Differently from typical e-learning environments, it is the teacher, not the machine, who leads the learning activity, i.e., she is able to monitor students’ individual and aggregated answers and provide them real-time feedback. Although the platform is subjectindependent, we are currently focusing on language exercises based on standard school curriculum. Answers provided by students and validated by the teacher (or automatic assessment) could constitute, in a large scale scenario, a valuable source of linguistic annotation. The platform can therefore be seen also as a crowdsourcing system to create novel linguistic resources to be used by the scientific community in the Natural Language Processing field.\n",
    "",
    "",
    "Index Terms: Web-based Learning Technologies, Online Educational Games, Crowdsourcing, Linguistic Annotation\n",
    ""
   ]
  },
  "wilken15_ltlt": {
   "authors": [
    [
     "Ilana",
     "Wilken"
    ],
    [
     "Febe de",
     "Wet"
    ],
    [
     "Elsabé",
     "Taljard"
    ]
   ],
   "title": "A mobile vocabulary acquisition application for health science students: a proposed study",
   "original": "lt15_020",
   "page_count": 5,
   "order": 4,
   "p1": "20",
   "pn": "24",
   "abstract": [
    "Communication plays a vital role in everyday life and in some situations multilingual communication is a necessity. The South African constitution recognises 11 official languages. Multilingual communication therefore occurs almost everywhere, like at hospitals and in clinics. When the need arises for someone (who does not speak a global language like English) to seek medical attention in South Africa, it becomes a challenge to find a health practitioner that speaks their first language. This study aims to develop and evaluate the use of a mobile application designed for supplementary Northern Sotho language learning by health science students.\n",
    "Index Terms: mobile-assisted language learning, humancomputer interaction, user experience\n",
    ""
   ]
  }
 },
 "sessions": [
  {
   "title": "Table of Contents and Access to Abstracts",
   "papers": [
    "delmonte15_ltlt",
    "lavalley15_ltlt",
    "sangati15_ltlt",
    "wilken15_ltlt"
   ]
  }
 ]
}