{
 "title": "Language Teaching, Learning and Technology (LTLT 2016)",
 "location": "San Francisco, USA",
 "startDate": "6/9/2016",
 "endDate": "7/9/2016",
 "URL": "https://sites.google.com/site/l1teachingandtechnology/previous-workshops/2016-san-francisco",
 "chair": "Chairs: Kay Berkling, Keelan Evanini, David Suendermann-Oeft",
 "conf": "LTLT",
 "year": "2016",
 "name": "ltlt_2016",
 "series": "LTLT",
 "SIG": "CHILD",
 "title1": "Language Teaching, Learning and Technology",
 "title2": "(LTLT 2016)",
 "date": "6-7 September 2016",
 "papers": {
  "loerbroks16_ltlt": {
   "authors": [
    [
     "Nicolas",
     "Loerbroks"
    ],
    [
     "Yue",
     "Sun"
    ],
    [
     "Yoshinori",
     "Sagisaka"
    ],
    [
     "Jinsong",
     "Zhang"
    ]
   ],
   "title": "Visualization of Mandarin Chinese Tone Production of Japanese L2 Learners for evaluation",
   "original": "LTLT2016_paper_1",
   "page_count": 5,
   "order": 1,
   "p1": 1,
   "pn": 5,
   "abstract": [
    "﻿Aiming at automatic characterization and evaluation of second language (L2) learners production of Mandarin Chinese tones, we applied robust F0-features previously used to characterize and visualize the tone control of native Chinese speakers. They consist of the average height and the average slope of the con- tour, which form a minimal set of F0-features to efficiently separate the four Mandarin tones. The resulting two-dimensional scatterplots represent L2 learner’s characteristics of tone production very well, in particular the confusion between tone 2 and tone 3 which has been well known as a L2 learning problem of Chinese tone production. This analysis could be carried out completely automatically using open source tools. To further confirm that the information contained in those two features is sufficient to reflect native’s perception, we used a neural network (NN) to predict natives evaluation of utterances of tone 2 and tone 3 based on the two features. The experiment showed a reasonable high correlation to natives subjective rating, which confirmed the availability of those two features to evaluate L2 proficiency of Chinese tone production."
   ],
   "doi": "10.21437/LTLT.2016-1"
  },
  "burstein16_ltlt": {
   "authors": [
    [
     "Jill",
     "Burstein"
    ],
    [
     "Beata",
     "Beigman Klebanov"
    ],
    [
     "Norbert",
     "Elliot"
    ],
    [
     "Hillary",
     "Molloy"
    ]
   ],
   "title": "A Left Turn: Automated Feedback and Activity Generation for Student Writers",
   "original": "LTLT2016_paper_2",
   "page_count": 8,
   "order": 2,
   "p1": 6,
   "pn": 13,
   "abstract": [
    "﻿Writing is key to educational and workplace success. The majority of computer-based writing support applications target K12 students, and typically offer standard feedback, targeting the U.S.-centric, 5-paragraph, expository essay genre, typically taught to developing writers and used on standardized tests. This writing demo takes a “left turn”: it illustrates how guided activities can be automatically generated, and aligned with natural language processing (NLP)-based feedback. The demo feedback and activities promote increased student engagement, and address critical writing domain knowledge required to produce higher quality postsecondary writing assignments across writing genres and academic disciplines."
   ],
   "doi": "10.21437/LTLT.2016-2"
  },
  "laarmannquante16_ltlt": {
   "authors": [
    [
     "Ronja",
     "Laarmann-Quante"
    ]
   ],
   "title": "Automating Multi-Level Annotations of Orthographic Properties of German Words and Children’s Spelling Errors",
   "original": "LTLT2016_paper_3",
   "page_count": 9,
   "order": 3,
   "p1": 14,
   "pn": 22,
   "abstract": [
    "﻿This paper presents the automatic annotation of orthographic properties of German words and spelling errors in texts of German primary school children according to a new multi-layered annotation scheme [1]. The scheme is closely linked to the principles of the German writing system and is supposed to allow the pursuit of new research questions concerning the relationship between spelling errors of competent and less competent spellers and the regularities of the German graphematic system. A novelty of the automatic annotation is that it takes an intended, correctly spelled word as input and applies a set of rules to generate a list of error candidates containing systematic spelling errors. As a further novelty, the annotation of additional word- and error-related properties is presented such as whether the spelling error changes the word’s pronunciation and whether a spelling can be derived from a related word form. This gives rise to more detailed analyses of the errors but also allows us to develop an application for learners that generates automatic advice for the correct spelling. A first evaluation shows that the automatic annotation of the presented categories and features can come close to human annotations."
   ],
   "doi": "10.21437/LTLT.2016-3"
  },
  "naganomadsen16_ltlt": {
   "authors": [
    [
     "Yasuko",
     "Nagano-Madsen"
    ],
    [
     "Xinzheng",
     "Wan"
    ]
   ],
   "title": "Perception of L2 Mandarin tones by L1Swedish learners at three proficiency levels",
   "original": "LTLT2016_paper_4",
   "page_count": 6,
   "order": 4,
   "p1": 23,
   "pn": 28,
   "abstract": [
    "﻿Cross-linguistic studies on the perception of Mandarin tones are many. However, studies conducted from an L2 acquisition perspective with reference to proficiency levels are still limited. Likewise, how the learners’ whose L1 prosody has lexical pitch-accents such as Swedish and Japanese perceive Mandarin tones is still largely an understudied area of research. In this study, perception of Mandarin tones in mono- and di-syllabic words by Swedish learners of Chinese at three proficiency levels was examined. Results for the monosyllabic stimuli showed that the most difficult tone to perceive was T2 while the easiest to perceive was T3. These results were consistent across the three levels of proficiency. In contrast, the results for the di-syllabic words showed more complex perceptual patterns, i.e. the entire perceptual patters differed at each proficiency level as ‘interlanguage’. One can speak of a typical perceptual pattern for the beginner level and intermediate level. The results of the present study are compared with those from the previous studies on the acquisition of L2 Japanese prosody by L1 Swedish learners. It also discusses about how L1 prosodic transfer takes place at different levels of proficiency in perceiving Mandarin tones."
   ],
   "doi": "10.21437/LTLT.2016-4"
  }
 },
 "sessions": [
  {
   "title": "LTLT",
   "papers": [
    "loerbroks16_ltlt",
    "burstein16_ltlt",
    "laarmannquante16_ltlt",
    "naganomadsen16_ltlt"
   ]
  }
 ],
 "doi": "10.21437/LTLT.2016"
}