{
 "series": "LW",
 "title": "Laughter and Other Non-Verbal Vocalisations Workshop 2024",
 "location": "Belfast, United Kingdom",
 "startDate": "16/07/2024",
 "endDate": "17/07/2024",
 "URL": "https://www.uni-bielefeld.de/fakultaeten/linguistik-literaturwissenschaft/forschung/fachbereich/phonetik/laughter-workshop-2024/",
 "chair": "Bogdan Ludusan, Marina Cantarutti",
 "conf": "LW",
 "name": "lw_2024",
 "year": "2024",
 "SIG": "",
 "title1": "Laughter and Other Non-Verbal Vocalisations Workshop 2024",
 "booklet": "intro.pdf",
 "date": "16-17 July 2024",
 "month": 7,
 "day": 16,
 "now": 1720791749032310,
 "papers": {
  "mcgettigan24_lw": {
   "authors": [
    [
     "Carolyn",
     "McGettigan"
    ]
   ],
   "title": "Laughter as a tool for investigating human vocal communication",
   "original": "invited01",
   "order": 1,
   "page_count": 1,
   "abstract": [
    "In this talk I will illustrate how my research has used laughter and other non-verbal vocalisations to investigate human vocal communication. Including evidence from behavioural vocal perception and production experiments, functional imaging of the brain, and real-time anatomical imaging of the vocal tract, I will describe how studying the human voice without using spoken words has given us valuable insights into the processing of affective and social cues, vocal identity, and the (neuro)anatomical ground truths of vocal motor control.\n"
   ],
   "p1": 1,
   "pn": 1
  },
  "zellers24_lw": {
   "authors": [
    [
     "Margaret",
     "Zellers"
    ]
   ],
   "title": "Forms and functions of discourse clicks across languages",
   "original": "invited02",
   "order": 2,
   "page_count": 2,
   "abstract": [
    "Clicks are frequently employed across languages as discourse markers, providing information about speaker stance, discourse organization, or social group identity, among other aspects. Most studies to date investigating aspects of discourse structuring have focused on Indo-European languages and Western cultures. I will present an analysis of discourse clicking in conversations in Luganda, spoken in Uganda, and in Khoekhoe, spoken in Namibia. Results will be discussed with an eye to cross-linguistic comparison as well as to possible aspects of language contact versus language universality of discourse-marking functions.\n"
   ],
   "p1": 2,
   "pn": 3
  },
  "gallo24_lw": {
   "authors": [
    [
     "Emanuela",
     "Gallo"
    ],
    [
     "Loredana",
     "Schettino"
    ],
    [
     "Francesco",
     "Cutugno"
    ]
   ],
   "title": "About theee hesitant voice: Acoustic and functional analysis of prolongations in Italian spontaneous speech",
   "original": "01",
   "order": 3,
   "page_count": 3,
   "abstract": [
    "The identification of prolongations is a non-trivial operation generally based on a pragmatic approach linked to the perception of their duration markedness. Also, prolongation studies mostly concerned duration, pitch, and segmental content. Hence, this study investigates the contribution of other acoustic parameters to distinguishing prolonged segments and whether (and how) specific functions associable with prolongations affect their phonetic realisation. The analysis shows that acoustic parameters such as duration, intensity, HNR, jitter and shimmer characterize and distinguish the portion of the segment contextually identifiable as a marked prolongation from the one identifiable as unmarkedly part of the lexical element. In addition, phonetic-prosodic features have been observed to correlate with functional differences, thus supporting the idea that prolongations play a role in marking discourse.\n"
   ],
   "p1": 4,
   "pn": 6,
   "doi": "10.21437/LW.2024-1",
   "url": "lw_2024/gallo24_lw.html"
  },
  "muhlack24_lw": {
   "authors": [
    [
     "Beeke",
     "Muhlack"
    ],
    [
     "Jürgen",
     "Trouvain"
    ],
    [
     "Mitko",
     "Sabev"
    ],
    [
     "Bistra",
     "Andreeva"
    ]
   ],
   "title": "A preliminary study on filler particles in Bulgarian Judeo-Spanish (Ladino)",
   "original": "02",
   "order": 4,
   "page_count": 3,
   "abstract": [
    "In this cross-linguistic study we investigate the vowel quality of filler particles (FPs) produced by Ladino-Bulgarian bilingual speakers compared to monolingual speakers of Bulgarian and Spanish, respectively. The FP vowel quality of the bilinguals in both languages is more similar to the FPs of the monolingual Bulgarian speakers, overlapping with realisations of /a/ and /ɤ/, and not with /e/ as produced in FPs by Spanish speakers. Our data suggests that the presence of a schwa-like central vowel in the inventory influences the FP vowel quality.\n"
   ],
   "p1": 7,
   "pn": 9,
   "doi": "10.21437/LW.2024-2",
   "url": "lw_2024/muhlack24_lw.html"
  },
  "ludusan24_lw": {
   "authors": [
    [
     "Bogdan",
     "Ludusan"
    ]
   ],
   "title": "Obtaining Agreement for Conversational Laughter Function Annotation",
   "original": "03",
   "order": 5,
   "page_count": 3,
   "abstract": [
    "We present a preliminary study into the use of majority agreement between several raters for laughter function annotation of conversational speech data. Six annotators rated laughter events as belonging to one of eight classes, having had knowledge of the immediately preceding context. Computing three measures of inter-rater agreement, we noticed low values for each one of them, denoting considerable disagreement between raters. We then explored whether taking the majority class label could be used instead. The fact that over 80% of the annotated laughter instances were labelled the same by a majority of raters suggests that this option would be feasible.\n"
   ],
   "p1": 10,
   "pn": 12,
   "doi": "10.21437/LW.2024-3",
   "url": "lw_2024/ludusan24_lw.html"
  },
  "jansen24_lw": {
   "authors": [
    [
     "Michel-Pierre",
     "Jansen"
    ],
    [
     "Khiet P.",
     "Truong"
    ],
    [
     "Dirk K.J.",
     "Heylen"
    ]
   ],
   "title": "Exploring bottom up functional laughter classification",
   "original": "04",
   "order": 6,
   "page_count": 2,
   "abstract": [
    "When engaged in a conversation, people may laugh for different reasons. Laughs can take different forms. There has been extensive research into classifying laughter in terms of its function, its form and the correlation between function and form. In this paper, we report on a study that explores how a group of non-expert participants create their own functional taxonomies of laughter given limited instructions. This exploratory approach involves an open card-sorting format for clustering laughter. In total 37 participants each sorted 24 stimuli in self created bins. In this paper, we present the criteria for the classes the participants came up with.\n"
   ],
   "p1": 13,
   "pn": 14
  },
  "hegarty24_lw": {
   "authors": [
    [
     "Katie",
     "Hegarty"
    ],
    [
     "Maria",
     "Koutsombogera"
    ],
    [
     "Anna",
     "Esposito"
    ],
    [
     "Carl",
     "Vogel"
    ]
   ],
   "title": "Evidence for Categories of Laughter",
   "original": "05",
   "order": 7,
   "page_count": 3,
   "abstract": [
    "A binary classification of laughter according to a functional dimension of venting mirth vs. moving discourse along is considered in relation to a three-way social classification of any instance of laughter as solo, ratifying or ratified (the latter two understood as shared laughter). Tests of these classifications with an extant dialogue data set are conducted in order to assess whether they interact: significant interaction is taken as evidence that the categorizations are informative. Interactions with other phenomena, like personality traits, are similarly assessed. Each cross-classification reveals significant interactions.\n"
   ],
   "p1": 15,
   "pn": 17,
   "doi": "10.21437/LW.2024-4",
   "url": "lw_2024/hegarty24_lw.html"
  },
  "trouvain24_lw": {
   "authors": [
    [
     "Jürgen",
     "Trouvain"
    ],
    [
     "Richard",
     "Ogden"
    ],
    [
     "Marina",
     "Cantarutti"
    ]
   ],
   "title": "On visualising timing aspects of overlapping laughter in conversational speech",
   "original": "06",
   "order": 8,
   "page_count": 3,
   "abstract": [
    "New forms of visualisations can help to draw attention to details of analysis. Here, we suggest new combinations of visual information for a better analysis of timing of elements of joint laughter in conversations.\n"
   ],
   "p1": 18,
   "pn": 20,
   "doi": "10.21437/LW.2024-5",
   "url": "lw_2024/trouvain24_lw.html"
  },
  "wang24_lw": {
   "authors": [
    [
     "Kexin",
     "Wang"
    ],
    [
     "Carlos",
     "Ishi"
    ],
    [
     "Ryoko",
     "Hayashi"
    ]
   ],
   "title": "Preliminary analysis of facial expressions and body movements of four types of laughter",
   "original": "07",
   "order": 9,
   "page_count": 3,
   "abstract": [
    "In the present work, we explored the facial expressions and body movements of different laughter types. 1806 laughter events were extracted from a multimodal dataset of three-party conversations, categorized into four types: mirthful, boosting, smoothing, and softening. The results showed that laughter performing different social functions is related to different visual expression patterns. Mirthful and boosting laughter showed a similar tendency that be accompanied by larger changes in facial expressions and body movements than smoothing and softening laughter, for example, higher cheeks raising, wider mouth open and apparent upper body frontward. We also attempted to analyze the dynamic changes occurring within a laughter event. Our findings provide hints for the design of human-like conversational agents.\n"
   ],
   "p1": 21,
   "pn": 23,
   "doi": "10.21437/LW.2024-6",
   "url": "lw_2024/wang24_lw.html"
  },
  "mckeown24_lw": {
   "authors": [
    [
     "Gary",
     "McKeown"
    ],
    [
     "Ellen",
     "McCandless"
    ],
    [
     "Caitlin",
     "Ferris"
    ]
   ],
   "title": "I Guess You Had to Be There: Group Laughter Is Perceived to Be Funnier Than Its Laughable",
   "original": "08",
   "order": 10,
   "page_count": 3,
   "abstract": [
    "The assumed link between humour and laughter has been questioned as laughter is common in non-humorous social scenarios. We explore the relationship between laughter and laughables. Using laughs and laughables extracted from a story-telling scenario. We examined the sociality (number of laughers) and target of laughter (a self-generated laughable or other-generated laughable). Raters perceived the funniness associated with a laugh to be similar to that of the laughable in all case but the social laughs from other people's laughables. In that case, laughs are perceived to be from a laughable that was funnier than the actual laughable was judged to be. Sociality appears to add funniness value to laughter.\n"
   ],
   "p1": 24,
   "pn": 26,
   "doi": "10.21437/LW.2024-7",
   "url": "lw_2024/mckeown24_lw.html"
  },
  "mazzocconi24_lw": {
   "authors": [
    [
     "Chiara",
     "Mazzocconi"
    ],
    [
     "Caterina",
     "Petrone"
    ],
    [
     "Maud",
     "Champagne-Lavau"
    ]
   ],
   "title": "How do laughter and speech interact, when context is available?",
   "original": "09",
   "order": 11,
   "page_count": 3,
   "abstract": [
    "Laughter can affect the meaning of speech. While laughter with a standalone sentence is interpreted as a sign of incongruity between what is said and what is uttered, laughter in conversation can have different meanings, and recent studies showed the crucial role of context in emotional expression interpretation. We explored the influence of low-arousal laughter on attributions of ironic intentions to speakers, considering verbal contextual cues. By manipulating the degree of incongruity between the context and the target utterance, and laughter presence, we found contextual incongruity to be the main predictor of irony perception. Laughter affects interpretations exclusively in ambiguous contexts, but dissimilarly depending on individual differences in laughter perception. Our study shows the contextual nature of laughter interpretation and highlights the importance of considering non-verbal cues and individual differences in understanding multimodal meaning and pragmatic processes.\n"
   ],
   "p1": 27,
   "pn": 29,
   "doi": "10.21437/LW.2024-8",
   "url": "lw_2024/mazzocconi24_lw.html"
  },
  "oforiward24_lw": {
   "authors": [
    [
     "Lillian",
     "Ofori Ward"
    ],
    [
     "Mele",
     "Taumoepeau"
    ]
   ],
   "title": "How are emotions perceived in nonverbal vocalisations? Evidence from a playback experiment and acoustic analysis",
   "original": "10",
   "order": 12,
   "page_count": 3,
   "abstract": [
    "Previous studies of the perception of nonverbal vocalisations have reported conflicting findings regarding how many emotions can be perceived, and whether emotion category or dimensions (e.g. arousal) best model perception. This study investigated emotion perception for 30 categories of nonverbal vocalisations, factors that influence perception, and associated acoustic features. In a playback experiment of 1269 vocalisations, with 56 participants (28 m), where each vocalisation was listened to by 14 participants, 24 emotions were identified significantly above chance. Accuracy was significantly affected by the vocaliser and the listener, and semantically similar emotions were confused, as were those with similar arousal and approach/avoid dimensions, but not valence. Significant associations between acoustic features and accuracy supported some predictions based on vocalisations' hypothesised function, but limited significant relationships highlighted the complexity of this behaviour.\n"
   ],
   "p1": 30,
   "pn": 32,
   "doi": "10.21437/LW.2024-9",
   "url": "lw_2024/oforiward24_lw.html"
  },
  "kosmala24_lw": {
   "authors": [
    [
     "Loulou",
     "Kosmala"
    ]
   ],
   "title": "Tongue clicks in L1 and L2: sequential and embodied practices",
   "original": "11",
   "order": 13,
   "page_count": 3,
   "abstract": [
    "The present study looks into the multimodal uses of tongue clicks in the productions of American and French speakers in tandem interactions (L1-L2 context) across different turn positions. It provides an overview of the total distribution of clicks in the whole dataset, as well as more in-depth micro-analyses of participants’ sequential and embodied practices in data fragments. Analyses shed light on the use of clicks in L2 in particular, an area of study which remains underexplored, and accounts for their multifunctional and multimodal nature.\n"
   ],
   "p1": 33,
   "pn": 35,
   "doi": "10.21437/LW.2024-10",
   "url": "lw_2024/kosmala24_lw.html"
  },
  "niculescu24_lw": {
   "authors": [
    [
     "Oana",
     "Niculescu"
    ]
   ],
   "title": "An exploratory analysis on the frequency distribution and duration of inbreaths in Romanian monologue speech",
   "original": "12",
   "order": 14,
   "page_count": 3,
   "abstract": [
    "This study explores audible inhalations in monologue speech in terms of distribution and temporal patterns. Based on data derived from the Ro-Phon corpus, our findings show that: inhalation noises share a similar frequency of occurrence with silent pauses; embedded and utterance-final breath intakes account for 80% of the data, while inbreaths surfacing as an offset of laughter (95% of the time 'voiceless') or during speech laugh display the lowest frequency of occurrence; similar to what was previously observed in conversational data, the average duration of inhalation noises in monologue speech is 503 ms. Our results also reveal that inbreaths display sequential multi-phase airflow intake of up to three phases, a topic that will be explored in future studies.\n"
   ],
   "p1": 36,
   "pn": 38,
   "doi": "10.21437/LW.2024-11",
   "url": "lw_2024/niculescu24_lw.html"
  },
  "edwards24_lw": {
   "authors": [
    [
     "David",
     "Edwards"
    ]
   ],
   "title": "Acoustic Parameter Selection for Identification of Turn-Taking Cues",
   "original": "13",
   "order": 15,
   "page_count": 3,
   "abstract": [
    "To quantify turn-taking behaviors, researchers have used differing methods for distinguishing between sound and silence periods and for grouping consecutive sounds together. However, the intensity and duration of sounds are both continuous variables that do not neatly lend themselves to a binary categorization that will serve various analytic purposes equally well. This paper evaluates various acoustic parameter settings and algorithms for the determination of sounds and silences in audio corpora, but the information may also provide value to other researchers in choosing different parameter settings for their particular research questions, including identification of non-verbal vocalizations.\n"
   ],
   "p1": 39,
   "pn": 41,
   "doi": "10.21437/LW.2024-12",
   "url": "lw_2024/edwards24_lw.html"
  },
  "mazzocconi24b_lw": {
   "authors": [
    [
     "Chiara",
     "Mazzocconi"
    ],
    [
     "Benjamin",
     "O'Brien"
    ],
    [
     "Abdellah",
     "Fourtassi"
    ]
   ],
   "title": "Laughter Responsiveness and Acoustic Alignment in Parent-Child and Adult-Adult Interaction",
   "original": "14",
   "order": 16,
   "page_count": 3,
   "abstract": [
    "While alignment in laughter production has been shown in adults, its presence in children remains understudied. We examined laughter responsiveness and acoustic alignment in middle childhood, comparing parent-child and parent-adult computer-mediated conversations. While no significant differences were found in laughter frequency, antiphonal laughter was less frequent in parent-child interactions, despite intra-dyadic balance. Acoustic analysis revealed an increase in low-frequency spectral modulations in antiphonal laughter. To test whether this was due to local alignment with the preceding laughter, we compared distances from genuine and pseudo-random initiating-antiphonal laughter pairs. In parent-adult interactions, genuine laughter pairs exhibited greater acoustic similarity than pseudo-random pairs, a pattern absent in parent-child interactions. Our study contributes to discussions on alignment theories and the role of laughter in pragmatic development.\n"
   ],
   "p1": 42,
   "pn": 44,
   "doi": "10.21437/LW.2024-13",
   "url": "lw_2024/mazzocconi24b_lw.html"
  },
  "giannitzi24_lw": {
   "authors": [
    [
     "Eleni",
     "Giannitzi"
    ],
    [
     "Vladislav",
     "Maraev"
    ],
    [
     "Christine",
     "Howes"
    ]
   ],
   "title": "Reacting to the last laugh: Probing non-humorous laughter with Furhat robot",
   "original": "15",
   "order": 17,
   "page_count": 3,
   "abstract": [
    "This paper explores how laughter can be added into a negotiative dialogue with a Furhat, the socially interactive agent (SIA). We present a proof-of-concept method of manipulating robot responses generated by a large language model through the interventions of a human operator. We conduct a pilot experiment focussing on people’s perception of Furhat in case of two intervention types: laughter reciprocation and laughter clarification requests.\n"
   ],
   "p1": 45,
   "pn": 47,
   "doi": "10.21437/LW.2024-14",
   "url": "lw_2024/giannitzi24_lw.html"
  }
 },
 "sessions": [
  {
   "title": "Keynote 1",
   "papers": [
    "mcgettigan24_lw"
   ]
  },
  {
   "title": "Keynote 2",
   "papers": [
    "zellers24_lw"
   ]
  },
  {
   "title": "Session 1",
   "papers": [
    "gallo24_lw",
    "muhlack24_lw"
   ]
  },
  {
   "title": "Session 2",
   "papers": [
    "ludusan24_lw",
    "jansen24_lw",
    "hegarty24_lw"
   ]
  },
  {
   "title": "Session 3",
   "papers": [
    "trouvain24_lw",
    "wang24_lw",
    "mckeown24_lw",
    "mazzocconi24_lw"
   ]
  },
  {
   "title": "Session 4",
   "papers": [
    "oforiward24_lw",
    "kosmala24_lw",
    "niculescu24_lw",
    "edwards24_lw"
   ]
  },
  {
   "title": "Session 5",
   "papers": [
    "mazzocconi24b_lw",
    "giannitzi24_lw"
   ]
  }
 ],
 "doi": "10.21437/LW.2024"
}
