{
 "title": "Models and Analysis of Vocal Emissions for Biomedical Applications (MAVEBA 2001)",
 "location": "Florence, Italy",
 "startDate": "13/9/2001",
 "endDate": "15/9/2001",
 "conf": "MAVEBA",
 "year": "2001",
 "name": "maveba_2001",
 "series": "MAVEBA",
 "SIG": "",
 "title1": "Models and Analysis of Vocal Emissions for Biomedical Applications",
 "title2": "(MAVEBA 2001)",
 "date": "13-15 September 2001",
 "papers": {
  "pelorson01_maveba": {
   "authors": [
    [
     "Xavier",
     "Pelorson"
    ],
    [
     "Mico",
     "Hirschberg"
    ]
   ],
   "title": "Physical models of the vocal folds including pathologies",
   "original": "mv01_001",
   "page_count": 1,
   "order": 1,
   "p1": "1",
   "pn": "",
   "abstract": [
    "The production of voiced sounds is now well understood as being the result of a spectacular interaction between an elastic structure, the vocal folds, and an airflow coming from the lungs. Under certain circumstances an instability, a flutter, can indeed occur and can lead to a self-sustained oscillation of the vocal folds.   One of the goal of physical modelling is, first of all, to try to understand what are the basic mechanical and fluid mechanical phenomenon involved during phonation. When studying pathologies such as vocal folds paralysis or (partial-) laryngectomy, physical modelling can gain sometimes an extra interest as a valuable tool not only for diagnostic or analysis purposes (e.g. Herzel, 1996) but also for predicting the consequences of surgery events or for the design of voice prosthesis (Lous et al., 1998).   In this presentation, a review of existing physical models of the vocal folds, and their relevance for the purpose of voice pathology studies, will be presented. In particular it will be shown that one has to face the problem dealing with the trade-off that has to be done between the complexity of the studied phenomenon (especially when pathologies are present) and the necessary assumptions or simplifications of the models.   Lastly, it will be shown that the real challenge of physical models is not to increase the number of parameters but to decrease it to a physiologically plausible amount. In depth physical studies of critical events such as the onset of voicing, the mechanical contact of the vocal folds or the physical boundary conditions can help in that purpose as it will be demonstrated.\n",
    "s: Herzel H. (1996) \"Possible mechanisms of vocal instabilities\" in Vocal Folds Physiology, P.J. Davis and N.H. Fletcher Eds, Singular Publishing Group, San Diego. 63-75. N.J.C. Lous, G.C.J. Hofmans, R.N.J. Veldhuis, A. Hirschberg (1998) \"A Symmetrical Two- Mass Vocal-Fold Model Coupled to Vocal Tract and Trachea, with Application to Prosthesis Design\", Acta Acustica, 84, 1135-1150.\n",
    ""
   ]
  },
  "howard01_maveba": {
   "authors": [
    [
     "David M.",
     "Howard"
    ]
   ],
   "title": "The real and the non-real in speech measurements",
   "original": "mv01_035",
   "page_count": 10,
   "order": 2,
   "p1": "35",
   "pn": "44",
   "abstract": [
    "The measurement of parameters from the output acoustic pressure waveform during speech has been a common activity in speech science laboratories for a number of decades. The widespread availability of personal computers with more than adequate processing capability to carry out speech analysis means that speech analysis is now commonly available and many more users have access to it. Indeed, there are some highly comprehensive speech analysis software packages available for PC computers as freeware. However, the results gained from speech analysis are not always a function only of the speech input itself. There are some often surprising pitfalls to be aware of due to the nature of the chosen measurement technique itself. This paper explores commonly applied speech analysis techniques and focuses particularly on potential pitfalls and their consequences.\n",
    ""
   ]
  },
  "wermke01_maveba": {
   "authors": [
    [
     "Kathleen",
     "Wermke"
    ],
    [
     "Werner",
     "Mende"
    ]
   ],
   "title": "Analysis of cries of singletons and twins during the first year of life",
   "original": "mv01_075",
   "page_count": 4,
   "order": 3,
   "p1": "75",
   "pn": "78",
   "abstract": [
    "The approach of our cry investigations is explained on the background of long-term analysis in singletons and twins. The focus is set on analyses of the fundamental frequency and its variations in time. Time variations of the fundamental frequency on different time scales are characterised with concern to their importance for the description of developmental stages. Behind a high variability of most cry features a universal program for prespeech development is hypothesised.\n",
    ""
   ]
  },
  "fujimura01_maveba": {
   "authors": [
    [
     "Osamu",
     "Fujimura"
    ]
   ],
   "title": "Voice quality as an aspect of prosodic control in speech utterance: the base function representation of the c/d model",
   "original": "mv01_123",
   "page_count": 2,
   "order": 4,
   "p1": "123",
   "pn": "124",
   "abstract": [
    "Traditionally, based on the phoneme concatenation and coarticulation concept, speech signals were interpreted as a linear string of consonants and vowels to represent the sound aspect of a linguistic form. The so-called suprasegmental characteristics of speech signals were typically represented by the voice fundamental frequency contour as a time function, associated with the linear string of phonemic segments. A new syllable-based phonetic theory of speech signal organization, the Converter-Distributor model [Fujimura, Phonetica 2000] describes speech signals as a base function with superimposed local articulatory movement patterns for consonantal gestures. The base function comprises, as its aspects, vowels representing the time series of syllable nuclei as well as jaw opening control and the voice function. Voice quality control is part of the voice function. The voice pitch (F0) change, from this point of view, is one (important and robustly observable) of the physical variables of voice quality control. Such base function aspects constitute the phonetic melody. In parallel, a syllable-boundary pulse train representing the metrical organization of the speech signal constitutes the phonetic skeleton (in an extended sense of the terminology used in nonlinear phonology). The phonetic melody is linked to the skeleton syllable by syllable.   Voice quality control, in this sense, includes voice pitch change, control of the speech spectral envelope, and the temporal span and variability of voicing conditions. It is to be noted, however, that the same physical variables, such as the voice fundamental frequency, are affected by metrical conditions also, in particular the syllable pulse magnitude, even without independent control based on phonological tonal features, such as lexical or phrasal tone/accent control.   In singing, depending on the musical genre, the same singer can choose consciously a particular voice quality, by setting system parameters of the phonetic implementation process, from the C/D model point of view. Estill [1997] proposed six basic qualities. Some temporal perturbation characteristics in the six different voice qualities are discussed by Kawahara, Estill, and Fujimura in this meeting, using Kawahara's new signal processing method STRAIGHT.\n",
    ""
   ]
  },
  "izworski01_maveba": {
   "authors": [
    [
     "Andrzej",
     "Izworski"
    ]
   ],
   "title": "Speech processing and recognition using artificial intelligence methods",
   "original": "mv01_228",
   "page_count": 2,
   "order": 5,
   "p1": "228",
   "pn": "229",
   "abstract": [
    "Many problems related to analysis and recognition of sound signals are characterized by the fact that finding the proper analysis rule or the proper recognition algorithm is very difficult. In addition the signal analysis methods and the methods of its recognition must be strictly adapted to the specific features of the particular task considered. It is worth noticing, that the situation is essentially different from the one encountered in the sound processing. The method of low- and high-pass filtering, compression techniques or algorithms of spectral transformations for a sound signal do not actually depend on the type of signal or the purpose for which it is being registered and processed. Therefore in the field of sound signal processing an enormous progress has been achieved, and the elaborated methods are to a high degree universal. The effect is additionally enhanced by the availability of affordable [lowcost] and convenient DSP technique. On the contrary in the tasks of sound signals analysis and processing the progress is much slower and the unification of methods and standardization of algorithms encounters considerable difficulties. The main source of these difficulties is the fact that in almost every task of signal analysis the features to be extracted and the required signal parameters are different, they are strongly dependent on the specific task being solved and they are expected to provide answers for different questions. Similarly in the tasks of sound signal recognition the criteria and goals of their classification can be very different - even for the same signal types.   Yet, the approach unification in the above mentioned field is strongly recommended, because it enables[promotes] more cost-effective and faster development of the required solutions for particular problems. It seems that in the field of analysis and recognition of sound signals a very promising direction in the search for such unification, and the universal solutions which might lead to it, are the methods used in the artificial intelligence research.\n",
    ""
   ]
  },
  "horacek01_maveba": {
   "authors": [
    [
     "Jaromír",
     "Horáček"
    ],
    [
     "Jan G.",
     "Švec"
    ],
    [
     "Jan",
     "Veselý"
    ],
    [
     "Erkki",
     "Vilkman"
    ],
    [
     "Ivo",
     "Klepáček"
    ],
    [
     "Aleš",
     "Vetešník"
    ]
   ],
   "title": "Measurement of the vocal-fold vibration behaviour in excised human larynges",
   "original": "mv01_002",
   "page_count": 6,
   "order": 6,
   "p1": "2",
   "pn": "7",
   "abstract": [
    "The contribution presents information on the experimental investigation of the glottal sound source with excised human larynges. The vocal fold vibrations were excited by airflow and monitored acoustically, electroglottographically as well as by means of laser vibrometry, pressure transducers, videokymography and stroboscopy techniques. The paper is focused on 1) presenting a method for monitoring non-linear vibration effects, when bifurcations appear during phonation by changing the tension of the vocal folds, and 2) on development of a method for casting laryngeal cavities using plaster and metal materials for determining the vocal fold shape in a defined phonation position.\n",
    "Index Terms. Non-linear dynamics, bifurcation phenomena, laryngoscopy, videokymography, chest-falsetto jumps, vocal fold shape\n",
    ""
   ]
  },
  "vilain01_maveba": {
   "authors": [
    [
     "C.",
     "Vilain"
    ],
    [
     "Xavier",
     "Pelorson"
    ],
    [
     "A.",
     "Hirschberg"
    ],
    [
     "J. F. H.",
     "Willems"
    ],
    [
     "L. Le",
     "Marre"
    ]
   ],
   "title": "Study of the airflow through in-vitro oscillating pathological vocal folds",
   "original": "mv01_008",
   "page_count": 6,
   "order": 7,
   "p1": "8",
   "pn": "13",
   "abstract": [
    "We present in this study experimental and theoretical results concerning the behaviour of the airflow through the glottis during phonation. This work follows our previous study on the behaviour of the flow in asymmetric models of vocal folds modelling pathologies. For sake of better control of the parameters, the vocal folds models were rigid but supplied with oscillating airflow. The measurements are now carried out on a more realistic set-up that reproduces the selfsustained oscillations of the vocal folds. It is inspired by previous works on brass player lips oscillations. By modifying asymmetricaly the mechanical properties of the vocal folds models we can simulate pathologies. We then try to reproduce the measured phenomena by use of numerical simulation with a two-mass model inspired by Lous et all..   In the first section, we describe the experimental set-up we use in this study, then we look at measurements with a special care to ‘pathological' cases. Finally, after a brief description of the numerical model, we present numerical simulations that fit our experimental data.\n",
    ""
   ]
  },
  "belforte01_maveba": {
   "authors": [
    [
     "Guido",
     "Belforte"
    ],
    [
     "Massimiliana",
     "Carello"
    ]
   ],
   "title": "Experimental comparison between Staffieri and new tracheo-oesophageal prostheses",
   "original": "mv01_014",
   "page_count": 7,
   "order": 8,
   "p1": "14",
   "pn": "20",
   "abstract": [
    "Phonatory valves are prostheses for the voice rehabilitation of patients that have lost the vocal function due to a total laryngectomy operation. The prosthesis is positioned in a fistula and recreates a communication via between the airway and the digestive tract, realising a one-way valve.   In this paper the experimental results obtained with Staffieri and new tracheo-oesophageal prostheses are presented. The valves have been experimentally tested under different conditions of airflow through the valve and tracheal side pressure; the data have allowed to calculate the airflow resistance, the parameter usually used to compare the performance of valves. The valves have also been experimentally tested under different condition of fluid flow through the valve and oesophageal side dynamic pressure; the use of a dynamic pressure better reproduce the real functioning of the valve.   Comparing the airflow resistance of the Staffieri and new tracheo-oesophageal prostheses with different angular extension of the razor thin slit a it has been observed that the parameter a has a significant influence on flow characteristics; while the influence of the shape of the hat is negligible for smaller a and became important for the bigger a considered. Regarding the reverse flow, it is pointed out that for most of the valve (Staffieri and new prosthesis), at different oesophageal pressures the fluid flow is smaller than the flow that can be tolerated by the patients without giving problems.\n",
    "Index Terms. total laryngectomy, voice rehabilitation, voice prosthesis, voice button, phonatory valve, low resistance.\n",
    ""
   ]
  },
  "kitajima01_maveba": {
   "authors": [
    [
     "Kazutomo",
     "Kitajima"
    ],
    [
     "Hideyuki",
     "Kataoka"
    ],
    [
     "Shigehiro",
     "Owaki"
    ]
   ],
   "title": "Effects of transglottal pressure on fundamental frequency of phonation: study with a rubber model",
   "original": "mv01_021",
   "page_count": 6,
   "order": 9,
   "p1": "21",
   "pn": "26",
   "abstract": [
    "Transglottal pressure affects fundamental frequency of phonation (Fo). When we plot Fo-change per unit change of transglottal pressure (dF/dP) as function of Fo, the values for dF/dP showed a non-linear or V-shaped relationship against Fo. In this study, we calculated the values for dF/dP with a rubber model under various condition of length and weight of the vibrating part, aiming to reproduce a similar relationship between dF/dP and Fo that has been observed in humans. The results showed that an increase in the length decreased dF/dP, and increased Fo. An increase in the weight decreased dF/dP, and decreased Fo as well. Using selected data, we were able to reproduce a V-shaped relationship between dF/dP and Fo, which is similar to that observed in humans. Based on the results, we speculate that, in humans, length-change of the vocal folds determines Fo at a lower Fo, and weight-change determines Fo at a higher Fo.\n",
    "Index Terms. fundamental frequency of phonation, model experiment, transglottal pressure\n",
    ""
   ]
  },
  "dollinger01_maveba": {
   "authors": [
    [
     "Michael",
     "Döllinger"
    ],
    [
     "Ulrich",
     "Hoppe"
    ],
    [
     "Stefan",
     "Schuberth"
    ],
    [
     "Frank",
     "Hettlich"
    ],
    [
     "Ulrich",
     "Eysholdt"
    ]
   ],
   "title": "Detecting asymmetries in high speed observations of vocal folds during phonation",
   "original": "mv01_027",
   "page_count": 8,
   "order": 10,
   "p1": "27",
   "pn": "34",
   "abstract": [
    "In this paper we describe an approach for extracting asymmetry proportions of vocal folds which affect vibrations. Combining high speed observations with the two-mass model by Ishizaka & Flanagan (1972) as modified by Steinecke & Herzel (1995) an inversion algorithm, is presented which allows the identification of physiological parameters of the vocal folds. The problem can be regarded as an optimization problem with a non-convex objective function. Therefore, the choice of appropriate initial values is important. It can be automized by using spectral features of the mass trajectories. The applicability of the inversion, procedure to high speed observations of vocal fold vibrations is demonstrated in a case of functional dysphonia and in a healthy voice.\n",
    "Index Terms. high speed glottography, two mass model, inversion\n",
    ""
   ]
  },
  "mende01_maveba": {
   "authors": [
    [
     "Werner",
     "Mende"
    ]
   ],
   "title": "Problems and pitfalls in pitch estimation of infant cries and voice signals",
   "original": "mv01_045",
   "page_count": 3,
   "order": 11,
   "p1": "45",
   "pn": "47",
   "abstract": [
    "[Abstract not available]\n",
    ""
   ]
  },
  "moore01_maveba": {
   "authors": [
    [
     "Christopher J.",
     "Moore"
    ],
    [
     "Susan",
     "Jones"
    ]
   ],
   "title": "Stimulated production of vowel-like LX-waveforms and spectral damping in the absence of phonation",
   "original": "mv01_048",
   "page_count": 5,
   "order": 12,
   "p1": "48",
   "pn": "52",
   "abstract": [
    "Impedance ‘LX' waveforms measured across the neck at the thyroid level during phonation are known to be correlated with vocal fold movement. Changes in vocal fold contact are thought to be the cause of this phenomenon though emerging applications in radiotherapy indicate that both fold and neck tissues are correlated with LX waveform shape. In this paper it is shown that a two-stage tissue damping model with controlled bandpass and passive low pass components is consistent with evidence from gradually degraded, controlled phonation. In particular it is shown that an externally applied stimulus to the vertebral processes of the neck can produce similar impedance waveforms in the absence of phonation and hence no controlled fold contact. It is postulated that this is evidence for radial pressure waves contributing to the classic ‘LX' impedance waveforms and that the primary mechanism for impedance changes may not simply be due to vocal fold contact per se.\n",
    "Index Terms. Impedance waveforms; Stimulated vowels; Phonation; Radial vibration; Damping, Control function; Normalised spectra\n",
    ""
   ]
  },
  "misun01_maveba": {
   "authors": [
    [
     "Vojtěch",
     "Mišun"
    ]
   ],
   "title": "The sound-damping characteristics of the vocal tract cavities",
   "original": "mv01_053",
   "page_count": 6,
   "order": 13,
   "p1": "53",
   "pn": "58",
   "abstract": [
    "The spectral and modal properties of the vocal tract are important acoustic characteristics since they take part in generating the formants of individual vowels. The positions of vowel formants on the spectrum frequency axis are mainly determined by the parameters and properties of the vocal tract: its size and geometry, boundary conditions ( opening mouth and glottis, closing ) and absorption characteristics of its walls. This paper presents results of experimental analysis of acoustic damping properties of the pig's vocal tract soft parts (tongue) which are, with regard to the acoustic properties in focus, related to the human vocal tract properties. The overview of the experimental methods for evaluation of the damping factors of acoustic cavities is also presented in the paper.\n",
    "Index Terms. Vocal tract, Acoustic cavity, Acoustic damping factors, Absorption coefficient\n",
    ""
   ]
  },
  "kawahara01_maveba": {
   "authors": [
    [
     "Hideki",
     "Kawahara"
    ],
    [
     "Jo",
     "Estill"
    ],
    [
     "Osamu",
     "Fujimura"
    ]
   ],
   "title": "Aperiodicity extraction and control using mixed mode excitation and group delay manipulation for a high quality speech analysis, modification and synthesis system STRAIGHT",
   "original": "mv01_059",
   "page_count": 6,
   "order": 14,
   "p1": "59",
   "pn": "64",
   "abstract": [
    "A new control paradigm of source signals for high quality speech synthesis is introduced to handle a variety of speech quality, based on timefrequency analyses by the use of an instantaneous frequency and group delay. The proposed signal representation consists of a frequency domain aperiodicity measure and a time domain energy concentration measure to represent source attributes, which supplement the conventional source information, such as F0 and power. The frequency domain aperiodicity measure is defined as a ratio between the lower and upper smoothed spectral envelopes to represent the relative energy distribution of aperiodic components. The time domain measure is defined as an effective duration of the aperiodic component. These aperiodicity parameters and F0 as time functions are used to generate the source signal for synthetic speech by controlling relative noise levels and the temporal envelope of the noise component of the mixed mode excitation signal, including fine timing and amplitude fluctuations. A series of preliminary simulation experiments was conducted to test and to demonstrate consistency of the proposed method. Examples sung in different voice qualities were also analyzed and resynthesized using the proposed method.\n",
    "Index Terms. Fundamental frequency; Voice perturbation; Instantaneous frequency; Group delay; Aperiodicity; Fluctuation\n",
    ""
   ]
  },
  "schindler01_maveba": {
   "authors": [
    [
     "A.",
     "Schindler"
    ],
    [
     "M. L.",
     "Garetto"
    ],
    [
     "M. Spadola",
     "Bisetti"
    ],
    [
     "F.",
     "Ottaviani"
    ],
    [
     "O.",
     "Schindler"
    ]
   ],
   "title": "Pitch control in tracheoesophageal voice",
   "original": "mv01_065",
   "page_count": 4,
   "order": 15,
   "p1": "65",
   "pn": "68",
   "abstract": [
    "Nowadays tracheoesophageal voice prosthesis after total laryngectomy are widely used. Data on maximum phonation time and spectrum have been studied by different authors and are well known. On the contrary pitch control did not received much attention.   Pitch has an important role not only in singing but also in the prosodic characteristics of speech. To our knowledge pitch variations have been studied in tone languages, but the ability to voluntarily change pitch were not investigated so far. Aim of our study is to analyze the ability of tracheoespphageal voice users to change pitch.   Twelve male subjects underwent total laryngectomy and a tracheoesophageal prosthesis was inserted. Maximum phonation time was calculated. Each subject was then asked to sing a well known italian song with an interval of a fifth. CSL 4300 B was used for acoustic analysis. Their performance were stored in the PC. A narrow band sonagram was performed and pitch variation analyzed.   Tracheoesophageal voice users were able to change pitch, but their control was rather poor. It is concluded that tracheoesophageal voice allows pitch variations, but their control appears difficult. Considerations on the influence of time from voice prosthesis insertion, maximum phonation time and spectrum are made.\n",
    ""
   ]
  },
  "dedouch01_maveba": {
   "authors": [
    [
     "Karel",
     "Dedouch"
    ],
    [
     "Jaromír",
     "Horáček"
    ],
    [
     "Tomáš",
     "Vampola"
    ],
    [
     "Přemysl",
     "Kršek"
    ],
    [
     "Jan G.",
     "Švec"
    ]
   ],
   "title": "Mathematical modelling of male vocal tract",
   "original": "mv01_069",
   "page_count": 6,
   "order": 16,
   "p1": "69",
   "pn": "74",
   "abstract": [
    "Acoustic characteristics of two types of finite element (FE) models of male vocal tract are compared in the paper. The first FE model was constructed from the data published by Story et al. (1996) on vocal tract geometry in English vowels /a/ and /i/. The design of this simplified FE model of the vocal tract was very laborious, however. For the second model, geometry of vocal tract shape for Czech vowels was obtained from a native Czech speaker using the magnetic resonance imaging (MRI) technique. An automatic procedure was developed which enabled to transform the MRI data files into a second, physiologically more plausible FE model. Acoustic frequency-modal characteristics of both FE models are computed and compared with the data known from literature.\n",
    "Index Terms. Acoustic modes and formant frequencies, finite element models, magnetic resonance imaging technique\n",
    ""
   ]
  },
  "bolfanstosic01_maveba": {
   "authors": [
    [
     "Natalija",
     "Bolfan-Stošiċ"
    ],
    [
     "Emica",
     "Farago"
    ]
   ],
   "title": "Acoustic features of voice of children with motoric disorders",
   "original": "mv01_079",
   "page_count": 5,
   "order": 17,
   "p1": "79",
   "pn": "83",
   "abstract": [
    "The sample of this research were seven children with neuro-motoric disorders (of both sexes- 3 girls and 4 boys). Acoustic analysis of voice parameters, representing variables in this research (fundamental frequency, jitter, shimmer, harmonic to noise ratio as well as maximum duration of the vowel /a/) has been made by using EZ Voice Plus program for voice analysis. The results of correlation matrix obtained by Statistica for Windows Ver.4.0 show significant negative correlation between frequency of laryngeal tone and jitter, and HNR and jitter. Acoustic analysis of the phonation of the vowel /a/ of this group shows great deviation of the voice from the normal, which points to the problem of non-development of voice quality in motoric disorders group mainly resulting from neglected therapy of speech and voice.\n",
    "Index Terms. jitter, shimmer, fundamental frequency, harmonic to noise ratio, voice quality, cerebral palsy, acoustical analyses\n",
    ""
   ]
  },
  "escobedobeceiro01_maveba": {
   "authors": [
    [
     "Daniel I.",
     "Escobedo Beceiro"
    ],
    [
     "Sergio D.",
     "Cano Ortiz"
    ],
    [
     "Eddy",
     "Coello Frometa"
    ],
    [
     "Luis",
     "Regüeiferos Prego"
    ],
    [
     "Leonardo",
     "Capdevila Bravo"
    ]
   ],
   "title": "Rising shift of pitch frequency in the infant cry of some pathologic cases",
   "original": "mv01_084",
   "page_count": 7,
   "order": 18,
   "p1": "84",
   "pn": "90",
   "abstract": [
    "In this paper is described the procedure employed in order to obtain the Fundamental Frequency or Pitch of the Infant Cry Signal of 11 cases (children) with different pathologies. A sample of the normal behavior pattern of the pitch as a reference case is included. This paper presents a way to get the Rising Shifts of Pitch Frequency (RSPF), besides others features of it. The result obtained shows certain coincidence of this shifts with the existence of this phenomenon in pathological cases, this is an important aspect that can be considered in the design of tools for help to diagnose in the infant cry.   In the software and hardware of this work is remarkable the use of the PCVOX program and the VISHA electronic card both products made in Spain, the BPVOZ program made by us (Voice Processing Group), besides of the IBM Microcomputer or Compatible. The short-time analysis and different programming language are used for the signal processing, for example: C++ in the program for the found and counter of the shift frequency.   This work was developed by members of the Voice Processing Group of the University of Oriente joined to the specialists of the Southern Maternity Hospital and General Hospital of Santiago, all entities of Santiago de Cuba.\n",
    "Index Terms. Pitch; Fundamental frequency; Rising shifts of pitch; Shift frequency; Infant cry analysis; Voice processing\n",
    ""
   ]
  },
  "escobedobeceiro01b_maveba": {
   "authors": [
    [
     "Daniel I.",
     "Escobedo Beceiro"
    ],
    [
     "Sergio D.",
     "Cano Ortiz"
    ],
    [
     "Francisco J.",
     "Ruiz Miyares"
    ]
   ],
   "title": "Some acoustical features of the cry and speech signals in infants with epilepsy",
   "original": "mv01_091",
   "page_count": 8,
   "order": 19,
   "p1": "91",
   "pn": "98",
   "abstract": [
    "This paper shows some acoustic parameters in time and frequency domains obtained by digital processing of infant cry data and others. The data consists in several pre-speech and speech signal of 6 children affected by Epilepsy in the Neurology Service of the Southern Children Hospital. Several ages and both sexes are considered. The samples were taken in both ways, using spontaneous form and synchronized form, by an AKAI PM-R55 tape recorder, and digitized by IBM Microcomputer with the PCVOX A/D acquisition and processing system. A speech-oriented database (BPVOZ) is also used for the infant cry, pre-speech and speech analysis.   Some alterations in the parameter behaviors, mainly that's concerned with the Fundamental Frequency, are present in the results. It is remarked the importance of to consider all these acoustics attributes in the qualitative and quantitative order as an information of highest interest in order to help in the description and analysis of this kind of neurological disorder, as well as in the follow up of these cases.   This work was developed by members of the Voice Processing Group of the University of Oriente joined to the people from the Neurology Service of Southern Children Hospital of Santiago de Cuba.\n",
    "Index Terms. Acoustical features; Cry and pre-speech analysis; Speech signals; Voice processing; Voice disorders\n",
    ""
   ]
  },
  "ozdas01_maveba": {
   "authors": [
    [
     "Asli",
     "Ozdas"
    ],
    [
     "Richard G.",
     "Shiavi"
    ],
    [
     "D. Mitchell",
     "Wilkes"
    ],
    [
     "Marilyn K.",
     "Silverman"
    ],
    [
     "Stephen E.",
     "Silverman"
    ]
   ],
   "title": "Analysis of vocal tract characteristics for near-term suicidal risk assessment",
   "original": "mv01_099",
   "page_count": 4,
   "order": 20,
   "p1": "99",
   "pn": "102",
   "abstract": [
    "Among the many clinical decisions that psychiatrists must make, assessment of a patient's risk of committing suicide is definitely among the most important, complex and demanding. One of the authors reviewing his clinical experience observed that successful predictions of suicidality were often based on the patient's voice independent of content. The voices of suicidal patients exhibited unique qualities, which distinguished them from non-suicidal patients. In this study we investigated the discriminating power of lower order mel-cepstral coefficients among suicidal, major depressed, and nonsuicidal patients. Our sample consisted of 10 near-term suicidal patients, 10 major depressed patients, and 10 non-depressed control subjects. Multivariate Gaussian mixtures using the first four mel-cepstral coefficients and six component functions were employed to model the class distributions of the extracted features. Maximum likelihood classification analyses of the groups yielded exceptional classification performance. Correct classification scores were: 80% between near-term suicidal patients and non-depressed controls, 75% between depressed patients and non-depressed controls, and 80% between nearterm suicidal patients and depressed patients.\n",
    "Index Terms. suicide, speech, classification, mel-cepstrum\n",
    ""
   ]
  },
  "jurgens01_maveba": {
   "authors": [
    [
     "Uwe",
     "Jürgens"
    ]
   ],
   "title": "The squirrel monkey as a model in the study of the central control of vocalization",
   "original": "mv01_103",
   "page_count": 5,
   "order": 21,
   "p1": "103",
   "pn": "107",
   "abstract": [
    "In the squirrel monkey (Saimiri sciureus), the electrical activity of single neurones was compared in the periaqueductal grey of the midbrain and the reticular formation of the medulla oblongata during vocalization, using a recently developed telemetric technique. The results show that both structures contain neurones with vocalization-correlated activity. There are characteristic differences between the two structures, however. Neurones showing changes in discharge rate with changes in fundamental frequency were only found in the reticular formation, whereas neurones firing immediately before vocalization, but not during vocalization, were almost exclusively found in the periaqueductal grey. It is concluded that the reticular formation is involved in vocal motor coordination, while the periaqueductal grey mainly serves gating functions.\n",
    "Index Terms. Neurobiology; Phonation control; Telemetry; Vocal pattern generation; Squirrel monkey\n",
    ""
   ]
  },
  "wainschenker01_maveba": {
   "authors": [
    [
     "Rubén",
     "Wainschenker"
    ],
    [
     "Jorge",
     "Doorn"
    ],
    [
     "Marcela",
     "Castro"
    ]
   ],
   "title": "Towards a systematic quantification of the speech speed",
   "original": "mv01_108",
   "page_count": 5,
   "order": 22,
   "p1": "108",
   "pn": "112",
   "abstract": [
    "Although it is widely used in every day activities and in several professions such as locution, shorthand and stenography among others, the magnitude speed of the speech does not have a precise way of measurement. Such notion is fundamental in the context of the study of the typical behavior of a main set of language allophones as the basic components for a robust speech synthesis. No precise information was found for Spanish and less for the variant spoken in Uruguay and center and south of Argentina usually called Riverplatean Spanish.   This article presents a quantitative characterization of the intuitive notions of fast, slow and normal speech speed. The article reports a research with a strong experimental foundation since its conclusions were obtained from 120 texts uttered by different speakers at different speeds in a context free of any sort of conditioning. More than a half of the texts were collected from public sources and from people who never knew they were recorded for this purpose.\n",
    "Index Terms. speech speed, allophones, voice synthesis, voice parameters\n",
    ""
   ]
  },
  "kuwabara01_maveba": {
   "authors": [
    [
     "Hisao",
     "Kuwabara"
    ]
   ],
   "title": "A relation between voice quality and acoustic features",
   "original": "mv01_113",
   "page_count": 4,
   "order": 23,
   "p1": "113",
   "pn": "116",
   "abstract": [
    "The present study deals with a voice quality that is referred to as “intelligible” or “articulate” voice. The purpose of the present study is to find a relation between the voice quality and acoustic features. The speech material is a read version of a simple short Japanese sentence “a o i so ra” in order to eliminate these linguistic variations. A set of speech samples uttered by fifteen adult male speakers including TV/Radio professional casters has been used. A perceptual similarity judgment on voice quality has been performed first and then a correlation between the result of the similarity and acoustic distances has been taken to find out how the acoustic features relate to the voice quality. Two types of acoustic features, time-varying dynamic parameter and static parameter, have been considered for each of the source and resonance characteristics. From source characteristics, 1) pitch contour (dynamic parameter), 2) mean pitch frequency (static parameter) are chosen. From the resonance characteristics, 3) formant trajectory (dynamic parameter), 4) mean spectrum envelope (static parameter), are chosen. The highest correlation is observed for the formant trajectory followed by the pitch contour. The third highest is the mean spectrum envelope and the lowest is, as it is expected, the mean pitch frequency. This result reveals that the dynamic parameters, especially formant movement, do contribute to the “clear” or “articulate” voice quality.\n",
    "Index Terms. voice quality; similarity judgment; pitch contour; pitch frequency; formant trajectory; spectrum envelope; multidimensional analysis; correlation analysis; dynamic parameter; static parameter\n",
    ""
   ]
  },
  "drioli01_maveba": {
   "authors": [
    [
     "Carlo",
     "Drioli"
    ],
    [
     "Federico",
     "Avanzini"
    ]
   ],
   "title": "A physically-informed model of the glottis with application to voice quality assessment",
   "original": "mv01_117",
   "page_count": 6,
   "order": 24,
   "p1": "117",
   "pn": "122",
   "abstract": [
    "A glottal model based on physical insights is proposed. The model describes the vocal fold as a second order oscillator, i.e. a damped mass-spring system. The oscillator is coupled with a non-linear block, accounting for fold interaction with airflow. The non-linear block is modeled as a regressor-based functional with weights to be identified, and a pitch-synchronous identification procedure is outlined. The model is used to analyze voiced sounds from normal and from pathological voices, and the application of the proposed method to voice quality assessment is discussed.\n",
    "Index Terms. Non-linear models of vocal emission; physical models; estimation and modeling of the glottal flow; non-linear identification; voice quality assessment\n",
    ""
   ]
  },
  "tadeusiewicz01_maveba": {
   "authors": [
    [
     "Ryszard",
     "Tadeusiewicz"
    ],
    [
     "Wieslaw",
     "Wszolek"
    ],
    [
     "Andrzej",
     "Izworski"
    ],
    [
     "Tadeusz",
     "Wszolek"
    ]
   ],
   "title": "Understanding of vocal tract pathology using speech signals analysis",
   "original": "mv01_125",
   "page_count": 9,
   "order": 25,
   "p1": "125",
   "pn": "133",
   "abstract": [
    "In the present work we introduce a new approach to pathological speech processing methods and recognition of various speech pathologies. We no longer attempt to recognise forms of pathological speech deformations, because it is impossible to show any compact template of a normal speech signal (as reference) and it is also impossible to show a standard form of any deformation. Almost any sample of speech, both normal and pathological, is unique – and we must introduce a new concept for the treatment of pathological speech; artificial understanding of the nature (and source) of the pathology of speech instead of traditional classification or recognition of signals. We try to implement the process for the artificial understanding of the observed forms of speech deformations with a very close look at vocal tract pathologies. Selected excerpts of research are presented concerning the application of (modified) acoustic signal processing methods and (in particular) the neural network techniques specially designed for solving the problem of \"understanding\" selected pathologies of vocal tract.\n",
    "Index Terms. speech analysis, pathological speech, vocal tract pathology, artificial intelligence\n",
    ""
   ]
  },
  "parraga01_maveba": {
   "authors": [
    [
     "Adriane",
     "Parraga"
    ],
    [
     "Milton A.",
     "Zaro"
    ],
    [
     "Adalberto",
     "Schuck Jr"
    ]
   ],
   "title": "Quantitative assessment of the use of continuous wavelet transform in the analysis of the fundamental frequency disturb of the synthetic voice",
   "original": "mv01_134",
   "page_count": 4,
   "order": 26,
   "p1": "134",
   "pn": "137",
   "abstract": [
    "The aim of this work is to investigate quantitatively the capability of the Continuous Wavelet Transform (CWT) as a tool to estimate (calculate) Jitter and Shimmer, assessing the error between these indices calculated in each Wavelet decomposition and the ones for the original signal, for several dilatation levels. It were generated 2 synthetic vowel /a/ with the fundamental frequency of 120Hz for male and 220Hz for female, by an autoregressive 22 coefficients all-pole model, and introduced Jitter and Shimmer on the signal using five different percent variations. The signals were decomposed by CWT in 8 levels of dilatation (1,2,4,8,16,32,64 and 128), using the Mexican Hat, Meyer and Morlet real bases. Jitter and Shimmer were calculated for the original signals and all the 8 levels of decompositions and then the errors between the indices in the decompositions and the original signals were calculated. It can be concluded that CWT can be used as a tool for preprocessing the signal to measure Shimmer preferentially, and Jitter, instead of using the original signal to do that. The Mexican Hat base provided the lowest errors for Shimmer analysis, where the best dilatation level was 8 (error below 0.1%). In addition, the errors associated with Shimmer index, in general, are lower than the ones associated with Jitter index.\n",
    "Index Terms. Speech processing, Continuous Wavelet transform, Acoustic analysis of voice, Fundamental frequency analysis.\n",
    ""
   ]
  },
  "kob01_maveba": {
   "authors": [
    [
     "Malte",
     "Kob"
    ],
    [
     "Christiane",
     "Neuschaefer-Rube"
    ]
   ],
   "title": "A method for measurement of the vocal tract mouth impedance",
   "original": "mv01_138",
   "page_count": 6,
   "order": 27,
   "p1": "138",
   "pn": "143",
   "abstract": [
    "In this contribution a novel method is presented, allowing the detection of resonance frequencies of an externally excited vocal tract in a fast and robust non-invasive manner. The method can be applied alternatively to linear prediction coding (LPC) analysis for patients with voice and speech disorders. Sweep signals are emitted and recorded simultaneously from the small end of a tube that is placed in front of the mouth opening. The use of two sensors, a pressure sensor and a velocity sensor provides a direct measurement of the vocal tract mouth impedance (VTMI). For selected sustained German vowels and some consonants a comparison of results from LPC analysis and VTMI measurements is given. The results indicate a good agreement in the frequency range from 500 Hz to 5000 Hz. The feasibility of the VTMI method for diagnostic and therapeutic applications is subject to current research.\n",
    "Index Terms. impedance, VTMI, vocal tract, correlation technique, velocity\n",
    ""
   ]
  },
  "morris01_maveba": {
   "authors": [
    [
     "Robert W.",
     "Morris"
    ],
    [
     "Mark A.",
     "Clements"
    ]
   ],
   "title": "Reconstruction of speech from whispers",
   "original": "mv01_144",
   "page_count": 6,
   "order": 28,
   "p1": "144",
   "pn": "149",
   "abstract": [
    "This paper investigates a method for the real-time reconstruction of normal speech from whispers. This system could be used by aphonic individuals as a voice prosthesis. It could also provide improved verbal communication when normal speech is not appropriate. The normal speech is synthesized using the mixed excitation linear prediction model. Differences between whispered and phonated speech are discussed and methods for estimating the parameters of this model from whispered speech for real-time synthesis are proposed. This includes modification of the formants and smoothing of the noisy linear prediction spectra and synthesis of the excitation signal. Trade-offs between computational complexity, delay, and accuracy of different methods are discussed.\n",
    "Index Terms. Whispered speech; voice parameter extraction; voice parameter modification; voice prosthesis\n",
    ""
   ]
  },
  "wszolek01_maveba": {
   "authors": [
    [
     "Wieslaw",
     "Wszolek"
    ],
    [
     "Maciej",
     "Modrzejewski"
    ],
    [
     "Ryszard",
     "Tadeusiewicz"
    ],
    [
     "Tadeusz",
     "Wszolek"
    ]
   ],
   "title": "Quality of voice signal after ENT surgery",
   "original": "mv01_150",
   "page_count": 6,
   "order": 29,
   "p1": "150",
   "pn": "155",
   "abstract": [
    "In the presented article, there are fragments of research done by its authors concerning the evaluation of the quality of a patient's voice following a surgical procedure in the area surrounding the voice channel.\n",
    "Index Terms. speech analysis, pathological speech, surgical treatment\n",
    ""
   ]
  },
  "matassini01_maveba": {
   "authors": [
    [
     "Lorenzo",
     "Matassini"
    ],
    [
     "Claudia",
     "Manfredi"
    ]
   ],
   "title": "Noise reduction for vocal pathologies",
   "original": "mv01_156",
   "page_count": 7,
   "order": 30,
   "p1": "156",
   "pn": "162",
   "abstract": [
    "We propose a noise reduction scheme in order to correct vocal disorders. The filter is based on concepts and tools originated from nonlinear time series analysis and deterministic chaos theory field. This work can provide a better understanding of voice dysfunctions, with a clear advantage for subjects a&# 11;ected by vocal pathologies. With similars tools, indeed, physicians can perform better surgical interventions and researchers can build devices to improve voice quality also without a surgigal treatment. We describe the filter and the idea of geometric signal classification in a feature space in order to visualize the effect of the noise reduction step. We focus our attention on patients a&# 11;ected by T1A glottis cancer and describe which kind of corrections are necessary to improve the quality of the voice, i.e. to move the feature vector from the sick cluster to the healthy zone.\n",
    "Index Terms. Chaos Theory, Nonlinear Noise Reduction, Feature Space, Vocal Disorders\n",
    ""
   ]
  },
  "savariaux01_maveba": {
   "authors": [
    [
     "Christophe",
     "Savariaux"
    ],
    [
     "Pascal",
     "Perrier"
    ],
    [
     "Daniel",
     "Pape"
    ],
    [
     "Jacques",
     "Lebeau"
    ]
   ],
   "title": "Speech production after glossectomy and reconstructive lingual surgery: a longitudinal study",
   "original": "mv01_163",
   "page_count": 6,
   "order": 31,
   "p1": "163",
   "pn": "168",
   "abstract": [
    "In this paper, the first results from a longitudinal study of speech production in French are presented for 9 patients who underwent vocal tract surgery, including partial or total glossectomy or pelvi-glossectomy and tongue reconstruction, or partial mandibulectomy. For each patient, two recordings were made of the acoustic speech signal, the first one a few days before surgery, and the second between 3 weeks and 12 months after surgery. The analysis of the data aimed at two main objectives. First we wanted to quantitatively assess the degree of speech production impairment induced by the surgery and to propose explanations in terms of articulation. Second, we were interested to observe and to understand how some of the subjects with a strong impairment were able to modify their speech production control strategies, in order to deal with the dramatic modifications of their oral cavity. Data analysis was based on formant patterns for the vowels, on Lisker and Abramson's VOT, and on temporal and spectral properties of the burst for the consonants. Speech production after surgery was evaluated on the basis of a comparison with the pre-surgery recording, which was considered as a reference describing the patients' speech production under normal condition. Special attention was paid to the patients who showed the largest postsurgery difficulties, in order to find the origins of their impairment and to study the strategy adopted to deal with this impairment.\n",
    "Index Terms. Speech Production, Glossectomy, Speech Pathology, Speech Perturbation\n",
    ""
   ]
  },
  "benahmeddaho01_maveba": {
   "authors": [
    [
     "Z.",
     "Benahmed Daho"
    ],
    [
     "N.",
     "Benamrane"
    ],
    [
     "A.",
     "Freville"
    ]
   ],
   "title": "Medical images compression by neural networks",
   "original": "mv01_169",
   "page_count": 7,
   "order": 32,
   "p1": "169",
   "pn": "175",
   "abstract": [
    "This paper presents a compression method for still images, based on Kohonen's neural network. To avoid the edge degradation caused by high compression ratio, the blocks are classified into two classes: blocks with high activity (edge blocks) and blocs with law activity. The image is divided first into blocks of 16 pixels. Each block of high activity are divided again into small blocs of 4 pixels. Blocs of high and law activity are coded separately with different codebooks. We have obtained a noticeable improvement of visual quality of all the rebuild images while keeping an important compression rate.\n",
    "Index Terms. Compression, Medical images, Neural Networks, Vector Quantization, Classification\n",
    ""
   ]
  },
  "benamrane01_maveba": {
   "authors": [
    [
     "N.",
     "Benamrane"
    ],
    [
     "R.",
     "Abderahim"
    ],
    [
     "L.",
     "Nemmiche"
    ]
   ],
   "title": "Medical image interpretation by fuzzy neural networks and expert system",
   "original": "mv01_176",
   "page_count": 5,
   "order": 33,
   "p1": "176",
   "pn": "180",
   "abstract": [
    "The object of this paper is to elaborate an automatic system in order to detect suspect zones or tumors in medical image especially brain ones. The purpose is to define with precision the existence of different kinds of lesions using a hybrid system which combines Fuzzy Neural Networks and Expert System. After getting regions features by regions growing or mathematical morphology, the fuzzy neural networks detects the suspect regions which are validated by an expert system to determine the nature of lesions.\n",
    "Index Terms. Fuzzy Neural Network, Expert System, Medical Images, Tumors, Diagnostic, Interpretation\n",
    ""
   ]
  },
  "bolfanstosic01b_maveba": {
   "authors": [
    [
     "Natalija",
     "Bolfan-Stošiċ"
    ],
    [
     "Mladen",
     "Hedjever"
    ]
   ],
   "title": "Degree of sub-harmonic components in infant cries and in Down Syndrome children and children with dysphonia",
   "original": "mv01_181",
   "page_count": 7,
   "order": 34,
   "p1": "181",
   "pn": "187",
   "abstract": [
    "According to different studies of the infant cry, the sub-harmonic components or double series of fundamental frequency as a rule does not occur in the crying of healthy neonates. An acoustic analysis was made of three samples of cry signal (continuous signal or several short phonations), and six phonations of the vowel /a/ by pre-school children with dysphonia and by school children with Down syndrome. This was a cross-sectional study of children (nine boys) of different ages and with different disorders, including voice disorders such as dysphonia which occurred without any other medical impairments, and the genetic disorder of Down syndrome. Acoustic analysis was made using MDVP, Kay Elemetrics Computer software, a Real Time Frequency Analyser Type 2123 (Bruel and Kjaer), and the EZ Voice Program for Voice Analysis (Voice Tek Enterprises, USA). Four different parameters were measured: fundamental frequency, jitter, shimmer and degree of sub-harmonic components. Also, the focus of this study was to find and explain, sub-harmonic components or bi-phonation, as an indicator of voice or other pathology. Descriptive statistics of the acoustic data were obtained through Statistica for Windows, version 4.5.\n",
    "Index Terms. infant cry, sub-harmonic components, jitter, shimmer, fundamental frequency, dysphonia, Down syndrome, acoustical analyses\n",
    ""
   ]
  },
  "faenza01_maveba": {
   "authors": [
    [
     "L.",
     "Faenza"
    ],
    [
     "G.",
     "Sciolla"
    ],
    [
     "M.",
     "Colli"
    ],
    [
     "A.",
     "Sacchi"
    ]
   ],
   "title": "Study of EEG signals to build a man-computer interface",
   "original": "mv01_188",
   "page_count": 5,
   "order": 35,
   "p1": "188",
   "pn": "192",
   "abstract": [
    "Following recent developments in numerical elaboration and electro-physiological science many researchers now believe it.s possible to build a man-computer interface EEG based. We know that hand movements are accompanied by changes of some EEG features. These changes are called event-related desynchronisations (ERDs) and are picked-up especially in the mu-band (8-12 Hz). We also know ERDs are bilateral for real hand movements, meaning that if we move the right hand we pick-up an ERDs in the mu band from left channels of EEG. We will investigate if, for merely imagined hand movement, ERDs occur in the same way; to do this we will use the approach suggested by W. Penny and S. Robert based on MAR models and Neural Networks.\n",
    ""
   ]
  },
  "hoppe01_maveba": {
   "authors": [
    [
     "Ulrich",
     "Hoppe"
    ],
    [
     "Michael",
     "Döllinger"
    ],
    [
     "Stefan",
     "Schuberth"
    ],
    [
     "Frank",
     "Rosanowski"
    ],
    [
     "Ulrich",
     "Eysholdt"
    ]
   ],
   "title": "Clinical significance of the two-mass-model",
   "original": "mv01_193",
   "page_count": 2,
   "order": 36,
   "p1": "193",
   "pn": "194",
   "abstract": [
    "[Abstract not available.]\n",
    "Index Terms. Vocal Fold Modeling, Voice Disorder Classification, Voice Parameter Extraction, High-Speed Observations\n",
    ""
   ]
  },
  "krot01_maveba": {
   "authors": [
    [
     "Alexander M.",
     "Krot"
    ]
   ],
   "title": "Analysis of attractors of complex dynamical systems based on matrix decomposition",
   "original": "mv01_195",
   "page_count": 6,
   "order": 37,
   "p1": "195",
   "pn": "200",
   "abstract": [
    "Decomposition relationships for nonlinear dynamical system operators into state space based on matrix series are proposed. Analysis of attractors of complex dynamical systems based on proposed decomposition was carried out.\n",
    "Index Terms. nonlinear dynamical systems, state space, matrix series, attractors of complex dynamical systems\n",
    ""
   ]
  },
  "krot01b_maveba": {
   "authors": [
    [
     "Alexander M.",
     "Krot"
    ],
    [
     "Helena B.",
     "Minervina"
    ]
   ],
   "title": "Estimation of minimal chaotic attractor embedding dimension on the basis of matrix decomposition for biomedical signal processing",
   "original": "mv01_201",
   "page_count": 6,
   "order": 38,
   "p1": "201",
   "pn": "206",
   "abstract": [
    "The theoretic ground of a local-topological method for defining a minimal attractor embedding dimension on the basis of matrix decomposition is proposed. The investigation of digital electrocardio signals using local-topological analysis of chaotic attractor trajectories is carried out. The computer confirmation of the theoretical results is presented.\n",
    "Index Terms. complex systems, chaotic dynamics, state-space, attractor, minimal embedding dimension, nonlinear decomposition\n",
    ""
   ]
  },
  "kudryavtsev01_maveba": {
   "authors": [
    [
     "Vadim O.",
     "Kudryavtsev"
    ]
   ],
   "title": "Filter bank realizations of Volterra kernels",
   "original": "mv01_207",
   "page_count": 4,
   "order": 39,
   "p1": "207",
   "pn": "210",
   "abstract": [
    "A great many of processes in a nature are nonlinear, so their modeling requires an embedding of nonlinear parts into the model structure. One of the popular approaches to the nonlinear system modeling are Volterra series. Unfortunately, already the second order Volterra kernel requires high amount of coefficients for its identification and therefore a large number of computations for its realization. This paper shows several possibilities of reducing the amount of computations based on matrix decomposition of a second order Volterra kernel, and presents both mathematically accurate algorithms and approximate ones. Presented algorithms are in the form of filter bank structure. They can be used for highest order Volterra kernel realization as well.\n",
    "Index Terms. Nonlinear Modeling; Volterra Series; Filter Banks; Eigen Value Decomposition; Fast Algorithms; Finite Fields.\n",
    ""
   ]
  },
  "manfredi01_maveba": {
   "authors": [
    [
     "Claudia",
     "Manfredi"
    ],
    [
     "Massimo",
     "D'Aniello"
    ],
    [
     "Piero",
     "Bruscaglioni"
    ]
   ],
   "title": "Comparison between AR and SVD approaches for speech denoising",
   "original": "mv01_211",
   "page_count": 6,
   "order": 40,
   "p1": "211",
   "pn": "216",
   "abstract": [
    "For pathological voices, hoarseness is mainly due to jitter and air flow turbulence in the vocal tract. In this paper, speech denoising is performed in time-domain, by means of a fast and reliable subspace approach. A low-order singular value decomposition allows separating the signal and the noise subspace of an appropriate data matrix, obtained from short data frames. The filtered signal is reconstructed along the directions spanned by the eigenvectors associated to the signal subspace eigenvalues, thus disregarding the noise contribution. This approach was found to work well for hoarse voices coming from cordectomised patients, giving enhanced voice quality. Its simple structure allows a real-time implementation, suitable for portable device realisation.\n",
    ""
   ]
  },
  "somkuwar01_maveba": {
   "authors": [
    [
     "Ajay",
     "Somkuwar"
    ],
    [
     "Sujoy K.",
     "Guha"
    ],
    [
     "Sudhir",
     "Atreya"
    ]
   ],
   "title": "Independent component analysis of electromyographic signal",
   "original": "mv01_217",
   "page_count": 5,
   "order": 41,
   "p1": "217",
   "pn": "221",
   "abstract": [
    "Electromyography is a valuable tool in many clinical analyses, as it can give the clinician an accurate representation of what the muscles are doing to contribute to the desired task. For functional EMG the surface electrodes have the advantage of convenience and comfort. The major disadvantage to surface electrodes are cross talk and low level signal reception. Their adverse effects complicate the definition of muscle timing and relative intensity of the activity. During period of low muscle activity there is the possibility that the EMG signals may include signals from musculature other than the muscle of interest. A recently developed linear transformation method is independent component analysis (ICA), in which the desired representation is the one that minimizes the statistical dependence of the components of the representation. In order to define suitable search criteria the approximation of nagentropy is used as a contrast function for minimizing the statistical dependence between the component. The fast ICA algorithm given by Aapo Hyvarinen identify the independent source by maximizing the joint entropy of a set of output signals derived form the Rectus femori (RF) and semimembranous (S) muscles of lower limb during pedaling action of leg. The signal of RF severely affected by sartorius and Tensor facia lata and the S muscle includes signals from Sartorius and Semitendenus together with electrical noise is separated via fast ICA algorithm. Result illustrating the good performance of the method.\n",
    ""
   ]
  },
  "hirtum01_maveba": {
   "authors": [
    [
     "Annemie van",
     "Hirtum"
    ],
    [
     "Daniel",
     "Berckmans"
    ]
   ],
   "title": "Assessing the sound of cough towards vocality",
   "original": "mv01_222",
   "page_count": 6,
   "order": 42,
   "p1": "222",
   "pn": "227",
   "abstract": [
    "The presented research positively evaluates vocality of the cough sound by estimating the averaged cough fundamental frequency or pitch. The fundamental frequency was determined by autocorrelation analysis on both the rough time-signal and the linear predicted time-signal. The experimental cough database was registered in the free acoustical field on respectively 3 pathological and 9 healthy non-smoking human subjects and on 2 pathological and 2 healthy Belgian Landrace piglets. For both species differences between pitch values for cough-sounds originating from subjects suffering from a respiratory infection and healthy subjects are put forward. The retrieved pitch-differences between respectively healthy and infected subjects indicate the existence of acoustical different cough-classes in accordance with a different cause or physical condition of the respiratory system.\n",
    "Index Terms. Physiological signal processing; Sound analysis; Cough; Biomedical computing; Pitch extraction\n",
    ""
   ]
  },
  "ritchings01_maveba": {
   "authors": [
    [
     "R. T.",
     "Ritchings"
    ],
    [
     "M.",
     "McGillion"
    ],
    [
     "Christopher J.",
     "Moore"
    ]
   ],
   "title": "Pathological voice quality assesment using artificial neural networks",
   "original": "mv01_230",
   "page_count": 5,
   "order": 43,
   "p1": "230",
   "pn": "234",
   "abstract": [
    "This paper describes a prototype system for the objective assessment of voice quality in patients recovering from various stages of laryngeal cancer. A large database of male subjects steadily phonating the vowel /i/ was used in the study, and the quality of their voices were independently assessed by a speech and language therapist (SALT) according to their 7-point ranking of subjective voice quality. The system extracts salient short-term and long-term time-domain and frequency-domain parameters from impedance (EGG) signals and these are used to train and test an Artificial Neural Network (ANN). Multi-layer Perceptron (MLP) ANNs were investigated using various combinations of these parameters, and the best results were obtained using a combination of short-term and longterm parameters, for which an accuracy of 92% was achieved. It is envisaged that this system could be used as a screening tool and provide a valuable aid to the SALT during clinical evaluation of voice quality.\n",
    ""
   ]
  },
  "hirtum01b_maveba": {
   "authors": [
    [
     "Annemie van",
     "Hirtum"
    ],
    [
     "Daniel",
     "Berckmans"
    ]
   ],
   "title": "Automated recognition of spontaneous versus voluntary cough",
   "original": "mv01_235",
   "page_count": 6,
   "order": 44,
   "p1": "235",
   "pn": "240",
   "abstract": [
    "Cough or cough epochs may be an important and persistent symptom in many respiratory diseases requiring both a continuous and objective observation. The research presented in this paper is aimed to assess a blind data-based classification between 'spontaneous' and 'voluntary' human cough on individual sound samples. Cough sounds were registered in the free acoustic field on 3 pathological and 9 healthy non-smoking subjects, all aged between 20 and 30. Each sound is represented by the normalized power spectral density (PSD). Different transformations of the cough PSD-vector are chosen as input-features to the classification algorithm. An experimental error rate comparison between different neural and fuzzy classification networks is performed. All evaluated algorithms used the Euclidean metric. This resulted in a correct class-discrimination between 'spontaneous' and 'voluntary' cough for 96% of the cough database.\n",
    "Index Terms. Artificial intelligence; Neural networks; Fuzzy reasoning; Expert system; Sound analysis; Cough\n",
    ""
   ]
  },
  "jo01_maveba": {
   "authors": [
    [
     "Cheolwoo",
     "Jo"
    ],
    [
     "Kwangin",
     "Kim"
    ],
    [
     "Daehyun",
     "Kim"
    ],
    [
     "Soogeon",
     "Wang"
    ]
   ],
   "title": "Screening of pathological voice from ARS using neural networks",
   "original": "mv01_241",
   "page_count": 5,
   "order": 45,
   "p1": "241",
   "pn": "245",
   "abstract": [
    "This paper describes procedures to screening vocal diseases using acoustic speech data which is collected from ARS(Automatic Response System). Speech data from normal peoples and patients are collected and diagnosed. The collected materials are analyzed using several mathematical features such as jitter, shimmer etc. The classification is performed using artificial neural networks. Then the classification rate is compared with the case when voice data are recorded directly to the DAT(Digital Audio Tape). The performance of neural net discriminator was comparable to the previous work. As a result of this experiment, it is verified that ARS voice can be used screening pathological voice by acoustical signal on the telephone network.\n",
    "Index Terms. Pathological voice; ARS; Neural Networks\n",
    ""
   ]
  },
  "krot01c_maveba": {
   "authors": [
    [
     "Alexander M.",
     "Krot"
    ],
    [
     "Polina P.",
     "Tkachova"
    ]
   ],
   "title": "Fast algorithms for Wiener kernels computing in speech phoneme recognition",
   "original": "mv01_246",
   "page_count": 8,
   "order": 46,
   "p1": "246",
   "pn": "253",
   "abstract": [
    "This paper presents the nonlinear speech phoneme decomposition based on Volterra-Wiener functional series. It is shown the usage this nonlinear decomposition in speech recognition systems constructing. The fast algorithms for finding estimation of Wiener kernels in frequency domain permit to reduce essentially computing expenses for evaluation of signals decomposition.\n",
    "Index Terms. speech recognition, nonlinear signal decomposition, Volterra-Wiener functional series, Wiener kernels measuring, fast algorithms\n",
    ""
   ]
  },
  "lucero01_maveba": {
   "authors": [
    [
     "Jorge C.",
     "Lucero"
    ]
   ],
   "title": "Principal differential analysis of lip motion signals",
   "original": "mv01_254",
   "page_count": 6,
   "order": 47,
   "p1": "254",
   "pn": "259",
   "abstract": [
    "Principal differential analysis is applied to lip motion recorded from a subject during the repeated production of the sentence “Buy Bobby a puppy” at fast, normal, and slow rates. In this technique, a second order differential equation of the form D2xi(t) + w1(t)Dxi(t) + w0(t)xi(t) = 0 is fitted to the lip trajectories xi(t). The objective is to characterize lip trajectories at different speaking rates in terms of biomechanical parameters as stiffness, damping, and applied external forces. The results show that, in the case of fast rate, the lip system is substantially underdamped and behaves like a simple mass-spring oscillator. In the case of slow rate, on the other hand, the lips are under a stronger external control to conform to the required trajectory. The case of normal rate falls between the fast and slow rate cases. Further, the variability computed at the forcing level increases with decreasing speaking rate. These results suggest that, at fast speaking rates, the lips are left to move at their natural frequency and so their motion presents low variability across repetitions. At slow rates, on the other hand, a stronger external control is exerted, whose associated variability results in increased variability of the lip motion.\n",
    "Index Terms. Principal differential analysis; Functional data analysis; Lip motion; Biomechanical modeling; Statistical modeling.\n",
    ""
   ]
  },
  "funaki01_maveba": {
   "authors": [
    [
     "Keiichi",
     "Funaki"
    ]
   ],
   "title": "A time-varying complex ARMA speech modeling based on IV method",
   "original": "mv01_260",
   "page_count": 4,
   "order": 48,
   "p1": "260",
   "pn": "263",
   "abstract": [
    "A complex-valued speech analysis using analytic signal realizes more accurate spectral estimation in low frequencies. We have already developed three kinds of time-varying complex AR (TV-CAR) parameter estimation algorithms for analytic speech signal, which are based on minimizing mean square error (MMSE), Huber's robust M-estimation and Instrumental Variable (IV) method. Needless to say, speech signal provides anti-resonance, especially in nasal speech. Accordingly, an ARMA parameter estimation may be useful on speech processing and speech research tool. This paper presents time-varying complex ARMA parameter estimation algorithm on the basis of the IV method, in which the excitation is assumed as the pulse train estimated from residual signal. The experiments with natural speech demonstrate that the proposed method achieves robust ARMA spectral estimation.\n",
    "Index Terms.  speech analysis, analytic signal, ARMA model, time-varying model, complex signal processing\n",
    ""
   ]
  }
 },
 "sessions": [
  {
   "title": "Tutorial Papers",
   "papers": [
    "pelorson01_maveba",
    "howard01_maveba",
    "wermke01_maveba",
    "fujimura01_maveba",
    "izworski01_maveba"
   ]
  },
  {
   "title": "Physical and Mechanical Models",
   "papers": [
    "horacek01_maveba",
    "vilain01_maveba",
    "belforte01_maveba",
    "kitajima01_maveba",
    "dollinger01_maveba"
   ]
  },
  {
   "title": "Problems and Pitfalls in Modelling and Analyis of Speech Signals",
   "papers": [
    "mende01_maveba",
    "moore01_maveba",
    "misun01_maveba"
   ]
  },
  {
   "title": "Software / Multi-Parametric Analysis of Speech Signals",
   "papers": [
    "kawahara01_maveba",
    "schindler01_maveba",
    "dedouch01_maveba"
   ]
  },
  {
   "title": "Infant Cry and Its Relation to Neurological Disfunction",
   "papers": [
    "bolfanstosic01_maveba",
    "escobedobeceiro01_maveba",
    "escobedobeceiro01b_maveba"
   ]
  },
  {
   "title": "Voice Quality in Relation to Physical and Neurological Disfunctions",
   "papers": [
    "ozdas01_maveba",
    "jurgens01_maveba",
    "wainschenker01_maveba",
    "kuwabara01_maveba",
    "drioli01_maveba"
   ]
  },
  {
   "title": "Voice Parameters Measurement",
   "papers": [
    "tadeusiewicz01_maveba",
    "parraga01_maveba",
    "kob01_maveba"
   ]
  },
  {
   "title": "Speech Denoising, Reconstruction, and Rehabilitation",
   "papers": [
    "morris01_maveba",
    "wszolek01_maveba",
    "matassini01_maveba",
    "savariaux01_maveba"
   ]
  },
  {
   "title": "Poster Session",
   "papers": [
    "benahmeddaho01_maveba",
    "benamrane01_maveba",
    "bolfanstosic01b_maveba",
    "faenza01_maveba",
    "hoppe01_maveba",
    "krot01_maveba",
    "krot01b_maveba",
    "kudryavtsev01_maveba",
    "manfredi01_maveba",
    "somkuwar01_maveba",
    "hirtum01_maveba"
   ]
  },
  {
   "title": "Voice Analysis and Classification with AI, NN, Fuzzy Logic Techniques",
   "papers": [
    "ritchings01_maveba",
    "hirtum01b_maveba",
    "jo01_maveba"
   ]
  },
  {
   "title": "Nonlinear Models for Voice Analysis",
   "papers": [
    "krot01c_maveba",
    "lucero01_maveba",
    "funaki01_maveba"
   ]
  }
 ]
}