{
 "series": "MAVEBA",
 "title": "Models and Analysis of Vocal Emissions for Biomedical Applications  (MAVEBA 2007)",
 "location": "Florence, Italy",
 "startDate": "13/12/2007",
 "endDate": "15/12/2007",
 "conf": "MAVEBA",
 "year": "2007",
 "name": "maveba_2007",
 "SIG": "",
 "title1": "Models and Analysis of Vocal Emissions for Biomedical Applications",
 "title2": "(MAVEBA 2007)",
 "date": "13-15 December 2007",
 "booklet": "maveba_2007.pdf",
 "papers": {
  "fraj07_maveba": {
   "authors": [
    [
     "S. Ben Elhadj",
     "Fraj"
    ],
    [
     "Francis",
     "Grenez"
    ],
    [
     "Jean",
     "Schoentgen"
    ]
   ],
   "title": "Towards the simulation of pathological voice qualities",
   "original": "mv07_003",
   "page_count": 4,
   "order": 1,
   "p1": "3",
   "pn": "6",
   "abstract": [
    "The presentation concerns a synthesizer for disordered voices. The simulation of dysphonia is a topic the relevance of which is growing, but to which few studies have been devoted. The simulator that is discussed here involves a nonlinear memory-less model of the glottal area that is driven by a harmonic excitation the instantaneous frequency and amplitude of which are controlled. The glottal airflow rate is generated by means of an aerodynamic model of the glottis, which also comprises trachea-source and source-tract interactions as well as the generation of turbulence noise at the glottis. Trachea and vocal tract are modelled by means of a concatenation of lossy cylindrical pipes of identical length, but different cross-sections. The text concerns the presentation of the synthesizer and its synthetic output, as well as the results of a perceptual evaluation of the naturalness of simulated speech sounds in the framework of a stimuli comparison paradigm.\n",
    ""
   ]
  },
  "vasilakis07_maveba": {
   "authors": [
    [
     "Miltiadis",
     "Vasilakis"
    ],
    [
     "Yannis",
     "Stylianou"
    ]
   ],
   "title": "A mathematical model for accurate measurement of jitter",
   "original": "mv07_007",
   "page_count": 4,
   "order": 2,
   "p1": "7",
   "pn": "10",
   "abstract": [
    "Jitter is a fundamental metric of voice quality. The majority of jitter estimators produce an average value over a duration of several pitch periods. This paper proposes a method for short-time jitter measurement, based on a mathematical model which describes the coupling of two periodic phenomena. The movement of one of the two periodic phenomena with respect to the other is what is considered as jitter and what the proposed method measures. Through tests with synthetic jitter signals it has been verified that the suggested method provides accurate local estimates of jitter. Further evaluation was conducted on actual normal and pathological voice signals from the Massachusetts Eye and Ear Infirmary (MEEI) Disordered Voice Database. Compared with corresponding parameters from the Multi-Dimension Voice Program (MDVP) and the Praat system, the proposed method outperformed both in normal vs. pathological voice discrimination.\n",
    "Index Terms. Jitter, short-time, pathological voice.\n",
    ""
   ]
  },
  "wokurek07_maveba": {
   "authors": [
    [
     "Wolfgang",
     "Wokurek"
    ]
   ],
   "title": "Towards a temporal high-resolution formant analysis",
   "original": "mv07_011",
   "page_count": 4,
   "order": 3,
   "p1": "11",
   "pn": "14",
   "abstract": [
    "An attempt to analyse formant movements within the cycle of vocal fold vibration by linear prediction is presented. To achieve a high temporal resolution the duration of the analysis window is adjusted shorter than the fundamental period. The measurement noise increased thereby is counteracted by averaging the parameter estimates by clustering. Preprocessing by a linear band pass filter and by polynomial regression is discussed. The function of the method is demonstrated by analysing a synthetic formant with known resonance parameter contours. Then the method is applied to the first and second formant of the vowels [i:], [a:], and [u:] of a male speaker. The instantaneous formant and bandwidth contours and compared to the electroglottographic recorded contours of vocal fold tissue contact. An interpretation in terms of time varying acoustic coupling of the subglottal cavity through the larynx is proposed.\n",
    "Index Terms. subglottal coupling, linear prediction, electroglottography\n",
    ""
   ]
  },
  "dubuisson07_maveba": {
   "authors": [
    [
     "T.",
     "Dubuisson"
    ],
    [
     "Thierry",
     "Dutoit"
    ]
   ],
   "title": "Improvement of source-tract decomposition of speech using analogy with LF model for glottal source and tube model for vocal tract",
   "original": "mv07_119",
   "page_count": 4,
   "order": 4,
   "p1": "119",
   "pn": "122",
   "abstract": [
    "In this paper we propose improvements to a recent algorithm of speech decomposition into glottal source and vocal tract contributions. This algorithm is based on the Zeros of the Z-Transform (ZZT) representation and requires restrictive conditions about the analysis window. Inaccurate results of decomposition can occur if these conditions are not fulfilled. The improvement method consists in considering an analogy with the LF model for the glottal source and a tube model for the vocal tract. Results are presented for a sustained vowel /a/ in both time and spectral domain. Future developments are also proposed.\n",
    "Index Terms. Zeros of the Z-Transform, glottal source, vocal tract, speech decomposition, Glottal Closure Instant\n",
    ""
   ]
  },
  "ciota07_maveba": {
   "authors": [
    [
     "Zygmunt",
     "Ciota"
    ]
   ],
   "title": "Methodology of fundamental frequency extraction and analysis using microphone speech signal and vocal tract model",
   "original": "mv07_123",
   "page_count": 4,
   "order": 5,
   "p1": "123",
   "pn": "126",
   "abstract": [
    "A model of vocal tract has been presented. According to the dimensions of natural tract, equivalent parameters of the model have been calculated. The proposed model permits to extract important parameters of vocal signal, especially frequency parameters of glottal waves. The proposed system of speech processing permits also for analysis and synthesis of all phonemes. The system is oriented on the verification of speech malfunctions. The improvement of verification process can be improved by using more sophisticated classifiers, like neural networks.\n",
    "Index Terms. Vocal tract, fundamental frequency, speech verification, neural networks\n",
    ""
   ]
  },
  "gommel07_maveba": {
   "authors": [
    [
     "A.",
     "Gömmel"
    ],
    [
     "C.",
     "Butenweg"
    ],
    [
     "Malte",
     "Kob"
    ]
   ],
   "title": "A fluid-structure interaction model of vocal fold oscillation",
   "original": "mv07_127",
   "page_count": 2,
   "order": 6,
   "p1": "127",
   "pn": "128",
   "abstract": [
    "Since fluid-structure interaction within the finite-element method is state of the art in many engineering fields, this method is used in voice analysis. A quasi two-dimensional model of the vocal folds including the ventricular folds is presented. First results of self-sustained vocal fold oscillation are presented and possibilities as well as limitations are discussed.\n",
    "Index Terms. Fluid structure interaction, finite element method, vocal fold oscillation\n",
    ""
   ]
  },
  "marchetto07_maveba": {
   "authors": [
    [
     "E.",
     "Marchetto"
    ],
    [
     "Federico",
     "Avanzini"
    ],
    [
     "Carlo",
     "Drioli"
    ]
   ],
   "title": "Estimation of a physical model of the vocal folds via dynamic programming techniques",
   "original": "mv07_129",
   "page_count": 4,
   "order": 7,
   "p1": "129",
   "pn": "132",
   "abstract": [
    "This work presents a procedure for the estimation of a two-mass vocal fold model starting from a time-varying target „²ow signal. The model is speci„±ed by a large number of physical parameters, computed as functions of four articulatory parameters (three laryngeal muscle activations and subglottal pressure). Flow waveforms synthesized by the model are characterized by means of a set of typical voice source quanti„±cation acoustic parameters. Given a sequences of target acoustic parameters, dynamic programming techniques and interpolation based on Radial Basis Function Networks are used to derive sequences of articulatory parameters that lead to resynthesis of the target signal.\n",
    "Index Terms. Voice source, Low-dimensional models, Estimation, Synthesis\n",
    ""
   ]
  },
  "murphy07_maveba": {
   "authors": [
    [
     "Peter J.",
     "Murphy"
    ]
   ],
   "title": "Physical and perceptual correlates of voice using acoustic analysis",
   "original": "mv07_017",
   "page_count": 4,
   "order": 8,
   "p1": "17",
   "pn": "20",
   "abstract": [
    "Acoustic analysis of voice is potentially useful for objective assessment and characterization of voice disorders. However, before extracting acoustic measures of voice it is firstly pertinent to ask; what do we mean by voice? In describing voice, the perceptual impression formed by the listener or the physical characteristics of the production mechanism may be of primary interest. With this in mind specific correlations with perception and source production are worthy of attention. The voiced speech signal recorded using a microphone comprises a glottal source signal, which has been resonated and radiated. Hence this signal is only indirectly related to the underlying source production mechanism. Furthermore it is only indirectly related to the perception of voice quality because auditory processing is not considered. Indices commonly extracted from the acoustic speech waveform include the harmonics-to-noise ratio (HNR), jitter and shimmer. This presentation inquires into how these measures relate to physical and perceptual characterizations and into how progress on these issues may be advanced.\n",
    ""
   ]
  },
  "dejonckere07_maveba": {
   "authors": [
    [
     "Philippe H.",
     "Dejonckere"
    ],
    [
     "J. W. M. A. F.",
     "Martens"
    ],
    [
     "H.",
     "Versnel"
    ],
    [
     "M. B. J.",
     "Moerman"
    ]
   ],
   "title": "The effect of visible speech on perceptual rating of pathological voices, and on correlation between perception and acoustics",
   "original": "mv07_021",
   "page_count": 4,
   "order": 9,
   "p1": "21",
   "pn": "24",
   "abstract": [
    "The inter-rater variability in perceptual voice evaluation still limits the widespread clinical use of the best available rating system. Support of visible speech in experimental conditions demonstrates a significant enhancement of the inter-rater agreement. However it does not influence the correlation between perceptual and conventional acoustic parameters. The addition of visible speech to the clinical setting is feasible since nowadays affordable computer programs provide the spectrogram in quasi real time.\n",
    "Index Terms. Dysphonia, Perceptual evaluation, Visible Speech, Acoustic analysis.\n",
    ""
   ]
  },
  "godinollorente07_maveba": {
   "authors": [
    [
     "Juan Ignacio",
     "Godino-Llorente"
    ],
    [
     "Rubén",
     "Fraile"
    ],
    [
     "Nicolás",
     "Sáenz-Lechón"
    ],
    [
     "Víctor",
     "Osma-Ruiz"
    ],
    [
     "Pedro",
     "Gómez-Vilda"
    ]
   ],
   "title": "Automatic detection of voice impairments from text-dependent running speech using a discriminative approach",
   "original": "mv07_025",
   "page_count": 4,
   "order": 10,
   "p1": "25",
   "pn": "28",
   "abstract": [
    "Most of the vocal and voice diseases cause changes in the acoustic voice signal. Acoustic analysis is a useful tool to diagnose this kind of diseases, furthermore it presents several advantages: it is a non-invasive tool, an objective diagnostic and, also, it can be used for the evaluation of surgical and pharmacological treatments and rehabilitation processes. Most of the approaches found in the literature address the automatic detection of voice impairments from speech by using the sustained phonation of vowels. In this paper it is proposed a new scheme for the detection of voice impairments from text dependent running speech. The proposed methodology is based on the segmentation of speech into voiced and non voiced frames, parameterising each frame with mel frequency cepstral parameters. The classification is carried out using a discriminative approach based on a Multilayer Perceptron Network. The data used to train the system were taken from the voice disorders database distributed by Kay Elemetrics. The material used for training and testing contains the running speech corresponding to the well known “rainbow passage” of 226 patients (53 normal and 173 pathological). The results obtained are compared with those using sustained vowels. The textdependent running speech showed a light improvement in the accuracy of the detection.\n",
    "Index Terms. running speech, pathological voices, mel cepstral parameters, multilayer perceptron\n",
    ""
   ]
  },
  "amato07_maveba": {
   "authors": [
    [
     "F.",
     "Amato"
    ],
    [
     "Mario",
     "Cannataro"
    ],
    [
     "C.",
     "Cosentino"
    ],
    [
     "A.",
     "Garozzo"
    ],
    [
     "N.",
     "Lombardo"
    ],
    [
     "Claudia",
     "Manfredi"
    ],
    [
     "F.",
     "Montefusco"
    ],
    [
     "G.",
     "Tradigo"
    ],
    [
     "Pierangelo",
     "Veltri"
    ]
   ],
   "title": "Early detection of voice diseases via a web-based system",
   "original": "mv07_029",
   "page_count": 4,
   "order": 11,
   "p1": "29",
   "pn": "32",
   "abstract": [
    "Voice is the result of the coordination of the whole pneumophonoarticulatory apparatus. The analysis of the voice allows the identification of the diseases of the vocal apparatus and currently is carried out from an expert doctor through methods based on the auditory analysis. The paper presents a web-based system for the acquisition and automatic analysis of vocal signals. Vocal signals are submitted by the users through a simple web-interface and are analyzed in real-time by using state-of-the art signal processing techniques, providing first-level information on possible voice alterations. The system offers different analysis functions to the doctors that may analyze suspected cases in detail. The system is currently being tested in the otorhinolaryngologist setting to carry out mass prevention via screening at a regional scale.\n",
    "Index Terms. Voice Analysis, Otorhinolaryngology\n",
    ""
   ]
  },
  "goddard07_maveba": {
   "authors": [
    [
     "J. C.",
     "Goddard"
    ],
    [
     "F. M.",
     "Martínez"
    ],
    [
     "G.",
     "Schlotthauer"
    ],
    [
     "M. E.",
     "Torres"
    ],
    [
     "H. L.",
     "Rufiner"
    ]
   ],
   "title": "Visualization of normal and pathological speech data",
   "original": "mv07_033",
   "page_count": 4,
   "order": 12,
   "p1": "33",
   "pn": "36",
   "abstract": [
    "Techniques for the visualization of highdimensional data are common in exploratory data analysis and can be very useful for gaining an intuition into the structure of a data set. The classical method of principal component analysis is the one most often employed, however in recent years a number of other nonlinear techniques have been introduced. In the present paper, principal component analysis, and two newer methods, are applied to a set of speech data and their results are compared.\n",
    "Index Terms. PCA, LLE, Kernel PCA\n",
    ""
   ]
  },
  "amir07_maveba": {
   "authors": [
    [
     "O.",
     "Amir"
    ],
    [
     "M.",
     "Wolf"
    ],
    [
     "N.",
     "Amir"
    ]
   ],
   "title": "A clinical comparison between MDVP and Praat softwares: is there a difference?",
   "original": "mv07_037",
   "page_count": 4,
   "order": 13,
   "p1": "37",
   "pn": "40",
   "abstract": [
    "MDVP and Praat are computer programs commonly used for acoustic analysis of voice in clinical and research settings. Both softwares extract a set of acoustic parameters, many of which are defined similarly. The purpose of the present study was to compare the results obtained by both programs, and examine whether they can clinically distinguish among pathological groups differently than the other. Fifty-eight women participated in the study. Of these women, 28 were diagnosed with functional dysphonia and 30 women were diagnosed with benign masslesions (ten nodules, ten polyps and ten cysts). Voice samples, which consisted of six productions of the vowels /a/ and /i/, were analyzed using MDVP and Praat. Results show similar mean fundamentalfrequency (mF0) values for both programs (P>0.05). However, jitter, shimmer, Noise-to-harmonic ratio (NHR) and degree of unvoiced (DUV) were significantly lower using Praat, in comparison with MDVP. High correlation coefficients were found between the parallel pairs of acoustic parameters extracted by the two programs. Jitter values obtained using MDVP, for the vowel /i/, revealed a significant group difference between the nodule and cyst groups (P<0.05). This group contrast was not observed using Praat. Results suggest that although high correlations are found between values obtained by both programs, individual numerical values vary greatly. Therefore, combining results from both programs is not advisable. In addition, there are indications that linear transformation for the results from one program to the other might lead to erroneous conclusions, and should be carried out with caution.\n",
    "Index Terms. Acoustic analysis, MDVP, Praat, Clinical implications\n",
    ""
   ]
  },
  "gomezvilda07_maveba": {
   "authors": [
    [
     "Pedro",
     "Gómez-Vilda"
    ],
    [
     "Roberto",
     "Fernández-Baíllo"
    ],
    [
     "R.",
     "Martínez"
    ],
    [
     "C.",
     "Muñoz"
    ],
    [
     "L. M.",
     "Mazaira"
    ],
    [
     "A.",
     "Álvarez"
    ],
    [
     "Juan Ignacio",
     "Godino-Llorente"
    ]
   ],
   "title": "Detecting pathology in the glottal spectral signature of female voice",
   "original": "mv07_183",
   "page_count": 4,
   "order": 14,
   "p1": "183",
   "pn": "186",
   "abstract": [
    "Pathology detection by the analysis of voice remained a challenging objective during last years’ research. Former studies have shown that the glottal signature defined on the glottal source spectral density contains helpful hints in determining the healthy or pathological condition of the subject. Therefore a good reconstruction of the glottal source after removing the vocal tract is essential for the study. Nevertheless it may be shown that gender is also strongly influencing this glottal signature. Therefore comparisons and clustering between healthy and pathological glottal signatures should have into account the patient’s gender. Through the present paper a new scheme for pathology detection is presented based on a priori determining the subject’s gender. Results from a database of healthy and pathological subjects are given to contribute in this sense. A study case is presented as an example in visualizing the interest of the approach.\n",
    "Index Terms. Glottal Signature, Gender Detection, Pathology Detection\n",
    ""
   ]
  },
  "moore07_maveba": {
   "authors": [
    [
     "C. J.",
     "Moore"
    ],
    [
     "Kathiresan",
     "Manickam"
    ],
    [
     "N.",
     "Slevin"
    ]
   ],
   "title": "A physiological basis for two group, healthy male voicing identified using spectral approximate entropy",
   "original": "mv07_187",
   "page_count": 3,
   "order": 15,
   "p1": "187",
   "pn": "189",
   "abstract": [
    "The approximate entropy of vowel phonation spectra has been used to reveal two normal voicing groups in healthy males. An analysis of the corresponding open and closed quotients for the groups shows the first with balanced quotients and the second with asymmetric quotients characterised by pronounced vocal fold open phases. This indicates the second group is impacted by turbulent air flow, which reduces both the spectral structure in and approximate entropy of vowel phonation. The corresponding spectra are presented to confirm the effect. This provides a physiological explanation for the success of approximate entropy as a single figure of merit for voicing quality.\n",
    "Index Terms. voicing, entropy, quotients, spectra, physiology\n",
    ""
   ]
  },
  "aghazadeh07_maveba": {
   "authors": [
    [
     "B. S.",
     "Aghazadeh"
    ],
    [
     "H.",
     "Khadivi Heris"
    ],
    [
     "H.",
     "Ahmadi"
    ],
    [
     "M.",
     "Nikkhah-Bahrami"
    ]
   ],
   "title": "Fuzzy wavelet packet based feature extraction method applied to pathological voice signals classification",
   "original": "mv07_191",
   "page_count": 4,
   "order": 16,
   "p1": "191",
   "pn": "194",
   "abstract": [
    "In this paper an efficient fuzzy wavelet packet (WP) based feature extraction method has been used for the classification of normal voices and pathological voices of patients suffering from unilateral vocal fold paralysis (UVFP). Mother wavelet function of tenth order Daubechies (d10) has been employed to decompose signals in 5 levels. Next, WP coefficients have been used to measure energy and Shannon entropy features at different spectral sub-bands. Consequently, to find discriminant features, signals have been clustered in 2 classes using fuzzy c-means method. The amount of fuzzy membership of pathological and normal signals in their corresponding clusters is considered as a measure to quantify the discrimination ability of features. Thus, considering this measure, an optimal feature vector of length 8 has been chosen to discriminate pathological voices from normal ones. Feature vector obtained by considering nodes’ discriminant ability with classification percentage of 100 has a better performance in comparison with the feature vector including equal portion of nodes for the features of energy and entropy with the approximate classification percentage of 96. The simulation results show that fuzzy WP based feature extraction is an effective tool in voice signal analysis.\n",
    "Index Terms. Voice disorders, feature extraction, wavelet packets, fuzzy sets\n",
    ""
   ]
  },
  "bacauskiene07_maveba": {
   "authors": [
    [
     "M.",
     "Bacauskiene"
    ],
    [
     "Adas",
     "Gelzinis"
    ],
    [
     "M.",
     "Kaseta"
    ],
    [
     "M.",
     "Kovalenko"
    ],
    [
     "R.",
     "Pribuisiene"
    ],
    [
     "V.",
     "Uloza"
    ],
    [
     "Antanas",
     "Verikas"
    ]
   ],
   "title": "Multiple feature sets and genetic search based discrimination of pathological voices",
   "original": "mv07_195",
   "page_count": 4,
   "order": 17,
   "p1": "195",
   "pn": "198",
   "abstract": [
    "The effectiveness of ten different feature sets in classification of voice recordings of the sustained phonation of the vowel sound /a/ into a healthy and pathological classes is investigated as well as a new approach to building a sequential committee of support vector machines (SVM) for the classification is proposed. The optimal values of hyper-parameters of the committee and the feature sets providing the best performance are found during the genetic search. In the experimental investigations performed using 444 voice recordings of the sustained phonation of the vowel sound /a/ coming from 148 subjects, three recordings from each subject, the correct classification rate of over 92% was obtained. The classification accuracy has been compared with the accuracy obtained from four human experts. Keywords— voice pathology; feature selection; genetic search; support vector machine\n",
    ""
   ]
  },
  "vampola07_maveba": {
   "authors": [
    [
     "T.",
     "Vampola"
    ],
    [
     "Jaromír",
     "Horáček"
    ],
    [
     "I.",
     "Klepáček"
    ]
   ],
   "title": "Three-dimensional finite element modelling of vocal folds vibration in the human larynx",
   "original": "mv07_043",
   "page_count": 4,
   "order": 18,
   "p1": "43",
   "pn": "46",
   "abstract": [
    "3D-FE model of the larynx including the vocal folds, arytenoid, thyroid and cricoid cartilages was developed. The vocal fold tissue is modeled as a three layered material representing the epithelium vocal ligament and muscle. First, the frequency modal analysis of the model was performed for nonlinear material characteristics and increasing pre-stress of the vocal folds. Then the results of numerical simulation of the vocal folds oscillations excited by a prescribed aerodynamic pressure loading the surface of the tissue is presented. The FE contact elements are used for modeling the vocal folds collisions.\n",
    "Index Terms. Biomechanics of human voice, parametric FE model of the human larynx, numerical simulation of the vocal folds vibration\n",
    ""
   ]
  },
  "popolo07_maveba": {
   "authors": [
    [
     "P. S.",
     "Popolo"
    ],
    [
     "Ingo R.",
     "Titze"
    ]
   ],
   "title": "Relating vocal fold amplitude of vibration to skin acceleration level on the anterior neck",
   "original": "mv07_047",
   "page_count": 3,
   "order": 19,
   "p1": "47",
   "pn": "49",
   "abstract": [
    "The purpose of this research was to determine if a relationship between vocal fold amplitude of vibration and skin acceleration level could be found using regression techniques. The effects of accelerometer location and phonation frequency were examined.\n",
    "Index Terms. vocal folds, vibration, acceleration\n",
    ""
   ]
  },
  "drioli07_maveba": {
   "authors": [
    [
     "Carlo",
     "Drioli"
    ],
    [
     "Federico",
     "Avanzini"
    ]
   ],
   "title": "Improved fold closure in mass-spring low-dimensional glottal models",
   "original": "mv07_051",
   "page_count": 4,
   "order": 20,
   "p1": "51",
   "pn": "54",
   "abstract": [
    "This work presents a low-dimensional physical model of the glottis in which a 2-D fold displacement representation allows to represent both the vertical and longitudinal displacements of the folds. We use a one-mass mechanical model, coupled to aerodynamic driving forces, and we use a delay line representation to account for the propagation of the displacement on the body-cover. The waveform is characterized by means of a set of acoustic parameters (open quotient, speed quotient, return quotient, fundamental frequency F0, etc.) that are used in the literature as typical voice source quantification parameters. The paper provides comparisons between values of these parameters computed for the proposed model and for analytical models (LF) of the flow.\n",
    "Index Terms. Voice source, Low-dimensional models, Voice source parameters, Voice quality\n",
    ""
   ]
  },
  "puncocharova07_maveba": {
   "authors": [
    [
     "P.",
     "Punčochářová"
    ],
    [
     "Jaromír",
     "Horáček"
    ],
    [
     "K.",
     "Kozel"
    ],
    [
     "J.",
     "Fürst"
    ]
   ],
   "title": "Numerical simulation of airflow through the oscillating glottis",
   "original": "mv07_055",
   "page_count": 4,
   "order": 21,
   "p1": "55",
   "pn": "58",
   "abstract": [
    "The work deals with the numerical solution of 2D unsteady compressible viscous flows in a symmetric channel for a low inlet airflow velocity. The unsteadiness of the flow is caused by a prescribed periodic motion of a part of the channel wall with large amplitudes, nearly closing the channel during the oscillations. The flow in the channel can represent a simplified model of airflow coming from the trachea, through the glottal region with periodically vibrating vocal folds to the human vocal tract.\n",
    "Index Terms. Navier-Stokes equations, unsteady compressible viscous flow, FVM, ALE method, CFD.\n",
    ""
   ]
  },
  "lukkari07_maveba": {
   "authors": [
    [
     "T.",
     "Lukkari"
    ],
    [
     "J.",
     "Malinen"
    ],
    [
     "P.",
     "Palo"
    ]
   ],
   "title": "Recording speech during magnetic resonance imaging",
   "original": "mv07_163",
   "page_count": 4,
   "order": 22,
   "p1": "163",
   "pn": "166",
   "abstract": [
    "We discuss recording arrangements for speech during an MRI scan of the speaker's vocal tract. The image and sound data thus obtained will be used for construction and validation of a numerical model for the vocal tract.\n",
    "Index Terms. Speech recording, MRI\n",
    ""
   ]
  },
  "jesus07_maveba": {
   "authors": [
    [
     "Luis M. T.",
     "Jesus"
    ],
    [
     "André",
     "Araújo"
    ],
    [
     "Isabel M.",
     "Costa"
    ]
   ],
   "title": "Articulatory oral space measures using the modified a-space",
   "original": "mv07_167",
   "page_count": 4,
   "order": 23,
   "p1": "167",
   "pn": "170",
   "abstract": [
    "The Modified A-Space method is described. It allows the detailed characterization of in terms of mid-sagittal-plane area, antero-posterior distance, occlusal plane area, posterior pharynx wall tilt, mandible arch width, and oral cavity volume.\n",
    "Index Terms. Speech Production, Articulatory oral space measures\n",
    ""
   ]
  },
  "svec07_maveba": {
   "authors": [
    [
     "J. G.",
     "Švec"
    ],
    [
     "M.",
     "Frič"
    ],
    [
     "F.",
     "Šram"
    ],
    [
     "H. K.",
     "Schutte"
    ]
   ],
   "title": "Mucosal waves on the vocal folds: conceptualization based on videokymography",
   "original": "mv07_171",
   "page_count": 2,
   "order": 24,
   "p1": "171",
   "pn": "172",
   "abstract": [
    "Mucosal waves have been considered of crucial importance for healthy vocal fold vibration, but their appearance and variability have been described only vaguely so far. We studied the appearance of the mucosal waves using videokymography. The mucosal wave was divided in two components: 1) the vertical phase differences between the lower and upper margins of the vocal folds, which are reflected in sharpness of the lateral peaks in kymograms and 2) the waves propagating laterally over the vocal fold surface which can be recognized as lateral movements on the vocal fold surface occurring during medial movement of the glottal edge. Different features of the laterally traveling mucosal waves were recognized. The suggested new classification of the mucosal wave properties opens new possibilities for more sensitive monitoring of the state of the vocal fold tissues in basic voice research and clinical practice.\n",
    "Index Terms. Mucosal waves, videokymography, high-speed videolaryngoscopy, vocal fold vibration\n",
    ""
   ]
  },
  "groleau07_maveba": {
   "authors": [
    [
     "Julie",
     "Groleau"
    ],
    [
     "Matthieu",
     "Chabanas"
    ],
    [
     "Christophe",
     "Marécaux"
    ],
    [
     "Natacha",
     "Payrard"
    ],
    [
     "Brice",
     "Segaud"
    ],
    [
     "Michel",
     "Rochette"
    ],
    [
     "Pascal",
     "Perrier"
    ],
    [
     "Yohan",
     "Payan"
    ]
   ],
   "title": "A biomechanical model of the face including muscles for the prediction of deformations during speech production",
   "original": "mv07_173",
   "page_count": 4,
   "order": 25,
   "p1": "173",
   "pn": "176",
   "abstract": [
    "A 3D biomechanical finite element model of the face is presented. Muscles are represented by piecewise uniaxial tension cable elements linking the insertion points. Such insertion points are specific entities differing from nodes of the finite element mesh, which makes possible to change either the mesh or the muscle implementation totally independently of each other. Lip/teeth and upper lip/lower lip contacts are also modeled. Simulations of smiling and of an Orbicularis Oris activation are presented and interpreted. The importance of a proper account of contacts and of an accurate anatomical description is shown.\n",
    "Index Terms. Face models, Muscle modeling, Lip/teeth interaction\n",
    ""
   ]
  },
  "sidlof07_maveba": {
   "authors": [
    [
     "P.",
     "Šidlof"
    ],
    [
     "Olivier",
     "Doaré"
    ],
    [
     "Olivier",
     "Cadot"
    ],
    [
     "Antoine",
     "Chaigne"
    ],
    [
     "Jaromír",
     "Horáček"
    ]
   ],
   "title": "PIV measurements of velocity fields in glottis on a physical vocal fold model",
   "original": "mv07_177",
   "page_count": 4,
   "order": 26,
   "p1": "177",
   "pn": "180",
   "abstract": [
    "The velocity fields along a selfvibrating physical model of vocal folds were studied experimentally. The shape of the vocal folds was specified according to data measured on excised human larynges in phonation position. The model was fabricated in 1:4 scale as a silicone body vibrating in the wall of a plexiglass wind tunnel. The model is not excited externally and oscillates only due to coupling with the flow. In addition to acoustic, subglottal pressure and impact intensity measurements, flow velocity fields were recorded in the coronal plane using particle image velocimetry, in the domain immediately above glottis. Analysis of the PIV images taken within 25 phases of one vibration cycle gives good insight into the dynamics of the supraglottal flow.\n",
    "Index Terms. glottal flow, physical model, PIV\n",
    ""
   ]
  },
  "pedersen07_maveba": {
   "authors": [
    [
     "Mette",
     "Pedersen"
    ],
    [
     "Kasper",
     "Munck"
    ]
   ],
   "title": "Advanced voice assessment. a prospective case-control study of jitter%, shimmer% and Qx%, glottis closure cohesion factor (spead by laryngograph ltd.) and long time average spectra",
   "original": "mv07_061",
   "page_count": 4,
   "order": 27,
   "p1": "61",
   "pn": "64",
   "abstract": [
    "It was suggested at the European Oto-Rhino-Laryngology conference 2007 in Vienna that voice analysis is empiric and that clinical voice treatment is not evidence based!! In the Cochrane Handbook advice for evaluation of quality of research was made: Groups are made of the quality in 3 levels: Level A (randomized controlled trial/meta-analysis): High-quality randomized controlled trial (RCT) that considers all important outcomes. High-quality meta-analysis (quantitative systematic review) using comprehensive search strategies. Level B (other evidence): A well-designed, non randomized clinical trial. A non quantitative systematic review with appropriate search strategies and well-substantiated conclusions, includes lower quality RCT's, clinical cohort studies and case-controlled studies with non biased selection of study participants and consistent findings. Other evidence, such as high-quality, historical, uncontrolled studies, or welldesigned epidemiological studies with compelling findings, is also included. Level C (consensus / expert opinion): Consensus viewpoint or expert opinion.  The purpose of this categorization is that good studies can be structured in meta-analysis to affirm the results as it is done in e.g. cancer and cardiology research.\n",
    ""
   ]
  },
  "fernandezbaillo07_maveba": {
   "authors": [
    [
     "Roberto",
     "Fernández-Baíllo"
    ],
    [
     "Pedro",
     "Gómez-Vilda"
    ],
    [
     "C.",
     "Ramirez"
    ],
    [
     "B.",
     "Scola"
    ]
   ],
   "title": "Pre-post surgery evaluation based on the profile of glottal source",
   "original": "mv07_065",
   "page_count": 4,
   "order": 28,
   "p1": "65",
   "pn": "68",
   "abstract": [
    "Nowadays an ever increasing interest in voice studies is present in the research and application fields both under biomedical and bioengineering scopes. Everyday more resources are assigned to this research field looking for new methods easing the study, evaluation and diagnose of voice pathology. In this sense it is well known that the mucosal wave is a fundamental phenomenon present in voice production, highly related to voice quality. In such a way when a specific pathology is present in vocal folds producing modifications in their dynamic model the amount of mucosal wave is sensibly altered. The present work uses results from inverse filtering to derive a mucosal wave correlate from the glottal flow derivative. Therefore two important estimates of the phonation pattern (glottal excitation) and the vocal fold behaviour (mucosal wave correlate) may be used in pathology detection. A clinical study case corresponding to the presence of a polyp on a single vocal fold (unilateral) is conducted to evaluate the pathological alteration produced on the dynamics of the vocal folds and on the presence of mucosal wave. The results illustrating the behaviour of the glottal closure and vocal fold dynamics obtained before and after treatment are given and discussed.\n",
    "Index Terms. Mucosal Wave, Glottal Source, Polyp, Voice Pathology, Vocal fold dymanics\n",
    ""
   ]
  },
  "krutisova07_maveba": {
   "authors": [
    [
     "Jana",
     "Krutišová"
    ],
    [
     "Jana",
     "Klečková"
    ]
   ],
   "title": "Data warehouse for prosody features",
   "original": "mv07_069",
   "page_count": 2,
   "order": 29,
   "p1": "69",
   "pn": "70",
   "abstract": [
    "Speech is the most direct and intuitive form of human communication. Speaker uses to emphasize his utterance a set of non-verbal features. It is called prosody. The prosody serves a critical information for the recognition and understanding system. This paper describes an idea to use data warehouse properties for storage of prosody features. The work presented in this paper was supported by the project number 2C06009.\n",
    "Index Terms. Spontaneous speech, prosody features, data warehouse\n",
    ""
   ]
  },
  "chytil07_maveba": {
   "authors": [
    [
     "P.",
     "Chytil"
    ],
    [
     "Cheolwoo",
     "Jo"
    ],
    [
     "K.",
     "Drake"
    ],
    [
     "D.",
     "Graville"
    ],
    [
     "M.",
     "Wax"
    ],
    [
     "M.",
     "Pavel"
    ]
   ],
   "title": "Detection of pathological diseases using a parametric model of vocal folds and neural networks",
   "original": "mv07_071",
   "page_count": 4,
   "order": 30,
   "p1": "71",
   "pn": "74",
   "abstract": [
    "There are a number of clinical conditions that affect directly or indirectly the function of the vocal folds and thereby the pressure waveforms of elicited sounds. If the relationships between the clinical conditions and the voice quality are sufficiently reliable, it should be possible to detect these diseases or disorders. The focus of this paper is to determine the set of features and their values that would characterize the speaker’s state of vocal folds. To the extent that these features can capture the anatomical, physiological, and neurological aspects of the speaker they can be potentially used to mediate an unobtrusive approach to diagnosis. We will show a new approach to this problem, supported with results obtained from two disordered voice corpora.\n",
    "Index Terms. Model, glottal pulse, pathological voice\n",
    ""
   ]
  },
  "ferrari07_maveba": {
   "authors": [
    [
     "Sara",
     "Ferrari"
    ],
    [
     "Mitchell",
     "Silva"
    ],
    [
     "Marcella",
     "Guarino"
    ],
    [
     "Daniel",
     "Berckmans"
    ]
   ],
   "title": "Characterisation of cough sounds to monitor respiratory infections in intensive pig farming",
   "original": "mv07_075",
   "page_count": 4,
   "order": 31,
   "p1": "75",
   "pn": "78",
   "abstract": [
    "Cough is a symptom and central element for diagnosis of very common respiratory affection causes of death and loss of productivity in intensive pig farms. The aim of this research is the comparison between acoustic features of cough sounds originating from infectious and non infectious diseases. The acoustic parameters investigated are Peak Frequency and Duration of cough signals. The differences resulting from the sound analysis confirmed variability in acoustics parameters according to a state of health or disease. Infections change the status of respiratory system; thus infectious cough (I) sounds are different than healthy ones (H). Duration of single coughs is significant different among the classes analyzed: non infectious coughs (H), Actinobacillus (A) and Pasteurella’s (P) ones. Frequency analysis allows a more general classification between H and I. Sounds can be used in an alarm system based on an algorithm to identifies automatically cough sounds and provide early warning system for the farmer about the health status of his herd.\n",
    "Index Terms. cough, diseases, prevention, sound\n",
    ""
   ]
  },
  "buchaillard07_maveba": {
   "authors": [
    [
     "Stéphanie",
     "Buchaillard"
    ],
    [
     "Muriel",
     "Brix"
    ],
    [
     "Pascal",
     "Perrier"
    ],
    [
     "Yohan",
     "Payan"
    ]
   ],
   "title": "Use of a biomechanical tongue model to predict the impact of tongue surgery on speech production",
   "original": "mv07_079",
   "page_count": 4,
   "order": 32,
   "p1": "79",
   "pn": "82",
   "abstract": [
    "This paper presents predictions of the consequences of tongue surgery on speech production. For this purpose, a 3D finite element model of the tongue is used that represents this articulator as a deformable structure in which tongue muscles anatomy is realistically described. Two examples of tongue surgery, which are common in the treatment of cancers of the oral cavity, are modelled, namely a hemiglossectomy and a large resection of the mouth floor. In both cases, three kinds of possible reconstruction are simulated, assuming flaps with different stiffness. Predictions are computed for the cardinal vowels /i, a, u/ in the absence of any compensatory strategy, i.e. with the same motor commands as the one associated with the production of these vowels in non-pathological conditions. The estimated vocal tract area functions and the corresponding formants are compared to the ones obtained under normal conditions.\n",
    "Index Terms. biomechanical modelling, tongue surgery, glossectomy, speech production\n",
    ""
   ]
  },
  "kleckova07_maveba": {
   "authors": [
    [
     "Jana",
     "Klečková"
    ],
    [
     "Jana",
     "Krutišová"
    ]
   ],
   "title": "Using nonverbal communication in dialog system",
   "original": "mv07_083",
   "page_count": 2,
   "order": 33,
   "p1": "83",
   "pn": "84",
   "abstract": [
    "The work presented in this paper was supported by the project number 2C06009. Verbal communication is the most obvious instrument used to express our thoughts and ideas, considering only this part of speech without regarding its nonverbal part, may lead to overlooking important information of utterance or even misunderstanding it. The contributed paper deals with use of automatic system for recognition of facial expressions which have been being created for the Czech dialog system.\n",
    "Index Terms. Face detection, feature extraction\n",
    ""
   ]
  },
  "khadiviheris07_maveba": {
   "authors": [
    [
     "H.",
     "Khadivi Heris"
    ],
    [
     "B. S.",
     "Aghazadeh"
    ],
    [
     "M.",
     "Nikkhah-Bahrami"
    ]
   ],
   "title": "Classification of pathological voice signals using self-similarity based wavelet packet feature extraction and Davies-bouldin criterion",
   "original": "mv07_085",
   "page_count": 4,
   "order": 34,
   "p1": "85",
   "pn": "88",
   "abstract": [
    "This paper suggests the nonlinear parameter of self-similarity as a novel feature to be employed in wavelet packet based voice signal analysis. Two groups of normal and pathological voice signals have been decomposed using wavelet packets. Next, self similar characteristics of reconstructed signals in each node have been calculated. Consequently, discrimination ability of each node has been obtained using Davies-Bouldin criterion. In the following, eight most discriminant nodes have been identified to construct feature vector parameters. To reduce the feature vector dimensionality Principal component analysis (PCA) has been employed. Finally, an artificial neural network has been trained to classify normal and pathological voices. The results show that self-similarity parameter can be a reliable feature in wavelet packet based voice signal analysis. Moreover, selected sub-bands are distributed over the whole available frequencies which shows that pathological factors do not influence specific frequency range which accentuates the role of WP decomposition.\n",
    "Index Terms. vocal disorder, wavelet packet, selfsimilarity, Davies-Bouldin Criterion\n",
    ""
   ]
  },
  "sommavilla07_maveba": {
   "authors": [
    [
     "Giacomo",
     "Sommavilla"
    ],
    [
     "Piero",
     "Cosi"
    ],
    [
     "Carlo",
     "Drioli"
    ],
    [
     "Giulio",
     "Paci"
    ]
   ],
   "title": "SMS-FESTIVAL: a new TTS framework",
   "original": "mv07_089",
   "page_count": 4,
   "order": 35,
   "p1": "89",
   "pn": "92",
   "abstract": [
    "A new sinusoidal model based engine for FESTIVAL TTS system which performs the DSP (Digital Signal Processing) operations (i.e. converting a phonetic input into audio signal) of a diphone-based TTS concatenative system, taking as input the NLP (Natural Language Processing) data (a sequence of phonemes with length and intonation values elaborated from the text script) computed by FESTIVAL is described.   The engine aims to be an alternative to MBROLA and makes use of SMS (“Spectral Modeling Synthesis”) representation, implemented with the CLAM (C++ Library for Audio and Music) framework.   This program will be released with open source license (GPL), and will compile everywhere gcc and CLAM do (i.e.: Windows, Linux and Mac OS X operating systems).\n",
    "Index Terms. TTS, SMS, MBROLA, FESTIVAL, GPL.\n",
    ""
   ]
  },
  "ferrer07_maveba": {
   "authors": [
    [
     "C. A.",
     "Ferrer"
    ],
    [
     "M. S. de",
     "Bodt"
    ],
    [
     "Y.",
     "Maryn"
    ],
    [
     "P. Van de",
     "Heyning"
    ],
    [
     "Maria E.",
     "Hernández-Díaz Huici"
    ]
   ],
   "title": "Properties of the cepstral peak prominence and its usefulness in vocal quality measurements",
   "original": "mv07_093",
   "page_count": 4,
   "order": 36,
   "p1": "93",
   "pn": "96",
   "abstract": [
    "Unlike many acoustic measures, Cepstral Peak Prominence (CPP) has shown consistently high correlations with subjective vocal quality ratings. However, this superiority of the CPP index is reported based on empirical results, with its theoretical advantages not always clearly stated. In this paper the properties of the CPP which makes it a good predictor for vocal quality are addressed, as well as how it differs from other measures. The reported experimental setups of the previous studies are analyzed, and reasons for the observed variability in the results are given. After this discussion, the clinical usefulness of CPP is addressed. This paper can be useful for researchers as well as for clinicians, in planning the experimental setup and interpreting the relevance of the results.\n",
    "Index Terms. Cepstrum, vocal quality, breathiness, roughness\n",
    ""
   ]
  },
  "putzer07_maveba": {
   "authors": [
    [
     "Manfred",
     "Pützer"
    ],
    [
     "Wolfgang",
     "Wokurek"
    ]
   ],
   "title": "Correlates of temporal high-resolution formant analysis and glottal excitation in laryngeal dystonia before and after botulinum toxin treatment: a case study",
   "original": "mv07_097",
   "page_count": 4,
   "order": 37,
   "p1": "97",
   "pn": "100",
   "abstract": [
    "This study visualizes the glottal excitation in a temporally highly resolved estimate of the first formant. Instantaneous estimates during the glottal cycle of the frequency and bandwidth of the first formant closely follow the electroglottographic contour. This is demonstrated for phonation of an [a:] produced by one female patient with laryngeal dystonia. The observed contours in the F1 frequency and bandwidth can be interpreted with reference to the current status of patients’ typical phonation behaviour before and after botulinum toxin (BTX) treatment. The temporally highly resolved formant frequency and bandwidth contours reflect glottal features such as the different durations of the open phase and fundamental frequency and/or amplitude perturbations of the vocal fold vibration. For example, diplophonia is identifiable in parts of the phonation. These results suggest the possibility of quantifying differences in the intra-cycle first formant contours according to different voice qualities.\n",
    "Index Terms. Linear prediciton, electroglottography, laryngeal dystonia, BTX treatment\n",
    ""
   ]
  },
  "sitchi07_maveba": {
   "authors": [
    [
     "A.",
     "Sitchi"
    ],
    [
     "Francis",
     "Grenez"
    ],
    [
     "Jean",
     "Schoentgen"
    ]
   ],
   "title": "An experiment in vocal tract length estimation",
   "original": "mv07_101",
   "page_count": 4,
   "order": 38,
   "p1": "101",
   "pn": "104",
   "abstract": [
    "The presentation concerns the estimation of the vocal tract length of a speaker on the base of her formant frequencies and the formant frequencies and known tract length of a reference speaker. The length prediction is founded on a rule inferred from Webster’s equation that describes the propagation of a planar acoustic wave in a loss-less vocal tract. The length prediction experiments have been crosslanguage, cross-gender and cross-corpora. Results show that the relative length prediction error is less than 3%, which is inferior to the error made assuming typical tract lengths of 15 and 17 cm for male and female speakers respectively.\n",
    ""
   ]
  },
  "horacek07_maveba": {
   "authors": [
    [
     "Jaromír",
     "Horáček"
    ],
    [
     "A.-M.",
     "Laukkanen"
    ],
    [
     "P.",
     "Šidlof"
    ]
   ],
   "title": "Estimation of output-cost–ratio using an aeroelastic model of voice production",
   "original": "mv07_105",
   "page_count": 4,
   "order": 39,
   "p1": "105",
   "pn": "108",
   "abstract": [
    "The study deals with mathematical modeling of the vocal fold self-oscillations related to estimation of the so-called output-cost-ratio (OCR), which is computed from the numerically simulated sound pressure level at the glottal level and the impact stress (IS) during vocal folds collision. The dependence of OCR on prephonatory glottal width, fundamental frequency and lung pressure is discussed and partly compared with a modified output cost ratio measured in humans, where the closed quotient is used instead of IS.\n",
    "Index Terms. Biomechanics of voice, numerical simulation of vocal folds vibration.\n",
    ""
   ]
  },
  "kob07_maveba": {
   "authors": [
    [
     "Malte",
     "Kob"
    ],
    [
     "Tobias",
     "Frauenrath"
    ]
   ],
   "title": "A system for parallel measurement of glottis opening and larynx position",
   "original": "mv07_109",
   "page_count": 3,
   "order": 40,
   "p1": "109",
   "pn": "111",
   "abstract": [
    "The simultaneous assessment of the status of the glottis opening and the position of the larynx can be beneficial for the diagnosis of disorders of voice production and swallowing. The method presented here makes use of a time-multiplex algorithm for the measurement of space-resolved transfer impedances through the larynx. The fast sequence of measurements allows a quasi simultaneous assessment of both larynx position and EGG signal in 32 channels. First results indicate a high potential of the method for use as a non-invasive tool in the diagnosis of voice dysfunction, ventricular fold phonation and swallowing disorders.\n",
    "Index Terms. Voice assessment, larynx position, tomography, transfer impedance, EGG\n",
    ""
   ]
  },
  "manfredi07_maveba": {
   "authors": [
    [
     "Claudia",
     "Manfredi"
    ],
    [
     "Giovanna",
     "Cantarella"
    ]
   ],
   "title": "A multi-purpose user-friendly voice analysis tool: application to lipofilling treatment",
   "original": "mv07_113",
   "page_count": 4,
   "order": 41,
   "p1": "113",
   "pn": "116",
   "abstract": [
    "A multi-purpose software tool (BioVoice) is presented, capable of performing automatic analysis of a large range of voice signal, no manual setting being required to the user. This makes the tool feasible for application by non-expert users in several fields, ranging from high-pitched new-born cries, to adult healthy singing vocalizations and to irregular, pathological voice signals. Main voice characteristics (fundamental frequency and formants) are evaluated and tracked by means of robust analysis techniques that can handle the above mentioned wide range of signals, as internal settings for optimal frame length, frequency range of analysis and plots are automatically adjusted.   Specific parameters are evaluated according to the kind of signal under study, and displayed with suitable plots and tables.   In this paper, the method is applied to patient affected by laryngeal hemiplegia that underwent lipofilling treatment to recover phonatory capabilities.\n",
    "Index Terms. multi-purpose voice analysis tool, robust parameter estimation, laryngeal hemiplegia.\n",
    ""
   ]
  },
  "airas07_maveba": {
   "authors": [
    [
     "M.",
     "Airas"
    ],
    [
     "Paavo",
     "Alku"
    ],
    [
     "M.",
     "Vainio"
    ]
   ],
   "title": "Laryngeal voice quality changes in expression of prominence in continuous speech",
   "original": "mv07_135",
   "page_count": 4,
   "order": 42,
   "p1": "135",
   "pn": "138",
   "abstract": [
    "In this study three different prominence and speech melody related effects on voice quality were studied using an inverse filtering based method. The hypothesis that prominence as a function of sentence and word stress is signaled with more pressed voice quality was tested. The results indicated discrepancies in the parameterization results, and the original hypothesis could not be confirmed. Instead, it is suggested that prominence is expressed with a more breathy voice quality. A possible physiological explanation for the phenomenon is also provided.\n",
    "Index Terms. voice inverse filtering, prominence\n",
    ""
   ]
  },
  "hernandezdiazhuici07_maveba": {
   "authors": [
    [
     "María E.",
     "Hernández-Díaz Huici"
    ],
    [
     "Werner",
     "Verhelst"
    ]
   ],
   "title": "Spectral transition features in dysarthric speech",
   "original": "mv07_139",
   "page_count": 4,
   "order": 43,
   "p1": "139",
   "pn": "142",
   "abstract": [
    "Some spectral transition features are introduced and tested in samples from dysarthric patients. The goal is to explore their potential as descriptors of articulatory deviations. This preliminary analysis includes only stop consonants extracted from the diadochokinetic task. Results and discussion are detailed for each one of the dysarthric groups included in the experiment.\n",
    "Index Terms. Articulation, dysarthria, spectral transitions\n",
    ""
   ]
  },
  "devillers07_maveba": {
   "authors": [
    [
     "L.",
     "Devillers"
    ],
    [
     "L.",
     "Vidrascu"
    ]
   ],
   "title": "Real-life emotions detection on human-human medical call center interactions",
   "original": "mv07_143",
   "page_count": 4,
   "order": 44,
   "p1": "143",
   "pn": "146",
   "abstract": [
    "Our aim is to study the vocal expression of emotion in real-life spoken interactions in order to build emotion detection system. We make use of a corpus of naturallyoccurring dialogs recorded in a real-life emergency medical call center. The context of emergency gives a large palette of complex and mixed emotions. About 30% of the utterances are annotated with non-neutral emotion labels on this medical corpus. The complexity of the emotion recognition task increases the higher the number of classes and the finest and closest these classes are. Finding relevant features of various types such as speech disfluencies or affect bursts becomes essential in order to improve the detection performances. Our experiments focus on a task of discriminating 2 to 5 emotions, Fear, Anger, Sadness, Neutral and Relief.\n",
    "Index Terms. Emotions, real-life spoken interactions, detection system, medical call center\n",
    ""
   ]
  },
  "alpan07_maveba": {
   "authors": [
    [
     "A.",
     "Alpan"
    ],
    [
     "Francis",
     "Grenez"
    ],
    [
     "Jean",
     "Schoentgen"
    ]
   ],
   "title": "Estimation of vocal noise and cycle duration jitter in connected speech",
   "original": "mv07_147",
   "page_count": 4,
   "order": 45,
   "p1": "147",
   "pn": "150",
   "abstract": [
    "The objective is to describe analysis methods that enable tracking vocal dysperiodicities in running speech. Vocal dysperiodicities here refer to deviations from strict periodicity in voiced speech sounds. Two methods are described. They respectively enable the sample-by-sample extraction of vocal noise from the speech signal or the isolation of speech cycles in voiced segments to quantify perturbations of the cycle lengths and amplitudes (i.e. cycle duration jitter and amplitude shimmer). These methods share the property that they are not based on the assumption that the signal is locally periodic and that the average period length is known a priori.\n",
    "Index Terms. Vocal noise, jitter, running speech\n",
    ""
   ]
  },
  "landau07_maveba": {
   "authors": [
    [
     "M.",
     "Landau"
    ],
    [
     "T.",
     "Yingthawornsuk"
    ],
    [
     "D. Mitchell",
     "Wilkes"
    ],
    [
     "Richard G.",
     "Shiavi"
    ],
    [
     "R. M.",
     "Salomon"
    ]
   ],
   "title": "Predicting severity of mental state using vocal output characteristics",
   "original": "mv07_153",
   "page_count": 4,
   "order": 46,
   "p1": "153",
   "pn": "156",
   "abstract": [
    "Acoustical properties of speech have been shown to be related to mental states such as depression and remission. In particular, energy in frequency bands has been used as features for group classification among the groups with mental states of remission, depression, and suicidal risk. The prediction algorithms presented develop an additional level of assessment and are designed to predict a score for the severity of the mental state, provided by the Beck Depression Inventory. Several multiple regression models have been produced relating the results of the inventory and the power in four frequency bands. Models were produced for both males and females using both spontaneous and automatic speech.\n",
    "Index Terms. speech, mental states, power spectra, regression\n",
    ""
   ]
  },
  "kaymazkeskinpala07_maveba": {
   "authors": [
    [
     "H.",
     "Kaymaz Keskinpala"
    ],
    [
     "T.",
     "Yingthawornsuk"
    ],
    [
     "D. Mitchell",
     "Wilkes"
    ],
    [
     "Richard G.",
     "Shiavi"
    ],
    [
     "R. M.",
     "Salomon"
    ]
   ],
   "title": "Distinguishing high risk suicidal subjects among depressed subjects using mel-frequency cepstrum coefficients and cross validation technique",
   "original": "mv07_157",
   "page_count": 4,
   "order": 47,
   "p1": "157",
   "pn": "160",
   "abstract": [
    "This paper describes a way to distinguish high risk suicidal patients among depressed patients using mel-frequency cepstrum coefficients. Distinguishing high risk suicidal patients among depressed patients is an important problem; a practical solution to this would prevent the loss of many lives. In this study, the vocal characteristics of female and male patients' speech samples were analyzed and a small subset of the first ten melfrequency cepstrum coefficients were used to classify high risk suicidal patients and depressed patients. Cross validation was used to observe classification performance. There were two different types of speech samples from both male and female patients. One of them was the speech sampled during a clinical interview and the other was speech sampled during a text-reading session.\n",
    "Index Terms. Speech, MFCC, suicide, depression, cross validation\n",
    ""
   ]
  },
  "moerman07_maveba": {
   "authors": [
    [
     "M. B. J.",
     "Moerman"
    ],
    [
     "J. P.",
     "Martens"
    ],
    [
     "D.",
     "Chevalier"
    ],
    [
     "G.",
     "Friedrich"
    ],
    [
     "M.",
     "Hess"
    ],
    [
     "G.",
     "Lawson"
    ],
    [
     "A. K.",
     "Licht"
    ],
    [
     "F.",
     "Ogut"
    ],
    [
     "E.",
     "Reckenzaun"
    ],
    [
     "M.",
     "Remacle"
    ],
    [
     "V.",
     "Woisard"
    ],
    [
     "Philippe H.",
     "Dejonckere"
    ]
   ],
   "title": "Towards a basic protocol for functional assessment of substitution voices: preliminary results of an international trial",
   "original": "mv07_201",
   "page_count": 4,
   "order": 48,
   "p1": "201",
   "pn": "204",
   "abstract": [
    "We performed an international trial with a newly developed multidimensional assessment protocol for substitution voices based on the European Laryngological Society protocol for ‘common dysphonia’. However, as sound production in SV is largely irregular, we needed some adaptations, in particular of the dimensions perception, acoustic analysis and visual evaluation. The protocol consisted of clinical information, the IINFVo perceptual rating scale, visual examination (level and quality of vibration), acoustic registration of vowels, vcv, cvcvcv and text (which was later analysed with the Auditory Model Based Pitch Extractor (AMPEX)), aerodynamic measurements (Vital Capacity, Maximum Phonation Time, and Maximal Intensity), and self-evaluation (of i) voice quality and ii) degree of invalidity). Six centers participated. We retained 96 suitable files (out of 102). Variance analysis demonstrates significance for i) all perceptual parameters (except for Voicing), MPT and Maximal Intensity and ii) type of surgery and/or main anatomical vibration source. There is no correlation at all between the patient’s perception of his /her disability and perceptual parameters, MPT, quality of vibration. Correlation between the acoustical analysis and the subjective rating was only moderate (Pearson < 0.62; standard deviation > 1.8).\n",
    "Index Terms. substitution voices, multidimensional protocol, acoustics, perception, dysphonia\n",
    ""
   ]
  },
  "hagmuller07_maveba": {
   "authors": [
    [
     "Martin",
     "Hagmüller"
    ]
   ],
   "title": "Pitch contour from formants for alaryngeal speech",
   "original": "mv07_205",
   "page_count": 4,
   "order": 49,
   "p1": "205",
   "pn": "208",
   "abstract": [
    "People without a larynx have to communicate with a substitute voice, where all possibilities have major shortcomings. A common problem is the lack of a natural pitch contour. This is either because of a constant pitch in the case of an electro-larynx or very limited control over pitch in case of esophageal or tracheo-esophageal speech. To introduce a more natural pitch contour, we propose to use the speech formants as a source to generate an arti„±cial pitch contour. Earlier of„²ine methods to introduce a natural pitch contour to AL speech have shown, that this signi„±cantly improves the speech quality. For voice modi„±cation, we use the voice pulse model which enables us to place voice pulses at arbitrary positions even when no harmonic voice source is available, while preserving the voice identity of the speaker. Informal perceptual evaluations showed that using a formant based fundamental frequency yields a reasonable pitch contour and is perceived as an improvement for alaryngeal speech.\n",
    "Index Terms. Alaryngeal speech, pitch, formants, enhancement\n",
    ""
   ]
  },
  "martinez07_maveba": {
   "authors": [
    [
     "F. M.",
     "Martínez"
    ],
    [
     "J. J.",
     "Azpiroz"
    ],
    [
     "A. E.",
     "Martínez"
    ]
   ],
   "title": "Analysis of noise in cry signal using frequency and time-frequency tools",
   "original": "mv07_211",
   "page_count": 4,
   "order": 50,
   "p1": "211",
   "pn": "214",
   "abstract": [
    "An acoustic cry analysis using frequency and time-frequency tools is developed with the objective of obtain precise and significant information about the events that occur and to analyze the effect of noise on the signals. For hungry baby cry signals, spectrogram, coherence function and wavelet packet decomposition were used on sonorant and non sonorant segments and de-noising techniques were applied to remove the unwanted components. Results show that it can be useful to use those techniques to perform a better analysis of the signal and to eliminate the noise, but the final assessment has to come from the physician’s point of view.\n",
    "Index Terms. Cry analysis, Spectrogram, Coherence Function, De-noising, Wavelet Packets\n",
    ""
   ]
  },
  "bocchi07_maveba": {
   "authors": [
    [
     "L.",
     "Bocchi"
    ],
    [
     "L.",
     "Spaccaterra"
    ],
    [
     "S.",
     "Orlandi"
    ],
    [
     "F.",
     "Acciai"
    ],
    [
     "F.",
     "Favilli"
    ],
    [
     "E.",
     "Atrei"
    ],
    [
     "Claudia",
     "Manfredi"
    ],
    [
     "G. P.",
     "Donzelli"
    ]
   ],
   "title": "Blood oxygenation vs. cry in preterm newborn infants",
   "original": "mv07_215",
   "page_count": 4,
   "order": 51,
   "p1": "215",
   "pn": "218",
   "abstract": [
    "Crying is a physiological action made by the infant to communicate and to draw attention. However, especially for a premature infant, this action requires great effort, which may even have an adverse impact on blood oxygenation. In this work we present first results concerning the evaluation of the distress occurring during cry, as related to possible decrease of cerebral oxygenation. A recording system has been developed, that allows synchronised monitoring of the central blood oxygenation and the audio recording of newborn infant’s cry. A multi-purpose voice analysis tool (BioVoice), characterised by high resolution and tracking capabilities, is applied to new-born infant cries. For these signals, the tool provides also detailed statistics (min and max cry length, maximum energy, etc.), to help diagnosis. BioVoice is completely automatic, working with any sampling frequency and F0, and does not need any manual setting of whatever option to be made by the user, thus being easily accessible also to non-experts. Some examples are reported, concerning preterm new-born infants.\n",
    "Index Terms. newborn cry, blood oxygenation, voice analysis\n",
    ""
   ]
  },
  "canoortiz07_maveba": {
   "authors": [
    [
     "Sergio Daniel",
     "Cano Ortiz"
    ],
    [
     "Israel",
     "Suaste"
    ],
    [
     "Daniel",
     "Escobedo"
    ],
    [
     "Taco",
     "Ekkel"
    ],
    [
     "Carlos Alberto",
     "Reyes García"
    ]
   ],
   "title": "Towards a cry classification based on articulated signal processing",
   "original": "mv07_219",
   "page_count": 4,
   "order": 52,
   "p1": "219",
   "pn": "222",
   "abstract": [
    "The paper assumes the implementation of a cry-based classifier for neonatal diagnosis. The main contribution is concerned with the articulated processing of cry signals, which includes two kinds of approaches: a threshold-based classification and ANN-based classification. Every one of those approaches makes its own contributions to the cry classification, both are adequately combined in a classifier of two-class (pathological and normal). Moreover the use of cry unit as a primary data was also an interesting aspect held by the authors. This articulated cry processing is the main body of a new cry-based methodology for neonatal diagnosis, which will be presented in a few months by the Group of Speech Processing in Cuba.\n",
    "Index Terms. cry analysis, neural networks\n",
    ""
   ]
  },
  "gamba07_maveba": {
   "authors": [
    [
     "M.",
     "Gamba"
    ],
    [
     "J.",
     "Medard"
    ],
    [
     "H.",
     "Andriamialison"
    ],
    [
     "G.",
     "Rakotoarisoa"
    ],
    [
     "C.",
     "Giacoma"
    ]
   ],
   "title": "Vocal tract modeling as a tool to investigate species-specific cues in vocalization",
   "original": "mv07_225",
   "page_count": 3,
   "order": 53,
   "p1": "225",
   "pn": "227",
   "abstract": [
    "Recent works emphasize the importance of acoustic cues of species-specificity in primate vocal communication. The potential of vocal tract resonance in generating these cues is examined by anatomically based vocal tract computational modeling. True lemurs (genus Eulemur), which occur in Madagascar, show a remarkable species diversity and this makes especially good model species to study these interspecific differences. The oral vocal tract of lemurs is relatively flexible, but the nasal tract also plays a crucial role in their communicative system. We analyzed distinctive formant characteristics as produced by the computational models in order to investigate inter- and intra-specific variation in the vocal tract size and shape. Differences in morphological features between lemur taxa have an influence on shaping structural characters of their vocalizations.\n",
    "Index Terms. Prosimians, morphology, Eulemur, vocal behaviour\n",
    ""
   ]
  },
  "sangiorgi07_maveba": {
   "authors": [
    [
     "T.",
     "Sangiorgi"
    ],
    [
     "L.",
     "Mazzei"
    ],
    [
     "F.",
     "Felici"
    ],
    [
     "S.",
     "Lapi"
    ],
    [
     "G.",
     "Testi"
    ],
    [
     "Claudia",
     "Manfredi"
    ],
    [
     "Piero",
     "Bruscaglioni"
    ]
   ],
   "title": "Objective analysis of the singing voice as related to singer posture",
   "original": "mv07_231",
   "page_count": 4,
   "order": 54,
   "p1": "231",
   "pn": "234",
   "abstract": [
    "This paper deals with objective analysis of the singing voice, and aims at giving non-professional singers both an aid to improve their voice capabilities and a criterion to prevent a wrong vocal attitude (head, neck, and body posture) that could even cause vocal pathologies.  A new standalone application with a user-friendly interface is proposed, for robust and reliable analysis of singing voice characteristics. The tool performs tracking of fundamental frequency and formants, along with an objective measure of main singing voice parameters, such as vibrato rate (V_rate), vibrato extent (V_ext), and vocal intonation (V_int). A sideview camera allows displaying and recording the singer’s posture.  Data are collected at the School of Music in Fiesole, Firenze, Italy, under the supervision of a voice teacher and a teacher of Alexander Technique (AT). First results are presented to compare some vocalizations coming both from professional and non-professional singers under different singer’s postures.\n",
    "Index Terms. objective voice parameters estimation, singing voice, Alexander Technique\n",
    ""
   ]
  },
  "dejonckere07b_maveba": {
   "authors": [
    [
     "Philippe H.",
     "Dejonckere"
    ]
   ],
   "title": "mozart's voice - a cultural appetizer",
   "original": "mv07_237",
   "page_count": 1,
   "order": 55,
   "p1": "237",
   "pn": "",
   "abstract": [
    "Mozart is mainly known to us as a genius of musical composition, and as a virtuoso keyboard player as well as violinist/violist. He composed major works for voice, but what do we know about his own (singing) voice ? When searching carefully in contemporary documents, as letters, posters, diaries, written testimonies, we can learn a lot about what and how Mozart himself sang: from his first public performance as a 5-year-old choir-boy in Sigismundus Rex Hungariae to the rehearsal of the unfinished Requiem at his home a few hours before his death, where he sang himself the alto part, forced to stop after the first bars of the “Lacrymosa”.   This vocal pilgrimage, with 180 slides and several musical illustrations, provides a fascinating look on Mozart's life and time from a double viewpoint: the musicological one and that one of the voice scientist.\n",
    ""
   ]
  }
 },
 "sessions": [
  {
   "title": "Theoretical Models I, II",
   "papers": [
    "fraj07_maveba",
    "vasilakis07_maveba",
    "wokurek07_maveba",
    "dubuisson07_maveba",
    "ciota07_maveba",
    "gommel07_maveba",
    "marchetto07_maveba"
   ]
  },
  {
   "title": "Pathology Detection/Classification I, II",
   "papers": [
    "murphy07_maveba",
    "dejonckere07_maveba",
    "godinollorente07_maveba",
    "amato07_maveba",
    "goddard07_maveba",
    "amir07_maveba",
    "gomezvilda07_maveba",
    "moore07_maveba",
    "aghazadeh07_maveba",
    "bacauskiene07_maveba"
   ]
  },
  {
   "title": "Mechanical Models I, II",
   "papers": [
    "vampola07_maveba",
    "popolo07_maveba",
    "drioli07_maveba",
    "puncocharova07_maveba",
    "lukkari07_maveba",
    "jesus07_maveba",
    "svec07_maveba",
    "groleau07_maveba",
    "sidlof07_maveba"
   ]
  },
  {
   "title": "Poster Session",
   "papers": [
    "pedersen07_maveba",
    "fernandezbaillo07_maveba",
    "krutisova07_maveba",
    "chytil07_maveba",
    "ferrari07_maveba",
    "buchaillard07_maveba",
    "kleckova07_maveba",
    "khadiviheris07_maveba",
    "sommavilla07_maveba",
    "ferrer07_maveba",
    "putzer07_maveba",
    "sitchi07_maveba",
    "horacek07_maveba",
    "kob07_maveba",
    "manfredi07_maveba"
   ]
  },
  {
   "title": "Continuous Speech/Prosody",
   "papers": [
    "airas07_maveba",
    "hernandezdiazhuici07_maveba",
    "devillers07_maveba",
    "alpan07_maveba"
   ]
  },
  {
   "title": "Neurological Dysfunctions",
   "papers": [
    "landau07_maveba",
    "kaymazkeskinpala07_maveba"
   ]
  },
  {
   "title": "A-Laryngeal Speech",
   "papers": [
    "moerman07_maveba",
    "hagmuller07_maveba"
   ]
  },
  {
   "title": "Newborn Infant Cry",
   "papers": [
    "martinez07_maveba",
    "bocchi07_maveba",
    "canoortiz07_maveba"
   ]
  },
  {
   "title": "Non-Human Sounds",
   "papers": [
    "gamba07_maveba"
   ]
  },
  {
   "title": "Singing Voice",
   "papers": [
    "sangiorgi07_maveba",
    "dejonckere07b_maveba"
   ]
  }
 ]
}