{
 "title": "Models and Analysis of Vocal Emissions for Biomedical Applications (MAVEBA 2005)",
 "location": "Florence, Italy",
 "startDate": "29/10/2005",
 "endDate": "31/10/2005",
 "conf": "MAVEBA",
 "year": "2005",
 "name": "maveba_2005",
 "series": "MAVEBA",
 "SIG": "",
 "title1": "Models and Analysis of Vocal Emissions for Biomedical Applications",
 "title2": "(MAVEBA 2005)",
 "date": "29-31 October 2005",
 "booklet": "maveba_2005.pdf",
 "papers": {
  "berry05_maveba": {
   "authors": [
    [
     "Carl",
     "Berry"
    ],
    [
     "Tim",
     "Ritchings"
    ]
   ],
   "title": "A comparative study of intelligent voice quality assessment using impedance and acoustic signals",
   "original": "mv05_003",
   "page_count": 4,
   "order": 1,
   "p1": "3",
   "pn": "6",
   "abstract": [
    "Objective assessment techniques for classifying voice quality for patients recovering from treatment for cancer of the larynx should lead to more effective recovery than the present approach, which is very subjective and depends heavily on the experience of the individual Speech and Language Therapist (SALT). This work follows an earlier study where an Artificial Neural Network (ANN) was trained on parameters derived from electrolaryngograph electrical impedance (EGG) signals recorded while a patient was phonating /i/ as steadily as possible, and gave an indication of voice quality inline with the standard UK Speech and Language Therapist (SALT) seven point scale. The applicability of this approach to voice quality assessment of acoustic signals is described, and the results are found to compare very well with those derived from the impedance signals. It was also noted that for both the impedance and the acoustic signals, the ANNs were able to classify the very good (recovered) and the very poor (abnormal) voices well, but performed quite badly with the mid-range classifications, raising questions about the accuracy of these classifications.\n",
    "Index Terms. Voice quality, classification, Artificial Neural Network, acoustic, impedance.\n",
    ""
   ]
  },
  "moore05_maveba": {
   "authors": [
    [
     "C. J.",
     "Moore"
    ],
    [
     "Kathiresan",
     "Manickam"
    ],
    [
     "N.",
     "Slevin"
    ]
   ],
   "title": "Voicing recovery in males following radiotherapy for larynx cancer",
   "original": "mv05_007",
   "page_count": 4,
   "order": 2,
   "p1": "7",
   "pn": "10",
   "abstract": [
    "Larynx cancer patients receive radiotherapy as a non-invasive alternative to surgery and cure rates are high. Inevitably this impacts vocal fold functionality. Hence, voice recovery as a pre-requisite for resuming normal life is of special interest. Voicing recovery following radiotherapy is studied in this paper.   Complexity analysis, using approximate entropy to concisely quantify the collective spectral pattern derived from the electro-glottogram, has revealed a double banded male normal voicing reference standard. Forty-eight male larynx cancer patients have been studied by applying this technique in parallel with an unrestricted perceptual analysis before and one year after radiotherapy.   Two thirds of radiotherapy patients had improved voice quality one year after treatment. Approximate entropy increased to reach normal population reference levels. These patients were predominantly in the less aberrant perceptual categories. However, a quarter of patients showed reduced approximate entropy and were predominantly in the most aberrant perceptual categories.   Complexity analysis has the potential to be a reliable, single parameter measure of voicing quality for use in monitoring radiotherapy patient recovery.\n",
    ""
   ]
  },
  "saenzlechon05_maveba": {
   "authors": [
    [
     "Nicolás",
     "Sáenz-Lechón"
    ],
    [
     "Juan Ignacio",
     "Godino-Llorente"
    ],
    [
     "Víctor",
     "Osma-Ruiz"
    ],
    [
     "Pedro",
     "Gómez-Vilda"
    ],
    [
     "Santiago",
     "Aguilera-Navarro"
    ]
   ],
   "title": "A methodology to evaluate pathological voice detection systems",
   "original": "mv05_011",
   "page_count": 4,
   "order": 3,
   "p1": "11",
   "pn": "14",
   "abstract": [
    "This paper describes some methodological issues to be considered when designing systems for automatic detection of voice pathology, in order to allow comparisons with previous or future experiments.   The proposed methodology is built around Kay Elemetrics voice disorders database, which is the only one commercially available. Discussion about key points on this database is included.   Any experiment should have a cross-validation strategy, and results should supply, along with the final confusion matrix, confidence intervals for all measures. Detector performance curves such as DET plots are also considered.   An example of the methodology is provided, with an experiment based on short-term parameters and Multi-layer Perceptrons.\n",
    "Index Terms. Voice pathology detection, pathological voice databases, cross-validation, Multi-Layer Perceptrons.\n",
    ""
   ]
  },
  "saenzlechon05b_maveba": {
   "authors": [
    [
     "Nicolás",
     "Sáenz-Lechón"
    ],
    [
     "Juan Ignacio",
     "Godino-Llorente"
    ],
    [
     "Víctor",
     "Osma-Ruiz"
    ],
    [
     "Pedro",
     "Gómez-Vilda"
    ],
    [
     "Santiago",
     "Aguilera-Navarro"
    ]
   ],
   "title": "Effects of MP3 encoding on voice pathology detection: results with MFCC parameters",
   "original": "mv05_015",
   "page_count": 4,
   "order": 4,
   "p1": "15",
   "pn": "18",
   "abstract": [
    "This paper presents a performance comparison for a voice pathology detection system dealing with different types of audio data. Several files of sustained phonation of vowel /a/, from Kay Elemetrics database, were encoded with MP3 algorithm with various bit rates (160, 48 and 24 kbps). A multilayer perceptron classifier is then used to automatically detect the normal from the pathologia files. Results are compared with those obtained for the original database, using confusion matrices and DET plots. There are no significant differences between the designed detectors.\n",
    "Index Terms. Voice pathology detection, Multi-Layer Perceptrons, MPEG Audio layer 3 (MP3)\n",
    ""
   ]
  },
  "schoentgen05_maveba": {
   "authors": [
    [
     "Jean",
     "Schoentgen"
    ]
   ],
   "title": "Towards a classification of phonatory features of disordered voices",
   "original": "mv05_019",
   "page_count": 4,
   "order": 5,
   "p1": "19",
   "pn": "22",
   "abstract": [
    "The purpose of the presentation is to give an overview of phonatory features of disordered voices and propose a classificatory framework. Generally speaking, phonatory features are numerical cues that summarize properties of speech signals or other voicerelated signals that are obtained noninvasively, and which are clinically relevant. The object of a classificatory framework is to ease the planning of future experiments and the exploitation of the existing literature, which is diverse with regard to pathologies studied, speaker tasks, speaker performance, speech material, vocal symptoms, sensors and sought for relations with other levels of description.\n",
    ""
   ]
  },
  "sheta05_maveba": {
   "authors": [
    [
     "Walaa",
     "Sheta"
    ],
    [
     "Tim",
     "Ritchings"
    ],
    [
     "Carl",
     "Berry"
    ]
   ],
   "title": "Intelligent voice quality assessment posttreatment using genetic programming",
   "original": "mv05_023",
   "page_count": 4,
   "order": 6,
   "p1": "23",
   "pn": "26",
   "abstract": [
    "Objective techniques for assessing and classifying voice quality for patients recovering from treatment for cancer of the larynx have largely focussed on they use of Artificial Neural Networks (ANN). The results of a preliminary study are reported, where a Genetic Programming (GP) has been trained to classify recovered (normal) and abnormal voices in acoustic data, and produced much more accurate results than an ANN. In addition, the GP is able to provide impact factors for the various voice parameters, and suggests that only 6 of the 22 short-term and longterm parameters used in the current ANN studies are contributing significantly to the classifications.\n",
    "Index Terms. Voice quality, classification, Artificial Neural Network, Genetic Algorithms, acoustic signals.\n",
    ""
   ]
  },
  "kuwabara05_maveba": {
   "authors": [
    [
     "Hisao",
     "Kuwabara"
    ]
   ],
   "title": "A method for changing speech quality and its application to pathological voices",
   "original": "mv05_029",
   "page_count": 4,
   "order": 7,
   "p1": "29",
   "pn": "32",
   "abstract": [
    "Speech quality is an interesting and very important aspect not only from linguistic and/or phonetic viewpoint but also from the viewpoint of speech technology. This study has been conducted from the latter point of view. A method has been developed based on the analysis-synthesis technique which enables to control voice quality by independently manipulating the voice source and the vocal tract resonant characteristics. Through this method, it is possible to investigate the amount of contribution of individual acoustic parameters to a certain voice quality including voice individuality. Formant frequencies and their bandwidths are used as the acoustic parameters to characterize the vocal tract configuration and the pitch frequency as the voice source. These acoustic parameters extracted from a natural speech are modified or changed to some extent and then a is synthesized making use of the modified acoustic parameters. Speech intelligibility and voice individuality are found to be controlled by this method. An application to a pathological voice has also been made to control the voice quality. It has been found that the method is capable of improving the so-called “roughness” or “hoarseness” of the pathological voice to a certain extent.\n",
    ""
   ]
  },
  "pietruch05_maveba": {
   "authors": [
    [
     "R.",
     "Pietruch"
    ],
    [
     "M.",
     "Michalska"
    ],
    [
     "W.",
     "Konopka"
    ],
    [
     "A.",
     "Grzanka"
    ]
   ],
   "title": "Methods for formant extraction in speech of patients after total laryngectomy",
   "original": "mv05_033",
   "page_count": 4,
   "order": 8,
   "p1": "33",
   "pn": "36",
   "abstract": [
    "The paper shows the methods for imaging power spectral density of speech and extracting formant frequencies from continuous voice. The methods will be used to improve the patients’ rehabilitation after the total laryngectomy surgery. The adaptive algorithms and transversal filters were implemented to estimate the transfer function of human vocal tract model. The estimation methods were based on statistical, Auto-Regressive model of speech production. The pilot study on formant frequencies, especially F1 and F2 formants, and their linear separation for each vowel has been presented. The method for recognition pathological voice has been proposed.\n",
    "Index Terms. Speech signal spectrum analysis, adaptive filters, formant tracking and total laryngectomy\n",
    ""
   ]
  },
  "manfredi05_maveba": {
   "authors": [
    [
     "Claudia",
     "Manfredi"
    ],
    [
     "Cloe",
     "Marino"
    ],
    [
     "Fabrizio",
     "Dori"
    ],
    [
     "Ernesto",
     "Iadanza"
    ]
   ],
   "title": "Optimised GSVD for dysphonic voice quality enhancement",
   "original": "mv05_037",
   "page_count": 4,
   "order": 9,
   "p1": "37",
   "pn": "40",
   "abstract": [
    "This paper concerns the problem of enhancing voice quality for people suffering from dysphonia, caused by airflow turbulence in the vocal tract, for irregular vocal folds vibration. A generalized subspace approach is proposed for enhancement of speech corrupted by additive noise, regardless of whether it is white or not. The clean signal is estimated by nulling the signal components in the noise subspace and retaining the components in the signal subspace. Two approaches are compared, taking into account both signal and noise, or signal only, eigenvalues. An optimised adaptive comb filter is applied first, to reduce noise between harmonics. Objective voice quality measures demonstrate improvements in voice quality when tested with sustained vowels or words corrupted with “hoarseness noise”. The intention is to provide users (disabled people, as well as clinicians) with a device allowing intelligible and effortless speech for dysphonics, and useful information concerning possible functional recovering. This will be of use to people in social situations where they interact with non-familiar communication partners, such as at work, and in everyday life.\n",
    "Index Terms. hoarseness, voice denoising, GSVD, comb filtering, voice quality, pitch, noise, formants.\n",
    ""
   ]
  },
  "vampola05_maveba": {
   "authors": [
    [
     "T.",
     "Vampola"
    ],
    [
     "Jaromír",
     "Horáček"
    ],
    [
     "J.",
     "Veselý"
    ],
    [
     "J.",
     "Vokřál"
    ]
   ],
   "title": "Modelling of influence of velopharyngeal insufficiency on phonation of vowel /a/",
   "original": "mv05_043",
   "page_count": 4,
   "order": 10,
   "p1": "43",
   "pn": "46",
   "abstract": [
    "The effects of velopharyngeal insufficiency (VFI) or clefting on acoustic frequency–modal characteristics of human supraglottal spaces are investigated. Finite element (FE) modelling is supported by experimental investigation using a physical model of the vocal and nasal tract fabricated by the rapid prototyping technique from the FE model. The FE model was developed from magnetic resonance images (MRI) of the subject during phonation. Finally the influence of the VFI on phonation of the vowel /a/ is numerically simulated in time domain and supported by clinical investigation.\n",
    "Index Terms. biomechanics of voice, acoustics, cleft\n",
    ""
   ]
  },
  "zaccarelli05_maveba": {
   "authors": [
    [
     "Riccardo",
     "Zaccarelli"
    ],
    [
     "Coen",
     "Elemans"
    ],
    [
     "W. Tecumseh",
     "Fitch"
    ],
    [
     "Hanspeter",
     "Herzel"
    ]
   ],
   "title": "Two-mass models of the bird syrinx",
   "original": "mv05_047",
   "page_count": 4,
   "order": 11,
   "p1": "47",
   "pn": "50",
   "abstract": [
    "Self-sustained vibrations within the syrinx of birds are simulated using symmetric two-mass models. The first system that will be presented here is a rescalcd version of the well-known model of human vocal fold vibrations. Moreover, a novel model of the syrinx of a ring dove is introduced. We show that the intensity of harmonics depends strongly on the geometry of the vibrating tissue and the driving pressure. This leads to a discussion how birds can control the strength of overtones.\n",
    ""
   ]
  },
  "ruty05_maveba": {
   "authors": [
    [
     "N.",
     "Ruty"
    ],
    [
     "J.",
     "Cisonni"
    ],
    [
     "X.",
     "Pelorson"
    ],
    [
     "Pascal",
     "Perrier"
    ],
    [
     "P.",
     "Badin"
    ],
    [
     "A. Van",
     "Hirtum"
    ]
   ],
   "title": "A physical model for articulatory speech synthesis. theoretical and numerical principles",
   "original": "mv05_051",
   "page_count": 4,
   "order": 12,
   "p1": "51",
   "pn": "54",
   "abstract": [
    "The objective of this study is to develop a simple physical model able to produce articulatory synthesis of continuous vowel transitions. The proposed model considers simplified physical approximations for the glottal source, acoustical propagation in the vocal tract and lip radiation. The articulatory quality of the synthesized results is interpreted in terms of the simplifications applied in each model element.\n",
    ""
   ]
  },
  "avanzini05_maveba": {
   "authors": [
    [
     "Federico",
     "Avanzini"
    ],
    [
     "Simone",
     "Maratea"
    ],
    [
     "Carlo",
     "Drioli"
    ]
   ],
   "title": "Physiological control of low-dimensional glottal models with applications to voice source parameter matching",
   "original": "mv05_055",
   "page_count": 4,
   "order": 13,
   "p1": "55",
   "pn": "58",
   "abstract": [
    "A set of rules is proposed for controlling a 2-mass glottal model through activation levels of laryngeal muscles. The rules convert muscle activities into physical quantities such as fold adduction, mass, thickness, depth, stiffness. A codebook is constructed between muscular activations and a set of relevant voice source parameters, and its applications to voice source parameter matching are explored.\n",
    ""
   ]
  },
  "gomezvilda05_maveba": {
   "authors": [
    [
     "Pedro",
     "Gómez-Vilda"
    ],
    [
     "C.",
     "Lázaro"
    ],
    [
     "Roberto",
     "Fernández-Baíllo"
    ],
    [
     "A.",
     "Nieto"
    ],
    [
     "Juan Ignacio",
     "Godino-Llorente"
    ],
    [
     "R.",
     "Martínez"
    ],
    [
     "F.",
     "Díaz"
    ],
    [
     "A.",
     "Álvarez"
    ],
    [
     "K.",
     "Murphy"
    ],
    [
     "V.",
     "Nieto"
    ],
    [
     "V.",
     "Rodellar-Biarge"
    ],
    [
     "F. J.",
     "Fernández-Camacho"
    ]
   ],
   "title": "Using biomechanical parameter estimates in voice pathology detection",
   "original": "mv05_059",
   "page_count": 4,
   "order": 14,
   "p1": "59",
   "pn": "62",
   "abstract": [
    "It has been shown in previous work that biomechanical parameters related to the cord body dynamics can be indirectly estimated from the power spectral density of the mucosal wave correlate. In the present study the use of these measurements to estimate the presence of parameter unbalance will be shown. The role of these parameters together with the classical distortion ones in relation to pathology detection and classification will be explored. Results using normophonic as well as pathologic voice will be presented and discussed.\n",
    ""
   ]
  },
  "orr05_maveba": {
   "authors": [
    [
     "R.",
     "Orr"
    ],
    [
     "B.",
     "Cranen"
    ]
   ],
   "title": "The effect of the flow mask on phonation",
   "original": "mv05_063",
   "page_count": 4,
   "order": 15,
   "p1": "63",
   "pn": "66",
   "abstract": [
    "This study is an investigation of the effect of the presence of the flow mask on voicing behaviour. Microphone and flow recordings were inverse filtered and compared to examine the possible effects of the flow mask. Closing quotient (ClQ), open quotient (OQ) and the amplitude difference between the first and second harmonics (H1-H2) were the parameters used to characterise the inverse filtered signals. The presence of the flow mask used for the recording of oral flow had an effect on these parameters, which is interpreted as being indicative of a more tense or more efficient voicing behaviour in the presence of the mask.\n",
    ""
   ]
  },
  "jeannin05_maveba": {
   "authors": [
    [
     "Christophe",
     "Jeannin"
    ],
    [
     "Pascal",
     "Perrier"
    ],
    [
     "Yohan",
     "Payan"
    ],
    [
     "André",
     "Dittmar"
    ],
    [
     "Brigitte",
     "Grosgogeat"
    ]
   ],
   "title": "A non-invasive device to measure mechanical interaction between tongue, palate and teeth during speech production",
   "original": "mv05_067",
   "page_count": 4,
   "order": 16,
   "p1": "67",
   "pn": "70",
   "abstract": [
    "This paper describes an original experimental procedure to measure the mechanical interaction between the tongue and teeth and palate during speech production. It consists in using edentulous people as subjects and to insert pressure sensors in the structure of their complete dental prosthesis. Hence, there is no perturbation of the vocal tract cavity due to the sensors themselves. Several duplicates are used with transducers situated at different locations of the complete denture according to palatography’s results, in order to carefully analyze the production of specific sounds such as stop consonants.. It is also possible to measure the contact pressure at different locations on the palate for the same sound.\n",
    "Index Terms. speech production, tongue/palate interaction, complete denture, pressure transducer\n",
    ""
   ]
  },
  "alku05_maveba": {
   "authors": [
    [
     "Paavo",
     "Alku"
    ],
    [
     "Jaromír",
     "Horáček"
    ],
    [
     "M.",
     "Airas"
    ],
    [
     "A.-M.",
     "Laukkanen"
    ]
   ],
   "title": "Assessment of glottal inverse filtering by using aeroelastic modelling of phonation and FE modelling of vocal tract",
   "original": "mv05_073",
   "page_count": 4,
   "order": 17,
   "p1": "73",
   "pn": "76",
   "abstract": [
    "Performance of glottal inverse filtering (IF) is evaluated in this paper by using speech material produced with computational modelling of voice production represented by an aeroelastic model of vocal folds and a Finite Element (FE) model of the vocal tract. An inverse filtering algorithm was used in order to estimate the glottal flow from the speech pressure signal generated by the model. Comparison between the estimated glottal flow and the original flow generated by computational modelling shows that the IF method is able to yield an accurate estimate for the glottal flow.\n",
    ""
   ]
  },
  "guarino05_maveba": {
   "authors": [
    [
     "Marcella",
     "Guarino"
    ],
    [
     "A.",
     "Costa"
    ],
    [
     "S.",
     "Patelli"
    ],
    [
     "Mitchell",
     "Silva"
    ],
    [
     "Daniel",
     "Berckmans"
    ]
   ],
   "title": "Cough analysis and classification by labelling sound in swine respiratory disease",
   "original": "mv05_077",
   "page_count": 4,
   "order": 18,
   "p1": "77",
   "pn": "80",
   "abstract": [
    "Coughing is one of the most frequent presenting symptoms of many diseases affecting the airways and the lungs of both humans and animals. In piggeries, the continuous on-line monitoring of cough sound can be used to build an intelligent alarm system for the early detection of diseases. In a first study, with experiments under laboratory conditions, algorithms have been developed to detect cough sounds and to classify the animals whether they were ill or not. In this study, the algorithm was tested in field conditions.  The main objective of this study was to evaluate the accuracy of cough recognition algorithm on labeled coughs from all other sounds, recorded simultaneously with background noises using two microphones, one for noise and one for cough recording.\n",
    ""
   ]
  },
  "hanquinet05_maveba": {
   "authors": [
    [
     "Julien",
     "Hanquinet"
    ],
    [
     "Francis",
     "Grenez"
    ],
    [
     "Jean",
     "Schoentgen"
    ]
   ],
   "title": "Wave-morphing in the framework of a glottal pulse model",
   "original": "mv05_081",
   "page_count": 3,
   "order": 19,
   "p1": "81",
   "pn": "83",
   "abstract": [
    "The presentation concerns a method of wavemorphing applied to a model of the phonatory excitation, the instantaneous frequency and the harmonic richness of which are controlled. This method is based on an interpolation between the Fourier coefficients of two template waveforms. The method enables morphing continuously from one waveshape to another. Possible applications are the simulation of diplophonia, biphonation and different phonation types.\n",
    ""
   ]
  },
  "kitamura05_maveba": {
   "authors": [
    [
     "T.",
     "Kitamura"
    ],
    [
     "P.",
     "Mokhtari"
    ],
    [
     "H.",
     "Takemoto"
    ]
   ],
   "title": "Changes of vocal tract shape and area function by F0 shift",
   "original": "mv05_085",
   "page_count": 4,
   "order": 20,
   "p1": "85",
   "pn": "88",
   "abstract": [
    "Articulatory variation due to the production of vowels at five pitch frequency (F0) levels (110 Hz, 123 Hz, 130 Hz, 146 Hz, and 164 Hz) was analyzed by volumetric magnetic resonance imaging (MRI). Three Japanese male subjects produced sustained Japanese vowels /a/ and /i/. Observation of vocal tract area functions extracted from the MRI data revealed that F0 shift in vowel production affects not only the length of the vocal tract but also its shape. Analysis employing coefficient of variation for lengthnormalized area functions revealed that the shape of the vocal tract does not change proportionately by F0 shift and that each subject adopt different strategies for controlling F0 while maintaining the phonetic identity of the vowel.\n",
    ""
   ]
  },
  "kob05_maveba": {
   "authors": [
    [
     "Malte",
     "Kob"
    ],
    [
     "J.",
     "Stoffers"
    ],
    [
     "Christiane",
     "Neuschaefer-Rube"
    ]
   ],
   "title": "Comparison of LPC analysis and impedance vocal tract measurements",
   "original": "mv05_089",
   "page_count": 3,
   "order": 21,
   "p1": "89",
   "pn": "90",
   "abstract": [
    "The acoustic measurement of the resonances in the space between vocal folds and lips, the vocal tract, allows a non-invasive, objective analysis of the spectral energy distribution for different articulatory cases. Whereas a conventional LPC analysis is successful only when applied to more or less stationary voice signals, an external excitation with subsequent measurement of the vocal tract impedance at the mouth can give reliable results when the voice signal is not stable or even missing.   This contribution adresses the problem how to compare results from impedance measurements with LPC measurements. For a set of normal speakers, both measurements have been performed simultaneously. Based upon the evaluation of the LPC curves, similar values for resonance frequency, amplitude and bandwidth were derived. In a study of 81 normal speakers the results from the evaluations are compared.\n",
    ""
   ]
  },
  "misun05_maveba": {
   "authors": [
    [
     "V.",
     "Misun"
    ]
   ],
   "title": "Source voice characteristics of the artificial vocal folds",
   "original": "mv05_093",
   "page_count": 4,
   "order": 22,
   "p1": "93",
   "pn": "96",
   "abstract": [
    "Specialised literature presents a number of models describing the function of the vocal folds. In most of those models an emphasis is placed on the effect of Bernoulli’s air underpressure during the air passage through the glottis. The author defines a principle of the vocal folds function with a working version name „principle of the compressed air bubble“. The paper deals with the experimental analysis of these artificial vocal folds and, first of all, with the properties and characteristics of the source voices generated by them. The main forces acting on the vocal folds during phonation are as follows: subglottal air pressure, elastic and inertia forces of the vocal folds structure.\n",
    ""
   ]
  },
  "orzechowski05_maveba": {
   "authors": [
    [
     "T.",
     "Orzechowski"
    ],
    [
     "A.",
     "Izworski"
    ],
    [
     "I.",
     "Gatkowska"
    ],
    [
     "M.",
     "Rudzińska"
    ]
   ],
   "title": "Automatic classification of voice disorders in course of neurodegenerative disease",
   "original": "mv05_097",
   "page_count": 4,
   "order": 23,
   "p1": "97",
   "pn": "100",
   "abstract": [
    "The study presented in this publication is the first from the planned complex, interdisciplinary studies. The examination was carried out on patients of CM-UJ clinic in Krakow who suffered from neurodegenerative disease with the damage of the extrapiramidal system with dysarthria-type changes in speech. Control examinations of healthy persons have also been carried out. The elements whose realization was tested had been chosen based on the linguistic knowledge in the scope of phonetics as well as on experience resulting from longterm practice as a speech pathologist. The linguistic material was selected in such a way as to pinpoint voice changes characteristic for patients with dysarthria. During the examination, phrases based on Polish idioms were also recorded for further analyses.\n",
    ""
   ]
  },
  "sovilj05_maveba": {
   "authors": [
    [
     "Mirjana",
     "Sovilj"
    ],
    [
     "Tatjana",
     "Adamovic"
    ],
    [
     "Misko",
     "Subotic"
    ],
    [
     "Nikoleta",
     "Stevovic"
    ]
   ],
   "title": "Newborn's cry from risk and normal pregnancies",
   "original": "mv05_101",
   "page_count": 4,
   "order": 24,
   "p1": "101",
   "pn": "104",
   "abstract": [
    "Previous researches of the prelingual period indicated that primal cry and the first cry represent the inception of verbal communication. The aim of this work was to study qualitative characteristics of crying of newborns from risk pregnancies and newborns from regular pregnancies in the function of prediction of verbal communication development.   The research was carried out on the sample of N=10 babies divided into two groups, aged 15 days. E group (N=5) comprised newborns from risk pregnancies, and C group (N=5) comprised newborns from normal pregnancies. Crying in the examined sample was digitally recorded and spectrographically analyzed.   The research results point to the possibility that certain acoustic characteristics of crying can be used in the prediction of verbal communication development and that the researches in this area should be intensified and continued.\n",
    "Index Terms. newborn's cry, verbal communication, prelingual period, spectrographic analysis\n",
    ""
   ]
  },
  "manickam05_maveba": {
   "authors": [
    [
     "Kathiresan",
     "Manickam"
    ],
    [
     "Haizhou",
     "Li"
    ]
   ],
   "title": "Complexity analysis of normal and deaf infant cry acoustic waves",
   "original": "mv05_105",
   "page_count": 4,
   "order": 25,
   "p1": "105",
   "pn": "108",
   "abstract": [
    "This work describes the complexity found in the normal and the deaf crying acoustic waves. Using approximate entropy, in a single figure, the complexity of the auto-covariance of the signal is computed. Thus, using this complexity value, we are able to discriminate the normal and the deaf infants crying domains with (P<<0.01).\n",
    "Index Terms. Infant Cry, Complexity, deaf infant\n",
    ""
   ]
  },
  "fourcin05_maveba": {
   "authors": [
    [
     "Adrian",
     "Fourcin"
    ]
   ],
   "title": "Clinical voice measurement using EGG/lx signals",
   "original": "mv05_111",
   "page_count": 4,
   "order": 26,
   "p1": "111",
   "pn": "114",
   "abstract": [
    "Nearly fifty years ago, Philippe Fabre initiated a method for the non-invasive electrical measurement of vocal fold vibration that is now known generically as “electro-glottography” — EGG. The name has arisen from the initial misinterpretation of the waveform, but the technique itself has now come into widespread daily use in the voice clinic, although for vocal fold contact rather than glottal opening measurements. The present extremely brief discussion is concerned with three particular aspects of the ways in which the approach can be usefully linked to basic aspects of voice perception and production — the psychophonetic use of the data in the measurement of sustained vowels and connected speech production; the use of these criteria in “pitch” based quantitative assessments; and the application of the technique in vocal fold closed phase duration appraisal. Particular attention is given to pathological voice analysis.\n",
    ""
   ]
  },
  "shrivastav05_maveba": {
   "authors": [
    [
     "Rahul",
     "Shrivastav"
    ]
   ],
   "title": "From vocal quality measurement to perception",
   "original": "mv05_115",
   "page_count": 4,
   "order": 27,
   "p1": "115",
   "pn": "118",
   "abstract": [
    "Quantification of vocal quality of a speech signal is essential in a number of applications. However, existing measures for this purpose are often characterized by poor sensitivity and specificity to perceptual judgments. These shortcomings may have arisen because (1) these measures are often validated against “noisy” perceptual data and (2) the non-linear and multidimensional relationships between the physical signal and perceptual judgments have often been ignored. This paper describes the psychometric principles underlying quantification of subjective judgments and the use of an auditory processing model as a signal processing front-end when measuring “breathy” voice quality. Preliminary data for quantification of “roughness” is also discussed.\n",
    ""
   ]
  },
  "svec05_maveba": {
   "authors": [
    [
     "J. G.",
     "Švec"
    ],
    [
     "F.",
     "Šram"
    ],
    [
     "M.",
     "Fric"
    ],
    [
     "Q.",
     "Qiu"
    ],
    [
     "H. K.",
     "Schutte"
    ]
   ],
   "title": "What can be seen in videokymographic images?",
   "original": "mv05_119",
   "page_count": 1,
   "order": 28,
   "p1": "119",
   "pn": "",
   "abstract": [
    "Kymographic imaging refers to a special way of displaying vibrations by putting together a great number of successive images of a vibrating object viewed through a thin slit. In medicine, the method has been found particularly well suited for imaging vibrations of the vocal folds, which are the ultimate source of human voice. Here we address the question on which vibratory characteristics of the vocal folds can be identified in high-speed videokymographic images and used in clinical practice when diagnosing origins of voice problems? The ultimate long-term goal of the research is to relate the displayed vibration characteristics to the tissue properties of the vocal folds and design strategies how undesirable tissue properties can be altered through conservative or surgical treatment.\n",
    ""
   ]
  },
  "bianchi05_maveba": {
   "authors": [
    [
     "S.",
     "Bianchi"
    ],
    [
     "L.",
     "Bocchi"
    ],
    [
     "Claudia",
     "Manfredi"
    ],
    [
     "G.",
     "Cantarella"
    ],
    [
     "N.",
     "Migali"
    ]
   ],
   "title": "Objective vocal fold vibration assessment from videokymographic images",
   "original": "mv05_121",
   "page_count": 4,
   "order": 29,
   "p1": "121",
   "pn": "124",
   "abstract": [
    "Vocal folds oscillation crucially influences all the basic qualities of voice, such as pitch and loudness, as well as the spectrum. Stroboscopy provides the standard view of the larynx. Videokymography is a new diagnostic tool developed to overcome specific limitations of stroboscopy in severely dysphonic patients with an aperiodic signal. It registers the movements of the vocal folds with a high time resolution on a line perpendicular to the glottis.   The main focus of this paper is on measuring and tracking quantitative parameters for objective vocal fold function assessment from videokymographic (VKG) examinations of subjects with normal and pathological laryngeal function. Active contour search is realised, by properly adjusted snake algorithm. Examples are reported, showing the robustness and reliability of the proposed technique.\n",
    ""
   ]
  },
  "mantha05_maveba": {
   "authors": [
    [
     "S.",
     "Mantha"
    ],
    [
     "L.",
     "Mongeau"
    ],
    [
     "T.",
     "Siegmund"
    ]
   ],
   "title": "Dynamic digital image correlation of a dynamic physical model of the vocal folds",
   "original": "mv05_125",
   "page_count": 4,
   "order": 30,
   "p1": "125",
   "pn": "128",
   "abstract": [
    "An experimental study of the vibratory deformation of the human vocal folds was conducted. Experiments were performed using model vocal folds made of soft silicone rubber, and an air supply system. The model self-oscillated at fundamental frequencies and flow rates typical of the human folds. Time-averaged mass flow rates and transglottal pressures were measured along with the sound pressure upstream of the orifice. The deformation of the vocal fold was measured using a high-speed threedimensional digital correlation system. The imaging set-up is composed of a high-speed digital camera and a prism beam splitter allowing two images to be obtained from different viewpoints in every image frame. Commercially available digital image correlation software was used to analyze the images, and to calculate the strain fields at the vocal fold superior surface. Results were obtained for vocal folds made of isotropic material and two different vocal fold lengths. The deformed shape of the model vocal folds, strains on the superior surface, and the time-varying vocal fold wall displacement were obtained.\n",
    "Index Terms. Digital image correlation (DIC), high-speed video, strain fields, collision\n",
    ""
   ]
  },
  "cieciwa05_maveba": {
   "authors": [
    [
     "Szymon",
     "Cieciwa"
    ],
    [
     "Dimitar D.",
     "Deliyski"
    ],
    [
     "Tomasz P.",
     "Zielinski"
    ]
   ],
   "title": "Fast FFT-based motion compensation for laryngeal high-speed videoendoscopy",
   "original": "mv05_129",
   "page_count": 4,
   "order": 31,
   "p1": "129",
   "pn": "132",
   "abstract": [
    "Six methods for endoscopic motion compensation for laryngeal high-speed videoendoscopy (HSV) are compared. Two of them are based on tracking the maximum of the cross-correlation function of two images; two are based on minimization of the L2–norm and L2-like distance between two images; and the other two make use of the peak present in the cross-power FFT-based spectrum of two images. All six methods are applied to compensate the motion, at the sub-pixel level, of the endoscopic lens relative to the vocal folds in HSV recordings. The new motion compensation methods based on FFT cross-power spectrum demonstrated remarkable computational speed and acceptable accuracy. While accuracy was best for the L2-minimization techniques, they were slower and had a limited motiontracking range.\n",
    ""
   ]
  },
  "shaw05_maveba": {
   "authors": [
    [
     "Heather S.",
     "Shaw"
    ],
    [
     "Dimitar D.",
     "Deliyski"
    ]
   ],
   "title": "Vertical motion during modal and pressed phonation: magnitude and symmetry",
   "original": "mv05_133",
   "page_count": 4,
   "order": 32,
   "p1": "133",
   "pn": "136",
   "abstract": [
    "Vertical motion of the vocal folds during phonation is a possible diagnostically significant feature. However, it is difficult to judge vertical motion through the typical two-dimensional stroboscopic display. Through high-speed videoendoscopy (HSV), the dynamics of vocal fold vibration are easier to appreciate; however, the traditional HSV is also two-dimensional. Recently, a method to display a three-dimensional (3D) image of vocal fold vibration was published. This method, as well as stroboscopy and HSV, was utilized to study vertical motion magnitude and symmetry during modal and pressed phonations in normophonic speakers. Vertical motion judgments were rated as at least 16% more possible from the HSV-derived playbacks than from stroboscopy. The assessments from the 3D playback were different than those from the two-dimensional HSV playback for magnitude, however a similar trend was realized. The findings demonstrate consistently greater magnitudes of vertical motion during pressed phonations. Asymmetry of vertical motion was appreciated in both modal and pressed phonations. The results of this study concur with the concept of increased vertical motion during pressed phonation and recommend further investigations of the typicality of this important feature of vocal fold vibration in various modes and registers of normal and pathologically influenced phonation.\n",
    ""
   ]
  },
  "shaw05b_maveba": {
   "authors": [
    [
     "Heather S.",
     "Shaw"
    ],
    [
     "Dimitar D.",
     "Deliyski"
    ]
   ],
   "title": "Mucosal wave magnitude: presence, extent, and symmetry in normophonic speakers",
   "original": "mv05_137",
   "page_count": 4,
   "order": 33,
   "p1": "137",
   "pn": "140",
   "abstract": [
    "Visualization of the vocal fold structure and function is imperative for accurate diagnoses and optimal treatment for persons with voice disorders. With the advent of commercial High-Speed Videoendoscopy (HSV) systems, an increased amount of variation has been appreciated in the diagnostically relevant features of mucosal wave presence, magnitude, and symmetry. This study presents findings from the assessment of mucosal wave from stroboscopy, HSV playback, mucosal wave playback, and mucosal wave kymography playback. The results from this study demonstrate the prevalence of features of ‘atypical’ mucosal wave during modal productions of /i/ by normophonic persons. Utilizing modal and pressed phonations, an increased understanding of the effect of medial compression and increased subglottal pressure on mucosal wave was realized.\n",
    ""
   ]
  },
  "takano05_maveba": {
   "authors": [
    [
     "Sayoko",
     "Takano"
    ],
    [
     "Keisuke",
     "Kinoshita"
    ],
    [
     "Kiyoshi",
     "Honda"
    ]
   ],
   "title": "Measurement of cricothyroid articulation using high-resolution MRI and 3d pattern matching",
   "original": "mv05_141",
   "page_count": 4,
   "order": 34,
   "p1": "141",
   "pn": "144",
   "abstract": [
    "This study investigates the actions of the cricothyroid joint for F0 changes based on high-resolution MRI and 3D image analysis. The data from a male speaker's phonation at two fundamental frequencies were analyzed with a 3D pattern matching method to obtain displacement and angular changes of the thyroid and cricoid cartilages. Results show displacement of the two cartilages relative to each other in 3D. The largest difference between 110 Hz and 165 Hz was found to be 1.2 mm horizontally and 0.6 mm vertically with respect to the translation of the cricothyoroid joint. This action is interpreted to be caused by the contraction of the cricothyroid muscle which draws the thyroid and cricoid cartilages together, and results in stretching of the vocal folds.\n",
    ""
   ]
  },
  "fell05_maveba": {
   "authors": [
    [
     "H. J.",
     "Fell"
    ],
    [
     "Joel",
     "MacAuslan"
    ]
   ],
   "title": "Vocalization analysis tools",
   "original": "mv05_147",
   "page_count": 4,
   "order": 35,
   "p1": "147",
   "pn": "150",
   "abstract": [
    "We offer two tools for automated vocalization analysis. The Syllable tool uses the Stevens landmark theory to find landmarks in vocalizations digitized as \"wav\" files. The landmarks are grouped to identify syllable-like productions in these vocalizations and the results are summarized. The Vocalization-Age tool is intended for pre-speech vocalizations. It uses the landmark and syllable information to yield a vocalization age that has been shown to clinically distinguish typically-developing children from children who are atrisk for later speech impairment.\n",
    ""
   ]
  },
  "svancara05_maveba": {
   "authors": [
    [
     "P.",
     "Švancara"
    ],
    [
     "Jaromír",
     "Horáček"
    ]
   ],
   "title": "Numerical modelling of effect of tonsillectomy on production of Czech vowels /a/ and /i/",
   "original": "mv05_151",
   "page_count": 4,
   "order": 36,
   "p1": "151",
   "pn": "154",
   "abstract": [
    "Aim of this study is to numerically examine the effect of tonsillectomy on production of Czech vowels /a/ and /i/. Similar experimental studies are not easily realisable on living subjects. The finite element (FE) models of the acoustic spaces corresponding to the human vocal tract for the Czech vowels /a/ and /i/ and acoustic space around the human head are used in numerical simulations of phonation. The acoustic resonant characteristics of the FE models are studied using modal and transient analyses (excitation by a short pulse). The production of vowels is simulated in time domain using transient analysis of FE model excited by Liljencrants-Fant’s (LF) glottal signal model. Calculated results show that tonsillectomy causes significant frequency shifts down to lower frequencies for 2nd (down by ~40Hz) and 4th (down by ~120Hz) formants for the vowel /a/, and similar shifts for 2nd (down by ~100Hz) and 4th (down by ~50Hz) formants for the vowel /i/. The frequency shifts of formants after tonsillectomy significantly depends on position and size of the tonsils.\n",
    ""
   ]
  },
  "kacha05_maveba": {
   "authors": [
    [
     "A.",
     "Kacha"
    ],
    [
     "Francis",
     "Grenez"
    ],
    [
     "Jean",
     "Schoentgen"
    ]
   ],
   "title": "Generalized variogram analysis of vocal dysperiodicities in connected speech",
   "original": "mv05_155",
   "page_count": 4,
   "order": 37,
   "p1": "155",
   "pn": "158",
   "abstract": [
    "A generalized variogram is used to track vocal dysperiodicities in connected speech, which are summarized by means of a signal-to-dysperiodicity marker. To evaluate the variogram-based analysis, signal-to-dysperiodicity estimates are correlated with scores obtained by means of perceptual ratings of the degree of hoarseness, which are based on comparative judgments of pairs of speech samples. The corpora comprise four French sentences as well as vowels [a] produced by 22 male and female normophonic and dysphonic speakers.\n",
    ""
   ]
  },
  "wurzbacher05_maveba": {
   "authors": [
    [
     "T.",
     "Wurzbacher"
    ],
    [
     "R.",
     "Schwarz"
    ],
    [
     "H.",
     "Toy"
    ],
    [
     "Ulrich",
     "Eysholdt"
    ],
    [
     "Jörg",
     "Lohscheller"
    ]
   ],
   "title": "Modelling of non-stationary phonation for classification of vocal fold vibrations",
   "original": "mv05_159",
   "page_count": 4,
   "order": 38,
   "p1": "159",
   "pn": "162",
   "abstract": [
    "In contrast to the endoscopic examination of a stationary phonation, the examination of a nonstationary phonation screens a broader spectrum of vocal fold oscillations. For this reason, vocal fold vibrations are investigated and recorded with a highspeed camera system in eight normal and in eight pathological voices during a pitch raise. A quantitative analysis of the observed vocal fold dynamics in terms of symmetry and regularity is done with a time-dependent two-mass model of the vocal folds. The model's parameters are numerically optimized to emulate the observed non-stationary vocal fold vibrations. These parameters permit an objective interpretation of vocal fold oscillating asymmetries and allow a classification in normal and pathological cases. The practicability of the optimization algorithm is demonstrated with a set of 242 synthetically generated data sets. By applying the optimization procedure to the recordings of the 16 subjects a correct classification into groups of normal and pathological cases was achieved.\n",
    ""
   ]
  },
  "martinez05_maveba": {
   "authors": [
    [
     "F. M.",
     "Martínez"
    ],
    [
     "J. C.",
     "Goddard"
    ],
    [
     "A. M.",
     "Martínez"
    ]
   ],
   "title": "Analysis of Spanish synthesized speech signals using spectral and basis pursuit representations",
   "original": "mv05_163",
   "page_count": 4,
   "order": 39,
   "p1": "163",
   "pn": "166",
   "abstract": [
    "In speech, the sounds involved in an utterance are not produced independently of one another, but rather reflect the result of a complex process of sound concatenation. It is important to study these coarticulation effects in representations of speech signals since, for example, their cues can be helpful in the development of robust speech recognition systems. Representational tools, such as the spectrogram, are useful for visualizing spectral characteristics along the time axis; most of these tools are based on secondorder statistics, and it is interesting to consider other methods which might be useful in studying the problem of coarticulation. In recent years, sparse signal representations using suitable dictionaries of functions seem to provide an attractive alternative. With this alternative in mind, the present paper applies spectral and basis pursuit techniques to spanish synthesized signals. The results on a reduced vocabulary show that some prosodic and coarticulatory cues can be obtained from the basis pursuit method compared to the spectral representation.\n",
    ""
   ]
  },
  "drepper05_maveba": {
   "authors": [
    [
     "F. R.",
     "Drepper"
    ]
   ],
   "title": "Voiced excitation as entrained primary response of a reconstructed glottal master oscillator",
   "original": "mv05_167",
   "page_count": 4,
   "order": 40,
   "p1": "167",
   "pn": "170",
   "abstract": [
    "The transmission protocol of sustained voiced speech is hypothesized to be based on a fundamental drive process, which synchronizes the vocal tract excitation on the transmitter side and evokes the pitch perception on the receiver side. A band limited fundamental drive is extracted from a voice specific subband decomposition of a speech signal. When the near periodic drive is used as fundamental drive of a two-level drive-response model, a more or less aperiodic voiced excitation can be reconstructed as a more or less aperiodic trajectory on a low dimensional synchronization manifold described by speaker and phoneme specific coupling functions. In the case of vowels and nasals the excitation depends on a single phase of the fundamental drive. In the case of other sustained voiced consonants the excitation may include an additional coupling function, which depends on a delayed fundamental phase with a phoneme specific time delay. The delay may exceed the length of the analysis window. The resulting long range correlation cannot be analysed by methods assuming stationary excitation.\n",
    "Index Terms. voiced speech, fundamental drive, two-level driveresponse model, generalized synchronization, delayed excitation\n",
    ""
   ]
  },
  "turunen05_maveba": {
   "authors": [
    [
     "Jari",
     "Turunen"
    ],
    [
     "Tarmo",
     "Lipping"
    ],
    [
     "Juha T.",
     "Tanttu"
    ]
   ],
   "title": "Speech analysis using Higuchi fractal dimension",
   "original": "mv05_171",
   "page_count": 4,
   "order": 41,
   "p1": "171",
   "pn": "174",
   "abstract": [
    "Speech analysis for identification and recognition purposes is a demanding task, especially to find recognition parameters for some consonants. In this paper, we show the initial analysis results of speech corpus, sampled with two sampling rates, 22050 and 8000 Hz, using Higuchi fractal dimension. The study shows that it might be possible to use fractal dimension value for classification of for example plosives /k/, /p/ and /t/. However, the analysis seems to be very sensitive to the sampling frequency in speech analysis.\n",
    ""
   ]
  },
  "cnockaert05_maveba": {
   "authors": [
    [
     "L.",
     "Cnockaert"
    ],
    [
     "Jean",
     "Schoentgen"
    ],
    [
     "P.",
     "Auzou"
    ],
    [
     "C.",
     "Ozsancak"
    ],
    [
     "Francis",
     "Grenez"
    ]
   ],
   "title": "Effect of Parkinson’s disease on vocal tremor",
   "original": "mv05_177",
   "page_count": 4,
   "order": 42,
   "p1": "177",
   "pn": "180",
   "abstract": [
    "Vocal tremor is encountered in different neurological diseases and could be used for their characterisation. In this paper, vocal tremor features have been extracted for speakers with Parkinson’s disease and control speakers. It is shown that Parkinson’s disease has significant effects on vocal tremor features. For speakers with Parkinson’s disease, the average vocal frequency is higher and the vocal tremor frequency is higher. This can be explained by higher vocal tremor components in the frequency band 8-12Hz.\n",
    ""
   ]
  },
  "subari05_maveba": {
   "authors": [
    [
     "Khazaimatol S.",
     "Subari"
    ],
    [
     "D. Mitchell",
     "Wilkes"
    ],
    [
     "Stephen E.",
     "Silverman"
    ],
    [
     "Marilyn K.",
     "Silverman"
    ],
    [
     "Richard G.",
     "Shiavi"
    ]
   ],
   "title": "Evaluation of speaker normalization for suicidality assessment",
   "original": "mv05_181",
   "page_count": 4,
   "order": 43,
   "p1": "181",
   "pn": "184",
   "abstract": [
    "When reviewing his clinical experience in treating suicidal patients, one of the authors observed that successful predictions of suicidality were often based on the patient’s voice independent of content. Using the Gaussian mixture model to represent the mel-cepstral features of voiced speech, speech of suicidal persons can be distinguish from that of depressed and control persons. The question then becomes can warping of the frequency axis improve the classification. The results show that warping of the frequency axis using the third format or Gaussian mixture model technique produces the best classification results.\n",
    "Index Terms. Speech, suicide, mel-cepstrum, frequency warping, classification\n",
    ""
   ]
  },
  "wermke05_maveba": {
   "authors": [
    [
     "Kathleen",
     "Wermke"
    ],
    [
     "Werner",
     "Mende"
    ],
    [
     "Anne",
     "Kempf"
    ],
    [
     "Claudia",
     "Manfredi"
    ],
    [
     "Piero",
     "Bruscaglioni"
    ],
    [
     "Angelika",
     "Stellzig-Eisenhauer"
    ]
   ],
   "title": "Interaction patterns between melodies and resonance frequencies in infants' pre-speech utterances",
   "original": "mv05_187",
   "page_count": 4,
   "order": 44,
   "p1": "187",
   "pn": "190",
   "abstract": [
    "Melody, the time function of the fundamental frequency is a key quantity for characterizing infants’ utterances during the first months of life. However, additional quantities, describing the voluntary control of the vocal tract become increasingly important during pre-speech development. From a physiological point of view laryngeal phonation and vocal tract based articulation are anatomically different and independently controlled systems. For speech acquisition these two systems have to interact systematically. For instance, melody movements increasingly influence resonance frequencies of the vocal tract and vice versa.  A prominent phenomenon of a melody - resonance frequency interaction is the increasing occurrence of periods of close parallel synchronous movements of melodies and lower resonance frequencies. We call such movements ‘tuning periods’ when a resonance frequency moves inside a close neighborhood, a ‘vicinity tube’, of one of the lower harmonics and when this situation lasts for at least 20 ms. Vicinity is given by our analysis bandwidth. Tuning develops either by movements of resonance frequencies to track the melody, or conversely, by movements of the melody to approach certain resonances, or by both processes taking place simultaneously. Here, the term ‘tuning’ is used in a purely descriptive sense, without considering the mechanisms that are producing this phenomenon as well as without considering what is cause or effect. It is not yet clear, how much mechanical couplings inside the vocal system contribute, and how much intentional neuro-physiological control contribute to the production of longer tuning periods.  Another prominent feature of melody-resonance interaction is resonance frequency transition. Here, transition is defined as coherent and smooth movements of a resonance frequency from the vicinity of one harmonic to the vicinity of another harmonic. The duration of a transition depends on several factors, e.g., neuro-physiological maturity and integrity of the underlying control systems, achieved training level, type of utterance or syllable-structure.  Such well-formed and smooth transitions and the abovementioned coherent tuning periods represent probably the predispositions for fast couplings (and de-couplings) of phonation and articulation and for acquiring the necessary flexibility for producing fast sequences of phonological structures in later fluent speech. At about babbling age, phonation and articulation are acting completely in concert. The production of babble - syllables is characterized by fast formant transitions which lay already within the time range of fluent speech.\n",
    ""
   ]
  },
  "nicollas05_maveba": {
   "authors": [
    [
     "R.",
     "Nicollas"
    ],
    [
     "J.",
     "Giordano"
    ],
    [
     "L.",
     "Francius"
    ],
    [
     "J.",
     "Vicente"
    ],
    [
     "Y.",
     "Burtschell"
    ],
    [
     "M.",
     "Medale"
    ],
    [
     "B.",
     "Nazarian"
    ],
    [
     "M.",
     "Roth"
    ],
    [
     "M.",
     "Ouaknine"
    ],
    [
     "A.",
     "Giovanni"
    ]
   ],
   "title": "Aerodynamical model of human newborn larynx: an approach of the first cry",
   "original": "mv05_191",
   "page_count": 3,
   "order": 45,
   "p1": "191",
   "pn": "193",
   "abstract": [
    "First cry has been much studied especially from an acoustical point of view. However, the mechanisms of sound production are unclear. Thus, following studies we previously performed, we extend in this present work our simulations to a more realistic geometry obtained by MRI images of a fetal larynx. This work confirms the major role of vortices and may be that of the supraglottis and the fluid flow interactions.\n",
    ""
   ]
  },
  "adachi05_maveba": {
   "authors": [
    [
     "Seiji",
     "Adachi"
    ],
    [
     "Jason",
     "Yu"
    ]
   ],
   "title": "High-pitched voice simulation using a two-dimensional vocal fold model",
   "original": "mv05_195",
   "page_count": 4,
   "order": 46,
   "p1": "195",
   "pn": "198",
   "abstract": [
    "Voiced sounds were simulated with a computer model of the vocal fold composed of a single mass vibrating both parallel and perpendicular to the airflow. The major improvement of the present model over the twomass model is that it has a wider continuous frequency range where self-excitation is possible both below and above the first formant frequency of the vocal tract. The two-dimensional model can therefore successfully be applied to the sound synthesis of a high-pitched soprano singing, where the fundamental frequency sometimes exceeds the first formant frequency.\n",
    ""
   ]
  },
  "sundberg05_maveba": {
   "authors": [
    [
     "Johan",
     "Sundberg"
    ]
   ],
   "title": "Effect of vocal loudness variation on the voice source",
   "original": "mv05_199",
   "page_count": 1,
   "order": 47,
   "p1": "199",
   "pn": "",
   "abstract": [
    "The physiological correlate of perceived vocal loudness is the overpressure of air under the glottis, or the subglottal pressure Psub. Variation of vocal loudness, i.e., of Psub has strong effects on the waveform of the transglottal airflow, also called the voice source. As the voice source is the primary sound itself, which after filtering by the vocal tract resonator is radiated through the lip opening, variation of Psub has strong effects on the voice timbre. The waveform of the voice source, called the flow glottogram, can be obtained by inverse filtering, which implies that the vocal sound is filtered by the inverted frequency curve of the vocal tract. A flow glottogram is characterized by triangular air pulses, occurring when the vocal folds open the glottis and allows an airstream to pass. These air pulses are interleaved by episodes of zero airflow occurring when the vocal folds close the glottis, arresting the air stream. Important flow glottogram characteristics are (1) the relative duration of the closed phase, or Qclosed, (2) the peak amplitude of the flow pulse and (3) the maximum flow declination rate corresponding to the steepness of the trailing end of the flow pulse. These voice source characteristics show a reasonably simple relationship to acoustic properties of vocal sounds. The peak-to-peak amplitude of the flow pulse is strongly correlated with the amplitude of the lowest spectrum partial, the fundamental.   The maximum flow declination rate determines the sound level and Qclosed is strongly correlated with the dominance of the fundamental in the spectrum.   When Psub is increased from very low to low, Qclosed increases markedly, but an increase from a high to a very high Psub does not affect Qclosed appreciably. An increase of Psub also leads to an increase of maximum flow declination rate and generally also of the peak-to-peak amplitude. Another consequence of an increased Psub is that the higher partials in the spectrum gain more in sound level than the lower partials. Thus, a 10 dB increase of the overall sound level of a vowel is typically accompanied by a 15 dB increase of the partials near 300 Hz. This means that the slope of the spectrum, and hence also of a long-term-average spectrum varies with. All these effects of Psub variation on the voice source imply that comparisons of acoustic spectrum characteristics of a voice, e.g., before and after treatment, must be made for the same degree of vocal loudness. If this condition is not met, the effect of the loudness difference between the recordings compared must be compensated for.\n",
    ""
   ]
  },
  "amir05_maveba": {
   "authors": [
    [
     "N.",
     "Amir"
    ],
    [
     "O.",
     "Amir"
    ],
    [
     "O.",
     "Michaeli"
    ]
   ],
   "title": "Assessing vibrato quality of singing students",
   "original": "mv05_201",
   "page_count": 3,
   "order": 48,
   "p1": "201",
   "pn": "203",
   "abstract": [
    "Many studies have been carried out on vibrato in the singing voice, though usually on singing of professional singers. In the present study we examine vibrato quality in sustained notes as sung by students, rather than professionals, in an attempt to find objective measures for assessing vibrato quality in singing students. A set of 78 notes was assessed subjectively by 5 experiences musicians. A set of acoustic measures was then extracted, and analyzed statistically to obtain two indicators: presence or absence of vibrato, and in the case of presence – an indication of vibrato quality. Discrimination between presence and absence of vibrato was 82% correct; the predictor of vibrato quality achieved a significant correlation coefficient of 0.7395 with the subjective judgments.\n",
    ""
   ]
  },
  "gamba05_maveba": {
   "authors": [
    [
     "M.",
     "Gamba"
    ],
    [
     "C.",
     "Giacoma"
    ]
   ],
   "title": "Vocal production mechanisms in ruffed lemurs: a Prosimian model for the basis of primate phonation",
   "original": "mv05_207",
   "page_count": 4,
   "order": 49,
   "p1": "207",
   "pn": "210",
   "abstract": [
    "The island of Madagascar is one of the planet’s foremost biodiversity hotspots and it is threatened with large-scale destruction by unsustainable human activities. The ruffed lemur, like all other lemurs, is endemic to Madagascar and inhabits the eastern rainforests of the island. A captive breeding project for this species has been underway since the Sixties and lead to a relatively great population of captive ruffed lemurs. Part of this population was recorded for the purpose of this study and phonetic analysis of the ruffed lemur calls is presented in this paper. As reported from studies on human and non-human primate vocal communication, ruffed lemurs show acoustic cues on actual (or even exaggerated) vocalizer body size when emitting inter-group and agonistic vocalizations. The vocal repertoire of Varecia sp. also features submissive, affinitive and pre-copulation calls, showing different formant patterns that contradict the use of the uniform, or flared, tube system as a valid model of non-human primate phonation.\n",
    ""
   ]
  },
  "aerts05_maveba": {
   "authors": [
    [
     "J.-M.",
     "Aerts"
    ],
    [
     "P.",
     "Jans"
    ],
    [
     "D.",
     "Halloy"
    ],
    [
     "P.",
     "Gustin"
    ],
    [
     "Daniel",
     "Berckmans"
    ]
   ],
   "title": "Labeling of cough data from pigs for on-line disease monitoring by sound analysis",
   "original": "mv05_211",
   "page_count": 4,
   "order": 50,
   "p1": "211",
   "pn": "214",
   "abstract": [
    "More objective and automated detection of respiratory diseases in pig houses should be possible by on-line sound analysis of cough monitoring. To develop automatic algorithms for pig cough recognition, experiments and well-labeled cough data are needed. The objectives of this article are: (1) to give a short overview of the attained results in cough recognition, and (2) to define a methodology to label the cough data in a pig house. Human observers labeled coughs by audiovisual observation in a laboratory test installation with ten pigs during periods ranging from two days to two weeks. Simultaneously, sound registration was done with audio equipment. The sound registrations were listened to by another observer to compare the number of coughs in the registration with the number labeled during the experiment. It was found that there were underestimations of up to 94% in the number of coughs. The underestimation in the number of coughs could be reduced to 10% when the observer used an additional labeling sound signal on the scene each time coughing was observed. In addition, differences were found between two independent observers scoring pig's coughs in an audiovisual manner on the scene. For future research, we suggest an investigation of how an observer using software labeling could improve the labeling results.\n",
    ""
   ]
  }
 },
 "sessions": [
  {
   "title": "Voice Pathology Classification (Special Session)",
   "papers": [
    "berry05_maveba",
    "moore05_maveba",
    "saenzlechon05_maveba",
    "saenzlechon05b_maveba",
    "schoentgen05_maveba",
    "sheta05_maveba"
   ]
  },
  {
   "title": "Voice Recovering / Enhancement",
   "papers": [
    "kuwabara05_maveba",
    "pietruch05_maveba",
    "manfredi05_maveba"
   ]
  },
  {
   "title": "Physical and Mechanical Models and Devices (Special Session)",
   "papers": [
    "vampola05_maveba",
    "zaccarelli05_maveba",
    "ruty05_maveba",
    "avanzini05_maveba",
    "gomezvilda05_maveba",
    "orr05_maveba",
    "jeannin05_maveba"
   ]
  },
  {
   "title": "Poster Session",
   "papers": [
    "alku05_maveba",
    "guarino05_maveba",
    "hanquinet05_maveba",
    "kitamura05_maveba",
    "kob05_maveba",
    "misun05_maveba",
    "orzechowski05_maveba",
    "sovilj05_maveba",
    "manickam05_maveba"
   ]
  },
  {
   "title": "Methods for Voice Measurements (Special Session)",
   "papers": [
    "fourcin05_maveba",
    "shrivastav05_maveba",
    "svec05_maveba",
    "bianchi05_maveba",
    "mantha05_maveba",
    "cieciwa05_maveba",
    "shaw05_maveba",
    "shaw05b_maveba",
    "takano05_maveba"
   ]
  },
  {
   "title": "Voice Modelling and Analysis",
   "papers": [
    "fell05_maveba",
    "svancara05_maveba",
    "kacha05_maveba",
    "wurzbacher05_maveba",
    "martinez05_maveba",
    "drepper05_maveba",
    "turunen05_maveba"
   ]
  },
  {
   "title": "Neurological Dysfunctions (Special Session)",
   "papers": [
    "cnockaert05_maveba",
    "subari05_maveba"
   ]
  },
  {
   "title": "Infant Cry &#150; Singing Voice",
   "papers": [
    "wermke05_maveba",
    "nicollas05_maveba",
    "adachi05_maveba",
    "sundberg05_maveba",
    "amir05_maveba"
   ]
  },
  {
   "title": "Non-Human Sounds",
   "papers": [
    "gamba05_maveba",
    "aerts05_maveba"
   ]
  }
 ]
}