{
 "title": "IEEE Nordic Signal Processing Symposium (NORSIG 1998)",
 "location": "Vigsø, Denmark",
 "startDate": "8/6/1998",
 "endDate": "11/6/1998",
 "conf": "NORSIG",
 "year": "1998",
 "name": "norsig_1998",
 "series": "",
 "SIG": "",
 "title1": "IEEE Nordic Signal Processing Symposium",
 "title2": "(NORSIG 1998)",
 "date": "8-11 June 1998",
 "papers": {
  "hansen98_norsig": {
   "authors": [
    [
     "Lars Kai",
     "Hansen"
    ],
    [
     "Niels",
     "Mørch"
    ],
    [
     "Finn Årup",
     "Nielsen"
    ]
   ],
   "title": "Neural networks in functional neuroimaging",
   "original": "nos8_001",
   "page_count": 8,
   "order": 1,
   "p1": "1",
   "pn": "8",
   "abstract": [
    "Functional brain mapping by scanning techniques like Positron Emission Tomography and Functional Magnetic Resonance Imaging is opening a new window for neuroscience. We introduce and apply modern statistical methods for design and evaluation of neural network architectures for brain mapping. Using empirical \"test set methods\" we are able to demonstrate significant non-linearities. Visualization and interpretation of the learned models are key aspects of this interdisciplinary research. Examples of such analysis are available on the World Wide Web - including videos and 3D environments (VRML) see http://hendrix.imm.dtu.dk.\n",
    ""
   ]
  },
  "lee98_norsig": {
   "authors": [
    [
     "Chin-Hui",
     "Lee"
    ]
   ],
   "title": "A tutorial on speaker and speech verification",
   "original": "nos8_009",
   "page_count": 8,
   "order": 2,
   "p1": "9",
   "pn": "16",
   "abstract": [
    "Speaker verification (SV) is the process of verifying the claimed identity of a speaker as one of the registered users based on his/her voice characteristics. Utterance verification (UV), on the other hand, attempts to verify the claimed content of a spoken utterance. When utterance verification is applied to verify the claimed identity of a talker against the stored information in his/her personal profile, the process is known as verbal information verification (VIV). In this paper, we discuss the fundamentals of pattern verification and focus on strategies and approaches that enable us to achieve speaker and speech verification for real-world applications.\n",
    ""
   ]
  },
  "sinkjr98_norsig": {
   "authors": [
    [
     "Thomas",
     "Sinkjær"
    ],
    [
     "Morten",
     "Hansen"
    ],
    [
     "Barry",
     "Upshaw"
    ],
    [
     "Morten",
     "Haugland"
    ],
    [
     "Aleksandar",
     "Rostov"
    ]
   ],
   "title": "Processing sensory nerve signals meant for control of paralyzed muscles",
   "original": "nos8_017",
   "page_count": 8,
   "order": 3,
   "p1": "17",
   "pn": "24",
   "abstract": [
    "Signals recorded from cutaneous nerves can be used as a replacement for artificial sensors (switches, strain gauges, etc.) in Functional Electrical Stimulation (FES) neuralprosthetic devices. Unfortunately, these signals are difficult to use in practice since they are plagued with high background noise levels, resulting in poor overall signal-to-noise ratios (SNRs). Reliable detection of afferent nerve signals is essential if such signals are to be of use in artificial sensory-based Functional Electrical Stimulation neuralprosthetics. We present two advanced signal processing algorithms, one based on signal and noise subspace orthogonal decompositions using the statistical distribution of the signal (Upshaw and Sinkjaer 1998), and another one using processing of neural signals by the Adaptive Logic Network (ALN) (Kostov et al. 1996). As a baseline, both are compared to the standard processing method most frequently employed in nerve signal analysis. Algorithms based on a Singular Value Decomposition (SVD) of the signal's 2nd and Higher-Order Statistics (HOS) resulted in a more robust signal detection and an improved detection rate. The ALNs can discriminate precise timing of heel contact as well as heel lift during FES assisted walking, having a detection rate of nearly 100%.\n",
    ""
   ]
  },
  "elstrm98_norsig": {
   "authors": [
    [
     "Leif",
     "Elstrøm"
    ]
   ],
   "title": "Applying usability design and testing in system development",
   "original": "nos8_025",
   "page_count": 4,
   "order": 4,
   "p1": "25",
   "pn": "28",
   "abstract": [
    "This paper introduces usability as a discipline in the system development process. A general definition of usability is introduced which provides the basis for discussion of some commonly accepted usability terms and dimensions. An ideal design and development process from a usability point of view highlights some of the considerations that designers and programmers must take into account during design, development, implementation and test. Definitions of quantifiable and thereby measurable dimensions are introduced which makes usability operational in design, development and test.\n",
    ""
   ]
  },
  "skinnemoen98_norsig": {
   "authors": [
    [
     "Harold",
     "Skinnemoen"
    ]
   ],
   "title": "Multimedia satellite communication",
   "original": "nos8_029",
   "page_count": 8,
   "order": 5,
   "p1": "29",
   "pn": "36",
   "abstract": [
    "Multimedia is on the move, boosted by a boom in Internet use. Satellite systems have the ability to rapidly deploy an infrastructure locally or worldwide. Wireless communications can also support mobility, but for very high bit rate terminals, mobile communications are not envisioned for some time. One must be satisfied with terminals that are movable when not in use. Multimedia will affect many of us in the near future, and satellites will play an important role. This paper discusses satellites in relation to broadband multimedia, aiming to be an introduction for the interested, but as for now, uninformed reader.\n",
    ""
   ]
  },
  "mller98_norsig": {
   "authors": [
    [
     "Henrik",
     "Møller"
    ],
    [
     "Dorte",
     "Hammershøi"
    ]
   ],
   "title": "HRTFs for binaural synthesis",
   "original": "nos8_037",
   "page_count": 8,
   "order": 6,
   "p1": "37",
   "pn": "44",
   "abstract": [
    "This paper presents the method of binaural synthesis for use in creation of three-dimensional sound images in virtual reality and multimedia applications. Special attention is given to the selection of head-related transfer functions (HRTFs), and how this choice affects the further processing. A brief introduction to spatial hearing is given, followed by a division of the sound transmission to the eardrum. The selection of HRTFs for binaural synthesis is discussed. It is then described how the binaural synthesis is carried out using information on sound transmission in the room as input. Examples of headphone characteristics are given, and it is described how the correct eardrum signals are obtained by headphone reproduction.\n",
    ""
   ]
  },
  "bengtsson98_norsig": {
   "authors": [
    [
     "Mats",
     "Bengtsson"
    ],
    [
     "Björn",
     "Ottersten"
    ]
   ],
   "title": "On approximating a spatially scattered source with two point sources",
   "original": "nos8_045",
   "page_count": 4,
   "order": 7,
   "p1": "45",
   "pn": "48",
   "abstract": [
    "Antenna array signal processing has emerged as a promising technique to improve the capacity and performance of wireless communication systems. One aspect that has received relatively little attention is the channel modeling, where the traditional assumption of point sources is inappropriate in many scenarios. Here, we use a statistical channel model for an environment where the signal energy arrives at the array in clusters of rays, distributed around the nominal directions of the signal sources. It is shown that each cluster can be well approximated by two point sources when the spread angle is small. This observation is used to derive low-complexity solutions both in the design of a beamformer with good interference rejection capabilities as well as for a parameter estimation algorithm for estimation of both nominal direction of arrival and spread angle. The performance of the different algorithms are illustrated in a simulation study.\n",
    ""
   ]
  },
  "coward98_norsig": {
   "authors": [
    [
     "Helge",
     "Coward"
    ],
    [
     "Andrew",
     "Perkis"
    ],
    [
     "Tor A.",
     "Ramstad"
    ],
    [
     "Geir E.",
     "Øien"
    ],
    [
     "Ilangko",
     "Balasingham"
    ]
   ],
   "title": "Robustness against channel errors in JPEG 2000",
   "original": "nos8_049",
   "page_count": 4,
   "order": 8,
   "p1": "49",
   "pn": "52",
   "abstract": [
    "In the development of JPEG 2000, a new still image compression algorithm, a series of core experiments is performed. One of them is \"Robust coding methods\". In this paper, we compare a fixed length coder to a variable length coder with respect to robustness against channel errors. From the simulation results we can conclude that the fixed length coder performs better than the variable length coder. In addition, a special kind of fixed length coder for a PAM channel has been tested. By including a part of the modem in the coder, we obtain graceful degradation of the image as the channel quality is lowered.\n",
    ""
   ]
  },
  "tschudin98_norsig": {
   "authors": [
    [
     "Martin",
     "Tschudin"
    ],
    [
     "Ralf",
     "Heddergott"
    ]
   ],
   "title": "Cramer-rao lower bound as a performance measure for high resolution multidimensional channel parameter estimation schemes",
   "original": "nos8_053",
   "page_count": 4,
   "order": 9,
   "p1": "53",
   "pn": "56",
   "abstract": [
    "The Cramer-Rao lower bound (CRLB) is derived as a performance measure for multidimensional channel parameter estimation schemes. A compact formulation of the CRLB is given, revealing its dependence on the given wave parameters. More-over, the SAGE algorithm is presented to yield a high resolution of the impinging electromagnetic field with respect to delay, azimuth and elevation. Furthermore, a comparison of the root mean square error of the parameter estimates (RMSEE) with the CRLB shows its usefulness to assess the performance of channel parameter estimation schemes.\n",
    ""
   ]
  },
  "minn98_norsig": {
   "authors": [
    [
     "Illaing",
     "Minn"
    ],
    [
     "Kimmo",
     "Mäkeläinen"
    ]
   ],
   "title": "An investigation into fast simulation of BER for cellular radio",
   "original": "nos8_057",
   "page_count": 4,
   "order": 10,
   "p1": "57",
   "pn": "60",
   "abstract": [
    "In performance evaluation of communication systems, finding faster simulation methods is a topic of ongoing research, and Importance Sampling (IS) is one of the most promising techniques. One of the main problems for IS is long system memory, for instance, in adaptive equalizer or in Viterbi decoder. An IS methodology, Stochastic Gradient Descent algorithm (SGD), has been previously successfully applied to an uncoded system with RLS adaptive equalizer [1, 2, 3, 4]. In this study, SGD is applied to a coded system, the IS-54 TDMA cellular mobile system, with Viterbi equalizer and Viterbi decoder. Both biasing the fading process and biasing the additive noise process are investigated. Simulation results show that biasing the fading process is a better approach than biasing the noise process and SGD is applicable to BER estimation at Viterbi equalizer output but does not perform very well in application to the system containing cascaded Viterbi algorithms.\n",
    ""
   ]
  },
  "werner98_norsig": {
   "authors": [
    [
     "Stefan",
     "Werner"
    ],
    [
     "Jose Antonio",
     "Apolinario Jr."
    ]
   ],
   "title": "Application of constrained normalized algorithms for a multiple-antenna CDMA mobile receiver",
   "original": "nos8_061",
   "page_count": 4,
   "order": 11,
   "p1": "61",
   "pn": "64",
   "abstract": [
    "Constrained adaptive receiver algorithms are considered in a multiple-antenna CDMA mobile receiver. We study the constrained versions of the Bi-normalized Data-Reusing LMS (BNDR-LMS) and the Normalized LMS (NLMS) and their performance are compared with the classical Frost algorithm. We make use of time-varying step-sequences to further enhance the performance of the receiver. The results show that considerable improvement in the convergence speed can be achieved with the use of the normalized algorithms compared with the conventional Frost algorithm. Using an optimal step-sequence in the update provides a fast convergence and a near optimum steady-state performance.\n",
    ""
   ]
  },
  "lethespensen98_norsig": {
   "authors": [
    [
     "Poul",
     "Leth-Espensen"
    ],
    [
     "Preben E.",
     "Mogensen"
    ],
    [
     "Per",
     "Zetterberg"
    ]
   ],
   "title": "Uplink combining performance in a GSM 1/3 reuse network using smart antennas",
   "original": "nos8_065",
   "page_count": 4,
   "order": 12,
   "p1": "65",
   "pn": "68",
   "abstract": [
    "This paper analyses the performance of uplink combining algorithms for adaptive base station antennas in GSM based on a network simulation model. The network structure considered is a random frequency hopping GSM network, which employs a reuse scheme of 1/3, in order to exploit the capacity gain of adaptive antennas. For uplink reception both beamsteering based on a robust Direction of Arrival (DoA) algorithm and the more complex optimum combining algorithm are considered. The network simulation model employs both measured and simulated 2D radio channel impulse responses. A uniform linear array with eight elements (M=8) has been considered to cover a sector of 120°. The beamsteering algorithm gives a C/I performance gain of nearly a factor M for low azimuth spread values (AS<5°). The implemented optimum combining algorithm gives marginally better results under the assumed network interference and 2-D radio channel conditions. The measured impulse responses have been obtained from the TSUNAMI II stand alone testbed.\n",
    ""
   ]
  },
  "baghaie98_norsig": {
   "authors": [
    [
     "Ramin",
     "Baghaie"
    ],
    [
     "Stefan",
     "Werner"
    ]
   ],
   "title": "Pipelined adaptive CDMA mobile receivers",
   "original": "nos8_069",
   "page_count": 4,
   "order": 13,
   "p1": "69",
   "pn": "72",
   "abstract": [
    "Adaptive multiple-antenna receivers can provide insensitivity to the interfering powers and room for more users or they require smaller number of antennas compared to the matched filter solution. In this paper, pipelined implementation of an adaptive Direct-Sequence Code Division Multiple Access receiver is proposed when multiple antennas are utilized for mobile communications. A number of approximation techniques are utilized to pipeline the Recursive Least-Squares (RLS) algorithm used for the receiver. The resulting pipelined structure achieves a higher throughput or requires lower power as compared to the receiver using the conventional serial RLS algorithm. As a result of pipelining, the hardware overhead is only 2M extra latches. For different number of antennas and different levels of pipelining the signal-to-interference versus the relative interfering power are illustrated.\n",
    ""
   ]
  },
  "grythe98_norsig": {
   "authors": [
    [
     "Knut H.",
     "Grythe"
    ],
    [
     "Jan E.",
     "Håkegård"
    ],
    [
     "Arne",
     "Lie"
    ],
    [
     "Andrew",
     "Perkis"
    ]
   ],
   "title": "WIRAC - a wideband radio access research programme",
   "original": "nos8_073",
   "page_count": 4,
   "order": 14,
   "p1": "73",
   "pn": "76",
   "abstract": [
    "This paper presents the scope, objective and preliminary results from a major project on Wideband Radio Access run by the Norwegian University of Science and Technology, NTNU, and SINTEF in Trondheim, Norway. The project is part of the Basic Telecommunications Research Programme (Grunnleggende Teleforskning) set up by the Norwegian Research Council (NFR). The project commenced in august 1997 and will run until December 2001.\n",
    ""
   ]
  },
  "skinnemoen98b_norsig": {
   "authors": [
    [
     "Harold",
     "Skinnemoen"
    ]
   ],
   "title": "Frequency-robust channel acquisition by auto-convolution estimation",
   "original": "nos8_077",
   "page_count": 4,
   "order": 15,
   "p1": "77",
   "pn": "80",
   "abstract": [
    "This paper provides an overview of a synchronization method that can be applied for channel acquisition for channel with relatively high frequency error. The method assumes one can choose a suitable complex synchronization word (UW) and focus on QPSK or OQPSK modulation. When a UW has the property that the real and imaginary parts are mirror images of each other, the received data can be its own matched filter. In principle this offers a performance that is independent of channel frequency error.\n",
    ""
   ]
  },
  "sarikaya98_norsig": {
   "authors": [
    [
     "Ruhi",
     "Sarikaya"
    ],
    [
     "Bryan L.",
     "Pellom"
    ],
    [
     "John H. L.",
     "Hansen"
    ]
   ],
   "title": "Wavelet packet transform features with application to speaker identification",
   "original": "nos8_081",
   "page_count": 4,
   "order": 16,
   "p1": "81",
   "pn": "84",
   "abstract": [
    "This study proposes a new set of feature parameters based on wavelet packet transform analysis of the speech signal. The new speech features are named subband based cepstral parameters (SBC) and wavelet packet parameters (WPP). The ability of each parameter set to capture speaker identity conveyed in the speech signal is compared to the widely used Mel-frequency cepstral coefficents (MFCC). The proposed parametrization methods are shown to achieve 48% and 67% reduction in relative error over MFCC for 630 and 168 speakers, respectively using the TIMIT (downsampled to 8 kHz) database.\n",
    ""
   ]
  },
  "olsen98_norsig": {
   "authors": [
    [
     "Jesper Ø.",
     "Olsen"
    ]
   ],
   "title": "Using ensemble techniques for improved speaker modelling",
   "original": "nos8_085",
   "page_count": 4,
   "order": 17,
   "p1": "85",
   "pn": "88",
   "abstract": [
    "The problem addressed in this paper is text prompted speaker verification. Ensemble techniques are introduced in order to improve an existing text prompted speaker verification system. It is found that ensemble techniques can significantly improve the quality of the speaker models, even when the original verification system has been optimised with regard to complexity. The verification system is evaluated on the Gandalf database, where the equal error rate is reduced from 3.9% to 3.2% for verification trials consisting of digit strings with four digits per utterance (one enrolment session).\n",
    ""
   ]
  },
  "zhou98_norsig": {
   "authors": [
    [
     "Guojun",
     "Zhou"
    ],
    [
     "John H. L.",
     "Hansen"
    ],
    [
     "James F.",
     "Kaiser"
    ]
   ],
   "title": "A new nonlinear feature for stress classification",
   "original": "nos8_089",
   "page_count": 4,
   "order": 18,
   "p1": "89",
   "pn": "92",
   "abstract": [
    "It is well known that the performance of speech recognition algorithms is greatly influenced by stressful conditions in which speech is produced. It is suggested that algorithms which are capable of classifying stress could be beneficial in the formulation of more effective speech recognition algorithms under stressful conditions. Recently, three nonlinear features derived from Teager Energy Operator (TEO) were proposed and shown to be effective for stress classification [1]. In this study, a new feature entitled TEO-CB-Auto-Env, is proposed which extends the work reported in [1]. The new feature is based on the normalized TEO autocorrelation envelope area employing critical band frequency analysis. The TEO-CB-Auto-Env feature is shown to outperform the three previous TEO based features for stress classification. Furthermore, it also outperforms the traditional Mel-frequency cepstral coefficients (MFCC) by 4-4.7%, as well as being more consistent for the task of stress classification using simulated and actual speech under stress.\n",
    ""
   ]
  },
  "karaca98_norsig": {
   "authors": [
    [
     "Nedim",
     "Karaca"
    ],
    [
     "Mark A.",
     "Clements"
    ],
    [
     "H. Selcuk",
     "Gecim"
    ]
   ],
   "title": "Speech recognition under adverse environments - rasta filtering and the weighted projection measure",
   "original": "nos8_093",
   "page_count": 4,
   "order": 19,
   "p1": "93",
   "pn": "96",
   "abstract": [
    "In this work, a speaker independent isolated word continuous density Hidden Markov Model (HMM) speech recognizer is designed and its performance is reported for small and medium size Turkish language databases under white and broadband colored noisy conditions. This paper covers the effort given to increase the recognition performance over a wide range of SNR's. The noise signal is created artificially and added to the clean utterances in laboratory conditions.\n",
    ""
   ]
  },
  "viikki98_norsig": {
   "authors": [
    [
     "Olli",
     "Viikki"
    ]
   ],
   "title": "On the importance of compensating variance in speaker adaptation",
   "original": "nos8_097",
   "page_count": 4,
   "order": 20,
   "p1": "97",
   "pn": "100",
   "abstract": [
    "Speaker adaptation has recently gained a great deal of interest in speech recognition research since the performance of speaker-independent systems is currently not adequate for practical applications. This paper studies the role of variance compensation in speaker adaptation. The performance of two variance adaptation techniques is evaluated and analyzed in a connected digit recognition task. In addition to the classical MAP (Maximum a Posteriori) variance adaptation method, a model-transform based variance update approach is in this paper combined with MAP mean adaptation. Recognition experiments indicate that the joint MAP mean adaptation and the model-transform based variance adaptation technique is superior both to joint MAP mean and variance adaptation, and to pure MAP mean adaptation. However, when studying the results more carefully, it can be observed that variance adaptation is the most useful for such speakers whose speech matches poorly the original speaker-independent HMMs. If a speaker already achieves a high recognition rate with speaker-independent models, variance compensation hardly improves the recognition accuracy compared to pure MAP mean adaptation.\n",
    ""
   ]
  },
  "johansen98_norsig": {
   "authors": [
    [
     "Finn Tore",
     "Johansen"
    ]
   ],
   "title": "Flexible vocabulary speech recognition for the norwegian speechdat database",
   "original": "nos8_101",
   "page_count": 4,
   "order": 21,
   "p1": "101",
   "pn": "104",
   "abstract": [
    "This paper presents a set of initial experiments with telephone speech recognitionon for the Norwegian SpeechDat database. Performance on four different tests, with a limited command word and digit vocabulary, is used to quantify the effect of different recogniser configurations. Results are reported for models trained on all database items, on the tested vocabulary only, and on the phonetically rich portions of the database only. Flat start training is compared to models initialised on phonetically labelled material. Feature analysis with enery scaling and cepstral mean normalisation is compared to features suitable for real-time recognition. Finally, decision-tree state clustered triphones are compared to mixture monophone models.\n",
    ""
   ]
  },
  "hasan98_norsig": {
   "authors": [
    [
     "Khairul",
     "Hasan"
    ],
    [
     "Kimmo",
     "Mäkeläinen"
    ]
   ],
   "title": "A study of tone recognition of speech using hidden Markov models",
   "original": "nos8_105",
   "page_count": 4,
   "order": 22,
   "p1": "105",
   "pn": "108",
   "abstract": [
    "The languages which use pitch variation to convey lexical information about the meaning of a syllable are called tone languages. For tone languages, a complete speech recognition system requires a tone recognition subsystem to properly recognize the meaning of a syllable. This paper studies tone recognition based on Hidden Markov Model techniques. A recognizer consisting of five semi-continuous HMMs has been trained for the five tones of Thai language. Recognition accuracy of 99% for a 4-state HMM has been achieved in speaker-independent recognition of isolated syllables. The complete tone recognition system has also been implemented for real-time operation by using TMS320C30 DSP.\n",
    ""
   ]
  },
  "suontausta98_norsig": {
   "authors": [
    [
     "Janne",
     "Suontausta"
    ],
    [
     "Marcel",
     "Vasilache"
    ],
    [
     "Kari",
     "Laurila"
    ]
   ],
   "title": "SCHMMs in digit dialing",
   "original": "nos8_109",
   "page_count": 4,
   "order": 23,
   "p1": "109",
   "pn": "112",
   "abstract": [
    "Hidden Markov models are a powerful tool for modeling speech signals. In the literature, several types of HMMs with their own advantages have been proposed. In this paper, the semi-continuous hidden Markov models (SCHMMs) are compared to the continuous density hidden Markov models (CDHMMs) in a noise robust con- nected digit recognition task. In the paper, we use a two-step training approach for SCHMMs. First, the codebook of densities and the initial model parameters are estimated, and finally discriminative training (DT) is applied. The CDHMMs are trained with the maximum likelihood (ML) method followed by DT. The experimental results indicate that the SCHMMs have similar performance as the CDHMMs with the same amount of parameters.\n",
    ""
   ]
  },
  "karjalainen98_norsig": {
   "authors": [
    [
     "Matti",
     "Karjalainen"
    ],
    [
     "Toomas",
     "Altosaar"
    ]
   ],
   "title": "An automated labeling tool for speech database work",
   "original": "nos8_113",
   "page_count": 4,
   "order": 24,
   "p1": "113",
   "pn": "116",
   "abstract": [
    "An automated speech signal labeling tool, developed for the QuickSig speech database environment, is described. It is based primarily on the use of neural networks as diphone event detectors. For robustness, only coarse categories of diphones, such as stop-vowel and vowel-nasal, are used. 64 such detectors are implemented to cover all of the Finnish diphones. The preprocessing of speech signals is carried out using warped linear prediction and the diphone events from neural network outputs are matched to the given text transcription using a simple rule-based parser. In a case study of isolated word labeling a well trained system makes less than 5 % of labeling errors, and the deviation of boundary positions, compared to careful manual labeling, is on average about 10 ms.\n",
    ""
   ]
  },
  "hansen98b_norsig": {
   "authors": [
    [
     "Anya Varnich",
     "Hansen"
    ]
   ],
   "title": "Spectrogram reading knowledge applied in HMM speech recognition",
   "original": "nos8_117",
   "page_count": 4,
   "order": 25,
   "p1": "117",
   "pn": "120",
   "abstract": [
    "Acoustic Parameters (APs) that are motivated by phonetic feature theory are employed as a signal representation in a Hidden Markov Model (HMM) recognition framework. A set of 14 phonetic features that uniquely describe the phonemes in the TIMIT database is designed and APs related to these features are applied for recognition of broad phonetic classes and phonemes. In a set of experiments the performance of the APs are compared to the performance of Mel Frequency Cepstrum Coefficients (MFCCs). When tested on the task of broad-class recognition the APs performs better than MFCCs. Also the APs show to be more robust to speaker variability than the MFCCs. In a phoneme recognition test MFCCs outperforms the APs.\n",
    ""
   ]
  },
  "jensen98_norsig": {
   "authors": [
    [
     "Jesper",
     "Jensen"
    ],
    [
     "Claus",
     "Nielsen"
    ],
    [
     "Ove",
     "Andersen"
    ],
    [
     "Egon",
     "Hansen"
    ],
    [
     "Niels-Jørn",
     "Dyhr"
    ]
   ],
   "title": "A speech synthesizer with modelling of the danish \"stoed\"",
   "original": "nos8_121",
   "page_count": 4,
   "order": 26,
   "p1": "121",
   "pn": "124",
   "abstract": [
    "In this paper we focus on issues related to a Danish concatenative Text-To-Speech (TTS) system. Particularly, we address the problem of the so-called Danish stoed (creaky voice). The stoed is distinctive and very common in Danish. Therefore, it is very important to have high-quality stoeds in Danish synthetic speech. Initial experiments show that concatenative synthesis schemes, e.g. TD-PSOLA, produce speech of poor quality in stoed segments. Therefore, we propose a synthesis scheme based on a residual excited linear prediction model, which proves successful in handling the stoed. Furthermore, we present a speech unit preprocessing algorithm, which modifies the intensity of voiced speech segments. This ensures that phones in the synthetic speech signal have a natural intensity interrelationship, and that intensity mismatches at speech unit concatenation points are minimized.\n",
    ""
   ]
  },
  "pellom98_norsig": {
   "authors": [
    [
     "Bryan L.",
     "Pellom"
    ],
    [
     "John H. L.",
     "Hansen"
    ]
   ],
   "title": "Trainable speech synthesis based on trajectory modeling of line spectrum pair frequencies",
   "original": "nos8_125",
   "page_count": 4,
   "order": 27,
   "p1": "125",
   "pn": "128",
   "abstract": [
    "In this paper we present a novel speaker-dependent speech synthesis algorithm based on modeling temporal trajectories of the speech Line Spectrum Pair Frequencies (LSFs). The overall approach is integrated into a pitch-synchronous analysis/synthesis framework and is shown to allow the synthesis of speaker-dependent voice characteristics through an automatic parameter learning algorithm.\n",
    ""
   ]
  },
  "egiazarian98_norsig": {
   "authors": [
    [
     "Karen O.",
     "Egiazarian"
    ],
    [
     "I. N.",
     "Aizenberg"
    ],
    [
     "N. N.",
     "Aizenberg"
    ],
    [
     "Jaakko T.",
     "Astola"
    ]
   ],
   "title": "On generalized discrete fresnel transforms",
   "original": "nos8_129",
   "page_count": 4,
   "order": 28,
   "p1": "129",
   "pn": "132",
   "abstract": [
    "In this paper we define the A-functions (generalized functions) of Fresnel using the concepts of generalized shift and convolution corresponding to any non-singular matrix operator A. The generalized Fresnel functions are used to define the generalized Fresnel transformations. In particular, when A is the discrete Fourier transform matrix, then the generalized Fresnel transformation will give the discrete-time version of the Fresnel transformation.\n",
    ""
   ]
  },
  "bysted98_norsig": {
   "authors": [
    [
     "Tommy K.",
     "Bysted"
    ],
    [
     "Ridha",
     "Hamila"
    ],
    [
     "Moncef",
     "Gabbouj"
    ],
    [
     "Markku",
     "Renfors"
    ]
   ],
   "title": "Teager correlation function",
   "original": "nos8_133",
   "page_count": 4,
   "order": 29,
   "p1": "133",
   "pn": "136",
   "abstract": [
    "A new correlation function called the Teager correlation function is introduced in this paper. The connection between this function, the Teager energy operator and the conventional correlation function is established. Two applications are presented. The first is the minimization of the Teager error norm and the second one is the use of the instantaneous Teager correlation function for simultaneous estimation of TDOA and FDOA (Time and Frequency Difference of Arrival).\n",
    ""
   ]
  },
  "hopperstad98_norsig": {
   "authors": [
    [
     "Jon-Fredrik",
     "Hopperstad"
    ],
    [
     "Sverre",
     "Holm"
    ]
   ],
   "title": "The coarray of sparse arrays with minimum sidelobe level",
   "original": "nos8_137",
   "page_count": 4,
   "order": 30,
   "p1": "137",
   "pn": "140",
   "abstract": [
    "Sparse arrays provide a large aperture with few elements. Through an exhaustive search of all possible thinning patterns for small linear sparse arrays, the Fourier properties of arrays with optimal coarray properties are explored. In addition coarray properties of sparse arrays with minimum peak sidelobe level are given. Minimum hole arrays have optimal low peak sidelobe level, while minimum redundancy arrays have a peak sidelobe level that is close to the global minimum. Other arrays with minimum peak sidelobe level have coarray properties similar to those of minimum hole and minimum redundancy arrays. Sparse arrays with optimal coarray qualities also possess optimal Fourier qualities.\n",
    ""
   ]
  },
  "egiazarian98b_norsig": {
   "authors": [
    [
     "Karen O.",
     "Egiazarian"
    ],
    [
     "I. N.",
     "Aizenberg"
    ],
    [
     "N. N.",
     "Aizenberg"
    ],
    [
     "Jaakko T.",
     "Astola"
    ]
   ],
   "title": "Cellular neural filters based on universal binary neurons",
   "original": "nos8_141",
   "page_count": 4,
   "order": 31,
   "p1": "141",
   "pn": "144",
   "abstract": [
    "Non-linear filters based on cellular neural networks with universal binary neurons (CNN-UBN) paradigm are considered in the paper. These filters give good results for such image processing problems as edge detection and impulsive noise removal. A basic idea is a separate processing of binary planes of gray-scale image by non-threshold Boolean functions which may be implemented using cellular neural network with universal binary neurons. They can be also considered in the framework of generalized threshold Boolean filters.\n",
    ""
   ]
  },
  "karvanen98_norsig": {
   "authors": [
    [
     "Juha",
     "Karvanen"
    ],
    [
     "Pauli",
     "Kuosmanen"
    ],
    [
     "Jaakko T.",
     "Astola"
    ]
   ],
   "title": "On output distributions of rational filters in the case of uniform noise",
   "original": "nos8_145",
   "page_count": 3,
   "order": 32,
   "p1": "145",
   "pn": "148",
   "abstract": [
    "This paper illustrates the difficulties in the evaluation of the output distributions of rational filters even when the assumptions of the relation between the signal and the noise are very simplified. We derive the output distribution analytically for one of the simplest rational filter for two i.i.d. uniformly distributed input samples. From this derivation the inherent difficulties can be understood.\n",
    ""
   ]
  },
  "potchinkov98_norsig": {
   "authors": [
    [
     "Alexander W.",
     "Potchinkov"
    ]
   ],
   "title": "The design of FIR filters via nonlinear semi-infinite optimization",
   "original": "nos8_149",
   "page_count": 4,
   "order": 33,
   "p1": "149",
   "pn": "152",
   "abstract": [
    "The advantages of optimization in filter design over strongly specialized methods based upon approximation theory are well known since some years, first of all in the area of constrained linear-phase filter design. Mainly finite linear optimization has been used which requires the discretization w.r.t. the frequency variable and, if necessary, the linearization of important nonlinear filter characteristics. The work here is founded on nonlinear semi-infinite optimization. This approach avoids the discretization step and thereby, in particular, enables the design of large filters on personal computers.\n",
    ""
   ]
  },
  "vesterbacka98_norsig": {
   "authors": [
    [
     "Mark",
     "Vesterbacka"
    ],
    [
     "Håkan",
     "Johansson"
    ],
    [
     "Kent",
     "Palmkvist"
    ],
    [
     "Lars",
     "Wanhammar"
    ]
   ],
   "title": "Implementation of narrow-band lattice wave digital filters",
   "original": "nos8_153",
   "page_count": 4,
   "order": 34,
   "p1": "153",
   "pn": "156",
   "abstract": [
    "Recently, a filter structure for narrow-band filtering based on lattice wave digital filters was introduced. The structure has increased parallelism over the corresponding direct realization. In this paper, hardware implementation of the filter structure is discussed. The suggested approach uses bit-serial processing elements that are scheduled so that a maximally fast implementation is achieved. An example is given where our implementation approach increases the sample frequency by a factor of 4 compared to a direct realization.\n",
    ""
   ]
  },
  "bysted98b_norsig": {
   "authors": [
    [
     "Tommy K.",
     "Bysted"
    ],
    [
     "Corneliu",
     "Rusu"
    ]
   ],
   "title": "Improving the stability of the LMF adaptive algorithm using the median filter",
   "original": "nos8_157",
   "page_count": 4,
   "order": 35,
   "p1": "157",
   "pn": "160",
   "abstract": [
    "The stability of the LMF (Least Mean Fourth) adaptive algorithm is improved by using the median of the gradient instead of the raw gradient for updating the coefficients of the adaptive filter. This operation has two advantages: first it improves the performance of the LMF in impulse noise environments and secondly it enables the use of a larger step-size of the adaptive algorithm especially when the signals are corrupted by noise. The disadvantages are a small raise in the computational complexity and a slower convergence than the LMF. Two examples are given which illustrate the behavior of the Median LMF compared to the LMF algorithm.\n",
    ""
   ]
  },
  "goode98_norsig": {
   "authors": [
    [
     "Amanda J.",
     "Goode"
    ],
    [
     "S. A.",
     "Harman"
    ]
   ],
   "title": "The auto-adaptive matched filter: a trainable matched filter for signal detection",
   "original": "nos8_161",
   "page_count": 4,
   "order": 36,
   "p1": "161",
   "pn": "164",
   "abstract": [
    "An isolated signal of known form obscured by noise and clutter can be optimally detected using a matched filter. In this paper we consider the more general problem of detecting an isolated signal belonging to a generic class containing a set of known signal types, as is the case for example in radar or acoustic signal detection or identification. We propose a technique for allowing the received (input) signal to select its own most likely matching signal from within an 'allowable signal domain' (ASD). This selected signal is then be transformed back into the original signal domain, and used to supply the weights for a 'matched' filter detector, which is then applied to the original input signal We refer to this technique as an auto-adaptive matched filter (AAMF): 'auto' because the input signal selects its own detector, 'adaptive' because the selected detector is adapted to the nearest allowable form.\n",
    ""
   ]
  },
  "johansson98_norsig": {
   "authors": [
    [
     "Håkan",
     "Johansson"
    ],
    [
     "Lars",
     "Wanhammar"
    ]
   ],
   "title": "A filter structure based on the frequency-response masking approach for high-speed recursive filtering",
   "original": "nos8_165",
   "page_count": 4,
   "order": 37,
   "p1": "165",
   "pn": "168",
   "abstract": [
    "A filter structure for high-speed recursive filtering is introduced. It is a simplification of a recently introduced structure, based on the frequency-response masking approach, which makes use of a periodic IIR model filter composed of two allpass subfilters in parallel, its complementary periodic model filter, and two linear-phase FIR masking filters. The simplified structure is obtained by letting the masking filters be related to each other in a certain way. This works if the passband and stopband edges of the overall filter are close to one quarter of the sampling frequency. The arithmetic complexity due to the masking filters can thereby be reduced, in some cases roughly by a factor of two.\n",
    ""
   ]
  },
  "baghaie98b_norsig": {
   "authors": [
    [
     "Ramin",
     "Baghaie"
    ],
    [
     "Timo",
     "Laakso"
    ]
   ],
   "title": "Implementation of low-power CDMA RAKE receivers using strength reduction transformation",
   "original": "nos8_169",
   "page_count": 4,
   "order": 38,
   "p1": "169",
   "pn": "172",
   "abstract": [
    "In a Code Division Multiple Access system operating in a multipath fading channel, a bank of RAKE receivers is needed for each active user at the base station. In this paper, low-power RAKE receivers are proposed that utilize the Strength Reduction (SR) transformation technique. The SR transformation can result in remarkable savings in consumed power and silicon area. A possible disadvantage of the SR transformation is that it increases the computation time of the critical path. However, this problem can be alleviated by different pipelining schemes.\n",
    ""
   ]
  },
  "gustafsson98_norsig": {
   "authors": [
    [
     "Oscar",
     "Gustafsson"
    ]
   ],
   "title": "A digit-serial polynomial basis GF(2m) multiplier",
   "original": "nos8_173",
   "page_count": 4,
   "order": 39,
   "p1": "173",
   "pn": "176",
   "abstract": [
    "This paper introduces a digit-serial GF(2W) multiplier for use in the polynomial basis. The multiplier works with the most significant digit first and is scalable to an arbitrary digit size and can be constructed for any GF(2m). It is derived from a commonly used MSB first bit-serial multiplier, known as the standard shift-register multiplier. As the latency of the multiplier decreases when the digit size increases, it is possible to minimize the complexity when the computational needs are known.\n",
    ""
   ]
  },
  "bramslw98_norsig": {
   "authors": [
    [
     "Lars",
     "Bramsløw"
    ]
   ],
   "title": "An object-oriented, multiprocessor DSP software architecture",
   "original": "nos8_177",
   "page_count": 3,
   "order": 40,
   "p1": "177",
   "pn": "180",
   "abstract": [
    "New software architecture has been developed for a multi-channel, multi-processor DSP measurement engine. It allows for dynamic booting, creation and connection of various signal processing and analysis elements. This software architecture, the element system, uses a proprietary real-time operating system as the foundation for a hierarchy of C++ classes. The software design is highly object-oriented, with use of inheritance and other C++ features. To overcome limitations in compiler optimization, all time-critical functions have been coded in assembly language.\n",
    ""
   ]
  },
  "nielsen98_norsig": {
   "authors": [
    [
     "Sofus Birkedal",
     "Nielsen"
    ]
   ],
   "title": "Versatile debugging tools for DSP-design",
   "original": "nos8_181",
   "page_count": 4,
   "order": 41,
   "p1": "181",
   "pn": "184",
   "abstract": [
    "Design of a DSP-system is an interaction of both hardware and software design and to manage this process a proper real time debugging tool is needed. During a period of more than 10 years the requirement for making small and cheap standalone DSP systems with real time debugging facilities has resulted in the development of a number of versatile Debugger/Monitor systems (D/M) for 3 generations of DSP's from Texas Instruments: TMS320-lx/2x/5x. These D/M-systems is just a program in an EPROM and an interface circuit to an RS 23 2-line which will turn a DSP-system into a complete real-time development system and eliminates the need for none real time simulators and expensive emulators.\n",
    ""
   ]
  },
  "riederer98_norsig": {
   "authors": [
    [
     "Klaus A. J.",
     "Riederer"
    ],
    [
     "Matti",
     "Karjalainen"
    ]
   ],
   "title": "DSP aspects of HRTF measurements",
   "original": "nos8_185",
   "page_count": 4,
   "order": 42,
   "p1": "185",
   "pn": "188",
   "abstract": [
    "This paper describes common DSP problems and solutions for transfer function measurements in linear and time invariant systems, reviewed in the light of a case study. General DSP aspects of head-related transfer function measurements performed in an object-oriented signal processing environment - QuickSig - are introduced.\n",
    ""
   ]
  },
  "hammershi98_norsig": {
   "authors": [
    [
     "Dorte",
     "Hammershøi"
    ],
    [
     "Jesper",
     "Sandvad"
    ]
   ],
   "title": "Using binaural synthesis for auditory virtual environment",
   "original": "nos8_189",
   "page_count": 4,
   "order": 43,
   "p1": "189",
   "pn": "192",
   "abstract": [
    "For experimental purposes a dynamic simulation of free-field environments has been developed, utilizing fast and accurate simulation of source direction. The simulation is made by means of binaural synthesis (using Head-related Transfer Functions) and the sound is presented by headphones. The synthesis method has been tested both in static and dynamic environments. Parameters relating to the measurement and processing of Head-related Transfer Functions, selection of filter representations and spatial resolution for the implementation of the Auditory Virtual Environment (AVE) system have been studied. Further, the significance of latency and update rate in the implementation of the dynamic AVE system has been investigated in the most recent experiments.\n",
    ""
   ]
  },
  "yensen98_norsig": {
   "authors": [
    [
     "Trevor N.",
     "Yensen"
    ],
    [
     "Rafik A.",
     "Goubran"
    ],
    [
     "Ioannis",
     "Lambadaris"
    ]
   ],
   "title": "A multiple participant CTI acoustic echo cancellation structure",
   "original": "nos8_193",
   "page_count": 4,
   "order": 44,
   "p1": "193",
   "pn": "196",
   "abstract": [
    "This paper presents a synthetic stereo acoustic echo cancellation structure for multiple participant, full-duplex, hands-free conferences and discusses the structural differences between this approach and that of true stereophony for computer telephony integration (CTI). Simulations using the synthetic stereo structure show that good tracking performance with low complexity is attainable. The synthetic stereo image is generated through the use of spatialization functions, which can be used to present simulated spatial information to the talker at the far-end if a monaural source is employed at the near-end. Furthermore, the traditional stereophonic problem of correlation between the two primary signals and system convergence to multiple solutions is eliminated by this structure.\n",
    ""
   ]
  },
  "johansen98b_norsig": {
   "authors": [
    [
     "Lars G.",
     "Johansen"
    ],
    [
     "Per",
     "Rubak"
    ]
   ],
   "title": "Application of the FXLMS algorithm in active noise reduction",
   "original": "nos8_197",
   "page_count": 4,
   "order": 45,
   "p1": "197",
   "pn": "200",
   "abstract": [
    "Application of the filtered-X LMS algorithm to adaptive/active noise cancelling in headsets or hearing protectors has been investigated. The speed of convergence and amount of obtainable noise reduction was investigated for different step-size parameters and FIR filter lengths. Simple models for the headphone transfer function and the sound transmission through the ear cups are applied. We have put focus on the limitations caused by the allpass part of the transfer function of the secondary sound source, the causality problem caused by the introduction of signal processing delays, and the requirement for accuracy of the estimated transfer function of the secondary sound source.\n",
    ""
   ]
  },
  "lokki98_norsig": {
   "authors": [
    [
     "Tapio",
     "Lokki"
    ],
    [
     "Riitta",
     "Väänänen"
    ],
    [
     "Lauri",
     "Savioja"
    ],
    [
     "Jyri",
     "Huopaniemi"
    ]
   ],
   "title": "Advanced 3-d audio in an interactive multimedia environment",
   "original": "nos8_201",
   "page_count": 4,
   "order": 46,
   "p1": "201",
   "pn": "204",
   "abstract": [
    "We present a digital signal processing (DSP) implementation of a virtual, interactive acoustic environment, which is a part of an audiovisual presentation in a digital interactive virtual acoustic research project. The process of modeling the sound propagation from a sound source to the listener is referred to as auralization, and it is described how this process is done by digital signal processing. Main emphasis is on the implementation of dynamic direct sound and early reflections, which is a part of the signal processing that changes along with the listener movements in the virtual environment. Many practical issues have to be taken into consideration when time-variant processing is done to produce an impression of naturally responding acoustic environment.\n",
    ""
   ]
  },
  "tolonen98_norsig": {
   "authors": [
    [
     "Tero",
     "Tolonen"
    ],
    [
     "Vesa",
     "Välimäki"
    ],
    [
     "Matti",
     "Karjalainen"
    ]
   ],
   "title": "A new sound synthesis structure for modeling the coupling of guitar strings",
   "original": "nos8_205",
   "page_count": 4,
   "order": 47,
   "p1": "205",
   "pn": "208",
   "abstract": [
    "A new structure for physics-based modeling of the guitar is proposed. The presented sound synthesis model is capable of simulating the coupling phenomena exhibited by vibrating guitar strings. The model is based on Commuted Waveguide Synthesis (CWS) and a formulation of digital waveguides called the Single Delay Loop (SDL) model. The proposed method can be applied for simulation of both the coupling of vibratory motion between strings and the interaction of the two polarization components of the transversal vibration of a single string.\n",
    ""
   ]
  },
  "wachtler98_norsig": {
   "authors": [
    [
     "Axel",
     "Wachtler"
    ],
    [
     "Rüdiger",
     "Hoffmann"
    ]
   ],
   "title": "Fast detection of synchronisation errors for the g.728 codec in plesiochronous transmission systems",
   "original": "nos8_209",
   "page_count": 4,
   "order": 48,
   "p1": "209",
   "pn": "212",
   "abstract": [
    "A new method for fast detection of frame synchronisation errors inside the G.728 decoder is described. The frame synchronisation of an G.728 decoder fails, if octet slips in a transmission systems occur. Octet slips are burst errors, which cause a shift of the word boundaries in the G.728 data stream. The decoder produces in this case a noisy output signal, which is uncorrelated with speech. The proposed algorithm uses information about the statistics of the energy of the excitation signal.\n",
    ""
   ]
  },
  "vuolahti98_norsig": {
   "authors": [
    [
     "Markus",
     "Vuolahti"
    ],
    [
     "Vesa T.",
     "Ruoppila"
    ]
   ],
   "title": "Performance of predictive vector quantizers in noisy channels",
   "original": "nos8_213",
   "page_count": 4,
   "order": 49,
   "p1": "213",
   "pn": "216",
   "abstract": [
    "Channel error resilience is a central issue when vector quantization is applied to mobile communication systems. In this paper we present an expression for the mean-square channel distortion of an autoregressive moving average vector quantizer with a maximum entropy encoder. According to simulations, the formula is approximately valid also for non-maximum entropy encoders when the bit error probability is small. Moreover, we compare noisy channel performance of memoryless, moving average, and auto-regressive vector quantizers in quantization of line spectrum frequencies using the US-TDMA enhanced full-rate speech codec (IS-641) as an example case. The results show the importance of a good index assignment for predictive vector quantizers.\n",
    ""
   ]
  },
  "skoglund98_norsig": {
   "authors": [
    [
     "Jan",
     "Skoglund"
    ],
    [
     "Jan",
     "Lindén"
    ]
   ],
   "title": "Aspects of split VQ for predictive LSF quantization",
   "original": "nos8_217",
   "page_count": 4,
   "order": 50,
   "p1": "217",
   "pn": "220",
   "abstract": [
    "The performance of split VQ compared to full dimensional VQ for line spectral frequencies is examined for memoryless VQ and linear predictive VQ. It is found that the relative loss due to the dimension reduction is the same for both quantization schemes. In addition to the prediction gain of a predictive VQ, it is also found to be more robust to various classes of speech material. A total gain of 6 bits can be achieved in comparison to a memoryless system.\n",
    ""
   ]
  },
  "hansen98c_norsig": {
   "authors": [
    [
     "Peter S. K.",
     "Hansen"
    ],
    [
     "Per Christian",
     "Hansen"
    ],
    [
     "Steffen Duus",
     "Hansen"
    ],
    [
     "John Aasted",
     "Sørensen"
    ]
   ],
   "title": "On speech enhancement algorithms based on signal subspace methods",
   "original": "nos8_221",
   "page_count": 4,
   "order": 51,
   "p1": "221",
   "pn": "224",
   "abstract": [
    "In this paper the signal subspace approach for non-parametric speech enhancement is considered. Several algorithms have been proposed in the literature but only partly analyzed. Here, the different algorithms are compared, and the emphasis is put onto the limiting factors and practical behavior of the estimators. Experimental results show that the signal subspace approach may lead to a significant enhancement of the signal to noise ratio of the output signal.\n",
    ""
   ]
  },
  "giurcaneanu98_norsig": {
   "authors": [
    [
     "Ciprian Doru",
     "Giurcaneanu"
    ],
    [
     "loan",
     "Tabus"
    ],
    [
     "Jaakko T.",
     "Astola"
    ]
   ],
   "title": "Linear prediction from subbands for lossless audio compression",
   "original": "nos8_225",
   "page_count": 4,
   "order": 52,
   "p1": "225",
   "pn": "228",
   "abstract": [
    "In this paper we propose the use of subband predictors in the prediction stage of adaptive context based lossless audio coding. The original wideband audio signal is first decomposed in subbands, linear prediction is then performed in each subband, possibly using different predictor orders, and finally the predicted values are transformed back to time domain. We take as a pilot signal decomposition the modulated lapped transform (MLT) and introduce several subband prediction algorithms, differing in the way the subband predictions are transferred back to time domain. Experimental results compare the entropy of prediction errors for the cases of subband prediction and fullband prediction.\n",
    ""
   ]
  },
  "harma98_norsig": {
   "authors": [
    [
     "Aki",
     "Härmä"
    ],
    [
     "Markus",
     "Vaalgamaa"
    ],
    [
     "Unto K.",
     "Laine"
    ]
   ],
   "title": "A warped linear predictive stereo codec using temporal noise shaping",
   "original": "nos8_229",
   "page_count": 4,
   "order": 53,
   "p1": "229",
   "pn": "232",
   "abstract": [
    "In this paper a new perceptual audio coding scheme is proposed. The codec is a combination of digital signal processing techniques which are supposed to work automatically in a perceptually convenient way. Those techniques are frequency warped linear predictive coding (WLP) and temporal noise shaping technique (TNS). In addition, a representation of a two-channel stereo signal as a single complex-valued signal is shown to be beneficial in respect to both techniques.\n",
    ""
   ]
  },
  "linden98_norsig": {
   "authors": [
    [
     "Jan",
     "Lindén"
    ]
   ],
   "title": "Design of channel optimized predictive VQ",
   "original": "nos8_233",
   "page_count": 4,
   "order": 54,
   "p1": "233",
   "pn": "236",
   "abstract": [
    "In this paper combined source-channel coding is considered for the case of predictive vector quantization. A design algorithm for channel optimized predictive vector quantizers is proposed. Under reasonable assumptions, the optimal encoder is presented and a sample iterative design method that simultaneously optimizes the predictor and the codebook is derived. Results are presented for a correlated Gauss-Markov process and speech LSF parameters.\n",
    ""
   ]
  },
  "breazu98_norsig": {
   "authors": [
    [
     "Macarie",
     "Breazu"
    ]
   ],
   "title": "Fractal image compression using deterministic search",
   "original": "nos8_237",
   "page_count": 4,
   "order": 55,
   "p1": "237",
   "pn": "240",
   "abstract": [
    "This paper introduces a new method based on deterministic search to fractal image compression. In order to find a good region-based partitioning, as required in fractal image compression, we propose a deterministic search method for finding the blocks to be merged. For each range, defined as union of frontier-connected atomic square image blocks, a list of best N domains is maintained. When two ranges are to be merged and their common edge disappears, for the new range the best N domains are selected only from the 2xN domain extension of the two ranges. At each step the edge with minimum collage error increase is selected and the two corresponding ranges are merged. The process starts with atomic blocks as ranges and ends when the desired number of ranges is achieved. Experimental results prove that our method yields a better rate-distortion curve than the classic quad-tree partition scheme.\n",
    ""
   ]
  },
  "thomsen98_norsig": {
   "authors": [
    [
     "Henrik F.",
     "Thomsen"
    ]
   ],
   "title": "A test statistics for validation of estimated phase ambiguities",
   "original": "nos8_241",
   "page_count": 4,
   "order": 56,
   "p1": "241",
   "pn": "244",
   "abstract": [
    "In the Global Positioning System (GPS) the Least squares AMBiguity Decorrelation Adjustment method (LAMBDA-method) is often used for estimating phase ambiguities. Until recently the validation of these estimates has been based on the test statistics called AT, but for this statistics no distributional results have been obtained. Therefore, two test statistics are proposed. The distributions of these test statistics are known. Three examples from a simple simulation illustrate aspects of the test variables.\n",
    ""
   ]
  },
  "oktem98_norsig": {
   "authors": [
    [
     "Rusen",
     "Öktem"
    ],
    [
     "Karen O.",
     "Egiazarian"
    ]
   ],
   "title": "Morphology based image compression with r-d optimized wavelet packet transform",
   "original": "nos8_245",
   "page_count": 4,
   "order": 57,
   "p1": "245",
   "pn": "248",
   "abstract": [
    "Statistical properties of wavelet coefficients play important role in wavelet transform based image coders. Wavelet packet (WP) transform coefficients exhibit similar statistical behavior as wavelet transform coefficients. Hence, efficient image coders which exploit statistical behavior of wavelet coefficients for better bit rate efficiency can be applied to wavelet packet decomposition based image coders as well. We present an algorithm to code WP decomposed coefficients using morphology based predicted significance maps. We use a rate-distortion (R-D) optimization to select best basis among a set of wavelet packet bases.\n",
    ""
   ]
  },
  "helsingius98_norsig": {
   "authors": [
    [
     "Mika",
     "Helsingius"
    ],
    [
     "Pauli",
     "Kuosmanen"
    ]
   ],
   "title": "Transform coding of quincunx sampled images",
   "original": "nos8_249",
   "page_count": 4,
   "order": 58,
   "p1": "249",
   "pn": "252",
   "abstract": [
    "Quincunx sampling is an elegant way to reduce the amount of data in images and video sequences. It has been used in simple image compression systems and sub-band coding, but seldom in block transform coding. This paper introduces a new combination of nonlinear quincunx interpolation and transform coding, it is intended for low bitrate applications. A special separable 3D transform is proposed for the transformation of quincunx sampled rectangular blocks. Proposed methods do not notably improve PSNR/bitrate over normal transform coding, but they can reach the same ratio with much less quantisation. The main advantage of the proposed method is the clearly improved, subjective image quality.\n",
    ""
   ]
  },
  "hansen98d_norsig": {
   "authors": [
    [
     "Lars Kai",
     "Hansen"
    ],
    [
     "Jan",
     "Larsen"
    ]
   ],
   "title": "Source separation in short image sequences using delayed correlation",
   "original": "nos8_253",
   "page_count": 4,
   "order": 59,
   "p1": "253",
   "pn": "256",
   "abstract": [
    "This paper addresses the use of blind sources separation techniques for analysis of short image sequences (multi-dimensional signals). We suggest a modification of Molgedey and Schuster's [8] approach allowing for an arbitrary number of source signals. The viability of the new algorithm is illustrated on a toy-problem image sequence separation problem.\n",
    ""
   ]
  },
  "huttunen98_norsig": {
   "authors": [
    [
     "Heikki",
     "Huttunen"
    ],
    [
     "Pauli",
     "Kuosmanen"
    ]
   ],
   "title": "Computational aspects of multivariate RCRS filters",
   "original": "nos8_257",
   "page_count": 4,
   "order": 60,
   "p1": "257",
   "pn": "260",
   "abstract": [
    "Different methods for software implementation of basic and multivariate rank conditioned rank selection (RCRS) filters are studied. The methods are compared and general guidelines for selecting the best method for a specific situation are given. The number of feature vectors in a typical training data set for typical RCRS filters is studied through experiments and theory, and conclusions concerning the size of the training data set are drawn thereof.\n",
    ""
   ]
  },
  "rsten98_norsig": {
   "authors": [
    [
     "Tage",
     "Røsten"
    ],
    [
     "Patrick",
     "Waldemar"
    ]
   ],
   "title": "On the performance of 2-d pre-stack seismic data compression after NMO correction",
   "original": "nos8_261",
   "page_count": 4,
   "order": 61,
   "p1": "261",
   "pn": "264",
   "abstract": [
    "This paper examines the effect of using a simple pre-processing scheme, normal moveout (NMO) correction, in compression of 2-D pre-stack seismic data. Important topics in our discussion of NMO correction are: cost in terms of side information bit rate, existence of inverse NMO, mute zone of NMO, and discuss the use of simple but invertible pre-processing alternatives. By evaluating the simulation results after stacking we conclude that in the synthetic data example the applied NMO correction improves the compression performance especially for low bit rates. In the real data example, however, the applied NMO correction gives only comparable or slightly improved results at low bit rates. In the synthetic and the real case, the NMO corrections allowed stretching up to 50 % and 30 %, respectively, before mutes were performed.\n",
    ""
   ]
  },
  "rsten98b_norsig": {
   "authors": [
    [
     "Tage",
     "Røsten"
    ],
    [
     "Tore",
     "Fevang"
    ],
    [
     "Tor A.",
     "Ramstad"
    ]
   ],
   "title": "2-d post-stack seismic data migration in the subband domain",
   "original": "nos8_265",
   "page_count": 4,
   "order": 62,
   "p1": "265",
   "pn": "268",
   "abstract": [
    "In this paper we present a dyadic tree-structured subband decomposition approach to seismic migration. It gives an interpretation of the seismic data in terms of multiscale representation. The proposed subband migration consists of the usual extrapolation and imaging steps and provides a scheme that in principle is efficient. Unfortunately, unwanted cross-terms are introduced in the subband migration due to aliasing. Nevertheless, a step-by-step multiscale approach gives the user a handle to choose between resolution and efficiency. The applicability of the proposed subband migration is illustrated with synthetic data examples.\n",
    ""
   ]
  },
  "abeyratne98_norsig": {
   "authors": [
    [
     "Udantha R.",
     "Abeyratne"
    ]
   ],
   "title": "Signal reconstruction from bispectrum slices in biomedical applications",
   "original": "nos8_269",
   "page_count": 4,
   "order": 63,
   "p1": "269",
   "pn": "272",
   "abstract": [
    "We propose techniques for non-minimum phase signal restoration from arbitrarily oriented one dimensional slices of their 3-rd order spectra (bispectra). We show that one oblique, arbitrary slice of the bispectrum carries sufficient information to estimate the impulse response of a complex valued system within a scaling factor and a time shift. The performance of the proposed techniques are investigated through Monte Carlo simulations. The significance of the proposed technique in medical signal processing are illustrated via analyzing EEG data from normal and alcoholic subjects.\n",
    ""
   ]
  },
  "aase98_norsig": {
   "authors": [
    [
     "Sven Ole",
     "Aase"
    ],
    [
     "Ranveig",
     "Nygaard"
    ],
    [
     "John Håkon",
     "Husøy"
    ]
   ],
   "title": "A comparative study of some novel ECG data compression techniques",
   "original": "nos8_273",
   "page_count": 4,
   "order": 64,
   "p1": "273",
   "pn": "276",
   "abstract": [
    "This paper presents a comparison of modern time and frequency domain coding of ElectroCardioGram (ECG) signals. A set of different subband decompositions are compared for coding purposes. These results are then compared with a time domain linear interpolation technique which is optimal with respect to reconstruction error given the number of retained samples. Comparing the optimized time domain solution to the subband coders, we observe better performance for the latter class of coders in terms the percentage root mean square difference (PRD) performance measure. The observations referred to above is confirmed and complemented by visual inspection of the reconstructed signals.\n",
    ""
   ]
  },
  "engan98_norsig": {
   "authors": [
    [
     "Kjersti",
     "Engan"
    ],
    [
     "John Håkon",
     "Husøy"
    ],
    [
     "Sven Ole",
     "Aase"
    ]
   ],
   "title": "Optimized frames of variable size for use in a matching pursuit based compression scheme",
   "original": "nos8_277",
   "page_count": 4,
   "order": 65,
   "p1": "277",
   "pn": "280",
   "abstract": [
    "A compression scheme based on optimized frames and Matching Pursuit (MP) algorithms is presented. Several different frames are used in the scheme, each optimized for a specific number of selected frame vectors in each approximation. The frame design algorithm is iterative and requires a training set. The use of several frames optimized for different numbers of vectors instead of using one frame requires very little extra side information. In this paper the optimized frames in the compression scheme have different sizes. We apply the frame design algorithm and the complete multi-frame compression scheme to electrocardiogram (ECG) signals. Coding experiments demonstrate improved rate-distortion performance relative to Discrete Cosine Transform (DCT) with run-length entropy coding and more conventional frame based schemes.\n",
    ""
   ]
  },
  "holm98_norsig": {
   "authors": [
    [
     "Henrik",
     "Holm"
    ],
    [
     "Hans",
     "Torp"
    ]
   ],
   "title": "Signal models of nonlinear acoustics in ultrasound imaging",
   "original": "nos8_281",
   "page_count": 3,
   "order": 66,
   "p1": "281",
   "pn": "283",
   "abstract": [
    "Harmonic tissue imaging, i.e. in ultrasound tissue imaging, receiving at twice the transmit frequency, turns out to be a promising tool for enhancing image quality. Forward propagated and backscattered signals were recorded in water-tank experiments, with increasing amplitude and in different positions. The first and second harmonic components of received signal were extracted and plotted. The amplitude in the first harmonic component varies approx-imately linearly as a function of transmit amplitude, while the second harmonic component is proportional to A1-7) where A is the transmit amplitude. The results also indicate that nonlinear scattering is a minor effect compared to nonlinear propagation in generation of second harmonic components in the received signal. This is the case for muscular tissue, but certain results indicate that membranes may scatter nonlinearly, thus producing a second harmonic signal which improve display of membrane-like structures in the body.\n",
    ""
   ]
  }
 },
 "sessions": [
  {
   "title": "Tutorials",
   "papers": [
    "hansen98_norsig",
    "lee98_norsig",
    "sinkjr98_norsig"
   ]
  },
  {
   "title": "Keynotes",
   "papers": [
    "elstrm98_norsig",
    "skinnemoen98_norsig",
    "mller98_norsig"
   ]
  },
  {
   "title": "Signal Processing for Wireless Communication Systems",
   "papers": [
    "bengtsson98_norsig",
    "coward98_norsig",
    "tschudin98_norsig",
    "minn98_norsig",
    "werner98_norsig",
    "lethespensen98_norsig",
    "baghaie98_norsig",
    "grythe98_norsig",
    "skinnemoen98b_norsig"
   ]
  },
  {
   "title": "Speaker and Speech Recognition",
   "papers": [
    "sarikaya98_norsig",
    "olsen98_norsig",
    "zhou98_norsig"
   ]
  },
  {
   "title": "Speech Recognition and Synthesis",
   "papers": [
    "karaca98_norsig",
    "viikki98_norsig",
    "johansen98_norsig",
    "hasan98_norsig",
    "suontausta98_norsig",
    "karjalainen98_norsig",
    "hansen98b_norsig",
    "jensen98_norsig",
    "pellom98_norsig"
   ]
  },
  {
   "title": "Digital Signal Processing",
   "papers": [
    "egiazarian98_norsig",
    "bysted98_norsig",
    "hopperstad98_norsig"
   ]
  },
  {
   "title": "Filter Structures, Design, and Applications",
   "papers": [
    "egiazarian98b_norsig",
    "karvanen98_norsig",
    "potchinkov98_norsig",
    "vesterbacka98_norsig",
    "bysted98b_norsig",
    "goode98_norsig"
   ]
  },
  {
   "title": "Implementation of DSP Algorithms",
   "papers": [
    "johansson98_norsig",
    "baghaie98b_norsig",
    "gustafsson98_norsig",
    "bramslw98_norsig",
    "nielsen98_norsig"
   ]
  },
  {
   "title": "Audio Processing",
   "papers": [
    "riederer98_norsig",
    "hammershi98_norsig",
    "yensen98_norsig",
    "johansen98b_norsig",
    "lokki98_norsig",
    "tolonen98_norsig"
   ]
  },
  {
   "title": "Speech Coding and Enhancement",
   "papers": [
    "wachtler98_norsig",
    "vuolahti98_norsig",
    "skoglund98_norsig",
    "hansen98c_norsig"
   ]
  },
  {
   "title": "Audio and Speech Coding",
   "papers": [
    "giurcaneanu98_norsig",
    "harma98_norsig",
    "linden98_norsig"
   ]
  },
  {
   "title": "Multidimensional Signal Processing",
   "papers": [
    "breazu98_norsig",
    "thomsen98_norsig",
    "oktem98_norsig",
    "helsingius98_norsig",
    "hansen98d_norsig",
    "huttunen98_norsig",
    "rsten98_norsig",
    "rsten98b_norsig"
   ]
  },
  {
   "title": "Medical Image and Signal Processing",
   "papers": [
    "abeyratne98_norsig",
    "aase98_norsig",
    "engan98_norsig",
    "holm98_norsig"
   ]
  }
 ]
}