{
 "title": "ESCA Workshop on Phonetics and Phonology of Speaking Styles",
 "location": "Barcelona, Catalonia, Spain",
 "startDate": "30/9/1991",
 "endDate": "2/10/1991",
 "conf": "PPST",
 "year": "1991",
 "name": "ppst_1991",
 "series": "",
 "SIG": "",
 "title1": "ESCA Workshop on Phonetics and Phonology of Speaking Styles",
 "date": "30 September - 2 October 1991",
 "papers": {
  "argente91_ppst": {
   "authors": [
    [
     "Joan A.",
     "Argente"
    ]
   ],
   "title": "From speech to speaking styles",
   "original": "pp91_001",
   "page_count": 12,
   "order": 1,
   "p1": "paper 001",
   "pn": "",
   "abstract": [
    "When E. Sapir wrote his book Language (1921), he put on it a subtitle: An Introduction to the Study of Speech. Obviously he took the term \"speech\" in a fairly common use in American English, meaning the whole set of language phenomena. By that time or shortly after this term was made more specific in part as a result of F. de Saussure linguistic theories and in part as a result of the advancements in phonetic science. Indeed, at least since the late F. de Saussure and his langue/parole dichotomy - uneasily translated into English as language/speech by Gardner - linguists have always distinguished between these two facets of \"language\" and have accepted the interpretation of them advanced by the Swiss linguist within the framework of his systematic notion of language phenomena.\n",
    "Let us pick up some ingredients from this interpretation, all of them of interest to our present discussion. The first one and the most relevant one is the opposition between the systematic or patterned, and the unsystematic or unpatterned. This opposition is supposed to underlie the language/speech dichotomy, in such a way that facts in \"language\" according to Saussure, arc patterned, i.e. they may be described through rules, whereas facts in \"speech\" are unpatterned, unpredictable, apparently ungoverned by rules.\n",
    "The second opposition is that between the social and the individual. \"Language\" is the result of social behaviour, whereas \"speech\" is the sum total of all individual acts of speech. As far as linguistics is, according to Saussure, part of semiotics, and semiotics is part of social psychology, and as far as \"language\" - not \"speech\" - is the proper object of Saussurean linguistics, \"language\" is understood as a semiotic and socio-psychological reality. By contrast, \"speech\" is understood as the result of non semiotic individual behaviour, as a phonetico-physiological or physico-acoustical event or set of events.\n",
    "Summarizing, language in the Saussurean sense is seen as something subject to regular pattern, the result of social activity, and socio-psychological in its nature, whereas speech is assumed to be something unpatterned, the result of individual behaviour, and phonetico-physiological or physico-acoustical in its nature. Moreover, two new assumptions were made: 1) language is something homogeneous; 2) language functions are to be studied in a general way, as universal propperties of it. The chomskyan view of linguistics did not basically modified these assumptions, except for the fact that cognitive psychology substituted for social psychology, homogeneity was interpreted psychologically in terms of instantaneous language learning uniformity and biologically in terms on genotype invariability, and lastly language function was of no concern at all.\n",
    "This picture was generally accepted and remained unchallenged at least until the mid-sixties - notwithstanding the marginal study of phenomena such as the so-called \"phonetic symbolism\" or even the developement of acoustic phonetics. In fact, it was not until the emergence of sociolinguistics that either these assumptions or their consequences were severely critized by the founders of the new discipline.\n",
    "To begin with the latter, from a methodological standing, W. Labov (1970) critized F. de Saussure and his followers for they tried to study \"language\" -i.e. \"la langue\", the social aspect of \"le langage\" - through the observation of one individual's linguistic output, while tried to study \"speech\" - i.e. \"la parole\", the individual aspect of \"le langage\" - through the observation of the whole community's linguistic output - or, it would be better to say that they programmatically conceived of this study in such a way. That is the basis for what W. Labov termed \"the Saussurean paradox\".\n",
    "On the other hand, D. Hymes (1962) critized the reductionist Saussurean view of speech as a merely physiological or physico-acoustical fact, for, even if speech could be conceived in such a way, speaking, he argued, is also a social fact, a social activity among other social activities, and as such, it is a form of patterned human behaviour, so rule-governed as any other form of meaningful behaviour. These rules are language-specific, culture-specific even community-spedfic -which means that every culture and every community assign a different place to speaking and to the several meaningful ways of speaking relevant within it, and it is the labour of the analyst to discover them. As a consequence, an ethnographic approach to the study of language is proposed, an approach that must study language, language luncSons and the ways of speaking from speech community to speech-community, without taking either ones nor the others for granted in a universaBstic bias, as Jakobson's, functional approach had did (I960). A new kind of linguistic relativism - the relativity of function, as opposed to the relativity of form once uncovered by Sapir (1922) - emerges from Hymes conception.\n",
    "By the same sort, language ceases to be considered as an all-embracing monolithic structure, and a new concept of the \"verbal repertoire\" -understood as the total set of language resources at the disposal of a speech^omtriunity and shared to different degrees by any of its members- is fostered by Gumperz (1971), who gathers the ethnography of speaking and extends towards an ethnography of communication.\n",
    "In this way, sociolinguistics, whose foundations are to be found in the linguistic study of bilingualism developed in the work of such researchers as a U. Weinreich (1953), E. Haugen and W.F. Mackey at the half of the century, turned out to have language diversityas its main topic of research. Now, language diversity was to be found not only in multiling;ual communities but also in the core of so-called monolingual cornmunities, as far^Htliese present their own diversity, i.e. what has been termed f1iiffierent variation\" by Labov (1969). This conclusion obviously was a challenge to the umtarian-homogeneous notion of language, sustained by the mainstream thought of linguistics throughout the century.\n",
    "Finally -may be also innecessarily to add-, all trends in sociolinguistics share the idea that language use, and so speaking too, is a patterned activity that may be described through rules or norms, albeit of a different type than those usually employed in Uri^istic             I will distinguish sociolinguistic rales -describing the existence of socio-symbolic alternative variants of a sociolinguistic variable, ex. g. French personal pronoun forms for 2nd person sg. tulvous (\"you\"), or English proper names and hypochoristic James/Jim , from communicative norms, describing the social and interpersonal conditions to be held for one or the other of these forms to be used appropriately, although in a sense both types of rules were collapsed into one with Labpy's not on of a \"variable rule\". Further, communicative norms include also those governing verbal interaction,or those stating when it is appropriate to speak or remain silent in a given context.\n",
    ""
   ]
  },
  "granstrom91_ppst": {
   "authors": [
    [
     "Björn",
     "Granström"
    ]
   ],
   "title": "The use of speech synthesis in exploring different speaking styles",
   "original": "pp91_003",
   "page_count": 10,
   "order": 2,
   "p1": "paper 003",
   "pn": "",
   "abstract": [
    "The possibility to vary speaker type and speaking style will be a feature of the next gen- eration text-to-speech systems. Already today, the need for these possibilities are appar- ent, in dialogue systems and when speech synthesis is used as prostheses for persons with a communication handicap. Much of the information needed is not yet available. In this contribution we argue that speech synthesis itself is an efficient tool to study and understand variability in speech. Some different methods are reviewed, representing both analysis/synthesis techniques and signal manipulations as well as text-to-speech. The main emphasis is on the work at KTH to study the variation of speaker and speak- ing styles in the context of our text-to-speech system.\n",
    ""
   ]
  },
  "lindblom91_ppst": {
   "authors": [
    [
     "Björn",
     "Lindblom"
    ],
    [
     "S.",
     "Brownlee"
    ],
    [
     "B.",
     "Davis"
    ],
    [
     "S. J.",
     "Moon"
    ]
   ],
   "title": "Speech transforms",
   "original": "pp91_004",
   "page_count": 10,
   "order": 3,
   "p1": "paper 004",
   "pn": "",
   "abstract": [
    "We begin by summarizing three projects currently in progress at the UT Phonetics Lab in Austin. Then, in conclusion, we shall broaden the perspective and briefly consider some of the theoretical implications of our results.\n",
    ""
   ]
  },
  "ohala91_ppst": {
   "authors": [
    [
     "John J.",
     "Ohala"
    ]
   ],
   "title": "What is the input to the speech production mechanism?",
   "original": "pp91_005",
   "page_count": 14,
   "order": 4,
   "p1": "paper 005",
   "pn": "",
   "abstract": [
    "In the fascinating history of the development of the different forms of the Roman alphabet there is a period between the 3rd and 10th centuries when the small letters, the so-called 'lower case' or uncials, developed gradually from the angular, largely straight-line Roman capitals. The curves and new lines joining parts of the letters came about when writing was done more on paper than in stone or wax, more with pen or reed than with chisel or stylus, such that it was done more rapidly and without lifting the writing instrument off the inscribed surface. Here we can see how task constraints: writing rapidly, and physical properties and limitations of the hand and of the material used led to a modification of letter shape. Yet when we use lower-case letters today, whether with a typewriter, word processor, or even in handwriting, it is not true that they are present due to these original constraints of the task, the writer, and the instruments. Lower-case letters as opposed to capital letters have been fossilized or conventionalized. Even so, contemporary handwriting may still show many of the effects from the same forces that originally led to the development of the uncials: parts of letters not previously joined - capitals or uncials - are often linked by a curve by virtue of the writer not lifting the pen from the paper.\n",
    "Variant forms of pronunciation are similar to this. Some of the variants observed in speech are fossilized remnants of earlier modifications of speech due to speaking rapidly or softly and others are modifications due to the same factors acting at present - on-line, so to speak. The first type of variants are selected by the speaker as capitals and lower-case are: they are drawn from an inventory of separate norms. The second type of variants are not so much selected by the speaker as they are just consequences of physical and physiological constraints of the speaking mechanism which accompany choice of a different speech style (e.g., the more open jaw position of shouting, the lesser amplitude of articulatory movement when speaking rapidly). In the second case, the variants may spring from a single norm.\n",
    "In studies of speech production it is important to know what the input to, the speech production mechanism is but unfortunately it is not as easy to differentiate between these two types of variants in speech as it is in writing. For one thing, speech norms have no existence outside of the mouths (or more properly, the brains) of speakers; norms for letter shapes have the advantage that they can be printed in, and consulted in books. Second, in some cases the discipline studying such variants, phonology, has never succeeded in developing a viable method to differentiate these two types of variant. It is only a slight oversimplification to say that there is only one fully developed method in phonology (so far) when it comes to giving an account of variation: this is the method of comparative reconstruction plus two more restricted methods which are based on it: internal reconstruction and phonemic analysis.\n",
    "Many of those working on spoken language may think that the concerns and methods of the historical linguist are irrelevant to their interests. This is not the case, though, because virtually all the \"linguistic\" information as to the underlying structure of speech (i.e., the \"norms\" according to which speech is generated) comes from linguists who, whether they know it or not, base their pronouncements on an application of the comparative method. Understanding the strengths and weaknesses of the method therefore is vitally important to an informed study of the variations in pronunciation. In what follows I propose first to give a brief sketch of the comparative method and to point out some of its successes and limitations as they impact on the study of speech variation. Then I will suggest very programmatically how new methods may be developed which would better serve these new interests.\n",
    ""
   ]
  },
  "rischel91_ppst": {
   "authors": [
    [
     "Jørgen",
     "Rischel"
    ]
   ],
   "title": "Formal linguistics and real speech",
   "original": "pp91_006",
   "page_count": 10,
   "order": 5,
   "p1": "paper 006",
   "pn": "",
   "abstract": [
    "This paper discusses the nature of the data that form the input to linguistic descriptions, particularly with regard to the greater or lesser artificiality of such data. The paper argues in favour of a much stronger emphasis in linguistic work on natural speech data even including spontaneous speech. A major part of the paper is devoted to a general discussion of some preliminaries to the study of linguistic variation in natural speech.\n",
    ""
   ]
  },
  "aguilarcuevas91_ppst": {
   "authors": [
    [
     "Lourdes",
     "Aguilar Cuevas"
    ],
    [
     "M. Jesus",
     "Machuca Ayuso"
    ],
    [
     "Gemma",
     "Martínez Dauden"
    ]
   ],
   "title": "Analysis of the Spanish sequence \"de\" in content words and in function words in continuous speech",
   "original": "pp91_007",
   "page_count": 4,
   "order": 6,
   "p1": "paper 007",
   "pn": "",
   "abstract": [
    "The aim of this paper is to determine whether the sequence \"de\" has a different acoustic behaviour when it is a preposition and when it appears as an unstressed syllable of a word. The items analized have been obtained from a sixty minutes recording of speech produced by a male native speaker of Spanish. Broadband spectrograms were made with a MacSpeech Lab II programme in order to analyse the following parameters: consonant duration, vowel duration, CV syllable duration, and vowel formant frequencies. The results suggest that a change in the grammatical function of a given segment implies a change in the acoustic properties of this segment.\n",
    ""
   ]
  },
  "ball91_ppst": {
   "authors": [
    [
     "Martin J.",
     "Ball"
    ]
   ],
   "title": "Connected speech in Welsh: stress and pitch in conflict",
   "original": "pp91_008",
   "page_count": 5,
   "order": 7,
   "p1": "paper 008",
   "pn": "",
   "abstract": [
    "This paper will examine certain connected speech characteristics of Welsh, in particular the interaction of stress and pitch. Welsh, with a few exceptions, has fixed stress on the penultimate syllable. Major pitch movements, however, have been described as occurring principally on the final syllable of regularly stressed lexical items. Unusually, therefore, pitch movements as part of the intonation system do not coincide with stressed syllables.\n",
    "This conflict has implications for changes observed between citation forms of certain common functives and the forms encountered in connected speech, in that there are regular deletions of stressed penultimates with  the retention of unstressed final syllables.\n",
    "The paper will briefly outline both the stress system of Welsh, and the main intonation patterns utilised in southern varieties of the language. It will then illustrate the conflict between stress and pitch in connected speech described above. In conclusion, a possible explanation for the dual positioning of the stress and pitch is discussed.\n",
    ""
   ]
  },
  "barry91_ppst": {
   "authors": [
    [
     "Martin C.",
     "Barry"
    ]
   ],
   "title": "Assimilation and palatalisation in connected speech",
   "original": "pp91_009",
   "page_count": 5,
   "order": 8,
   "p1": "paper 009",
   "pn": "",
   "abstract": [
    "An investigation is reported into the phonostylistic variation encountered in the distribution of palatalisation in consonant-clusters in Russian. EPG evidence from two speakers suggests that while the spread of palatalisation does not vary with speaking rate or style, the lingual gesture constituting palatalisation is shown to be sensitive to speech-rate, diminishing in magnitude with increased speaking rate. This phenomenon is compared with measurements of other lingual gestures; it is seen that while the coronal gesture employed in the formation of dental stops shows no such susceptibility, a similar reduction in gesture-magnitude characterises dental nasals in clusters. A comparison is made between the spread of palatalisation and the assimilation of a dental nasals to the place of articulation of a following velar or labial in tautosyllabic clusters. In both cases speakers of Russian have access to phonological processes determining discrete categorical assimilations; at the same time speakers exhibit a tendency elsewhere for a lingual gesture to weaken in the circumstances of increased speaking rate. Such weakening does not appear to be tractable within conventional phonological descriptions, while none the less staking a claim to inclusion within the heading of 'the speaker's knowledge of how the language is pronounced' which may be taken as a broad definition of the subject matter of phonological theory.\n",
    ""
   ]
  },
  "bergem91_ppst": {
   "authors": [
    [
     "Dick R. van",
     "Bergem"
    ]
   ],
   "title": "Acoustic and lexical vowel reduction",
   "original": "pp91_010",
   "page_count": 5,
   "order": 9,
   "p1": "paper 010",
   "pn": "",
   "abstract": [
    "In this paper two different types of vowel reduction are discussed. Acoustic vowel reduction is a loss of vowel quality due to a relaxed articulation in less informative parts of an utterance. The effect of acoustic vowel reduction is illustrated with an experiment. Lexical vowel reduction is the substitution of one vowel by another that is easier to pronounce. It is hypothesized that lexical vowel reduction is the systematic extension of acoustic vowel reduction.\n",
    ""
   ]
  },
  "bhatt91_ppst": {
   "authors": [
    [
     "Parth",
     "Bhatt"
    ],
    [
     "Pierre",
     "Léon"
    ]
   ],
   "title": "Melodic patterns in three types of radio discourse",
   "original": "pp91_011",
   "page_count": 5,
   "order": 10,
   "p1": "paper 011",
   "pn": "",
   "abstract": [
    "In a preceding article (Bhatt and Leon, 1991) temporal variables of three types of radio discourse (Newscasts, Concert Introductions and North American Football commentaries) were studied. Newscasts were found to have a relatively fast articulatory rate, with an irregular distribution of syllable quantity. Concert Introductions were much more regular in speed and distribution, whereas Football commentaries were found to contain unpredictable variations. The aim of this paper is to analyze melodic markers in the same corpus.\n",
    "A number of researchers have remarked upon the highly conventional nature of accentual and intonational patterns in the speech of radio and television announcers (see, for example, D. Bolinger, 1989; D. Crystal and D. Davy, 1969; I. Fonagy and P. Leon, Eds., 1979; V. Lucci 1983). Our purpose here is to discover the extent to which these patterns can in themselves be recognized and distinguished without the presence of referential information. If these patterns are recognizable on their own this would give support to the hypothesis that prosodic markers have their own autonomous structure (especially on the macro-structural level) independent of lexical, semantic or syntactic cues.\n",
    ""
   ]
  },
  "blaauw91_ppst": {
   "authors": [
    [
     "Eleonora",
     "Blaauw"
    ]
   ],
   "title": "Phonetic characteristics of spontaneous and read-aloud speech",
   "original": "pp91_012",
   "page_count": 5,
   "order": 11,
   "p1": "paper 012",
   "pn": "",
   "abstract": [
    "Our research investigates which phonetic characteristics of spontaneous and read-aloud speech enable listeners to distinguish between the two* Material containing vocal hesitations, ungrammatical pauses, and/or poorly marked syntactic boundaries (48 non-fluent utterances) and material containing none of these features (48 fluent utterances) was selected from a spontaneous monologue of one speaker. This material was transcribed! and read aloud by the same speaker. In a listening experiment subjects were able to identify these read-aloud and spontaneous utterances correctly. Moreover, the presence of non-fluencies in spontaneous utterances does not substantially facilitate identification. Correlations between identification scores and some potential cues are presented.\n",
    ""
   ]
  },
  "bruce91_ppst": {
   "authors": [
    [
     "Gösta",
     "Bruce"
    ],
    [
     "Paul",
     "Touati"
    ]
   ],
   "title": "On the analysis of prosody in spontaneous speech with exemplification from Swedish and French",
   "original": "pp91_013",
   "page_count": 5,
   "order": 12,
   "p1": "paper 013",
   "pn": "",
   "abstract": [
    "This paper reports on a methodology developed to study prosody in spontaneous speech, incorporating four different kinds of analysis. Two of them, auditory analysis and acoustic-phonetic analysis applied to a corpus of spontaneous speech in Swedish and French, are presented. Speaking styles in both languages are illustrated with examples of pitch patterns used in read versus spontaneous Swedish and in political rhetoric in French.\n",
    ""
   ]
  },
  "caelenhaumont91_ppst": {
   "authors": [
    [
     "Genevieve",
     "Caelen-Haumont"
    ]
   ],
   "title": "Linguistic and prosodic features of speaking styles in French text readings",
   "original": "pp91_014",
   "page_count": 7,
   "order": 13,
   "p1": "paper 014",
   "pn": "",
   "abstract": [
    "This paper aims at putting forward some speech styles which are based on the use by 12 speakers of two semantic model patterns and specific pitch parameters under three sets of reading instructions. These semantic patterns give rise to a weighting. All the numeric values issued from semantic models and from pitch parameters are reduced to a four-level scale in order to make all the conditions comparable. This four-level scale seems to be a good compromise between the little part of text signification that each model conveys and all the other factors, linguistic and extra-linguistic. Finally the study shows that the model distribution is a function of the instruction strengh, when pitch parameter distribution, whatever the reading instruction may be, is nearly the same : the stricter the instructions are, the slower the speech rate, and the greater the propotion of models which take semantically into account local lexical relations.\n",
    ""
   ]
  },
  "cagliari91_ppst": {
   "authors": [
    [
     "Luiz Carlos",
     "Cagliari"
    ]
   ],
   "title": "Linguistic functions of prosody",
   "original": "pp91_015",
   "page_count": 6,
   "order": 14,
   "p1": "paper 015",
   "pn": "",
   "abstract": [
    "This paper is an outline of the most important linguistic functions of the prosodic units. These units are defined as phonetic features that have at least the length of a syllable, such as tones, intonation, tessitura, mora, pause, stress, rhythm, arsis/tesis, loudness, register and voice quality.\n",
    "The linguistic functions are presented in relation to phonetics, phonology, morphology, syntax, semantics, pragmatics and discourse analysis.\n",
    "Prosody causes specific phonological processes, it determines syntactic structures, it specifies semantic meanings and it contributes to the organization of sentences in the discourse, among other linguistic functions.\n",
    "Prosodic units do not occur in language in a random manner but they share specific language conventions with well defined framework.\n",
    ""
   ]
  },
  "carriofont91_ppst": {
   "authors": [
    [
     "Mar",
     "Carrió Font"
    ],
    [
     "Antonio",
     "Ríos Mestre"
    ]
   ],
   "title": "Compensatory shortening in Spanish spontaneous speech",
   "original": "pp91_016",
   "page_count": 5,
   "order": 15,
   "p1": "paper 016",
   "pn": "",
   "abstract": [
    "Our experiment aims at studying compensatory shortening phenomena in Spanish spontaneous speech taking into account as a variables stressed syllable duration and total duration of surrounding unstressed fragments. Results show that in Spanish there is not compensatory shortening, which is supposed to be characteristic cf stress-timed languages.\n",
    ""
   ]
  },
  "ciduribe91_ppst": {
   "authors": [
    [
     "Miriam",
     "Cid Uribe"
    ],
    [
     "Santiago G.",
     "Fernandez Corugedo"
    ]
   ],
   "title": "The construction of a corpus of spoken Spanish: phonetic and phonological parameters",
   "original": "pp91_017",
   "page_count": 5,
   "order": 16,
   "p1": "paper 017",
   "pn": "",
   "abstract": [
    "This paper will deal with the processes carried out and developed when analysing a corpus of spoken Spanish before, during, and after a comparative stage with a similar corpus of data from English. Phonetic and Phonological analyses are carried out so that findings obtained from experimental procedures may gain practical status in language processing and teaching. The underlaying aim is to gather data from spontaneous speech in Spanish using a variety of speakers and different styles and social dialects in order to build a set of samples that would later be compared with the existing operative corpus of English designed in Lancaster University by G. Knowles. Both segmental and prosodic features were monitored and a special study of experimental versus descriptive approaches was also developed.\n",
    ""
   ]
  },
  "cutler91_ppst": {
   "authors": [
    [
     "Anne",
     "Cutler"
    ],
    [
     "Beverley",
     "Fear"
    ]
   ],
   "title": "Categoricality in acceptability judgements for strong versus weak vowels",
   "original": "pp91_018",
   "page_count": 5,
   "order": 17,
   "p1": "paper 018",
   "pn": "",
   "abstract": [
    "A distinction between strong and weak vowels can be drawn on the basis of vowel quality, of stress, or of both factors. An experiment was conducted in which sets of contextually matched word-intial vowels ranging from clearly strong to clearly weak were cross-spliced, and the naturalness of the resulting words was rated by listeners. The ratings showed that in general cross-spliced words were only significantly less acceptable than unspliced words when schwa was not involved; this supports a categorical distinction based on vowel quality.\n",
    ""
   ]
  },
  "delgadomartins91_ppst": {
   "authors": [
    [
     "Maria Raquel",
     "Delgado-Martins"
    ],
    [
     "Maria Joao",
     "Freitas"
    ]
   ],
   "title": "Temporal  structures  of  speech: \"reading  news  on  TV\"",
   "original": "pp91_019",
   "page_count": 5,
   "order": 18,
   "p1": "paper 019",
   "pn": "",
   "abstract": [
    "This paper presents a procedure of data collection of different styles of speech in relation to different professional discourse. Several styles are collected such as reading a text, \"spontaneous speech\" and professional speech. Freitas (1990) has published the results of this data for teachers of the University. Our data are relative to the same styles but for TV journalist \"reading news\" with teletext as professional style.\n",
    "The paper presents some theoretical discussion about the relevance of the procedure and a description of temporal indicators of temporal structures such as relation of speech and pauses. This methodology tends to verify in this first phase the indicators of temporal structures as result of individual, professional or stylistic factors.\n",
    ""
   ]
  },
  "dohalskazichova91_ppst": {
   "authors": [
    [
     "Marie",
     "Dohalská-Zichová"
    ]
   ],
   "title": "Stability of Czech vowels studied in three different corps",
   "original": "pp91_020",
   "page_count": 5,
   "order": 19,
   "p1": "paper 020",
   "pn": "",
   "abstract": [
    "Research in the sphere of sound speech perception and of speech signal intelligibility, above all, in unfavorable acoustic conditions points out an important role of vowels for a positive orientation in the usual communication.\n",
    "During the studies of spontaneous contemporary spoken Czech we aimed at Czech vowel perception especially, to ascertain which vowels represent certain supporting points in the Czech vocalic system. The first material represented the experimental research in the field of the perception of segmental elements, especially vowels. After completing the confrontation study dealing with the perception of isolated vowels in \"laboratory conditions\", and then completing the contrastive research on the reliability of identification of vowels in logatoms, we wanted to find out what the perception of vowels in a natural context was.\n",
    "On the basis of preliminary probes we saw fit to study the problem on three different sets: confrontation perception of isolated vowels starting from a laboratory material containing 12.000 data, perception of vowels in loggatoms - material acquired during the test of intelligibility of information for passengers at four different railway stations (the preliminary analysis, the result of which is presented here, included 20.000 data), intelligibility of vowels in authentic records of spontaneous communication in different kinds of communication in working and control processes.\n",
    ""
   ]
  },
  "duez91_ppst": {
   "authors": [
    [
     "Danielle",
     "Duez"
    ]
   ],
   "title": "Some factors affecting F2-patterns in spontaneous speech in French",
   "original": "pp91_021",
   "page_count": 5,
   "order": 20,
   "p1": "paper 021",
   "pn": "",
   "abstract": [
    "F2 was measured in CV syllables occurring in the spontaneous speech of five speakers. The effect of speaker's tempo, word novelty and syntactic prominence on CV contextual assimilation was particularly investigated. The degree of contextual assimilation partly depends on tempo. The information value of words seemed to have an effect on contextual assimilation since the difference in formant frequency between the CV boundary and the vowel nucleus is smaller in old words than in new words. Syllables carrying syntactic prominence showed a larger formant excursion from the CV boundary to the nucleus than the non prominent ones as observed in other languages. However, compared with Swedish, the contextual asimilation of non prominent syllables in French appeared to be less important. This difference may be due to the temporal organisation specific to each language. This latter result confirms Delattre's (1969) previous findings which showed that the \"unstressed\" vowel is not reduced by the same amount and the same manner in all languages.\n",
    ""
   ]
  },
  "elordui91_ppst": {
   "authors": [
    [
     "Agurtzane",
     "Elordui"
    ],
    [
     "Miren Lourdes",
     "Oñederra"
    ]
   ],
   "title": "Speech styles and the pronunciation of Basque in TV",
   "original": "pp91_022",
   "page_count": 6,
   "order": 21,
   "p1": "paper 022",
   "pn": "",
   "abstract": [
    "The main aim of this paper is the study of the pronunciation of Basque in the Basque speaking channel of TV through the presentation and analysis of phonoiogically crucial data. Where available and convenient, data from other sources will be provided. Special attention will be drawn to the contrast between mass media speech and spontaneous popular speech styles.\n",
    "A brief survey of what could be expected on theoretical grounds will be the starting point for the exposition of what we actually observe. Our main source of inspiration in this respect will be the works done in this field within the theoretical framework of Natural Phonology.\n",
    "For the purpose of measuring the degree of correspondence with the expected register the speech of the different types of dubbing will be considered and contrasted with news reports or other types of programs. We will also take into account the presence and use of dialectal pronunciation in TV.\n",
    "The phonetic and phonological weight of notions like fortition and/or foregrounding and lenition and/or backgrounding will be dicussed in connection with the data under examination.\n",
    "Sociolinguistic and pragmatic facts (the relative lack of variation in Basque pronunciation, the prestige of Spanish and of certain Basque dialects, the process of standardization of the language and its normative pseudo-phonology, etc.) will be mentioned as possible partial explanation of apparent phonological unnaturalness. The paper will focus on linguistic criteria of phonological productivity, use of phonetic salience, etc. Although both phonetics and phonology will be considered, this work will fundamentally be of a phonological nature due to our background and field of research. We intend to present it as a plea for the complementary phonetic research which Basque linguistics so badly needs.\n",
    ""
   ]
  },
  "fant91_ppst": {
   "authors": [
    [
     "Gunnar",
     "Fant"
    ],
    [
     "Anita",
     "Kruckenberg"
    ],
    [
     "Lennart",
     "Nord"
    ]
   ],
   "title": "Some observations on tempo and speaking style in Swedish text reading",
   "original": "pp91_023",
   "page_count": 5,
   "order": 22,
   "p1": "paper 023",
   "pn": "",
   "abstract": [
    "This is a report of some of our findings from studies of temporal structure in prose reading, essentially confined to Swedish. Our major effort has been to study durations of speech sounds, syllables, stress groups and pauses with respect to specific modes of performance with an emphasis on high quality reading. Earlier work along these lines have been followed up by a language contrastive study and also a study of poetry reading. Speaking and reading style and their major categories such as relative distinctiveness are multidimensional. Temporal variations of FO, intensity and coarticulation are obvious components but will not be treated here. We shall focus on durational patterns and their variations with reading mode and overall speech rate, including short time tempo variations. Durational patterns are determined by phonetic and linguistic structures and speaker specific, semantic and pragmatic denotations and speaking style. A fundamental distinction is that between stressed and unstressed syllables. In a stress-timed language like Swedish or English it is important to retain a sufficient contrast between stressed and unstressed syllables. An increased stressed/unstressed contrast tends to emphasize content words, which adds to distinctiveness and constitutes a basic parameter of individual speaking style. Of special interest is the role of pauses in variations of overall speech rate and relations between speech rate and stress patterns.\n",
    ""
   ]
  },
  "farnetani91_ppst": {
   "authors": [
    [
     "Edda",
     "Farnetani"
    ],
    [
     "Alice",
     "Faber"
    ]
   ],
   "title": "Vowel production in isolated words and in connected speech: an investigation of the linguo-mandibular subsystem",
   "original": "pp91_024",
   "page_count": 5,
   "order": 23,
   "p1": "paper 024",
   "pn": "",
   "abstract": [
    "This study investigates the positions of tongue dorsum and jaw in the production of Italian vowels HI and /a/, in different phonetic contexts and utterance types, with the aim of assessing the patterns of coordination of the two articulators in the processes of coarticulation, reduction and compensation. The data indicate that reduction is manifested as a decreased displacement of jaw and tongue from their rest position along the high/low dimension, while C-to-V and V-to-V coarticulation is mainly induced by tongue displacements along both axes. Extensive compensatory tongue horizontal displacements in the production of reduced /a/ vowels are crucial in preserving the articulatory distance between the two vowel categories in symmetric sequences, thus counteracting the effects of reduction, whilst in asymmetric sequences, the V-to-V effects seem to overrule the compensatory movements, and, adding to reduction effects, cause a further decrease in the articulatory distance between the two vowels.\n",
    ""
   ]
  },
  "fretheim91_ppst": {
   "authors": [
    [
     "Thorstein",
     "Fretheim"
    ]
   ],
   "title": "The structural and pragmatic basis of an intonational reduction process in colloquial Norwegian",
   "original": "pp91_025",
   "page_count": 5,
   "order": 24,
   "p1": "paper 025",
   "pn": "",
   "abstract": [
    "The phenomenon to be discussed in the present paper is a frequently occurring but not previously studied discourse-prosodic process of colloquial Norwegian, whereby two consecutive Intonation Units (IUs) in an answering turn are truncated and blended, ending up as one IU instead of two, Tb: first IU of the input sequence of intonation contours where this IU reduction may take place is always an affirmative or negative response word, and the second input IU is always a declarative sentence reinforcing, expanding, or commenting on the response already given. How can we account for this intonational reduction process? What is its functional basis? These are the central questions this paper attempts to answer. It will be demonstrated that the phenomenon is not simply a function of rapid conversational style, even if it tends to occur much more in allegro speech of the rather informal sort than in more formal speaking styles. There are some specific rule-governed constraints on its application, some formal constraints that will be shown to interrelate with certain pragmatic constraints.\n",
    ""
   ]
  },
  "gandariasolaeta91_ppst": {
   "authors": [
    [
     "M. Rosario",
     "Gandarias Olaeta"
    ]
   ],
   "title": "On the rhythmical type of Basque",
   "original": "pp91_026",
   "page_count": 5,
   "order": 25,
   "p1": "paper 026",
   "pn": "",
   "abstract": [
    "It is a well known fact that connected speech shows several phenomena that are not found in written language. It is possible to distinguish two groups of languages depending on the rhythm (syllable-timed and stress-timed languages). In this paper, several examples of Basque are shown. All of cases correspond to connected speech and try to show different deletions of segments and syllables. It is an attempt to aproach to the role of stress in Basque (syllable-timed language) and to show different examples that seem to go against the rhythm typology of this language.\n",
    ""
   ]
  },
  "granstrom91b_ppst": {
   "authors": [
    [
     "Björn",
     "Granström"
    ],
    [
     "Lennart",
     "Nord"
    ]
   ],
   "title": "Neglected dimensions in speech synthesis",
   "original": "pp91_027",
   "page_count": 5,
   "order": 26,
   "p1": "paper 027",
   "pn": "",
   "abstract": [
    "In traditional accounts on speech prosody, fundamental frequency, duration and intensity have been described as the most important attributes. Among these, intensity has attracted the least attention. In perceptual studies both F0 and duration has had an undisputable role in signalling prosodic categories but the role of intensity has been less clear. This has resulted in an emphasis on the former attributes in current speech synthesis schemes. We are in this study exploring the use of speech intensity and also other segmental correlates of prosody. Intensity has a dynamic aspect, discriminating emphasized and reduced stretches of speech. A more global aspect of intensity must be controlled when we try to model different speaking styles. Specifically, we have been trying to model the continuum from soft to loud speech.\n",
    ""
   ]
  },
  "greisbach91_ppst": {
   "authors": [
    [
     "Reinhold",
     "Greisbach"
    ]
   ],
   "title": "Some aspects of maximally fast reading style",
   "original": "pp91_028",
   "page_count": 5,
   "order": 27,
   "p1": "paper 028",
   "pn": "",
   "abstract": [
    "Some phonetic phenomena of maximally fast reading, i.e. reading as fast as possible, are investigated. A production and a perception experiment (of German texts) was performed and the general speaker and hearer specific problems are discussed. Phonetic transcripts were checked against standard reduction rules of German. More extensive reductions, speaker specific as well as speaker independent, were observed.\n",
    ""
   ]
  },
  "grice91_ppst": {
   "authors": [
    [
     "Martine",
     "Grice"
    ],
    [
     "William",
     "Barry"
    ]
   ],
   "title": "Phonetic units by ear and eye",
   "original": "pp91_029",
   "page_count": 5,
   "order": 28,
   "p1": "paper 029",
   "pn": "",
   "abstract": [
    "A study of the differences in phonetic analysis occurring in auditory transcription and signal-aligned labelling is presented and perceptual and physical explanations are offered.\n",
    ""
   ]
  },
  "hansen91_ppst": {
   "authors": [
    [
     "Anita Berit",
     "Hansen"
    ]
   ],
   "title": "The covariation of [@] with style in Parisian French: an empirical study of 'e caduc' and pre-pausal [@]",
   "original": "pp91_030",
   "page_count": 7,
   "order": 29,
   "p1": "paper 030",
   "pn": "",
   "abstract": [
    "The effect of speaking style has been examined for two linguistic features in French. On the one hand, the variation between dropped and maintained interconsonantal 'E caduc' in word initial and medial postion as well as in monosyllables (la s(e)maine, sam(e)di. tu l(e) connais). On the other hand, the variation between pauses preceeded by an [@] - be it etymological or not - and pauses without such a vowel (Bonjour(-e)||, Philipp(-e)||. A la fac(-e)||).\n",
    "The data corpus used is recorded in 1989 and counts 24 persons who have all lived more than half of their lives in Paris or its suburbs. Three different speaking styles are defined: reading; interview; conversation at three-hand (the informant, a friend of the informant, and the researcher). The informants fit into three age groups (15 to 19, 20 to 25 and 40 to 55 years old), and are equally distributed between men and women.\n",
    "A quantitative analysis shows different style patterns for the two variables studied. Whereas the 'E caduc', as stated by other studies, drops largely in the two speaking styles, and is often maintained in reading style, the final prepausal [@] shows a much more complex behaviour. The percentage of pronounced final [@]s does not seem to vary with style at first hand, but qualitatively this is certainly the case: Certain prosodic features accompanying the final [@] (especially the upwards-downwards mouvement of the intonation) are much more frequent in the conversation than in the interview, and moreover, certain phonetic realisations of the prepausal element ([@~], [a]) disappear gradually and are replaced by inoffensive variants like [(@)] when conversation style is compared to interview style, and again with reading style.\n",
    "If the 'E caduc' is a typical case of reduction in speaking style as opposed to reading style, the prepausal [@] seems to be a case of elaboration of a prepausal element in speaking style, particularly salient in the most informal one of the two defined.\n",
    "It should be added that the age factor interferes with the patterns mentioned: young and adults do not show exactly the same style shifting behaviour as regards the 'E caduc' and the prepausal [@].\n",
    ""
   ]
  },
  "harmegnies91_ppst": {
   "authors": [
    [
     "Bernard",
     "Harmegnies"
    ],
    [
     "Dolors",
     "Poch-Olivé"
    ]
   ],
   "title": "Some aspects of vowel reduction in Spanish spontaneous speech",
   "original": "pp91_031",
   "page_count": 5,
   "order": 30,
   "p1": "paper 031",
   "pn": "",
   "abstract": [
    "The classical descriptions of Spanish vowels, both articulatory (Navarro Tomas, 1918) and acoustic (Navarro Tomas, 1916, 1917; Lacerda-Canellada, 1942; Monroy Casas, 1980; Quilis-Esgueva, 1983), all based upon laboratory speech, agree on the points that 1. the Spanish vocalic system is composed of five vowels (/i/, /e/, /a/, /o/, /u/); 2. these are free of reduction (understood as an approximation to the schwa quality).\n",
    "Nevertheless, as Lindblom (1963) notices, vowel reduction may derive from non- phonologic factors (stress, speech rate, etc.) that influence the acoustic characteristics of vowel utterances. These factors behave in different ways according to the different speech styles involved and produce [...] variations. Particularly, vowels in spontaneous Spanish speech seem to [...] relaxation (Poch, 1989) which approaches them to schwa, although this phenomenon is not sensible in laboratory speech.\n",
    "In this paper, we will focus on these phenomena and try to determine whether variations in the speaking style (laboratory vs. spontaneous speech) result in vocalic variability. For this purpose, we will contrast vowels in sentences produced by a single speaker in invariant phonetic environment, and differences in speaking styles only. Due to the bad quality of the paper copy parts of this abstract are incomplete.\n",
    ""
   ]
  },
  "hieronymus91_ppst": {
   "authors": [
    [
     "James L.",
     "Hieronymus"
    ],
    [
     "Briony J.",
     "Williams"
    ]
   ],
   "title": "A comparison of the prosody in read speech and directed monologue in British English",
   "original": "pp91_032",
   "page_count": 5,
   "order": 31,
   "p1": "paper 032",
   "pn": "",
   "abstract": [
    "Previous work on the prosodic differences between read speech and spontaneous speech in British English RP has used a purely perceptual analysis of the data. However, this type of analysis is largely confined to one style of English (read monologue), and makes no reference to the acoustic exponents of prosodic features. The work to be reported here compares read speech with (semi-) spontaneous speech for a male speaker of RP English. This provides for a direct comparison between speaking styles. A perceptual prosodic transcription is made of each text, and an automatic stress detection algorithm is run over the data, locating any accented syllables and prosodic boundaries. The success of the algorithm is evaluated, using the perceptual transcription as reference. The styles of speech are then compared in prosodic terms.\n",
    ""
   ]
  },
  "karlsson91_ppst": {
   "authors": [
    [
     "Inger",
     "Karlsson"
    ]
   ],
   "title": "Modelling voice variations in female speech synthesis",
   "original": "pp91_033",
   "page_count": 5,
   "order": 32,
   "p1": "paper 033",
   "pn": "",
   "abstract": [
    "The voice source is an important factor in the production of different voice qualities. These different voice qualities art used in speech to convey among other things different suprasegmental aspects, for example emphasis, phrase boundaries and also different speaking styles, for example an authoritative or a sub-missive voice. Voice source variations are also an important means of conveying extralinguistic information of various kinds in ordinary speech. In the present study voice source variations in normal speech by female speakers have been investigated using inverse filtering. The results of the inverse filtering are given in voice source parameters appropriate for controlling speech synthesis. Accordingly, the resulting descriptions have been utilized to produce voice variations in our new synthesis system.\n",
    ""
   ]
  },
  "kelm91_ppst": {
   "authors": [
    [
     "Orlando R.",
     "Kelm"
    ]
   ],
   "title": "Intrinsic difficulties with the terms 'stress-timing' and 'syllable-timing' for Spanish and Portuguese",
   "original": "pp91_034",
   "page_count": 7,
   "order": 33,
   "p1": "paper 034",
   "pn": "",
   "abstract": [
    "Traditionally the rhythmic alternations between stress and non-stress are described by the terms \"stress-timing\" and \"syllable-timing\". Frequently authors have proceeded under the assumption that every language possesses an intrinsic timing pattern which is responsible for segment duration, phonetic reduction, and stress assignment. There is little evidence to suggest that these timing patterns serve as a catalyst to phonetic alternations. There do exist, however, other factors uhich inherently affect segment duration and speech rhythm. For example, there are neuromuscular constraints (e.g., the speed of nerve impulses, the mass of the various articulators), articulatory factors (e.g., the inherent differences in the duration of stops, nasals, fricatives, as well as the effect of vowel height and voicing), sentence-level shortening processes (e.g., prepausal lengthening), and semantic constraints (e.g., emphasis). This paper compares phonetic reduction processes between Spanish (a syllable-timed language) and Brazilian Portuguese (a stress-timed language). An analysis of their respective vowel reductions, spirant ization, and reduction of heterosyllabic consonant clusters exemplify how an investigation of their phonetic patterns better explains the disparate rhythm tendencies than does the implementation of the terms stress-timing and syllable-timing.\n",
    ""
   ]
  },
  "knowles91_ppst": {
   "authors": [
    [
     "Gerry",
     "Knowles"
    ]
   ],
   "title": "The Lancaster/IBM spoken English corpus: a database for research into speaking styles",
   "original": "pp91_035",
   "page_count": 9,
   "order": 34,
   "p1": "paper 035",
   "pn": "",
   "abstract": [
    "This paper discusses techniques currently being developed at Lancaster University to investigate in a systematic way a wide range of phonetic patterns in naturally occurring spoken texts. These techniques will have a number of applications, including the study of speaking style.\n",
    "There has been a steady shift over the last decade or so away from the study of language as system towards the study of language in communication. This has important consequences for the way we approach the phonetic form of a text. Formerly it was sufficient for many purposes to use a standard orthographic transcript, or at most to do a phonemic transcription and mark word stress: either of these is sufficient to indicate what words are being said, but neither can satisfactorily represent what is being communicated.\n",
    "If we are concerned with language as system, we can pose relatively simple phonological questions, typically relating to individual words out of context, and they can be answered in a simple and straight forward way. Thus we can ascertain how words are pronounced, and which syllables are stressed, either by examining our own intuitions, or by looking the words up in a pronouncing dictionary. But to deal with what is communicated requires an analysis of a range of patterns - including pitch, timing, voice quality and loudness - which conventional phonetic and phonological theory are not equipped to handle.\n",
    "As an illustration of the problem, consider the pronunciation of and, which in texts sometimes begins with a glottal stop and semi-reduced vowel. The glottal stop is traditionally regarded as phonemically irrelevant, and semi-reduction is impossible if all vowels must belong uniquely to one phoneme or another. And yet this pronunciation indicates a different meaning from the form /an/ with no glottal stop and a fully reduced shwa. (At the time of writing it would appear that the former type acts as a cohesive link between sentences, and the latter as a coordinator at phrase level.) The distribution and meaning of such forms - and even their existence - cannot be discovered by introspection. Their occurrence cannot be predicted with any certainty, and is governed by probabilities.\n",
    "The size of prosodic word groups, and patterns of accentuation, are similarly a matter of probability. The probabilities themselves are not fixed, but vary according to style: the prosodic patterns of a liturgical passage differ from those of a story read aloud. The variation may or may not be related to specific parameters, such as speaking rate.\n",
    "In order to handle contextual patterns in texts, we need to develop a new methodology. First, we need a carefully compiled corpus of naturally occurring data. Secondly, the corpus has to be annotated in a useful way. Thirdly, we need to convert the corpus into a database so that we can extract contextual information from it.\n",
    ""
   ]
  },
  "koopmansvanbeinum91_ppst": {
   "authors": [
    [
     "Florien J.",
     "Koopmans-van Beinum"
    ]
   ],
   "title": "Spectro-temporal reduction and expansion in spontaneous speech and read text: focus words versus non-focus words",
   "original": "pp91_036",
   "page_count": 5,
   "order": 35,
   "p1": "paper 036",
   "pn": "",
   "abstract": [
    "This project concerns the communicatively important aspects in spontaneous speech as compared to read speech. Spectro-temporal and intonational aspects of focus words (i.e. words bearing the highest load of semantic information) are studied in spontaneous speech and in the same texts, re-read after orthographic transcription. In order to investigate the acoustic characteristics of both speech styles, we introduced a peak-and-level model with two possible hypotheses, regarding the spectral and durational contrasts in focus and non-focus words in spontaneous speech as compared to read speech. In first instance we used speech material of one professional male speaker, the one whose voice and pronunciation served as a model for the diphone-based component of the Dutch national speech synthesis program. For a number of global parameters it can be concluded that there is a clear difference in the 'level values1 of the two speech styles, but that the 'peak values' display similar contrast to these level values.\n",
    ""
   ]
  },
  "kvale91_ppst": {
   "authors": [
    [
     "Knut",
     "Kvale"
    ],
    [
     "Arne Kjell",
     "Foldvik"
    ]
   ],
   "title": "Manual segmentation and labelling of continuous speech",
   "original": "pp91_037",
   "page_count": 5,
   "order": 36,
   "p1": "paper 037",
   "pn": "",
   "abstract": [
    "For speech reeearch and development and assessment of speech recognizers and synthesizers segmentation of continuous speech into linguistically defined segments Is desirable. The motivation for studying this problem wae our participation In the European speech research project ESPRIT-SAM In which segmentation and labelling of a large multilingual database Is needed.\n",
    "Due to the lack of objective criterlons manual segmentation and labelling will exhibit tome Inconsistencies and Is prone to errors. In order to overcome these drawbacks and to make the manual segmentation more consistent and also faster to carry out we developed a set of eegmentatlon rules.\n",
    "We used the analysis program WAVES on a SUN workstation with the waveform and a broadband spectrogram displayed. Our point of departure was to transcribe what we \"heard\" and \"saw\" with phonemic labels and to mark the endpolnt for each phoneme and for pauses.\n",
    "When comparing segmentation and labelling of the same material performed by the same labeller with a 3 months' Interval the labelling error Is about a half percent and over 96% of the boundaries coincide within ±20 ms. The segmentation and labelling spssd was more than 5 phonemes per minute.\n",
    ""
   ]
  },
  "lacheretdujour91_ppst": {
   "authors": [
    [
     "Anne",
     "Lacheret-Dujour"
    ]
   ],
   "title": "Phonological variations in read speech, reduction phenomena and speaker classes: do allophonic choices represent speaking style?",
   "original": "pp91_038",
   "page_count": 10,
   "order": 37,
   "p1": "paper 038",
   "pn": "",
   "abstract": [
    "In text-to-speech synthesis, linguistic and extra-linguistic knowledge is necessary to produce natural sounding multistyle and multivoice speech. Similarly, since a multispeaker speech recognition system is always confronted by the great variability in the speech signal, we need to know what factors contribute to this variability and how we can represent them formally. Where phonological variations are concerned, it is impossible to treat multispeaker phonological variability as a global and indivisible phenomenon. While linguistic constraints such as syntactic rules can reduce the number of allophonic possibilities, extra-linguistic knowledge is also necessary to better understand and formalize phonological variations which depend on the speaker characteristics. Actually, factors such as a speaker's geographic origin, his age, etc, determine to a large extent the allophonic choices and the deep phonological representation of each speaker.\n",
    "The goal of this communication is to present an analysis of different strategies of allophonic choices in French according to the speech rate. From the analysis of a read corpus pronounced by four speakers, we underline that phonological reductions are linked to the speech rate and also to a speaker's phonetic style. We will then see if it is possible to differentiate classes of speakers according to their segmental variations at a given speech rate.\n",
    ""
   ]
  },
  "laporte91_ppst": {
   "authors": [
    [
     "Eric",
     "Laporte"
    ]
   ],
   "title": "A formal tool for modelling \"standard\" phonetic variations",
   "original": "pp91_039",
   "page_count": 7,
   "order": 38,
   "p1": "paper 039",
   "pn": "",
   "abstract": [
    "Speech processing requires that some more phonetic variability than in current systems should be taken into account. CERIL has undertaken the description of a category of variability. In this paper, we discuss the limits of this description in terms of its extent (which styles are retained and which are discarded?) and of its precision (which minimal difference between two variants can be taken into account?). Then we present the formal and technical means used to model phonetic variations: a phonemic dictionary and local finite-state automata.\n",
    ""
   ]
  },
  "maturi91_ppst": {
   "authors": [
    [
     "Pietro",
     "Maturi"
    ]
   ],
   "title": "Spontaneous speech and phonological models: the role of signal-independent information in linguistic communication",
   "original": "pp91_040",
   "page_count": 5,
   "order": 39,
   "p1": "paper 040",
   "pn": "",
   "abstract": [
    "Current phonological models are built on an \"abstract11 phonetic form only existing in the mental representations of researchers and in the \"laboratory\" realizations of speakers. Direct spectroacoustical observation of spontaneous speech raises a lot of new problems that only a close collaboration between phoneticians and phonologists may solve.\n",
    ""
   ]
  },
  "monaghan91_ppst": {
   "authors": [
    [
     "Alex I. C.",
     "Monaghan"
    ]
   ],
   "title": "Accentuation and speech rate in the CSTR TTS system",
   "original": "pp91_041",
   "page_count": 5,
   "order": 40,
   "p1": "paper 041",
   "pn": "",
   "abstract": [
    "This paper describes work done on the prosodic rules of the Edinburgh University CSTR Text-to- Speech system, a linguistically sophisticated speech output system. Like most other high-quality text-to-speech systems, our system bases its prosodic rules on the content-word/function-word (CW/FW) distinction. The first step in determining accentuation is to assign accent to (almost) all CWs, resulting in an unnaturally over-accented representation. It is therefore necessary to apply a RHYTHM RULE to this representation in order to derive a more natural accentuation. There are various stages to our rhythm rule, producing successively more reduced prosody. The first stage produces what we call the fully-accented representation, from which various degrees of reduction can be produced: this stage is obligatory, and all subsequent stages are optional. The choice of which additional stages to apply is dependent upon the speech rate and style to be synthesised, but a range from laboriously stilted to extremely reduced can be produced.\n",
    "The various stages and their effects are presented, and their relation to pitch and duration in the acoustic output is discussed. Some further work on remaining problems is also suggested.\n",
    ""
   ]
  },
  "moore91_ppst": {
   "authors": [
    [
     "Kate",
     "Moore"
    ]
   ],
   "title": "Segment reduction and expansion in Finnish: a comparison of read and spontaneous speech",
   "original": "pp91_042",
   "page_count": 5,
   "order": 41,
   "p1": "paper 042",
   "pn": "",
   "abstract": [
    "This study is an investigation of how Finnish speakers adapt the articulation of their phonemes to the task of producing abnormally fast speech. In advance of the study, it was anticipated that the following questions would be relevant to the investigation: Do some sounds (phonemes) consistently speed up more than do others in an attempt at fast speech, and does any such speedup correlate with the articulatory  characteristics  of the  sounds? Is there variation in the rate of phonation from speaker to speaker? Is there a difference between spontaneous speech and reading when speakers  attempt to speak faster?\n",
    "With the collection of observations, the following points were established: The attempt at speedup produced not only faster phonation rates, but also slower phonation rates, with oscillation between the two during the production of the text. No  individual phonemes showed consistently  greater speedup than other phonemes, nor did  any  articulatory  type  consistently  show greater speedup.  Expected points of greater speedup, such as the superior adroitness of the apex over the dorsum, did not emerge in the actual observations. However, mean phonation rates, both in normal speech and fast speech, were consistently higher when excitation of the cavity was produced by the glottis rather than by  a supra-glottal  articulator. Speakers varied in the success of their attempt at speedup.\n",
    "Because of the constraints of space and time in this report, the spontaneous speech data and its comparison with the read material provided here will be saved for presentation at the conference.\n",
    ""
   ]
  },
  "nichasaide91_ppst": {
   "authors": [
    [
     "Ailbhe",
     "Ní Chasaide"
    ],
    [
     "Christer",
     "Gobl"
    ]
   ],
   "title": "Phonatory correlates of speaking style",
   "original": "pp91_043",
   "page_count": 5,
   "order": 42,
   "p1": "paper 043",
   "pn": "",
   "abstract": [
    "Subtle variations in phonatory quality may reveal aspects of the speaker's mood and attitude, and are thus an important aspect of speaking style. This paper illustrates current research being carried out by the authors on the correlates of a range of such voice quality differences. The qualities looked at include modal, breathy, whispery, tense, lax and creaky voice, following the description of Laver (1980). The principle analysis method involved inverse filtering of the speech waveform. In order to quantify the voice source differences, a four parameter source model (the LF model) was matched to the inverse filtered waveform. Spectral analysis yielded complementary information.\n",
    ""
   ]
  },
  "ogden91_ppst": {
   "authors": [
    [
     "Richard",
     "Ogden"
    ]
   ],
   "title": "A non-segmental phonetic and phonological analysis of variation in natural speech",
   "original": "pp91_044",
   "page_count": 5,
   "order": 43,
   "p1": "paper 044",
   "pn": "",
   "abstract": [
    "The aim of this paper is to present a methodology for making a non-segmental phonological description for a small amount of data, based on close phonetic observation. The intention is not to present a non-segmental labelling scheme, but to show what sorts of things one must consider in order to devise such a scheme, and to give an idea of what such a scheme would be like. I want to show that there are other ways of analysing data which might be more linguistically interesting when fast and slow speech are compared than if more traditional segmental labels are used.\n",
    ""
   ]
  },
  "roach91_ppst": {
   "authors": [
    [
     "Peter",
     "Roach"
    ],
    [
     "Dave",
     "Millar"
    ]
   ],
   "title": "Syllabic consonants at different speaking rates: a problem for automatic recognition",
   "original": "pp91_045",
   "page_count": 5,
   "order": 44,
   "p1": "paper 045",
   "pn": "",
   "abstract": [
    "A familiar aspect of English pronunciation is the occurrence of syllabic consonants. It is common to treat consonantal syllabicity as a consequence of vowel elision, implying that, for example, the pronunciation of'button' as/bVtn/ is the realisation of underlying /bAt@n/ (or even /bVtOn/). JSince elision is a phenomenon that is subject to the influence of speaking style, it would seem to follow that in rapid or casual speech we should expect to find more cases of syllabic consonants and fewer cases of unstressed vowels followed by continuant consonants. This paper sets out to show that the phenomenon is not this simple: we look at problems that confront our attempts at the automatic recognition of syllables and other sub-word units, and considerphono tactic and phonetic factors that may help to resolve them.\n",
    ""
   ]
  },
  "romeas91_ppst": {
   "authors": [
    [
     "Pascal",
     "Romeas"
    ]
   ],
   "title": "Prosodic effects of reiteration in man-machine dialog by voice",
   "original": "pp91_046",
   "page_count": 5,
   "order": 45,
   "p1": "paper 046",
   "pn": "",
   "abstract": [
    "Man-machine dialog by voice is a specific verbal interaction involving subjects' adaptation and communication failures. Our experimental material gave us the opportunity to compare the prosodic effects of two different tasks : the numerous reiterations of the same speech act (at least 25) for experimental needs, and the reiteration of an utterance (same word sequence) when the machine failed to understand. The numerous repetitions of the same speech act through the experiment lead the speakers to lower the whole time of each subsequent utterance (increase of the rate of production). On the other hand, the reiteration of a given utterance by request of the machine does not effect the rate of production, whereas the speaking rate proper (referring to the duration of meaningful units only) shows a tendency for lowering. Fundamental frequency is found to vary in this latter case, but this variation is determined by the semantic reorganisation of the utterance.\n",
    ""
   ]
  },
  "scully91_ppst": {
   "authors": [
    [
     "Celia",
     "Scully"
    ],
    [
     "Esther",
     "Grabe"
    ],
    [
     "Eric",
     "Castelli"
    ]
   ],
   "title": "Comparison of some articulatory paths for fricatives in slow speech-like sequences and in connected speech",
   "original": "pp91_047",
   "page_count": 5,
   "order": 46,
   "p1": "paper 047",
   "pn": "",
   "abstract": [
    "Articulatory paths for fricatives produced in two different speech styles were compared, in similar vowel contexts. A trace indicating the acoustically relevant parameter of cross-section area was used. The results suggest that the deceleration phase into the constriction and the acceleration phase out of it may be stable features. The static end point states found in the slower speech-like sequences were absent in the connected speech.\n",
    ""
   ]
  },
  "schulzova91_ppst": {
   "authors": [
    [
     "Olga",
     "Schulzová"
    ]
   ],
   "title": "The speech reduction under the influence of nonverbal factors",
   "original": "pp91_048",
   "page_count": 5,
   "order": 47,
   "p1": "paper 048",
   "pn": "",
   "abstract": [
    "Contemporary linguistics cannot go on to disregard the fact that the sound speech, especially the impulsive, unprepared one, is accompanied with nonverbal means* (i.e. movements of face mimic organs - forehead, eyebrows, eye-lids, mouth, cheeks, nose, look; body position, gestures of arms of hands, of legs, of head, gesticulation in general, movement of the whole body: melody, intonation, pauses uring the speech, etc.) The opinion of Charles Darwin's and other researchers who claimed that the nonverbal means are proper only to primitive groups and uneducated members of the human community, cannot be longer fully accepted. It is true that the nonverbal means represent a quite natural attribute or a company or a partial substitution of the sound speech and even of the soliloquy of any individual speaker. Those means enable to make the sound speech more accurate and to make unambiguous the transmitted information on the one hand, and to help the addressee in comprehension of the information on the other hand.\n",
    "The reasons mentioned above have caused that new considerations dealing with the nonverbal means function in the sound speech communication are raising in the contemporary linguistic literature. Those means attribute the communication and make it more accurate, they can \"speak\" though not being a verbal communication, one can use them not only to speak but also to make oneself understood. The non-language elements (nonverbal means, as we call them) communication Has been only mentioned or stated in the linguistic literature until now. This problematic has been studied and appraised by psychologists, first of all, by sociologists, doctors and scientists of other branches.\n",
    "Nevertheless, the appearance and functions of the nonverbal means should be interesting for linguists especially, because those means have the same function in the men's communication as the verbal means have. The function is to enable social communication and understanding followed by comprehension among people.\n",
    "The fact that the speech as a mean of cpmmunication can be realised in two ways - in a sound form and in a written form - and the nonverbal means can be used in situations appropriate for the sound speech, causes the lack of the linguists' attention paid to the nonverbaf means communication.\n",
    "The nonverbal means can be effectuated in a direct contact of the subjects of communication or when the proper communication is transmitted via various technical means and facilities. In the latter case, the participants of communication can or cannot see each other.\n",
    "When writing or reading, the language information got through printed words or phrases must be sufficient for us. The author of trie monologue does not know the addressee and he knows he cannot expect any direct reaction in a form of reply to his text. He is conscious about uselessness of repetition of the information in other words, another explanation, to make the intended information more complete, the way that is usual by the sound speech form. Thus he builds his information in a way specific for the written form. Even this form of information can be accepted with imaginary or sound words reaction form the of addressee, though the author cannot see him and does not know him. The addressee's reaction can be agreeing or discordant, can express surprise or any other opinion and can be accompanied with the nonverbal means, too.\n",
    "As has already been written above, the nonverbal means can accom- pany or substitute the sound speech. It is possible for case of tete-a-tete communication (the interaction of the communicants is realized at a certain place and in a certain time) and also for case of partial communication (the information from a speaker to an addressee is transmitted via any sound transmission facility - i.e. radio, telephone, etc. - or via any facility transmitting sound and picture - f.e. television). The nonverbal means of communication of a different range and intensity according to the characters of the communicants and the type of communication can be applied here.\n",
    ""
   ]
  },
  "sole91_ppst": {
   "authors": [
    [
     "Maria Josep",
     "Solé"
    ],
    [
     "John J.",
     "Ohala"
    ]
   ],
   "title": "The phonological representation of reduced forms",
   "original": "pp91_049",
   "page_count": 5,
   "order": 48,
   "p1": "paper 049",
   "pn": "",
   "abstract": [
    "In this paper the productivity of reduction processes as a function of the frequent or infrequent nature of words or combinations is studied and the nature of the cognitive representation of reduced forms is considered. An experiment is presented where speakers of American English were asked to produce i) new strings of words which have a low probability of combining together, and ii) phonetically equivalent frequently occurring sequences. The experimental results show that reduction processes apply rather consistently to highly frequent combinations, but they hardly apply to sequences of words which are rare or unusual. The claims made in this paper on the basis of the evidence presented are: 1) Phonological rules can not provide a cognitive representation that accounts adequately for the automaticity of frequent sequences and the high percentage of reduced forms they present. 2) The difference in reduction processes in frequent and infrequent sequences can be explained in terms of two modes of speech perception and production. An automatic or template mode for frequently recurring words of phrases, where style-dependent variant pronunciations are stored as separate lexical entries, and an analytical or derivational mode for new, propositional speech, where rules might be used to produce variant pronunciations. This proposal is in line with psycholinguistic, neurological and learning models of speech behaviour. This proposal obviously reformulates the size and nature of the phonological inventory.\n",
    ""
   ]
  },
  "sussman91_ppst": {
   "authors": [
    [
     "Harvey M.",
     "Sussman"
    ]
   ],
   "title": "An investigation of locus equations as a source of relational invariance for stop place categorization",
   "original": "pp91_050",
   "page_count": 12,
   "order": 49,
   "p1": "paper 050",
   "pn": "",
   "abstract": [
    "Locus equations were investigated as a potential higher-order metric capable of illustrating relational invariance for place of articulation in voiced initial stop consonants independently of vowel context. Locus equations are straight line regresson fits to data points formed by plotting onsets of F2 transitions along the y-axis and their corresponding midvowel nuclei along the x-axis. Twenty subjects, 10 male and 10 female, produced /b/v/t/, /d/v/t/, and /g/v/t/ tokens for 10 vowel contexts. Each CVC token was repeated in a carrier phrase five times yielding 150 tokens per subject. Formant measures were obtained using the MacSpeech Lab II speech analyis system. Locus equation scatterplots revealed extremely tight clustering of points around the regression line that were consistent across speakers and gender. Derived slope and y-intercept parameters were significantly different across stop place categories. The relative value of F2 onset as it linearly changes in relation to the coarticulatorily produced vowel reflects a stable acoustic correlate capturing relational invariance for stop place. A discriminant analysis using F2onset & vowel as predictors showed 82%, 78%, and 67% classification rates for labial, alveolar, and velar place. Using derived slope and y-intercept values as predictors led to 100% classification into stop place categories.\n",
    ""
   ]
  }
 },
 "sessions": [
  {
   "title": "Lectures",
   "papers": [
    "argente91_ppst",
    "granstrom91_ppst",
    "lindblom91_ppst",
    "ohala91_ppst",
    "rischel91_ppst"
   ]
  },
  {
   "title": "Contributed Papers",
   "papers": [
    "aguilarcuevas91_ppst",
    "ball91_ppst",
    "barry91_ppst",
    "bergem91_ppst",
    "bhatt91_ppst",
    "blaauw91_ppst",
    "bruce91_ppst",
    "caelenhaumont91_ppst",
    "cagliari91_ppst",
    "carriofont91_ppst",
    "ciduribe91_ppst",
    "cutler91_ppst",
    "delgadomartins91_ppst",
    "dohalskazichova91_ppst",
    "duez91_ppst",
    "elordui91_ppst",
    "fant91_ppst",
    "farnetani91_ppst",
    "fretheim91_ppst",
    "gandariasolaeta91_ppst",
    "granstrom91b_ppst",
    "greisbach91_ppst",
    "grice91_ppst",
    "hansen91_ppst",
    "harmegnies91_ppst",
    "hieronymus91_ppst",
    "karlsson91_ppst",
    "kelm91_ppst",
    "knowles91_ppst",
    "koopmansvanbeinum91_ppst",
    "kvale91_ppst",
    "lacheretdujour91_ppst",
    "laporte91_ppst",
    "maturi91_ppst",
    "monaghan91_ppst",
    "moore91_ppst",
    "nichasaide91_ppst",
    "ogden91_ppst",
    "roach91_ppst",
    "romeas91_ppst",
    "scully91_ppst",
    "schulzova91_ppst",
    "sole91_ppst",
    "sussman91_ppst"
   ]
  }
 ]
}