{
 "title": "2nd ISCA/DEGA Tutorial and Research Workshop on Perceptual Quality of Systems (PQS 2006)",
 "location": "Berlin, Germany",
 "startDate": "4/9/2006",
 "endDate": "6/9/2006",
 "conf": "PQS",
 "year": "2006",
 "name": "pqs_2006",
 "series": "PQS",
 "SIG": "",
 "title1": "2nd ISCA/DEGA Tutorial and Research Workshop on Perceptual Quality of Systems",
 "title2": "(PQS 2006)",
 "date": "4-6 September 2006",
 "papers": {
  "sasse06_pqs": {
   "authors": [
    [
     "M. Angela",
     "Sasse"
    ],
    [
     "Hendrik",
     "Knoche"
    ]
   ],
   "title": "Quality in context - an ecological approach to assessing QoS for mobile TV",
   "original": "pqs6_011",
   "page_count": 10,
   "order": 1,
   "p1": "11",
   "pn": "20",
   "abstract": [
    "The paper presents an overview of Quality of Service (QoS) definitions, and reviews approaches to identifying quality requirements for audio and video quality in the context of novel multimedia services. We advocate an approach that maximizes ecological validity. It is important to recruit participants from the expected user population, create realistic tasks and using real material, and use an assessment method that creates minimal load on study participants. Finally, it is important to replicate all physical factors that affect quality in the eventual context of use. We present an example of how we apply this approach to identifying video quality requirements for mobile TV viewing.\n",
    ""
   ]
  },
  "blauert06_pqs": {
   "authors": [
    [
     "Jens",
     "Blauert"
    ]
   ],
   "title": "Real worlds, virtual worlds - and the roots of psychoacoustics",
   "original": "pqs6_149",
   "page_count": 3,
   "order": 2,
   "p1": "149",
   "pn": "151",
   "abstract": [
    "Knowledge from Psychoacoustics has recently gained increasing attention in technology. In this context it can be observed that, on the one hand, scientific Psychoacoustics is overestimated regarding it's application potency and, thus, contributions are expected from it which it cannot render. On the other hand, Psychoacoustics is also underestimated in that it is considered to be primarily \"subjective\" and, hence, not based on solid scientific grounds.\n",
    "It is the purpose of this paper to point out the position of Psychoacoustics - and in a more general way, of Psychophysics - in the concert of sciences and arts. In doing so, a stringently phenomenal line of arguments will be presented, i.e. a line of arguments which is solely based on actual perception and not on fiction. Virtual Reality will be used as an illustrating example.\n",
    ""
   ]
  },
  "jekosch06_pqs": {
   "authors": [
    [
     "Ute",
     "Jekosch"
    ]
   ],
   "title": "Sound perception and sound design",
   "original": "pqs6_021",
   "page_count": 2,
   "order": 3,
   "p1": "21",
   "pn": "22",
   "abstract": [
    "Sound design constructs audibility of the world. Sounds carry information about the world. When listening to sounds communication takes place. This is a well-known fact for speech sounds, but it is also true of other types of sounds such as music or product sounds. In principle, each acoustic event can be perceived as a sign carrier by which information about the world is communicated. In its ultimate sense, sound designers are engineers of communication. To be successful they have to take design decisions on the basis of how listeners perceive sounds and of what sort of communication takes place during the perceptual event. The career of sound design requires a special view of acoustic / auditory communication. Amongst others, this is a field of semiotics. This paper looks at sound design from the perspective of semiotics.\n",
    ""
   ]
  },
  "vastfjall06_pqs": {
   "authors": [
    [
     "Daniel",
     "Västfjäll"
    ],
    [
     "Pontus",
     "Larsson"
    ],
    [
     "Anders",
     "Genell"
    ],
    [
     "Anders",
     "Sköld"
    ],
    [
     "Mendel",
     "Kleiner"
    ]
   ],
   "title": "A neuropsychological theory of sound design: implications for auditory icons in vehicles",
   "original": "pqs6_023",
   "page_count": 3,
   "order": 4,
   "p1": "23",
   "pn": "25",
   "abstract": [
    "A main function of warning and info sounds in vehicles is to convey a sense of the needed action. For instance, a warning sound that is intended to signal \"stop the vehicle\" should lead to only that action. Hence, warning and info sounds should lead to correct, and furthermore, the same reaction, in all user. In experimental psychology, the degree to which the sound elicits the correct action would be described as \"stimulusreaction compatibility\" (Guski, 1997). While there is some ongoing research on how to design auditory signals to optimize stimulus-action compatibility, there is currently a lack of theory that can guide sound design. It is our aim to develop a novel framework for the design and assessment of warning and information sounds. Here we describe a brief outline of our framework and implications for the creation and assessment of warning and information sounds in vehicles.\n",
    ""
   ]
  },
  "silzle06_pqs": {
   "authors": [
    [
     "Andreas",
     "Silzle"
    ]
   ],
   "title": "Towards a new method for developing objective quality taxonomies",
   "original": "pqs6_026",
   "page_count": 8,
   "order": 5,
   "p1": "26",
   "pn": "33",
   "abstract": [
    "A new method to develop an objective Quality Taxonomy for an interactive auditory virtual environment (AVE) with the help of a DELPHI expert survey is presented. The development process with the steps: purpose identification, building, evaluation and documentation is explained. The Quality Taxonomy developed here includes the descriptive and relation orientated characterisation. Additionally, it is expanded by a quantitative component (weighting factors for the relations) - unlike the standard taxonomies or ontologies. The resulting taxonomy for the application edutainment [Combination of education and entertainment, used here for a virtual museum application] scenario presents clearly the multivariate character of the involved relations between the quality elements (in the physical domain) and quality features (in the perceptual domain). No listening experiments are necessary to develop such a Quality Taxonomy with this method, only a sufficient number of experts having experience in this field. Further, when a large number of experts participate in developing a taxonomy using the proposed methodology, a high degree of objectivity in the results is obtained.\n",
    ""
   ]
  },
  "kuhn06_pqs": {
   "authors": [
    [
     "Clemens",
     "Kuhn"
    ],
    [
     "Renato S.",
     "Pellegrini"
    ]
   ],
   "title": "Interior car sound simulation using binaural processing for wave field synthesis reproduction",
   "original": "pqs6_034",
   "page_count": 6,
   "order": 6,
   "p1": "34",
   "pn": "39",
   "abstract": [
    "This paper proposes a spatial sound reproduction approach for subjective assessment of interior car sound. The sound reproduction is based on wave field synthesis technology (WFS). This technology enables holophonic audio reproduction and an enhanced immersion of the listener into a spatially extended sound field without using headphones. In past publications [15], [16], the basic principles of interior car sound simulations using WFS have been outlined. This paper gives technical details on implementations and proposes spatial processing approaches for a WFS reproduction compatible to existing binaural simulation environments for NVH engineering.\n",
    ""
   ]
  },
  "raake06_pqs": {
   "authors": [
    [
     "Alexander",
     "Raake"
    ],
    [
     "Brian F. G.",
     "Katz"
    ]
   ],
   "title": "Measurement and prediction of speech intelligibility in a virtual chat room",
   "original": "pqs6_040",
   "page_count": 4,
   "order": 7,
   "p1": "40",
   "pn": "43",
   "abstract": [
    "Intelligibility in a telecommunication-based conference application can largely be improved, when the speech signals of the different interlocutors are presented spatially, and when the sources are spatially distributed. For the controlled exploitation of the underlying Cocktail Party Effect in speech chat applications, a prediction of the intelligibility related to a given spatial configuration is sought. To this aim, a number of intelligibility tests have been conducted on different configurations of a virtual speech chat room based on binaural rendering technology and headphone presentation. The measurement object of the intelligibility tests was the Speech Reception Threshold, i.e. the signal-to-interferer ratio threshold for 50% intelligibility. Based on the test results, the paper presents a parametric model developed for intelligibility predictions in virtual chat-room applications, and briefly discuss its prediction performance.\n",
    ""
   ]
  },
  "merchel06_pqs": {
   "authors": [
    [
     "Sebastian",
     "Merchel"
    ],
    [
     "Rüdiger",
     "Hoffmann"
    ]
   ],
   "title": "Subjective evaluation of musical instruments on the basis of solo pieces of music",
   "original": "pqs6_044",
   "page_count": 4,
   "order": 8,
   "p1": "44",
   "pn": "47",
   "abstract": [
    "This study examines the human quality perception of musical instruments. It provides the background for future development of objective algorithms ([1],[2]) to distinguish between musical instruments on a quality basis. Previous studies showed that evaluation using single tones is not sufficient ([3],[4],[5],[6]), thus tone sequences will be used. This corresponds also more to the natural situation where a guitar is played. Three listening tests have been developed, using two different methods (serial and block by block presentation of stimuli). They have been realized and evaluated. It was asked to judge the acoustical overall quality of selected classical guitars by listening to recorded tone sequences (scale and melody). The selected binaural technology in combination with headphone compensation seemed to achieve good results. Not only the attributes of the instrument itself affect the perceived quality, also other factors (independent variables) might influence. Parameters like the playing musician, the room in which the instrument is played, the played sequence and the repetition of the same sequence by the musician have been included into the experimental design. The listeners were divided into two groups, those who play guitar themselves and those who do not.\n",
    "The complexity of human quality perception can be seen from a multitude of interactions between the mentioned factors. It was concluded, that hierarchical plans, which would reduce the necessary effort in listening experiments, can only be applied very restricted. To present stimuli in blocks gave no benefits, because of difficult comparison between blocks. There was no significant difference between the quality judgment of guitarists and non guitarists.\n",
    "s\n",
    "Eichner, M., Wolff, M., Hoffmann, R. Instrument classification using HMMs (to appear at 7th International Conference on Music Information Retrieval 2006, Canada) Löschke, H. Differenzierbarkeit von Musikinstrumenten (2006, Fortschritte der Akustik - DAGA) Krishna, A. G., Screenivas, T. V. Music instrument recognition: From isolated notes to solo phrases (Proc. ICASSP 2004, Montreal, IV-265-IV-268) Fasold, W., Kraak, W., Schirmer, W. Taschenbuch Akustik, Teil 2 (1984, Verlag Technik, Berlin, S. 1106 - 1110) Meinel, E., Boehm, T., Miklaszewski, K., Blutner, F. Estimation of guitar sound quality (1986, Archives of Acoustics 11 (3), 203-229) Valenzuela, M. N. Subjektive Beurteilung der Qualität und Ähnlichkeit von Flügelklängen (1995, Fortschritte der Akustik - DAGA 95, S. 587-590)\n",
    ""
   ]
  },
  "skowronek06_pqs": {
   "authors": [
    [
     "Janto",
     "Skowronek"
    ],
    [
     "Martin F.",
     "McKinney"
    ]
   ],
   "title": "Quality of music classification systems: how to build the reference?",
   "original": "pqs6_048",
   "page_count": 8,
   "order": 9,
   "p1": "48",
   "pn": "55",
   "abstract": [
    "The quality of classification systems is usually measured in correct classification performance: compare the predicted classes of test items with their predefined classes (ground truth). This paper discusses a number of requirements and considerations that are important for a proper design of a ground truth database in the context of music classification. Two examples will show how the recommendations can be translated into concrete decisions to be taken and instructions to be followed during the design process. This paper will not provide an universal methodology for setting up a ground truth for any music classification system; it rather intends to give handles that help in building a reliable quality reference for such systems.\n",
    ""
   ]
  },
  "moller06_pqs": {
   "authors": [
    [
     "Sebastian",
     "Möller"
    ],
    [
     "Johannes",
     "Heimansberg"
    ]
   ],
   "title": "Estimation of TTS quality in telephone environments using a reference-free quality prediction model",
   "original": "pqs6_056",
   "page_count": 5,
   "order": 10,
   "p1": "56",
   "pn": "60",
   "abstract": [
    "This paper reports on initial experiments to estimate the overall quality of synthesized speech transmitted over telephone channels, using a reference-free quality prediction model which is described in ITU-T Rec. P.563. Three tests have been carried out where naturally-produced and synthesized speech samples have been transmitted over various telephone channels, and then judged by test listeners with respect to their overall quality. The mean auditory ratings obtained in these tests have been compared to estimations provided by the P.563 model. Correlations between auditory and estimated quality scores vary considerably between experiments. It is concluded that the P.563 model mainly predicts the effects of the transmission channel, but not of the (naturally-produced or synthesized) source speech material.\n",
    ""
   ]
  },
  "oulasvirta06_pqs": {
   "authors": [
    [
     "Antti",
     "Oulasvirta"
    ],
    [
     "Klaus-Peter",
     "Engelbrecht"
    ],
    [
     "Anthony",
     "Jameson"
    ],
    [
     "Sebastian",
     "Möller"
    ]
   ],
   "title": "The relationship between user errors and perceived usability of a spoken dialogue system",
   "original": "pqs6_061",
   "page_count": 7,
   "order": 11,
   "p1": "61",
   "pn": "67",
   "abstract": [
    "An experiment (N=24) was conducted with a spoken dialogue system (a smart home system), in which the users carried out several tasks with the system and rated its usability. Users interactions were analyzed from the perspective of human error research done in human factors and cognitive ergonomics, distinguishing between goal-, concept-, task-, and command-level errors. This paper raises the question of how the interrelationship between errors and usability perceptions should be studied. Preliminary results are presented from correlational and factor-analytical approaches.\n",
    ""
   ]
  },
  "krebber06_pqs": {
   "authors": [
    [
     "Rosa Pegam",
     "Krebber"
    ]
   ],
   "title": "User expectations and selected notions in the context of the spoken dialogue system INSPIRE",
   "original": "pqs6_068",
   "page_count": 8,
   "order": 12,
   "p1": "68",
   "pn": "75",
   "abstract": [
    "This paper investigates the interaction with the INSPIRE spoken dialogue system as perceived by users from a communication-theoretic perspective. We found a practical interest in research into user expectations in the context of interaction with spoken dialogue systems. When designers of these systems create the various dialogue modules they usually rely on designs of previous interactive speech systems. This is not always the most recommendable way to deal with the matter because in many cases the earlier reference systems (e.g. automatic telephonic train information services) were designed for purposes different from the current ones (e.g. voice controlled smart-home applications). This is certain to have a negative effect on the eventual performance quality of the newer system because the dialogue structures were not developed exclusively for the system in question. This paper investigates expectations that users build up while interacting with the INSPIRE system.\n",
    "The objective of this paper is to reveal the most striking kinds of expectations and those most relevant as to the dialogue flow. Furthermore, a categorisation of system limitations regarding dialogue shall be established. We assume that when user expectations are known to the system developer, this knowledge can be applied during the system implementation and will lead to a reduction of ill-structured dialogues (i.e. incomprehensible structures).\n",
    "The interdisciplinary approach taken in this paper curls up challenges as regards thematic commitment: the main focus of this paper is on the actual interaction events between man and machine. This paper is strongly empirically oriented. Although literature treating the subject of user expectations regarding dialogue systems has been published, the vast majority of these texts regard dialogue systems based on modalities other than voice-controlled user interfaces (e.g. graphical user interfaces). This circumstance makes a practical approach to the subject necessary, that is, a study of the subject in very close connection with the INSPIRE system tapping the wealth of experience the authors have collected while assisting with the development of the system prototype at the Institute of Communication Acoustics Ruhr-University of Bochum during 2003 and 2004.\n",
    ""
   ]
  },
  "hempel06_pqs": {
   "authors": [
    [
     "Thomas",
     "Hempel"
    ]
   ],
   "title": "Usability of telephone-based speech dialog systems as experienced by user groups of different age and background",
   "original": "pqs6_076",
   "page_count": 3,
   "order": 13,
   "p1": "76",
   "pn": "78",
   "abstract": [
    "Due to the maturity of todays speech recognition systems, telephone-based speech dialog systems address an increasing number of potential users. Especially, well-defined and socially standardized dialogs in the customer relationship field bear a high potential of being automated. Potential application fields are, e.g., ordering information brochures, obtaining tariff information, easy brokerage portals. Consequently, telephonebased voice portals covering a broad range of services and information will be facing an extremely heterogeneous user group. This may include young people, elderly people, people with and without computer literacy and the like. Nowadays, not all users are addressed by user group specific features, a fact that may contribute to the low acceptance of some of these systems ([1]).\n",
    "The aim of this usability study is to observe the users approach to using telephone-based speech dialog systems in order to determine trends for audience-adequate dialog design. Since this topic has been little addressed, issues for further investigations were also expected as results of this study. The study is part of a co-operation of Siemens AG with Deutsche Telekom AG.\n",
    "",
    "",
    "[1] Hempel, T., \"Usability of Speech Applications - Wheres the Rub?\", Forum Ware, 32(1-4):24-26, 2004. [in German]\n",
    ""
   ]
  },
  "chen06_pqs": {
   "authors": [
    [
     "Shi-Han",
     "Chen"
    ],
    [
     "Shun-Ju",
     "Chen"
    ],
    [
     "Chih-Chung",
     "Kuo"
    ]
   ],
   "title": "Comparison and analysis of listening test methods for development of perceptual speech quality assessment",
   "original": "pqs6_079",
   "page_count": 6,
   "order": 14,
   "p1": "79",
   "pn": "84",
   "abstract": [
    "Reliability of the listening test design has a great influence on the performance of the quality estimation model. In this paper we compare four different listening test designs by Monte Carlo simulation. Three common problems of interval scale ratings are included in the simulation, and their influences on the performance of estimating the underlying true quality are investigated. It turns out that in these methods, randomly choosing partial trials for Scaled Comparison could be the most reliable way to perform listening test under the influences of interval scale ratings problems.\n",
    ""
   ]
  },
  "rath06_pqs": {
   "authors": [
    [
     "Matthias",
     "Rath"
    ]
   ],
   "title": "On the relevance of auditory feedback for subjective and objective quality of control in a balancing task",
   "original": "pqs6_085",
   "page_count": 4,
   "order": 15,
   "p1": "85",
   "pn": "88",
   "abstract": [
    "A tangible audio-visual interface based on the metaphor of balancing a ball on a tiltable track allows the measurement of human control movements under different conditions of sensory feedback. This specific scenario of human-system interaction forms an example for the definition of various measures of performance and quality of interaction. The dependence of these measures on specific configurations of the interface with regard to the employed audio-visual feedback, and their relationship is discussed.\n",
    ""
   ]
  },
  "chateau06_pqs": {
   "authors": [
    [
     "Noël",
     "Chateau"
    ],
    [
     "Laetitia",
     "Gros"
    ],
    [
     "Virginie",
     "Durin"
    ],
    [
     "Amélie",
     "Macé"
    ]
   ],
   "title": "Redrawing the link between customer satisfaction and speech quality",
   "original": "pqs6_089",
   "page_count": 7,
   "order": 16,
   "p1": "89",
   "pn": "95",
   "abstract": [
    "This paper analyzes the actual usage of Mean Opinion Scores (MOS) in the telecommunication industry and looks back to the tremendous evolutions that has encountered this sector since subjective test methodologies were standardized by ITUT. It is pointed out that MOS have severe drawbacks and that test methods should evolve by taking into account valuable inputs from connected research fields such as the psychology of emotions, cognitive science, usability engineering and marketing research.\n",
    ""
   ]
  },
  "mahdi06_pqs": {
   "authors": [
    [
     "Abdulhussain E.",
     "Mahdi"
    ]
   ],
   "title": "Advances in perceptual speech quality assessment",
   "original": "pqs6_096",
   "page_count": 7,
   "order": 17,
   "p1": "96",
   "pn": "102",
   "abstract": [
    "In the context of telecommunications, speech quality is the most visible and important aspects of quality of service (QoS), and the ability to monitor and design for this quality should be a top priority. Speech quality refers to the clearness of a speakers voice as perceived by a listener. Its measurement offers a means of adding the human end-users perspective to traditional ways of performing network management evaluation of voice telephony services. Traditionally, measurement of users perception of speech quality has been performed by expensive and time-consuming subjective listening tests. Over the last three decades, numerous attempts have been made to supplement subjective tests with objective measurements based on algorithms that can be computerised and automated. This paper describes the technicalities associated with speech quality measurement, and presents a review of current subjective and objective speech quality evaluation methods and standards in telecommunications.\n",
    ""
   ]
  },
  "waltermann06_pqs": {
   "authors": [
    [
     "Marcel",
     "Wältermann"
    ],
    [
     "Alexander",
     "Raake"
    ],
    [
     "Sebastian",
     "Möller"
    ]
   ],
   "title": "Perceptual dimensions of wideband-transmitted speech",
   "original": "pqs6_103",
   "page_count": 6,
   "order": 18,
   "p1": "103",
   "pn": "108",
   "abstract": [
    "In this paper it is analyzed which perceptual dimensions are existent for speech that is transmitted over wideband telephone connections. Therefore, two auditory experiments with subsequent multidimensional analyses (multidimensional scaling and semantic differential) were carried out with a diverse set of mixed narrowband and wideband conditions. This revealed a mapping of the perceptual space with a dimensionality of four. The identified dimensions were labeled \"continuity\", \"distance\", \"lisping\", and \"noisiness\". By mapping those dimensions onto overall listening quality scores in a linear way, statements regarding the importance of single dimensions could be made for the given context. It turned out that \"continuity\" is the main contributor for overall listening quality.\n",
    ""
   ]
  },
  "huo06_pqs": {
   "authors": [
    [
     "Lu",
     "Huo"
    ],
    [
     "Kirstin",
     "Scholz"
    ],
    [
     "Ulrich",
     "Heute"
    ]
   ],
   "title": "Idealized system for studying the speech-quality dimension \"directness/frequency content\"",
   "original": "pqs6_109",
   "page_count": 6,
   "order": 19,
   "p1": "109",
   "pn": "114",
   "abstract": [
    "This paper presents a design method for an idealized system to be applied for the study of the speech-quality dimension \"directness/frequency content\". Using this idealized system, we can generate degraded speech samples processed by systems with defined values of the parameters describing the above dimension. These parameters are the equivalent rectangular bandwidth ERB, the center frequency ΘG (center of gravity of the frequency content), the slope β, the ripple depth γD, and the ripple rate γR. The performance of this idealized system is evaluated by both an objective measure and a listening-only test.\n",
    ""
   ]
  },
  "cote06_pqs": {
   "authors": [
    [
     "Nicolas",
     "Côté"
    ],
    [
     "Valérie",
     "Gautier-Turbin"
    ],
    [
     "Alexander",
     "Raake"
    ],
    [
     "Sebastian",
     "Möller"
    ]
   ],
   "title": "Analysis of a quality prediction model for wideband speech quality, the WB-PESQ",
   "original": "pqs6_115",
   "page_count": 8,
   "order": 20,
   "p1": "115",
   "pn": "122",
   "abstract": [
    "Perceptual Estimation of Speech Quality (PESQ) [1] is an instrumental model to estimate speech quality. This model provides quite a good estimation of quality for narrow-band transmission. The wideband version of PESQ (WB-PESQ [2]) delivers estimates of WB transmission quality. In contrast to PESQ, WB-PESQ shows differences between estimated and more expressed auditory MOS scores. Based on different subjective tests, the detailed analysis of estimated and auditory MOS scores provided in this paper shows two problems of WB-PESQ: (1) The model under-estimates the quality of wideband hybrid speech coders, like G.722.2 [3] and the recently normalized G.729.1 [4]; (2) WB-PESQ makes differences in quality between male and female talkers. The female talkers are under-estimated by WB-PESQ. A description of the psychoacoustic model of WB-PESQ and the transformation of speech signals in the different stages of this psychoacoustic model show where these problems come from. Especially WB-PESQ overestimates the degradation due to noise in hybrid coders. The implementation of a modified WB-PESQ based on this observation shows reliable estimates of speech quality which are better in accordance with auditory results.\n",
    "s ITU-T Recommendation P.862, Perceptual Evaluation of Speech Quality (PESQ), an Objective Method for End-to- End Speech Quality Assessment of Narrowband Telephone Networks and Speech Codecs, International Telecommunication Union, CH-Geneva, 2001. ITU-T Recommendation P.862.2, Wideband Extension to Recommendation P.862 for the Assessment of Wideband Telephone Networks and Speech Codecs, International Telecommunication Union, CH-Geneva, 2005. ITU-T Recommendation G.722.2, Wideband Coding of Speech at Around 16 kbit/s Using Adaptive Multi-Rate Wideband (AMR-WB), International Telecommunication Union, CH-Geneva, 2003. ITU-T Recommendation G.729.1, G.729 Based Embedded Variable Bit-rate Coder: An 8-32 kbit/s Scalable Wideband Coder Bitstream Interoperable with G.729, International Telecommunication Union, CHGeneva, 2006. Côté, N., Qualité perçue de parole transmise par voie téléphonique large-bande, Master thesis, Université Pierre et Marie Curie, FR-Paris, 2005.\n",
    ""
   ]
  },
  "mahdi06b_pqs": {
   "authors": [
    [
     "Abdulhussain E.",
     "Mahdi"
    ]
   ],
   "title": "Non-intrusive SOM-based speech quality assessment for telephony applications",
   "original": "pqs6_123",
   "page_count": 8,
   "order": 21,
   "p1": "123",
   "pn": "130",
   "abstract": [
    "A non-intrusive method for speech quality assessment in telephony applications is proposed and its performance evaluated. The method involves measuring perception-based objective auditory distances between the voiced parts of the processed (degraded) speech signal to appropriately matching references extracted from a pre-formulated codebook. The codebook is formed by optimally clustering large number of parametric speech vectors extracted from a database of clean speech records, using an efficient data-mining tool known as the Self-Organizing Map (SOM). The auditory distances are mapped into an objective Mean Opinion listening quality scores (MOS_LQO). Three domain transformation techniques have been utilized to provide perception-based, speakerindependent parametric representation of the speech: a Perceptual Linear Prediction (PLP) model, a Bark Spectrum (BS) analysis and Mel-Frequency Cepstrum Coefficients (MFCC). Reported evaluation results show that the proposed method provides high correlation with subjective listening quality scores (MOS_LQS), yielding accuracy similar to that of the ITU-T P.563 while maintaining a relatively low computational complexity. Results also demonstrate that the method outperforms the PESQ in assessing the quality of speech degraded by channel impairments.\n",
    ""
   ]
  },
  "kettler06_pqs": {
   "authors": [
    [
     "Frank",
     "Kettler"
    ],
    [
     "H. W.",
     "Gierlich"
    ],
    [
     "S.",
     "Poschen"
    ],
    [
     "S.",
     "Dyrbusch"
    ]
   ],
   "title": "Speech quality for mobile phones: what is achievable with today²s technology?",
   "original": "pqs6_131",
   "page_count": 6,
   "order": 22,
   "p1": "131",
   "pn": "136",
   "abstract": [
    "The mobile market is an interesting and rapidly growing market. Although new features are coming up, speech transmission is still one of the most important applications. This contribution addresses frequently asked questions concerning speech quality of mobile phones. The analyses discussed in this contribution focus purely on the speech quality and the capability of todays signal processing. All other aspects such as cost factors or different customer groups being addressed by a specific type of phone are disregarded. Extracted from a huge amount of data some implementation examples are analyzed. The paper discusses the typical range of single parameters. The intention of this paper is to provide useful information for manufacturers and operators for development and comparison. The analyses are based on the three latest phones on the market of 9 different competitive mobile manufacturers.\n",
    ""
   ]
  },
  "voldhaug06_pqs": {
   "authors": [
    [
     "Jan Erik",
     "Voldhaug"
    ],
    [
     "Erik",
     "Hellerud"
    ],
    [
     "Astrid",
     "Undheim"
    ],
    [
     "Erling",
     "Austreim"
    ],
    [
     "U. Peter",
     "Svensson"
    ],
    [
     "Peder J.",
     "Emstad"
    ]
   ],
   "title": "Effects of network architecture on perceived audio quality",
   "original": "pqs6_137",
   "page_count": 6,
   "order": 23,
   "p1": "137",
   "pn": "142",
   "abstract": [
    "Subjective testing based on the ITU-R MUSHRA method has been used to evaluate the perceived quality of audio signals exposed to packet loss. A congested best-effort and a Differentiated Services (DiffServ) router were simulated to find models for the packet loss processes. Two different models were combined with three packet loss rates, three audio clips and two different error concealment (EC) schemes and the resulting audio quality was evaluated. Results show statistically significant effects of both audio clip, EC, and packet loss rate on perceived quality. No significant difference was found between the two network architectures, but interaction effects between the network architectures and both audio clip and packet loss rate were observed.\n",
    ""
   ]
  },
  "yamagishi06_pqs": {
   "authors": [
    [
     "Kazuhisa",
     "Yamagishi"
    ],
    [
     "Takanori",
     "Hayashi"
    ]
   ],
   "title": "Verification of video quality opinion model for videophone services",
   "original": "pqs6_143",
   "page_count": 6,
   "order": 24,
   "p1": "143",
   "pn": "148",
   "abstract": [
    "We propose a computational opinion model for estimating the video quality of videophone services. Although opinion models for speech such as the E-model have been established and widely used, little attention has been given to opinion models for video quality estimation. Our proposed opinion model is useful as a network-planning tool using several video parameters that affect the quality of videophone services. First, we established a function for estimating video quality affected by coding distortion, which expresses the quality of a video affected by coding bit rate and frame rate. Second, we established a packet loss degradation index that estimates the degree of video quality degradation due to packet loss. Third, we integrated these two functions into the opinion model for estimating video quality. We applied this model for video quality estimation of H.264 codec. The results indicated that the estimation errors of our model were less than the mean of the 99% confidence intervals for the subjective scores, which is the statistical reliability of subjective score. Finally, we conducted a verification test of our proposed model using an MPEG-4 codec and found that the form of our proposed model was valid, because video quality can be accurately estimated. Therefore, our model could be applied to effective design, implementation, and management of videophone applications and communication networks.\n",
    ""
   ]
  },
  "klasmeyer06_pqs": {
   "authors": [
    [
     "Gudrun",
     "Klasmeyer"
    ]
   ],
   "title": "Perceptual quality of speech transmission and speech enhancement systems in vehicles",
   "original": "pqs6_152",
   "page_count": 8,
   "order": 25,
   "p1": "152",
   "pn": "159",
   "abstract": [
    "In this paper methods for determination of perceptual quality of speech transmission and speech enhancement systems are discussed. The rating categories introduced in the listening test (7.) are not meant to replace existing \"objective\" or \"technical\" measures. They are meant to complement the description of a device under test and place more emphasize on the end-users impression of the system.\n",
    "The rating categories introduced in this paper are complete and intuitive, even non-experts can understand their importance for successful and agreeable speech communication. Benchmark tests using these categories are much more informative for the non-expert and can still be presented \"at a glance\".\n",
    "Furthermore, the comparison ratings serve to clarify the responsibility for quality losses, which the device under test cannot avoid, since their origin lies in the mobile network.\n",
    ""
   ]
  },
  "holub06_pqs": {
   "authors": [
    [
     "Jan",
     "Holub"
    ],
    [
     "Jana",
     "Motlová"
    ],
    [
     "Radislav",
     "Smíd"
    ],
    [
     "Ondøej",
     "Tomíska"
    ]
   ],
   "title": "Objective assessment of speech distribution quality by means of unconventional PESQ application - a case study",
   "original": "pqs6_160",
   "page_count": 4,
   "order": 26,
   "p1": "160",
   "pn": "163",
   "abstract": [
    "The article describes non-traditional deployment of ITUT P.862 (PESQ) algorithm for quality assessment of speech distribution. Subjective and objective results are presented and compared.\n",
    ""
   ]
  },
  "susini06_pqs": {
   "authors": [
    [
     "Patrick",
     "Susini"
    ],
    [
     "Nicolas",
     "Misdariis"
    ],
    [
     "Guillaume",
     "Lemaitre"
    ],
    [
     "Olivier",
     "Houix"
    ],
    [
     "Davide",
     "Rocchesso"
    ],
    [
     "Pietro",
     "Polotti"
    ],
    [
     "Karmen",
     "Franinovic"
    ],
    [
     "Yon",
     "Visell"
    ],
    [
     "Klaus",
     "Obermayer"
    ],
    [
     "Hendrik",
     "Purwins"
    ],
    [
     "Kamil",
     "Adiloglu"
    ]
   ],
   "title": "Closing the loop of sound evaluation and design",
   "original": "pqs6_164",
   "page_count": 3,
   "order": 27,
   "p1": "164",
   "pn": "166",
   "abstract": [
    "Despite being a promising and lively playground, sound design is not a discipline as solid and established as visual or product design. We believe that the reason is to be found in the lack of design-oriented measurement and evaluation tools. The European project CLOSED (Closing the Loop Of Sound Evaluation and Design) aims at providing a functional-aesthetic sound measurement tool that can be profitably used by designers. At one end, this tool is linked with physical attributes of soundenhanced everyday objects; at the other end it relates to user emotional response. The measurement tool will be made of a set of easy-to-interpret indicators, which will be related to use in natural context, and it will be integrated in the product design process to facilitate the control of sonic aspects of objects, functionalities, and services encountered in everyday settings.\n",
    ""
   ]
  },
  "joost06_pqs": {
   "authors": [
    [
     "Gesche",
     "Joost"
    ]
   ],
   "title": "The rhetoric of HCI: a communication model for the design and evaluation process",
   "original": "pqs6_167",
   "page_count": 4,
   "order": 28,
   "p1": "167",
   "pn": "170",
   "abstract": [
    "Today, the interaction between human and computer (HCI) is an important design task for all services and products. But how can designers predict the quality perceived by the user when they plan and design a system from scratch? How can designers provide systems that will most likely satisfy users expectations? One approach is to understand the design process as rhetorical communication that has to address an audience in an appropriate way. It is an interdisciplinary approach from design research and humanities reflecting on the ancient technique of strategic communication that is applied to media communication. The rhetoric of HCI is a theory to explore the communicative interaction between system designer, the system itself, and the user. The aim of this paper is to elicit this transfer with a basic communication model that shows the dependencies and forces between these three parties: designer, system and user.\n",
    ""
   ]
  },
  "reichl06_pqs": {
   "authors": [
    [
     "Peter",
     "Reichl"
    ],
    [
     "Florian",
     "Hammer"
    ]
   ],
   "title": "Charging for quality-of-experience: a new paradigm for pricing IP-based service",
   "original": "pqs6_171",
   "page_count": 7,
   "order": 29,
   "p1": "171",
   "pn": "177",
   "abstract": [
    "Over the last couple of years, the interdisciplinary research area of \"Internet Economics\" has received rapidly increasing attention, especially regarding various proposals for Qualityof- Service (QoS) aware charging of IP services. However, the continuously strong trend towards flat-rate pricing in todays fixed and mobile networks indicates that QoS differentiation does not provide a suitable economic framework for the tradeoff between quality delivered by the provider and willingnessto- pay from the customers side. Therefore, in this paper we argue for a paradigm shift towards Quality-of-Experience (QoE) as an alternative framework for pricing service quality according to the user perception. To this end, we provide a comprehensive survey about various charging schemes for Internet services, discuss the evolution from QoS to QoE and finally describe in detail two different proposals for QoEaware Internet charging, i.e. (1) an instrumental approach complementing standard charging architectures with an additional module for translating network QoS into perceptual QoS, and (2) a novel mechanism called \"Reactive Charging\" which is based on direct user feedback for both perceived quality and willingness-to-pay.\n",
    ""
   ]
  }
 },
 "sessions": [
  {
   "title": "Keynote Papers",
   "papers": [
    "sasse06_pqs",
    "blauert06_pqs"
   ]
  },
  {
   "title": "Sound Design",
   "papers": [
    "jekosch06_pqs",
    "vastfjall06_pqs"
   ]
  },
  {
   "title": "Quality of Virtual Environments",
   "papers": [
    "silzle06_pqs",
    "kuhn06_pqs",
    "raake06_pqs"
   ]
  },
  {
   "title": "Quality of Music",
   "papers": [
    "merchel06_pqs",
    "skowronek06_pqs"
   ]
  },
  {
   "title": "Quality of Speech Technology",
   "papers": [
    "moller06_pqs",
    "oulasvirta06_pqs",
    "krebber06_pqs",
    "hempel06_pqs"
   ]
  },
  {
   "title": "Methodologies and Methods",
   "papers": [
    "chen06_pqs",
    "rath06_pqs",
    "chateau06_pqs"
   ]
  },
  {
   "title": "Quality in Telecommunications",
   "papers": [
    "mahdi06_pqs",
    "waltermann06_pqs",
    "huo06_pqs",
    "cote06_pqs",
    "mahdi06b_pqs",
    "kettler06_pqs"
   ]
  },
  {
   "title": "Audio and Video Quality",
   "papers": [
    "voldhaug06_pqs",
    "yamagishi06_pqs"
   ]
  },
  {
   "title": "Quality in Cars and Rooms",
   "papers": [
    "klasmeyer06_pqs",
    "holub06_pqs"
   ]
  },
  {
   "title": "Other topics",
   "papers": [
    "susini06_pqs",
    "joost06_pqs",
    "reichl06_pqs"
   ]
  }
 ]
}