{
 "title": "3rd International Workshop on Perceptual Quality of Systems (PQS 2010)",
 "location": "Bautzen, Germany",
 "startDate": "6/9/2010",
 "endDate": "8/9/2010",
 "chair": "Chairs: Ute Jekosch, Ercan Altinsoy, Sebastian Möller, Alexander Raake",
 "ISSN": "1680-8908",
 "conf": "PQS",
 "year": "2010",
 "name": "pqs_2010",
 "series": "PQS",
 "SIG": "",
 "title1": "3rd International Workshop on Perceptual Quality of Systems",
 "title2": "(PQS 2010)",
 "date": "6-8 September 2010",
 "booklet": "pqs_2010.pdf",
 "papers": {
  "bech10_pqs": {
   "authors": [
    [
     "Søren",
     "Bech"
    ],
    [
     "Ditte Hvas",
     "Mortensen"
    ]
   ],
   "title": "Identification of perceptual attributes constituting the user’s experience of mechanical switches",
   "original": "1",
   "page_count": 6,
   "order": 1,
   "p1": 1,
   "pn": 6,
   "abstract": [
    "The Repertory Grid Technique was applied to identify the perceptual a ttributes constituting the users experience of mechanical switches for seven sensory conditions. Participants (105) were subjected to six bimodal and unimodal sensory combinations created by selectively restricting the flow of haptic, auditory and visual information, plus one condition with full sensory information. Verbal Classification analysis and principal components analy sis (PCA) on the obtained rating data suggest that the primary dimension is associated with the magnitude of the haptic feedback and the second is associated with the quality of the feedback, determined by combinations of auditory, visual and haptic information.\n"
   ],
   "doi": "10.21437/PQS.2010-1"
  },
  "merchel10_pqs": {
   "authors": [
    [
     "Sebastian",
     "Merchel"
    ],
    [
     "M. Ercan",
     "Altinsoy"
    ],
    [
     "Maik",
     "Stamm"
    ]
   ],
   "title": "Touch the Sound: Audio-Driven Tactile Feedback for Audio Mixing Applications",
   "original": "2",
   "page_count": 5,
   "order": 2,
   "p1": 7,
   "pn": 11,
   "abstract": [
    "In this study, experiments were conducted to determine if a person could distinguish percussive audio loops by their fingertips using audio-driven tactile feedback. The audio signal was adapted to generate a vibration signal (tactile feedback) taking into account the limited capabilities of the tactile modality. A systematic approach to find the different adaptation parameters is discussed. The vibrations were created by an electro-dynamic shaker mounted behind a touch-sensitive screen. Results indicate percussive loops are best distinguished if the source features (e.g., frequency spectrum) and sequence features (e.g., rhythm) are maintained. Also, the pragmatic and hedonic qualities of an interactive, multimodal system using audio-driven tactile feedback were evaluated using a semantic differential.\n"
   ],
   "doi": "10.21437/PQS.2010-2"
  },
  "stamm10_pqs": {
   "authors": [
    [
     "Maik",
     "Stamm"
    ],
    [
     "M. Ercan",
     "Altinsoy"
    ],
    [
     "Sebastian",
     "Merchel"
    ]
   ],
   "title": "Identification Accuracy and Efficiency of Haptic Virtual Objects Using Force-feedback",
   "original": "3",
   "page_count": 6,
   "order": 3,
   "p1": 12,
   "pn": 17,
   "abstract": [
    "In the field of constructive solid geometry, modelers combine (or decombine) geometry primitives like cones, cylinders, prisms, pyramids and spheres to create digital models of physical items. Haptically recognizing the shape of such complex models in virtual environments represents a challenging task if just minimal information is conveyed while using forcefeedback with a single point of contact. However conducting object identification experiments is very important for determining chances and limits offered by such a haptic feedback system. Therefore this paper describes two experiments using planes and surfaces based on geometry primitives, geometry primitives themselves, frustums and combined geometry primitives for recognition task. In the first experiment the models are postured upright (not rotated). In the second experiment the same models are randomly rotated to investigate influences of posture. Test persons’ averaged identification accuracy and exploration time are determined. Furthermore important statements and sources of identification errors are listed that have to be considered to allow intuitive, reliable and fast exploration.\n"
   ],
   "doi": "10.21437/PQS.2010-3"
  },
  "blauert10_pqs": {
   "authors": [
    [
     "Jens",
     "Blauert"
    ],
    [
     "Ute",
     "Jekosch"
    ]
   ],
   "title": "A Layer Model of Sound Quality",
   "original": "4",
   "page_count": 6,
   "order": 4,
   "p1": 18,
   "pn": 23,
   "abstract": [
    "Sound-quality is a complex and multi-layered phenomenon [1]. When analysing or modelling the formation process of sound-quality judgements, a variety of quality elements and quality features [2] have to be taken into account, whereby the actual relevance and salience of each of them is situation dependent. In this paper, we present some ideas with the aim of structuring the quality-formation process into different layers according to the degree of abstraction involved. Depending on this degree, different sets of references and evaluation and assessment methods have to be employed.\n"
   ],
   "doi": "10.21437/PQS.2010-4"
  },
  "asutay10_pqs": {
   "authors": [
    [
     "Erkin",
     "Asutay"
    ],
    [
     "Daniel",
     "Västfjäll"
    ],
    [
     "Ana",
     "Tajadura-Jimenez"
    ],
    [
     "Anders",
     "Genell"
    ],
    [
     "Penny",
     "Bergman"
    ],
    [
     "Mendel",
     "Kleiner"
    ]
   ],
   "title": "Emoacoustics: a study of the physical and psychological dimensions of emotional sound design",
   "original": "5",
   "page_count": 5,
   "order": 5,
   "p1": 24,
   "pn": 28,
   "abstract": [
    "Psychoacoustical research provided indispensible knowledge on how human audition works, which is necessary for successful sound design applications. It may, however, be argued that traditional psychoacoustics, in its narrow focus on signal characteristics, has neglected listener and contextual characteristics. Thus, to demonstrate the influence of meaning the listener attaches to a sound we used an FFT processing to reduce the identifiability of 18 environmental sounds, since source identification is central to meaning attribution. In a listening experiment, 20 subjects listened to and rated all the processed stimuli first and then original stimuli, without being aware of the existence of two sets. Another 20 subjects rated only the processed stimuli, which were primed by their original counterparts. This manipulation was used in order to see the difference when the subject could tell what the sound source is. In both tests subjects rated their emotional experience for each stimulus on the orthogonal dimensions of valence and arousal, as well as perceived annoyance and perceived loudness for each stimulus. They were also asked to identify the sound source. It was found that processing caused correct identification to reduce substantially, while priming recovered most of the identification. While original stimuli induced a wide range of emotional experience, reactions to processed stimuli were affectively neutral. Priming manipulation reversed the effects of processing to some extent. Moreover, even though Zwickers-loudness value of most of the stimuli was reduced after processing, perceived loudness was only decreased for affectively negative stimuli.\n"
   ],
   "doi": "10.21437/PQS.2010-5"
  },
  "altinsoy10_pqs": {
   "authors": [
    [
     "M. Ercan",
     "Altinsoy"
    ]
   ],
   "title": "Quality of Auditory-Tactile Virtual Environments",
   "original": "6",
   "page_count": 7,
   "order": 6,
   "p1": 29,
   "pn": 35,
   "abstract": [
    "In our daily life, we mostly perceive an event by more than one sensory modality (e.g., vision, audition, touch). Therefore multimodal integration and interaction play an important role when we use objects in our environment, e.g. for object or event recognition. Burdea and Coiffet define the virtual environment as a simulation in which computer graphics is used to create a realistic looking interactive world [1]. Virtual environments support communication with the user not only through the visual channel but also through other modalities, taking into account the multisensory nature of humans. In addition to the visual communication channel, the auditory and tactile senses are the most used communication channels. In recent years a variety of customer products which have additional tactile input and output capabilities have been developed (for example: Apple iPhone, different touch-screen applications, Wiimote, etc.). Some of these devices bring new possibilities to interact with a computer. These trends are also valid for the auditory modality. Binaural synthesis and rendering are becoming a key technology for multimedia products. “Virtual Environments” are not any more only the subject of academic research, there are also commercial applications, particularly in medicine, game and entertainment industry. This trend results that the quality of virtual environments becomes more and more important. The user interactivity of virtual environments is a key issue for the quality perception. Several studies have discussed the quality of displays, input and output devices (for different modalities) as well as software and hardware issues. However the multimodal user interaction should be taken into account in addition to the mentioned parameters to assess the quality of virtual environments. The focus of this paper is on the parameters influencing the perceptual quality of audio-tactile virtual environments.\n"
   ],
   "doi": "10.21437/PQS.2010-6"
  },
  "altinsoy10b_pqs": {
   "authors": [
    [
     "M. Ercan",
     "Altinsoy"
    ],
    [
     "Michael",
     "Ferling"
    ],
    [
     "Ute",
     "Jekosch"
    ]
   ],
   "title": "The Semantic Space of Vehicle Sounds - An Approach to Develop a Semantic Differential in View of Customer Perceptions",
   "original": "7",
   "page_count": 5,
   "order": 7,
   "p1": 36,
   "pn": 40,
   "abstract": [
    "Sound quality evaluation of the vehicle sound is a complex process. Physical measures are not sufficient to describe and understand this process and they can only give superficial cues. Psychoacoustical parameters and measurements also do not allow a general description of the vehicle sound quality. The quality evaluation of the customers is based on their perception, interpretation and expectations. The aim of this study is to generate the semantic space of vehicle sounds. In other words, a number of attributes relating to the perception and quality of vehicle sound will be elicited. This semantic space will be the basis of the development of attribute scales (Semantic Differential). Therefore our aim is to find the common descriptive language of the customers which is appropriate for the vehicle sound quality evaluation. An approach was developed and applied in this study. The steps of this approach include a thinking aloud test (free verbal remarking interview), the evaluation of the terms according to their suitability in describing acoustically perceptible vehicle properties by all subjects, testing the understandability of the attributes for all subjects, control the completeness of the semantic database to describe the vehicle sounds conducting a similarity experiment, testing the relevance and the redundancy of the attributes. At the end of the investigation eight different sets of attributes were developed for eight different driving conditions. Each set contains 18 to 36 attributes.\n"
   ],
   "doi": "10.21437/PQS.2010-7"
  },
  "wolters10_pqs": {
   "authors": [
    [
     "Maria K.",
     "Wolters"
    ],
    [
     "Florian",
     "Gödde"
    ],
    [
     "Sebastian",
     "Möller"
    ],
    [
     "Klaus-Peter",
     "Engelbrecht"
    ]
   ],
   "title": "Finding Patterns in User Quality Judgements",
   "original": "8",
   "page_count": 6,
   "order": 8,
   "p1": 41,
   "pn": 46,
   "abstract": [
    "User quality judgements can show a bewildering amount of variation that is difficult to capture using traditional quality prediction approaches. Using clustering, an exploratory statistical analysis technique, we reanalysed the data set of a Wizard-of-Oz experiment where 25 users were asked to rate the dialogue after each turn. The sparse data problem was addressed by careful a priori parameter choices and comparison of the results of different cluster algorithms. We found two distinct classes of users, positive and critical. Positive users were generally happy with the dialogue system, and did not mind errors. Critical users downgraded their opinion of the system after errors, used a wider range of ratings, and were less likely to rate the system positively overall. These user groups could not be predicted by experience with spoken dialogue systems, attitude to spoken dialogue systems, affinity with technology, demographics, or short-term memory capacity. We suggest that evaluation research should focus on critical users and discuss how these might be identified.\n"
   ],
   "doi": "10.21437/PQS.2010-8"
  },
  "schatz10_pqs": {
   "authors": [
    [
     "Raimund",
     "Schatz"
    ],
    [
     "Sebastian",
     "Egger"
    ],
    [
     "Kathrin",
     "Masuch"
    ]
   ],
   "title": "Gain from Strain? Assessing the Impact of User Fatigue on the Quality of Subjective MOS Ratings",
   "original": "9",
   "page_count": 6,
   "order": 9,
   "p1": 47,
   "pn": 52,
   "abstract": [
    "This paper addresses a central question in subjective test design: ”What is the appropriate duration for QoE lab experiments that involve human participants?” Since user tests are time-consuming and costly, this is an important question as it exposes the fundamental challenge of maximizing test duration while avoiding problems arising from undue strain on test participants. We provide an extensive analysis of the influence that workload and fatigue have on the rating behavior of QoE test participants, based on empirical data. Our analysis is grounded on measurements and experiences made during two typical QoE lab studies which assessed the impact of different network conditions on perceived quality of data services (web browsing, file download). During both studies, we measured participants’ workload and fatigue in two complementary ways, subjectively by means of a questionnaire and objectively by capturing eye blink rate (EBR). Our main finding is that even after 90 minutes of active testing, the mean and standard deviation of participants’ MOS grades were not significantly affected by their temporal position within the test sessions (beginning vs. end). Thus, for comparable QoE lab user experiments, this duration represents a safe recommendation for balancing results quantity with results quality.\n"
   ],
   "doi": "10.21437/PQS.2010-9"
  },
  "lamm10_pqs": {
   "authors": [
    [
     "Katrin",
     "Lamm"
    ],
    [
     "Thomas",
     "Mandl"
    ],
    [
     "Christa",
     "Womser-Hacker"
    ],
    [
     "Werner",
     "Greve"
    ]
   ],
   "title": "User Experiments with Search Services: Methodological Challenges for Measuring the Perceived Quality",
   "original": "10",
   "page_count": 6,
   "order": 10,
   "p1": 53,
   "pn": 58,
   "abstract": [
    "For many people, search engines are a crucial entry point for their online activities today. People use search services to find relevant information of their interest on the web. Measuring the quality of search systems is a challenging task. User expectations have been proposed as one possible parameter for user satisfaction. The so-called confirmation/disconfirmation (C/D) paradigm, a widely used model to describe customer satisfaction, was used to predict the reaction of search engine users. Two studies were conducted to examine how prior expectations of users affect their perceptions of system quality of search engines. This paper describes the initial test designs, compares the methodical approaches and presents a concise summary of statistical results obtained using ANOVA.\n"
   ],
   "doi": "10.21437/PQS.2010-10"
  },
  "moller10_pqs": {
   "authors": [
    [
     "Sebastian",
     "Möller"
    ],
    [
     "Frank",
     "Kettler"
    ],
    [
     "Hans-Wilhelm",
     "Gierlich"
    ],
    [
     "Nicolas",
     "Côté"
    ],
    [
     "Alexander",
     "Raake"
    ],
    [
     "Marcel",
     "Wältermann"
    ]
   ],
   "title": "Extending the E-Model to Better Capture Terminal Effects",
   "original": "11",
   "page_count": 6,
   "order": 11,
   "p1": 59,
   "pn": 64,
   "abstract": [
    "In this paper, we address the parametric prediction of speech quality for planning telecommunication networks. More specifically, we propose an extension to the E-model recommended by the International Telecommunication Union in order to better capture the effects of signal processing equipment integrated in the terminals. We propose to use two additional parameters for describing the effects of noise reduction, namely the signal- to-noise ratio improvement during speech and the total noise level reduction. Furthermore, we propose to introduce an additional equipment im pairment factor for describing the speech degradations resulting from imperfect noise reduction. The proposed extensions are analyzed on the basis of data collected with seven modern handsets, and directions for future work are discussed.\n"
   ],
   "doi": "10.21437/PQS.2010-11"
  },
  "cote10_pqs": {
   "authors": [
    [
     "Nicolas",
     "Côté"
    ],
    [
     "Vincent",
     "Koehl"
    ],
    [
     "Sebastian",
     "Möller"
    ],
    [
     "Alexander",
     "Raake"
    ],
    [
     "Marcel",
     "Wältermann"
    ],
    [
     "Valérie",
     "Gautier-Turbin"
    ]
   ],
   "title": "Diagnostic Instrumental Speech Quality Assessment in a Super-Wideband Context",
   "original": "12",
   "page_count": 6,
   "order": 12,
   "p1": 65,
   "pn": 70,
   "abstract": [
    "Speech quality models usually estimate the integral quality of the degraded speech files. Such quality values do not inform system developers and telephone service providers on the perceived degradation introduced by the system under study. This paper describes a new intrusive speech quality model, called Diagnostic Instrumental Assessment of Listening quality (DIAL), providing diagnostic information in both narrow-band and super-wideband contexts. Contrary to previous methods, this model estimates scores on four perceptual quality dimensions, Directness/Frequency content, Continuity, Noisiness and Loudness. These four dimensions are assumed to define the whole speech quality space.\n"
   ],
   "doi": "10.21437/PQS.2010-12"
  },
  "raake10_pqs": {
   "authors": [
    [
     "Alexander",
     "Raake"
    ],
    [
     "Marcel",
     "Wältermann"
    ],
    [
     "Falk",
     "Schiffner"
    ],
    [
     "Ulf",
     "Wüstenhagen"
    ],
    [
     "Bernhard",
     "Feiten"
    ]
   ],
   "title": "How to talk about speech and audio quality with speech and audio people?",
   "original": "13",
   "page_count": 6,
   "order": 13,
   "p1": 71,
   "pn": 76,
   "abstract": [
    "We present results of two speech and two audio quality listening tests to compare the two test methods ACR and MUSHRA for different content types. These comparisons have two primary goals: (i) Find relations for transforming test results obtained with one method onto the scale of the other, and (ii) refine audio quality results obtained using the ACR method by using MUSHRA-results for the upper quality regime, where MUSHRA typically shows a sightly better resolution than ACR. The aim is to contribute to the harmonization of speech and audio assessment methods considered meaningful in the light of the convergence between speech and audio coding and transmission.\n"
   ],
   "doi": "10.21437/PQS.2010-13"
  },
  "huckvale10_pqs": {
   "authors": [
    [
     "Mark",
     "Huckvale"
    ],
    [
     "Gaston",
     "Hilkhuysen"
    ],
    [
     "Deizom",
     "Frasi"
    ]
   ],
   "title": "Performance-Based Measurement of Speech Quality with an Audio Proof-Reading Task",
   "original": "14",
   "page_count": 6,
   "order": 14,
   "p1": 77,
   "pn": 82,
   "abstract": [
    "Existing measures of speech intelligibility and speech quality can be ineffective for evaluating new types of speech communication systems, such as wideband audio codecs, digital hearing aids and noise-reduction systems. We propose that new performance-based evaluation methods are required which tap into the cognitive effort listeners employ to understand speech through such systems. We present an example of such a method, based on the correction of transcripts of fluent spontaneous dialogues, and evaluate it for six different signal qualities, including telephone, added noise and noise-reduced conditions. We show that signal quality has a significant effect both in terms of transcript error detection accuracy and in terms of processing speed. We also show that in this test noise-reduction did not have any beneficial effect, despite the commonly recorded opinion that noise reduction improves signal quality.\n"
   ],
   "doi": "10.21437/PQS.2010-14"
  },
  "waltermann10_pqs": {
   "authors": [
    [
     "Marcel",
     "Wältermann"
    ],
    [
     "Alexander",
     "Raake"
    ],
    [
     "Sebastian",
     "Möller"
    ]
   ],
   "title": "Can latent speech quality dimensions be quantified directly?",
   "original": "15",
   "page_count": 6,
   "order": 15,
   "p1": 83,
   "pn": 88,
   "abstract": [
    "Previous studies revealed that the quality of transmitted speechcan well be described by three perceptual dimensions: “discontinuity”, “noisiness”, and “coloration”. In this paper, a methodis presented for quantifying these dimensions directly in subjective tests. Two experiments were conducted according to this method with large sets of test conditions. A detailed descriptionof the test procedure and a thorough analysis of the results is presented. The proposed method is reliable and produces meaningful and orthogonal results for diverse stimuli sets, in particular for stimuli containing multi-dimensional degradations. The method might form the basis for collecting the data for future diagnostic speech quality estimators.\n"
   ],
   "doi": "10.21437/PQS.2010-15"
  },
  "holub10_pqs": {
   "authors": [
    [
     "Jan",
     "Holub"
    ],
    [
     "Peter",
     "Počta"
    ]
   ],
   "title": "Transmitted Speech Quality versus Perceptual Annoyance and Service Acceptability Thresholds",
   "original": "16",
   "page_count": 3,
   "order": 16,
   "p1": 89,
   "pn": 91,
   "abstract": [
    "In this contribution, two types of subjective listening test results are reported. The test goal was to link the P.800 MOS quality scale (1...5) to thresholds of service quality annoyance and service quality acceptability. Other tested aspect was trend analysis of these thresholds as identical experiment was performed 2 years ago.\n"
   ],
   "doi": "10.21437/PQS.2010-16"
  },
  "houben10_pqs": {
   "authors": [
    [
     "Rolph",
     "Houben"
    ],
    [
     "Tjeerd M.H.",
     "Dijkstra"
    ],
    [
     "Wouter A.",
     "Dreschler"
    ]
   ],
   "title": "Individual preference for the amount of noise reduction",
   "original": "17",
   "page_count": 6,
   "order": 17,
   "p1": 92,
   "pn": 97,
   "abstract": [
    "We measured individual preferences for pairs of audio streams differing in the amount of noise reduction (G min ). To describe the paired comparison data a logistic probability model was used based on a quadratic preference utility function. This model allowed for the calculation of the G min that was optimal for each individual subject. For five out of ten subjects the optimized G min (ranging from 5.5 to 10dB) differed significantly from the optimum obtained for the grouped data (7.1dB). The predicted preference of the individually optimized G min over the group optimum was slightly higher than chance level (up to 60%).\n"
   ],
   "doi": "10.21437/PQS.2010-17"
  },
  "schmidt10_pqs": {
   "authors": [
    [
     "Stefan",
     "Schmidt"
    ],
    [
     "Klaus-Peter",
     "Engelbrecht"
    ],
    [
     "Matthias",
     "Schulz"
    ],
    [
     "Martin",
     "Meister"
    ],
    [
     "Julian",
     "Stubbe"
    ],
    [
     "Mandy",
     "Töppel"
    ],
    [
     "Sebastian",
     "Möller"
    ]
   ],
   "title": "Identification of interactivity sequences in interactions with spoken dialog systems",
   "original": "18",
   "page_count": 6,
   "order": 18,
   "p1": 98,
   "pn": 103,
   "abstract": [
    "The MeMo workbench is an existing system for semi-automated usability testing and following a rule based approach. The rules which are actually used have been obtained from usability expert knowledge as well as from empirical observations in a more or less uncontrolled way. In this paper we present a sociotechnical approach for finding rules, which implement probable user behavior, in a structuralized and more realistic way. We will give short introduction to the MeMo workbench followed by the description of our approach and the resulting experiment.\n"
   ],
   "doi": "10.21437/PQS.2010-18"
  },
  "antons10_pqs": {
   "authors": [
    [
     "Jan-Niklas",
     "Antons"
    ],
    [
     "Robert",
     "Schleicher"
    ],
    [
     "Ingo",
     "Wolf"
    ],
    [
     "Anne K.",
     "Porbadnigk"
    ],
    [
     "Benjamin",
     "Blankertz"
    ],
    [
     "Sebastian",
     "Möller"
    ],
    [
     "Gabriel",
     "Curio"
    ]
   ],
   "title": "Neural correlates of speech degradation – Subjective ratings and brain activation in case of signal-correlated noise",
   "original": "19",
   "page_count": 4,
   "order": 19,
   "p1": 104,
   "pn": 107,
   "abstract": [
    "Recent studies with magnetoencephalography (MEG) have shown that the human auditory cortex is particularly sensitive to reduction in sound and speech quality. In this paper, we examine whether this sensitivity is also visible in the electroencephalogram (EEG) and whether it is possible to detect subconscious processes which can then be used to improve the behavioral assessment of speech quality. In order to compare the physiological results with behavioral measurements, we degraded a speech stimulus (vowel /a/) in a scalable way and asked for a pair comparison (PC) and a comparison category rating (CCR) of the degraded stimuli. In addition, the brain activity of eleven healthy subjects was measured with EEG, focusing on event-related potentials (ERPs). We found that the threshold as set by the Modulated Noise Reference Unit (MNRU) for the PC and CCR are on a similar signal-to-noise level. We trained classifiers, which were found capable of distinguishing between events which are seemingly similar at the behavioral level (i.e., no button press). Converging evidence suggests that the classifier results could reflect subconscious cortical sensitivity to sound degradations.\n"
   ],
   "doi": "10.21437/PQS.2010-19"
  },
  "garcia10_pqs": {
   "authors": [
    [
     "Marie-Neige",
     "Garcia"
    ],
    [
     "Alexander",
     "Raake"
    ]
   ],
   "title": "Quality impact of video format and scaling in the context of IPTV.",
   "original": "20",
   "page_count": 6,
   "order": 20,
   "p1": 108,
   "pn": 113,
   "abstract": [
    "In this paper we investigate the influence of the video format and of re-scaling on the perceived video quality in the context of IPTV. Addressed resolutions are typical of IPTV: Standard Definition (SD, 720 x 576 pixels) and High Definition (HD, 1920x1080 pixels). Re-scaling comprises SD to HD (4:3, 1350x1080) upscaling and cropping from HD 16:9 (1920x1080) to HD 4:3 (1350x1080) format. In parallel, we analyze the influence of IPTV typical degradations (compression, loss-induced slicing and freezing) on the quality-impact of video format and re-scaling. In addition, we investigate the possibility of modelling the effect of up-scaling on quality and of having one video quality model for both SD and HD by including video format related parameters as additional inputs to the model. A further analysis is provided for discussing the choice of the employed subjective test design. Results show that the quality impact of video format and of re-scaling depends on the amount and type of degradations.\n"
   ],
   "doi": "10.21437/PQS.2010-20"
  },
  "dostal10_pqs": {
   "authors": [
    [
     "Petr",
     "Dostal"
    ],
    [
     "Milos",
     "Klima"
    ]
   ],
   "title": "Image Quality Impact and Comparison of Selected State-of-the-Art CFA Interpolation Technique",
   "original": "21",
   "page_count": 6,
   "order": 21,
   "p1": 114,
   "pn": 119,
   "abstract": [
    "Among recent multimedia imaging systems single chip cameras are do minating over three chip cameras. The single chip cameras with a CFA as a color splitting system provide the RGB im ages with mutually different and in complete sampling. The calculation of full resolution RGB im ages brings some problems and selected interpolation technique can affect the final image quality very significantly. This paper summarizes experimental results and performance comparison for four recent CFA interpolation techniques. Having the reference with reconstructed im ages available, the performance of each technique has been evaluated by objective criteria - both PSNR and SSIM.\n"
   ],
   "doi": "10.21437/PQS.2010-21"
  },
  "bahne10_pqs": {
   "authors": [
    [
     "Adrian",
     "Bahne"
    ]
   ],
   "title": "Perceived Sound Quality of Small Original and Optimized Loudspeaker Systems",
   "original": "22",
   "page_count": 6,
   "order": 22,
   "p1": 120,
   "pn": 125,
   "abstract": [
    "The perceived sound quality of small loudspeaker systems with and without digital optimization was empirically evaluated in a listening experiment. Further, the influence on the results of the presentation order of the two versions was investigated, as well as a self-evaluation of potential use for variance reduction. The systems were optimized by means of FIR filters. The two versions of each loudspeaker system were rated in a paired comparison test for music stimuli. For the purpose of analysis a linear gaussian model was applied, resulting in an interval scale revealing interesting information about certainty and discrimination ability of the subjects. The test investigated whether linear precompensation of rather cheap systems results in a significant improvement of the perceived audio quality in a typical listening situation. The results indicated a significant preference for the optimized version and a significant dependency on the presentation order was detected. The self-evaluation was found to be uncorrelated to the test results.\n"
   ],
   "doi": "10.21437/PQS.2010-22"
  },
  "lindau10_pqs": {
   "authors": [
    [
     "Alexander",
     "Lindau"
    ],
    [
     "Fabian",
     "Brinkmann"
    ]
   ],
   "title": "Perceptual evaluation of individual headphone compensation in binaural synthesis based on non-individual recordings",
   "original": "23",
   "page_count": 6,
   "order": 23,
   "p1": 126,
   "pn": 131,
   "abstract": [
    "The headphone transfer function (HpTF) is one major source of spectral coloration that occurs in non-individual binaural synthesis. Filters for frequency response compensation can be derived from measurements of HpTFs. Therefore, a reliable method for measuring at the blocked ear canal had to be developed. Subsequently, in comparing dynamic binaural simulations directly to reality we could assess effects of non-individual, generic and individual headphone compensation in listening tests. Additionally, we tested improvements of the regularization scheme of a LMS inversion algorithm, the effect of minimum phase inverse filters, and a method for the low frequency extension by means of integrating a subwoofer.\n"
   ],
   "doi": "10.21437/PQS.2010-23"
  },
  "legarth10_pqs": {
   "authors": [
    [
     "Søren V.",
     "Legarth"
    ],
    [
     "Jesper",
     "Ramsgaard"
    ],
    [
     "Guillaume Le",
     "Ray"
    ],
    [
     "Nick",
     "Zacharov"
    ]
   ],
   "title": "A performance comparison of Home Usage Testing and Central Location Testing in small impairment listening tests.",
   "original": "24",
   "page_count": 6,
   "order": 24,
   "p1": 132,
   "pn": 137,
   "abstract": [
    "The performance of listening tests can be a laborious process and requires significant preparation and control to ensure good data quality. This is particularly true for small impairment listening tests performed in accordance to recommendation ITU-R BS.1116-1 [1] in dedicated listening rooms under calibrated conditions. The usage of such central location testing (CLT) methods is time consuming, costly and limited to the physical location. An alternative type of test is the home usage testing (HUT) whereby the assessors evaluate a product in normal usage at home, as commonly encountered in consumer evaluations. This paper provides a comparative analysis of the two methods in a small impairment study of audio codec performance.\n"
   ],
   "doi": "10.21437/PQS.2010-24"
  },
  "legarth10b_pqs": {
   "authors": [
    [
     "Søren Vase",
     "Legarth"
    ],
    [
     "Christian Stender",
     "Simonsen"
    ],
    [
     "Lars",
     "Bramsløw"
    ],
    [
     "Guillaume Le",
     "Ray"
    ],
    [
     "Nick",
     "Zacharov"
    ]
   ],
   "title": "Sensory evaluation of hearing aid performance based on normal-hearing listeners",
   "original": "25",
   "page_count": 6,
   "order": 25,
   "p1": 138,
   "pn": 143,
   "abstract": [
    "This paper describes a method used for evaluating sound quality of 4 hearing aid products using expert assessors for a sensory profiling test and a preference test. Hearing aids were evaluated by trained normal-hearing listeners in 7 different sound environments that were selected to represent some of the common hearing aid user situations. The scenarios were reproduced in a standard listening room. Assessors performed a consensus language development to establish seven key sound quality attributes, which they used to assess the performance of each hearing aid in each sound scenario. Additionally, preference data was also collected from assessors. The univariate analysis of the preference data and the multivariate analysis of the sensory profiling data are discussed in detail.\n"
   ],
   "doi": "10.21437/PQS.2010-25"
  }
 },
 "sessions": [
  {
   "title": "Keynote 1",
   "papers": [
    "bech10_pqs"
   ]
  },
  {
   "title": "Quality of Multimodal Perception I – Audiotactile Interaction",
   "papers": [
    "merchel10_pqs",
    "stamm10_pqs"
   ]
  },
  {
   "title": "Sound Quality",
   "papers": [
    "blauert10_pqs",
    "asutay10_pqs",
    "altinsoy10_pqs",
    "altinsoy10b_pqs"
   ]
  },
  {
   "title": "User Quality Judgements",
   "papers": [
    "wolters10_pqs",
    "schatz10_pqs",
    "lamm10_pqs"
   ]
  },
  {
   "title": "Speech Quality I",
   "papers": [
    "moller10_pqs",
    "cote10_pqs"
   ]
  },
  {
   "title": "Speech Quality II",
   "papers": [
    "raake10_pqs",
    "huckvale10_pqs",
    "waltermann10_pqs"
   ]
  },
  {
   "title": "Speech Quality III",
   "papers": [
    "holub10_pqs",
    "houben10_pqs",
    "schmidt10_pqs",
    "antons10_pqs"
   ]
  },
  {
   "title": "Quality of Multimodal Perception II – Audiovisual Interaction",
   "papers": [
    "garcia10_pqs",
    "dostal10_pqs"
   ]
  },
  {
   "title": "Perceptual Studies on Spatial Audio Reproduction",
   "papers": [
    "bahne10_pqs",
    "lindau10_pqs"
   ]
  },
  {
   "title": "Hearing Aids and Performance Evaluation",
   "papers": [
    "legarth10_pqs",
    "legarth10b_pqs"
   ]
  }
 ],
 "doi": "10.21437/PQS.2010"
}