{
 "title": "4th International Workshop on Perceptual Quality of Systems (PQS 2013)",
 "location": "Vienna, Austria",
 "startDate": "2/9/2013",
 "endDate": "4/9/2013",
 "URL": "http://pqs.qu.tu-berlin.de/about-pqs/",
 "chair": "Chairs: Raimund Schatz and Tobias Hoßfeld",
 "conf": "PQS",
 "year": "2013",
 "name": "pqs_2013",
 "series": "PQS",
 "SIG": "",
 "title1": "4th International Workshop on Perceptual Quality of Systems",
 "title2": "(PQS 2013)",
 "date": "2-4 September 2013",
 "booklet": "pqs_2013.pdf",
 "papers": {
  "moor13_pqs": {
   "authors": [
    [
     "Katrien De",
     "Moor"
    ],
    [
     "Miguel A. Ríos",
     "Quintero"
    ],
    [
     "Dominik",
     "Strohmeier"
    ],
    [
     "Alexander",
     "Raake"
    ]
   ],
   "title": "Evaluating QoE by means of traditional and alternative subjective measures: an exploratory 'living room lab' study on IPTV",
   "original": "1",
   "page_count": 6,
   "order": 1,
   "p1": 1,
   "pn": 6,
   "abstract": [
    "In this paper, we explore the use of a set of potential 'alternative', emotional state and engagement-related measures of QoE and investigate how they relate to traditional QoE measures. To this end, we present results from a living room lab study (N=28) in which the impact of slicing errors on QoE was investigated. Our findings indicate significant differences in QoE between the three used error profiles, both when considering the traditional and alternative measures. Furthermore, we found that the link between the traditional and alternative measures is rather weak, indicating that the former may need to be reconsidered and extended with alternative measures, which allow to measure QoE in terms of 'delight' or 'annoyance'. "
   ],
   "doi": "10.21437/PQS.2013-1"
  },
  "kepplinger13_pqs": {
   "authors": [
    [
     "Sara",
     "Kepplinger"
    ],
    [
     "Christian",
     "Jauch"
    ],
    [
     "Denise",
     "Tobian"
    ]
   ],
   "title": "Defining the Viewing Conditions in the Home Environment and its Influences",
   "original": "2",
   "page_count": 4,
   "order": 2,
   "p1": 7,
   "pn": 10,
   "abstract": [
    "This work describes the activities towards the definition of modern TV viewing environments and possible changes over time from a standardization point of view compared to the real usage in the living room. Up to now, standards are available in order to recommend the ideal viewing environment for different viewing conditions including TV system, usage purpose and kind of visualization (e.g. 2D vs. 3D) for subjective assessment of quality in laboratory environments. In order to define these and similar factors for the therein differentiated home environment a study was conducted investigating the collection of data which is relevant for future evaluation purposes. The results show, that different profiles might be detectable concerning room conditions but not concerning the illumination and ambient light conditions deriving from a small-scale field examination. Based on this, we would like to discuss the process of defining the home environment and its influence including ambient light conditions. "
   ],
   "doi": "10.21437/PQS.2013-2"
  },
  "antons13_pqs": {
   "authors": [
    [
     "Jan-Niklas",
     "Antons"
    ],
    [
     "Sebastian",
     "Arndt"
    ],
    [
     "Robert",
     "Schleicher"
    ]
   ],
   "title": "Effect of Questionnaire Order on Ratings of Perceived Quality and Experienced Affect",
   "original": "3",
   "page_count": 3,
   "order": 3,
   "p1": 11,
   "pn": 13,
   "abstract": [
    "The assessment of perceived quality and experienced affect of users towards different audio and speech quality levels using subjective rating methods is a common and valid approach. In case that researchers are interested in the subjective a) quality and b) affective rating, participants have to rate the stimuli on both scales. Even though subject should just rate only one of the scales to be not influenced by the questions asked in the other questionnaire, researchers in practice frequently present various scales in a sequence to subjects. This paper examines the effect of questionnaire order on perceived quality and experienced affect by comparing the ratings of two groups of subjects which filled in questionnaires in different orders after listening to the same set of stimuli. We showed that the order of sequence had a significant effect on perceived quality and experienced affect as e.g. the quality of stimuli was rated lower if the quality rating not occurred instantly after stimulus presentation. Thus we want to create awareness for these effects and presented first guidelines to overcome them. "
   ],
   "doi": "10.21437/PQS.2013-3"
  },
  "varela13_pqs": {
   "authors": [
    [
     "Martin",
     "Varela"
    ],
    [
     "Toni",
     "Mäki"
    ],
    [
     "Lea",
     "Skorin-Kapov"
    ],
    [
     "Tobias",
     "Hoßfeld"
    ]
   ],
   "title": "Increasing Payments in Crowdsourcing: Don't look a gift horse in the mouth!",
   "original": "4",
   "page_count": 6,
   "order": 4,
   "p1": 14,
   "pn": 19,
   "abstract": [
    "A commonly cited maxim states that \"you get what you pay for\", implying that there is a strong correlation between the price paid for something, and its quality. In this paper, we examine whether this often-cited wisdom applies to using crowdsourcing for conducting subjective QoE experiments, and if so, how. As part of a large-scale user study designed to assess Web QoE, we conducted two crowdsourced campaigns to collect user ratings and study the influence of certain website design parameters related to typography and color on the overall visual appeal of the site. While the test content was exactly the same across both campaigns, the second campaign was set up to pay participants three times the reward of the first one. The goal was to analyze the impact of payment on a number of parameters, including the ratio of reliable users and obtained MOS values. With respect to QoE modeling, we found that while payment levels influenced absolute MOS values, there was no significant impact on the actual model.\n"
   ],
   "doi": "10.21437/PQS.2013-4"
  },
  "moller13_pqs": {
   "authors": [
    [
     "Sebastian",
     "Möller"
    ],
    [
     "Friedemann",
     "Köster"
    ],
    [
     "Falk",
     "Schiffner"
    ],
    [
     "Janto",
     "Skowronek"
    ]
   ],
   "title": "Analyzing Technical Causes and Perceptual Dimensions for Diagnosing the Quality of Transmitted Speech",
   "original": "5",
   "page_count": 6,
   "order": 5,
   "p1": 20,
   "pn": 25,
   "abstract": [
    "We present an analysis of technical causes and corresponding perceptual dimensions of the quality of transmitted speech. Four experts annotated speech files of a common database according to a methodology which is currently being discussed for the future ITU-T Recommendation P.TCA. The annotations are analyzed with respect to their frequency and consistency, and compared to overall quality values as well as perceptual dimension scores, obtained either from subjective experiments or from instrumental models. This way, links can be drawn between technical causes and perceptual dimensions in diagnostic quality assessment of transmitted speech, and the proposed procedures of several upcoming ITU-T Recommendations can be initially validated. \n"
   ],
   "doi": "10.21437/PQS.2013-5"
  },
  "fingscheidt13_pqs": {
   "authors": [
    [
     "Tim",
     "Fingscheidt"
    ],
    [
     "Patrick",
     "Bauer"
    ]
   ],
   "title": "A Phonetic Reference Paradigm for Instrumental Speech Quality Assessment of Artificial Speech Bandwidth Extension",
   "original": "6",
   "page_count": 4,
   "order": 6,
   "p1": 26,
   "pn": 29,
   "abstract": [
    "Today’s instrumental speech quality measures are limited in their use as they ”do not yet sufficiently include processing steps beyond the periphery of the auditory system” [1]. This becomes particularly obvious when using reference-based instrumental methods to assess the quality of artificial speech bandwidth extension (ABWE) approaches. While Blauert and Jekosch [1] have not proposed particular schemes, they advocate a model of sound quality representing layers of abstraction. In fact, once subjects are asked for opinion scores following any of ITU-T’s definitions, they have already understood (or not) what was spoken. It is our firm conviction that in not too-bad testing conditions this knowledge serves as internal reference for judging speech quality – which in consequence asks for a paradigm shift of reference-based instrumental speech quality measures. In consequence, not only some (direct wideband) reference speech data is useful, but also a phonetic transcription of the speech, serving as human-internal representation of what was spoken. The paper will give thoughts to support this thesis, along with a proof that not all sounds are equal, asking for a phoneme-specific processing of future reference-based instrumental speech quality assessment methods. \n"
   ],
   "doi": "10.21437/PQS.2013-6"
  },
  "norrenbrock13_pqs": {
   "authors": [
    [
     "Christoph",
     "Norrenbrock"
    ],
    [
     "Florian",
     "Hinterleitner"
    ],
    [
     "Ulrich",
     "Heute"
    ],
    [
     "Sebastian",
     "Möller"
    ]
   ],
   "title": "Quality Estimation Based on Regular Perception",
   "original": "7",
   "page_count": 6,
   "order": 7,
   "p1": 30,
   "pn": 35,
   "abstract": [
    "We present a novel approach for speech-quality prediction based on the observation that perception-relevant properties may cover a wide range of different values without significantly changing perceptual quality. To account for this nonlinear phenomenon, a semi-supervised discretization concept is proposed which is applied to temporal as well as aggregated properties as a preprocessing step prior to conventional modelling. The idea of perceptual regularization allows for integrating an assumed perceptual reference into the modelling process without neglecting the empirical cognition effects coded in the subjective test data. For the example of synthetic-speech quality we will demonstrate how the two main goals of quality estimation, namely interpretability and robustness, are addressed through the presented approach. "
   ],
   "doi": "10.21437/PQS.2013-7"
  },
  "jackson13_pqs": {
   "authors": [
    [
     "Iain",
     "Jackson"
    ]
   ],
   "title": "Perceived quality of speech degraded by wind noise: An assessment of sources of variability in a Web experiment",
   "original": "8",
   "page_count": 4,
   "order": 8,
   "p1": 36,
   "pn": 39,
   "abstract": [
    "An online speech-in-noise task was used to assess the effect of wind noise degradation on perceptions of audio quality. Many researchers in experimental psychology are increasingly confident of the potential of web-based tasks of perception and cognition. Investigations of the perception of audio quality, however, require consideration of additional factors (e.g. different reproduction systems) which may contribute to variability. Here we report analyses of potential sources of variability, in self-reported categories by participants pre-test. These categories are participant age, audio expertise, method of audio reproduction and level of background noise in the testing environment. Some effects on quality ratings were found but, overall, effect sizes suggest these were small relative to the effect of the main experimental variable of wind noise. "
   ],
   "doi": "10.21437/PQS.2013-8"
  },
  "sackl13_pqs": {
   "authors": [
    [
     "Andreas",
     "Sackl"
    ],
    [
     "Michael",
     "Seufert"
    ],
    [
     "Tobias",
     "Hoßfeld"
    ]
   ],
   "title": "Asking costs little? The impact of tasks in video QoE studies on user behavior and user ratings",
   "original": "9",
   "page_count": 6,
   "order": 9,
   "p1": 40,
   "pn": 45,
   "abstract": [
    "Three crowdsourcing video QoE studies have been conducted to investigate the influence of tasks on user behavior and quality perception. Different dimensions of tasks have been applied to impaired video clips and their impact on task success, focus time, and QoE was measured. Our findings suggest that task presence or absence has no influence on the user. However, continuous tasks can improve the focus times of users, and hard tasks are suitable to filter unreliable participants. "
   ],
   "doi": "10.21437/PQS.2013-9"
  },
  "msakni13_pqs": {
   "authors": [
    [
     "Hajer Gahbiche",
     "Msakni"
    ]
   ],
   "title": "Impact of non-QoS related parameters on video QoE",
   "original": "10",
   "page_count": 5,
   "order": 10,
   "p1": 46,
   "pn": 50,
   "abstract": [
    "Nowadays a huge amount of multimedia content is available over different Online Social Networks (OSN) Web sites such as Facebook, YouTube, ... Therefore, the proposal of mechanisms capable to assessing the user satisfaction, i.e. Quality of Experience (QoE), become imminent. Different work has shown that the QoE may be affected by different QoS parameters. However, these parameters are not the only factors that might affect the QoE. This paper considers two non-QoS parameters: the video length and the different moment of the day. This paper presents a comparative study based on subjective assessment, that consider different lengths of video sequences, i.e. 30 seconds, 1 minute 30s, 3 minutes, 5 minutes and 8 minutes. These videos sequences belong to four different classes: funny, documentary, soccer and film class. This paper considers also different moment of the day, i.e. morning, midday, afternoon and night, in the assessment process. \n"
   ],
   "doi": "10.21437/PQS.2013-10"
  },
  "pitrey13_pqs": {
   "authors": [
    [
     "Yohann",
     "Pitrey"
    ],
    [
     "Helmut",
     "Hlavacs"
    ]
   ],
   "title": "You look blocky, is everything alright? Influence of video distortions on facial expression recognition & quality",
   "original": "11",
   "page_count": 6,
   "order": 11,
   "p1": 51,
   "pn": 56,
   "abstract": [
    "The ability to read expressions on human faces is hardwired in the human brain, as a very powerful tool to sample non-verbal information about the emotional disposition of other people. Nowadays, more and more face-toface interactions are happening over multimedia systems, including video conferencing, watching movies and interacting with virtual characters. Some of these systems usually rely on compression and other data reduction mechanisms to cope with limited transmission speeds. This paper evaluates the impact of typical video distortions, such as compression, spatial and temporal downscaling, on the ability of human subjects to recognize facial expressions. We use a realistic face simulator to generate four basic facial expressions, which we distort under typical scenarios, and measure both the ability of participants to recognize the facial expressions and the overall perceived quality. Our results show that the scene composition and the expressions have a significant impact on perception, and show some evidence on the relation between recognition rate and perceived quality. "
   ],
   "doi": "10.21437/PQS.2013-11"
  },
  "djordjevic13_pqs": {
   "authors": [
    [
     "Dragana S",
     "Djordjevic"
    ],
    [
     "David",
     "Okolisan"
    ],
    [
     "Maja",
     "Pokric"
    ],
    [
     "Dragan",
     "Kukolj"
    ]
   ],
   "title": "Toward Certification of 3D Video Quality of Experience through Inter - Laboratory Comparison",
   "original": "12",
   "page_count": 6,
   "order": 12,
   "p1": 57,
   "pn": 62,
   "abstract": [
    "The fast development and increasing use of 3D video technology increases the need for standardization and certification processes when it comes to quality of video experience. Due to the specific conditions necessary for high-quality 3D video reproduction, an important role in evaluating the quality of 3D video plays the human experience factor. In order to find the best mechanisms for 3D video testing analysis of existing objective evaluation methods and proposal for certifiable subjective evaluations are required. This paper summarizes existing standards which are related to general inter-laboratory testing, examines the best practices for 3D video quality assessment from different laboratories, and based on gathered state-of-the art subjective measurements proposes a universal method which can be used as basis for certification procedure. "
   ],
   "doi": "10.21437/PQS.2013-12"
  },
  "gupta13_pqs": {
   "authors": [
    [
     "Rishabh",
     "Gupta"
    ],
    [
     "Khalil Rehman",
     "Laghari"
    ],
    [
     "Sebastian",
     "Arndt"
    ],
    [
     "Robert",
     "Schleicher"
    ],
    [
     "Sebastian",
     "Möller"
    ],
    [
     "Douglas",
     "O'Shaughnessy"
    ],
    [
     "Tiago",
     "Falk"
    ]
   ],
   "title": "Using fNIRS to Characterize Human Perception of TTS System Quality, Comprehension, and Fluency: Preliminary Findings",
   "original": "13",
   "page_count": 6,
   "order": 13,
   "p1": 63,
   "pn": 68,
   "abstract": [
    "The quality of synthesized speech signals from different Text-to-Speech (TTS) systems is traditionally evaluated using subjective tests based on user ratings. Subjective testing, however, is challenging due to the variability and complexity of human perception. As such, recently there has been a shift towards exploring new objective techniques to evaluate the quality of TTS systems. In this paper, we describe our initial effort of characterizing human TTS quality perception via neurophysiological insights obtained from a neuroimaging technology called functional Near Infrared Spectroscopy (fNIRS). This approach allowed for a link between the human decision making process and the quality of different TTS systems to be established. We showed significant correlations between perceived quality and several fNIRS features related to cerebral haemodynamics. These preliminary results have helped establish the potential of fNIRS as an important tool for evaluating the quality of TTS systems. "
   ],
   "doi": "10.21437/PQS.2013-13"
  },
  "arndt13_pqs": {
   "authors": [
    [
     "Sebastian",
     "Arndt"
    ],
    [
     "Robert",
     "Schleicher"
    ],
    [
     "Jan-Niklas",
     "Antons"
    ]
   ],
   "title": "Does Low Quality Audiovisual Content Increase Fatigue of Viewers?",
   "original": "14",
   "page_count": 4,
   "order": 14,
   "p1": 69,
   "pn": 72,
   "abstract": [
    "While most quality studies measure purely the subjectively perceived quality of videos, physiological measurements can give more detailed information about the perception of multimedia consumers. Thus, they provide better information about long-term effects as they are difficult to estimate by purely subjective studies. The current study uses electroencephalography (EEG) to measure effects of fatigue during watching low and high quality videos. Therefore, a usual video was chosen, after partly reducing the bit rate of the video subjects watched it and gave subjective ratings accompanied by measuring EEG. With the obtained data we showed that lower video quality produces a higher percentage of alpha waves in the EEG, thus participants got more fatigued. Since these alpha waves are an indicator for the level of fatigue. \n"
   ],
   "doi": "10.21437/PQS.2013-14"
  },
  "robitza13_pqs": {
   "authors": [
    [
     "Werner",
     "Robitza"
    ],
    [
     "Yohann",
     "Pitrey"
    ],
    [
     "Benjamin",
     "Kitzinger"
    ],
    [
     "Helmut",
     "Hlavacs"
    ]
   ],
   "title": "The NappingPlayer - Projective Mapping Experiments on Android Tablets",
   "original": "15",
   "page_count": 6,
   "order": 15,
   "p1": 73,
   "pn": 78,
   "abstract": [
    "Projective Mapping opens up new ways of interpreting experienced quality from a bottom-up perspective and identifies the main dimensions along which it is classified. This methodology comes from the sensory sciences, and asks users to place stimuli on a tablecloth in front of them, according to their perceived similarity. They may then be freely labeled and grouped in order to explore the semantics of the users’ perception. We apply Projective Mapping in the domain of Quality of Experience assessment, and implement a novel application for tablet PCs, which allows for a more efficient and accurate test procedure. This paper presents the application and results from a preliminary study. "
   ],
   "doi": "10.21437/PQS.2013-15"
  },
  "langjahr13_pqs": {
   "authors": [
    [
     "Paco",
     "Langjahr"
    ],
    [
     "Pejman",
     "Mowlaee"
    ]
   ],
   "title": "Objective Quality Assessment of Target Speaker Separation Performance in Multisource Reverberant Environment",
   "original": "16",
   "page_count": 6,
   "order": 16,
   "p1": 79,
   "pn": 84,
   "abstract": [
    "Sound quality estimation of a speech enhancement or source separation system in a realistic adverse noise scenario is a challenge. In particular, the connection between results obtained by quality metrics versus those obtained from human subjective listening tests is unknown. In this paper, as the first attempt, we present results, which examine the correlation between certain objective metrics and Multi Stimulus with Hidden Reference and Anchor Point (MUSHRA) listening tests. There are a variety of applications which may benefit from the outcome of this study, since the enhancement/separation system is often used as a pre-processing stage for target applications such as - to name a few - automatic speech recognition, speech coding, speaker recognition and hearing aid devices. In all these applications the knowledge of which objective metrics reliably predicts subjective results is of great importance, as it saves the time consuming task of listening tests in future studies when developing a new enhancement system. The paper presents performance evaluation of several benchmark systems in a realistic noisy reverberant environment using the existing objective quality metrics. Subjective listening experiments which are relevant for perceptual speech quality. MUSHRA listening test is also conducted as our subjective evaluation. Comparing the objective and subjective results we present the discussion about which metrics correlate well with subjective listening tests. "
   ],
   "doi": "10.21437/PQS.2013-16"
  },
  "altinsoy13_pqs": {
   "authors": [
    [
     "M. Ercan",
     "Altinsoy"
    ]
   ],
   "title": "Towards an European Sound Label for Household Appliances: Psychoacoustical Aspects and Challenges",
   "original": "17",
   "page_count": 6,
   "order": 17,
   "p1": 85,
   "pn": 90,
   "abstract": [
    "The European Union energy label, which provides information on the energy consumption of household appliances, has proven its reliability for the customers in recent years. However, a label for the product sound perception, which can be very useful for the customers but also manufacturers, is not available up to now. The energy label is required to include the sound power level of the devices. Although the sound power level is an important acoustical parameter, it does not characterize the customers' perception of product sound sufficiently. The psychoacoustical parameters, e.g., loudness, sharpness, tonality, roughness, fluctuation strength, etc., are much more useful for characterization purposes. However, in some cases it is required to adapt these parameters for complex household product sounds and to model their interaction. Another important issue refers to the optimal measurement environment (anechoic chamber vs. real living environment) and the measurement conditions for sound quality testing. The aims of this study are to summarize the results of investigations, which were conducted on two different household appliances (vacuum cleaner, dishwasher), and discuss the future milestones on the way to a European sound label. "
   ],
   "doi": "10.21437/PQS.2013-17"
  },
  "beattie13_pqs": {
   "authors": [
    [
     "David",
     "Beattie"
    ],
    [
     "Lynne",
     "Baillie"
    ],
    [
     "Martin",
     "Halvey"
    ],
    [
     "Rod",
     "McCall"
    ]
   ],
   "title": "Maintaining a Sense of Control in Autonomous Vehicles via Auditory Feedback",
   "original": "18",
   "page_count": 5,
   "order": 18,
   "p1": 91,
   "pn": 95,
   "abstract": [
    "This paper presents the findings from an observational field study conducted with 8 car drivers. The study attempted to create a taxonomy of sounds that present information to people whilst driving. We also aimed to determine whether participants noticed these sounds as they occurred and whether they paid attention to them. Furthermore, we asked the participants subjective questions regarding particular sonic attributes and their ability to catch driver's attention. It was concluded that although certain sounds occur regularly, differing levels of attention are given to each depending on the information they present. Our study also revealed that while all sonic attributes play an impact in catching driver's attention, some aspects are more noticeable than others. We conclude with a discussion of our future directions with regards to the findings obtained from our observational field study and outline the plan for our next study. "
   ],
   "doi": "10.21437/PQS.2013-18"
  },
  "drews13_pqs": {
   "authors": [
    [
     "Michael",
     "Drews"
    ],
    [
     "Steffen",
     "Schlapak"
    ],
    [
     "Stefano",
     "Rini"
    ],
    [
     "Michele",
     "Nicoletti"
    ],
    [
     "Werner",
     "Hemmert"
    ]
   ],
   "title": "A Neurogram Matching Similarity Index (NMSI) for the Assessment of Audio Quality",
   "original": "19",
   "page_count": 6,
   "order": 19,
   "p1": 96,
   "pn": 101,
   "abstract": [
    "In this paper, the performance of neurogram and spectrogram similarity indexes for the prediction of perceived audio quality is evaluated. Additionally, a new method for comparison of internal signal representations is introduced that relies on a two-dimensional extension of the Needleman-Wunsch algorithm. It approximates the twodimensional edit distance which is given by the minimum cost to transform one matrix into another by sequentially inserting, deleting and changing the positions and values of single elements. By choosing the cost of each operation, we define a similarity index which can be used for assessment of audio quality among neurograms or spectrograms. We evaluate the performance of this measure to estimate the sound quality of audio files degraded by low bit-rate audio COder-DECoders (CODECs). The new measure shows high correlation with Perceptual Evaluation of Audio Quality (PEAQ) predictions and outperforms other measures of similarity in the literature. We find similarity of spectrograms and neurograms to be sensitive to changes in audio quality for low bit-rate codings. "
   ],
   "doi": "10.21437/PQS.2013-19"
  },
  "reimes13_pqs": {
   "authors": [
    [
     "Jan",
     "Reimes"
    ],
    [
     "Marc",
     "Lepage"
    ],
    [
     "Frank",
     "Kettler"
    ],
    [
     "Jörg",
     "Zerlik"
    ],
    [
     "Frank",
     "Homann"
    ],
    [
     "Christoph",
     "Montag"
    ]
   ],
   "title": "Analytical Analysis of Disturbed Radio Broadcast",
   "original": "20",
   "page_count": 6,
   "order": 20,
   "p1": 102,
   "pn": 107,
   "abstract": [
    "Analogue radio broadcast signals are often disturbed in various ways as experienced in driving situations. These disturbances cover typical, short term \"pops\", longer noise bursts, short term \"mutes\", insertion of so-called \"HighCut\", i.e. the attenuation of higher frequencies to mask disturbances or noticeable stereo/mono switching. These disturbances can be separated in two parts: they are caused either by bad reception conditions (loss of transmission energy, interferences, multiple transmission paths etc.) or by implemented masking techniques in FM receivers in order to improve audio quality. "
   ],
   "doi": "10.21437/PQS.2013-20"
  },
  "wilfinger13_pqs": {
   "authors": [
    [
     "David",
     "Wilfinger"
    ],
    [
     "Nicole",
     "Perterer"
    ],
    [
     "Arno",
     "Laminger"
    ],
    [
     "Alexander",
     "Meschtscherjakov"
    ],
    [
     "Manfred",
     "Tscheligi"
    ]
   ],
   "title": "Measuring Sound Experience with In-Vehicle Speaker Systems",
   "original": "21",
   "page_count": 4,
   "order": 21,
   "p1": 108,
   "pn": 111,
   "abstract": [
    "Measuring the perceived quality of speaker systems in the car together with potential users is important to evaluate new speaker developments. Existing sound perception questionnaires suffer from being difficult to answer for human beings because audio perceptions are, for the average user, hard to express in words. In this paper, we present a questionnaire that focuses on user experiences that drivers and passengers have with in-car speaker systems. It uses seven items each representing a dimension of car sound user experience. We describe the development of the questionnaire and a first study, which compares the experiences of two speaker systems. Our questionnaire showed a high reliability and enabled us to compare the level to which the speaker systems evoked positive experiences. "
   ],
   "doi": "10.21437/PQS.2013-21"
  },
  "sackl13b_pqs": {
   "authors": [
    [
     "Andreas",
     "Sackl"
    ],
    [
     "Raimund",
     "Schatz"
    ]
   ],
   "title": "Evaluating the impact of expectations on end-user quality perception",
   "original": "22",
   "page_count": 7,
   "order": 22,
   "p1": 112,
   "pn": 118,
   "abstract": [
    "In Quality of Experience (QoE) research, the concept of ’expectations’ is frequently used but seldom defined with sufficient clarity and precision. In this paper, we present theoretical and conceptual approaches originating from various research fields that deal with expectations and its measurement. In addition, we also present results from our own empirical work to exemplify how to measure and to evoke expectations in the context of perceived quality for multimedia services. Together these contributions form the basis for an interdisciplinary discussion of the nature of expectations on quality perception as well as its role in QoE research. "
   ],
   "doi": "10.21437/PQS.2013-22"
  },
  "rainer13_pqs": {
   "authors": [
    [
     "Benjamin",
     "Rainer"
    ],
    [
     "Christian",
     "Timmerer"
    ],
    [
     "Markus",
     "Waltl"
    ]
   ],
   "title": "Recommendations for the Subjective Evaluation of Sensory Experience",
   "original": "23",
   "page_count": 6,
   "order": 23,
   "p1": 119,
   "pn": 124,
   "abstract": [
    "Selecting and adopting the appropriate assessment method for conducting subjective quality assessments is a challenging task. The method decides whether the assessment is successful in delivering the correct answers to previously set up hypotheses. Therefore, in this paper we provide recommendations on test methods used in the domain of Sensory Experience. The proposed test methods comprise single stimulus and double stimulus methods. These test methods were used in previous studies and are presented in combination with the results of the subjective quality assessments with which they were used. Furthermore, we briefly outline our test setup, test design, and test content for assessing Sensory Experience which have been validated through conducted assessments. "
   ],
   "doi": "10.21437/PQS.2013-23"
  },
  "jokinen13_pqs": {
   "authors": [
    [
     "Kristiina",
     "Jokinen"
    ],
    [
     "Graham",
     "Wilcock"
    ]
   ],
   "title": "User Experience in Human-Robot Interactions",
   "original": "24",
   "page_count": 6,
   "order": 24,
   "p1": 125,
   "pn": 130,
   "abstract": [
    "This paper describes our experiments concerning human-robot interaction and its evaluation in order to measure the user's communication experience with the robot. We assume that the user's evaluation of the interaction reflects their participation in the interaction as a participant, and correlates with their own multimodal signaling as well as with their perception of the robot's communicative capability. The work contributes to evaluation methodology of intelligent situated agents, as we explore the role and effect of the user's own activity in successful communication experience, and ultimately in their evaluation of interactive systems, instead of focusing solely on task completion. This also adds to our understanding of how the interlocutors perceive interaction, and of the important cognitive processes that underlie communication experience in general. "
   ],
   "doi": "10.21437/PQS.2013-24"
  },
  "skowronek13_pqs": {
   "authors": [
    [
     "Janto",
     "Skowronek"
    ],
    [
     "Falk",
     "Schiffner"
    ],
    [
     "Alexander",
     "Raake"
    ]
   ],
   "title": "On the influence of involvement on the quality of multiparty conferencing",
   "original": "25",
   "page_count": 6,
   "order": 25,
   "p1": 131,
   "pn": 136,
   "abstract": [
    "The present study is a first investigation on the potential influence of conversation and task involvement on quality ratings in the context of multiparty telemeetings. The results show that involvement has indeed a significant impact, and it can be larger than the effect of the tested technical degradations. This study confirms experience from the two-party context and gives an estimate of rating differences between listening and conversation tests. "
   ],
   "doi": "10.21437/PQS.2013-25"
  },
  "holub13_pqs": {
   "authors": [
    [
     "Jan",
     "Holub"
    ],
    [
     "Peter",
     "Pocta"
    ],
    [
     "Jean-Yves",
     "Monfort"
    ],
    [
     "Joachim",
     "Pomy"
    ]
   ],
   "title": "Management Conversational Quality Predictor",
   "original": "26",
   "page_count": 4,
   "order": 26,
   "p1": 137,
   "pn": 140,
   "abstract": [
    "In a majority of modern networks traditional end-to-end transmission planning is no longer possible, but popular field testing in technologies such as UMTS, NGN and LTE, typically reveals only one quality component of the QoS. This paper describes an operational quality estimator developed within ETSI STF 436 project called Management Conversational Quality Predictor (MCQP) which can combine results from field trials with other impairments such as one-way delay, echo loss, type of conversation, etc. Potential areas for an extension of the designed model are outlined in a conclusion of the paper. "
   ],
   "doi": "10.21437/PQS.2013-26"
  },
  "mller13_pqs": {
   "authors": [
    [
     "Anders",
     "Møller"
    ],
    [
     "Pablo",
     "Hoffmann"
    ],
    [
     "Marcello",
     "Carrozzino"
    ],
    [
     "Claudia",
     "Faita"
    ],
    [
     "Giovanni",
     "Avveduto"
    ],
    [
     "Franco",
     "Tecchia"
    ],
    [
     "Flemming",
     "Christensen"
    ],
    [
     "Dorte",
     "Hammershøi"
    ]
   ],
   "title": "Joint evaluation of communication quality and user experience in an audio-visual virtual reality meeting",
   "original": "27",
   "page_count": 6,
   "order": 27,
   "p1": 141,
   "pn": 146,
   "abstract": [
    "This paper presents a method for evaluating a communication situation in a multimodal multi-user virtual environment. In the evaluation both the quality of the communication and the user experience will be addressed. Twenty-four subjects participated in the experiment which was carried out in a virtual reality CAVE. Two different sound presentations were used (Diotic and Binaural) and two different video presentations using two levels of video quality. The mix between these two variables created four different sessions. In each session the subjects observed a virtual meeting. The subjects tried all sessions and rated their experience on different scales. The subjects also answered a questionnaire about the content of the meeting. The preliminary results from the experiment showed no differences between the subjects' rating of the experience. Tendencies of relation between visual cues and subjects ability to detect the emotional state of the meeting members were shown. "
   ],
   "doi": "10.21437/PQS.2013-27"
  },
  "kepplinger13b_pqs": {
   "authors": [
    [
     "Sara",
     "Kepplinger"
    ],
    [
     "Denise",
     "Tobian"
    ]
   ],
   "title": "Wizard of Oz Approach for a 3DVO Video Communication System",
   "original": "28",
   "page_count": 4,
   "order": 28,
   "p1": 147,
   "pn": 150,
   "abstract": [
    "This work describes the concept and the test of a Wizard of Oz Study approach. This is used in order to overcome the lack of interactivity of a pre-prototypical video communication application. The video communication system solves the problem of missing eye-contact by using free viewpoint video technology. Thereof, the quality should be evaluated. However, the system is not yet applicable in real-time due to extensive rendering. Therefore, a simulation in respect of quality evaluation is intended. The research question is towards which extent the test participants do not recognize the simulation and how this profits the design and evaluation phase. The results show the applicability of the Wizard of Oz Study approach in this context as well as critical issues on social interaction which needs to be taken into consideration and which we want to discuss within the workshop. "
   ],
   "doi": "10.21437/PQS.2013-28"
  },
  "morton13_pqs": {
   "authors": [
    [
     "Alfred",
     "Morton"
    ]
   ],
   "title": "Improved Internet speed tests can enhance QoS and QoE",
   "original": "29",
   "page_count": 6,
   "order": 29,
   "p1": 151,
   "pn": 156,
   "abstract": [
    "Many Internet users spend time away from their typical activities to make measurements of their current performance, using one or more of today's widespread \"Speed Test\" web sites and apps. Their motivations to test are varied, often prompted by new service subscription or performance problems, and the objective results they measure have become an aspect of their perception of service quality and a growing part of their experience. There are two key issues impeding the progress of this growing crowd of measurement \"experts\": 1, the accuracy of the measurements and 2, how few systems help the users find and resolve the problems they perceive. Therefore, there is room for improvement beginning with the design of the measurements themselves and the network scope where measurements are most needed. For users with fixed broadband access and Wi-Fi networks, the main cause of impairments may be in their home. "
   ],
   "doi": "10.21437/PQS.2013-29"
  },
  "casas13_pqs": {
   "authors": [
    [
     "Pedro",
     "Casas"
    ],
    [
     "Dimitra",
     "Paraskevopoulou"
    ],
    [
     "Giuseppe",
     "Settanni"
    ],
    [
     "Stefan",
     "Suette"
    ],
    [
     "Patrick",
     "Zwickl"
    ],
    [
     "Raimund",
     "Schatz"
    ]
   ],
   "title": "Quality of Experience in Telepresence and Remote Collaboration Cloud Services",
   "original": "30",
   "page_count": 6,
   "order": 30,
   "p1": 157,
   "pn": 162,
   "abstract": [
    "Cloud-based systems are gaining enormous popularity due to a number of promised benefits, including ease of use in terms of deployment, administration and maintenance, high scalability and flexibility to create new services, and others. However, as more personal and business applications migrate to the Cloud, the quality of the service becomes an important differentiator between providers. This paper addresses the problem of Quality of Experience in Telepresence and Remote Collaboration (TRC) services provided by Microsoft Lync Online (MLO). MLO is a Cloud-based service providing online meeting capabilities including videoconferencing, audio calls, and desktop sharing, and has become the default system for TRC in enterprise scenarios. We present a complete study of the QoE undergone by 44 MLO users (22pairs, interactive sessions)in controlled subjective lab tests. The study is performed on three different interactive scenarios running on top of the real MLO Cloud service, additionally shaping the Lync flows at the access network to influence the participants' experience. The scenarios include audio conferencing, videoconferencing, and remote collaboration though desktop sharing. By passively monitoring the end-to-end QoS achieved by the Lync flows, and correlating it with the QoE feedbacks provided by the participants, this study enables better understanding of the interplays between network performance and QoE in TRC Cloud services. \n"
   ],
   "doi": "10.21437/PQS.2013-30"
  },
  "moller13b_pqs": {
   "authors": [
    [
     "Sebastian",
     "Möller"
    ],
    [
     "Dennis",
     "Pommer"
    ],
    [
     "Justus",
     "Beyer"
    ],
    [
     "Jannis",
     "Rake-Revelant"
    ]
   ],
   "title": "Factors Influencing Gaming QoE: Lessons Learned from the Evaluation of Cloud Gaming Services",
   "original": "31",
   "page_count": 5,
   "order": 31,
   "p1": 163,
   "pn": 167,
   "abstract": [
    "In this paper, we present initial results from the evaluation of two computer games provided by a prototypical cloud gaming service provider. An experiment is described which addresses the impact of transmission bandwidth and delay on different aspects of user-perceived quality. It is analyzed with respect to the impact of the experimental procedure and set-up. The analysis shows that the set-up of the local player software and the restriction of the transmission channel considerably impact the subjective judgments. In addition, game content impacts performance metrics as well as perceived quality. Implications of these findings for the experimental set-up of cloud gaming quality evaluation are discussed. "
   ],
   "doi": "10.21437/PQS.2013-31"
  },
  "grafl13_pqs": {
   "authors": [
    [
     "Michael",
     "Grafl"
    ],
    [
     "Christian",
     "Timmerer"
    ]
   ],
   "title": "Representation Switch Smoothing for Adaptive HTTP Streaming",
   "original": "32",
   "page_count": 6,
   "order": 32,
   "p1": 168,
   "pn": 173,
   "abstract": [
    "When an adaptive media streaming system has to switch from one representation of the content to another, the switch causes viewer distraction. We introduce the concept of representation switch smoothing for alleviating the distraction and improving the overall quality of experience. As adaptive HTTP streaming systems typically deploy video buffers on the client side, the adaptation decision is known far enough ahead of playout time to perform a seamless transition between quality representations. We discuss implementation considerations for an adaptive HTTP streaming system with scalable video coding, present a subjective evaluation of the proposed approach, and identify factors that influence how smooth transitions are perceived. "
   ],
   "doi": "10.21437/PQS.2013-32"
  },
  "amrehn13_pqs": {
   "authors": [
    [
     "Philipp",
     "Amrehn"
    ],
    [
     "Karel",
     "Vandenbroucke"
    ],
    [
     "Tobias",
     "Hoßfeld"
    ],
    [
     "Katrien De",
     "Moor"
    ],
    [
     "Matthias",
     "Hirth"
    ],
    [
     "Raimund",
     "Schatz"
    ],
    [
     "Pedro",
     "Casas"
    ]
   ],
   "title": "Need for Speed? On QoE for File Storage Services",
   "original": "33",
   "page_count": 7,
   "order": 33,
   "p1": 174,
   "pn": 180,
   "abstract": [
    "Cloud computing is receiving growing attention by researchers from a variety of disciplines. However, so far only a few studies exist that investigate the Quality of Experience (QoE) of cloud services, including the category of personal file storage services like Dropbox or Livedrive, from an end user perspective. The contribution of this paper is a methodology and the results of four different user studies towards a situational QoE model for file storage services. In order to obtain insights in existing usage practices and to detect possible QoE influencing factors and relevant features, we conducted an online survey amongst users of personal cloud storage services in general (N=349) and one specifically targeted at users of one of the major popular cloud storage services, namely Dropbox (N=49). A third study (N=13) on mobile Dropbox further investigated QoE and specific use cases in a mobile context, via smartphones and tablets. Based on these results, typical usage situations as well as short-term and long-term QoE influence factors were derived which included user profile, context and situation, as well as system level influences. In a fourth lab study (N=52) the impact of waiting times, i.e. short-term QoE influences on system level during the regular usage of Dropbox, is investigated for different situations and use cases are obtained from the first three studies. As an outcome of our studies, we formulate research questions driving the agenda towards measuring and modeling QoE for cloud-based file storage services. \n"
   ],
   "doi": "10.21437/PQS.2013-33"
  }
 },
 "sessions": [
  {
   "title": "Context Factors",
   "papers": [
    "moor13_pqs",
    "kepplinger13_pqs",
    "antons13_pqs",
    "varela13_pqs"
   ]
  },
  {
   "title": "Speech Quality",
   "papers": [
    "moller13_pqs",
    "fingscheidt13_pqs",
    "norrenbrock13_pqs",
    "jackson13_pqs"
   ]
  },
  {
   "title": "Video Quality",
   "papers": [
    "sackl13_pqs",
    "msakni13_pqs",
    "pitrey13_pqs",
    "djordjevic13_pqs"
   ]
  },
  {
   "title": "New Assessment Methods",
   "papers": [
    "gupta13_pqs",
    "arndt13_pqs",
    "robitza13_pqs"
   ]
  },
  {
   "title": "Quality of Audio and Acoustics",
   "papers": [
    "langjahr13_pqs",
    "altinsoy13_pqs",
    "beattie13_pqs",
    "drews13_pqs",
    "reimes13_pqs"
   ]
  },
  {
   "title": "Sensory Experience and Expectations",
   "papers": [
    "wilfinger13_pqs",
    "sackl13b_pqs",
    "rainer13_pqs",
    "jokinen13_pqs"
   ]
  },
  {
   "title": "Conversation Quality",
   "papers": [
    "skowronek13_pqs",
    "holub13_pqs",
    "mller13_pqs",
    "kepplinger13b_pqs"
   ]
  },
  {
   "title": "Web and Cloud Services",
   "papers": [
    "morton13_pqs",
    "casas13_pqs",
    "moller13b_pqs",
    "grafl13_pqs",
    "amrehn13_pqs"
   ]
  }
 ],
 "doi": "10.21437/PQS.2013"
}