{
 "title": "ESCA Workshop on Prosody",
 "location": "Lund, Sweden",
 "startDate": "27/9/1993",
 "endDate": "29/9/1993",
 "conf": "Prosody",
 "year": "1993",
 "name": "prosody_1993",
 "series": "",
 "SIG": "",
 "title1": "ESCA Workshop on Prosody",
 "date": "27-29 September 1993",
 "papers": {
  "ladd93_prosody": {
   "authors": [
    [
     "D. Robert",
     "Ladd"
    ]
   ],
   "title": "Notes on the phonology of prominence",
   "original": "pro3_010",
   "page_count": 6,
   "order": 1,
   "p1": "10",
   "pn": "15",
   "abstract": [
    "An explicitly phonological approach to prosody, of the sort provided by autosegmental and metrical theory, is necessary for understanding the relationships among different prosodic phenomena. Prominence is not a simple phonetic property of syllables but a complex phenomenon reflecting the metrical structure of a phrase or utterance, the location of (intonational) pitch accents, and the utterance's paralinguistic aspects.\n",
    ""
   ]
  },
  "cruttenden93_prosody": {
   "authors": [
    [
     "Alan",
     "Cruttenden"
    ]
   ],
   "title": "The de-accenting and re-accenting of repeated lexical items",
   "original": "pro3_016",
   "page_count": 4,
   "order": 2,
   "p1": "16",
   "pn": "19",
   "abstract": [
    "The phenomenon of the de-accenting of old or 'given' information has often been taken for granted as an intonational universal, despite hints to the contrary in the literature. An attempt is made to construct a test of such de-accenting and apply it to eight languages. It is found that de-accenting and re-accenting vary according to discourse structure and to language.\n",
    ""
   ]
  },
  "grnnum93_prosody": {
   "authors": [
    [
     "Nina",
     "Grønnum"
    ]
   ],
   "title": "Rhythm in regional variants of standard danish",
   "original": "pro3_020",
   "page_count": 4,
   "order": 3,
   "p1": "20",
   "pn": "23",
   "abstract": [
    "The acoustic analysis is an attempt to establish the durational correlates of differences in perceived rhythm in six regional variants of Standard Danish. Durational relations between vowels and consonants in disyllabic sequences vary considerably across the six regions, but the correlation with differences in perceived rhythm is nearly nil. F0 patterns seem to be the main determinants of perceived rhythm.\n",
    ""
   ]
  },
  "grabe93_prosody": {
   "authors": [
    [
     "Esther",
     "Grabe"
    ],
    [
     "Paul",
     "Warren"
    ],
    [
     "Francis",
     "Nolan"
    ]
   ],
   "title": "Resolving category ambiguities - evidence from stress shift",
   "original": "pro3_024",
   "page_count": 4,
   "order": 4,
   "p1": "24",
   "pn": "27",
   "abstract": [
    "This paper presents an experimental study of stress shift in category-ambiguous material. Sequences such as Chinese fan exhibit phonological evidence for two structural analyses. If Chinese is an adjective, fan is stressed; the sequence is a syntactic phrase. If Chinese is a noun, fan is deaccented and the sequence a compound. Additionally, as Chinese is a stress shift item, stress shift may apply in the phrasal interpretation. Thus, category-ambiguous sequences with a potential for stress shift might contain earlier cues to syntactic category than sequences without such a potential. Production data show that stress shift patterns do indeed map onto syntactic categories, but only if the second element in the sequence is not right-branching. A comprehension experiment suggests that stress shift may facilitate category assignment.\n",
    ""
   ]
  },
  "hermes93_prosody": {
   "authors": [
    [
     "Dik J.",
     "Hermes"
    ],
    [
     "H. H.",
     "Rump"
    ]
   ],
   "title": "The role of pitch in lending prominence to syllables",
   "original": "pro3_028",
   "page_count": 4,
   "order": 5,
   "p1": "28",
   "pn": "31",
   "abstract": [
    "Pitch is one of the prosodic variables that play an important role in lending prominence to an accented syllable. Little is known, however, about which characteristics of a pitch contour are important in this respect. A model will be described in which it is assumed that the contribution of pitch to prominence depends linearly on the difference between the average pitch level in the nucleus of the accented syllable and the average pitch level in the nucleus of the preceding syllable. When excursion size is defined as the difference between upper and lower declination line, a consequence of this model is that, excursion sizes being equal, a fall lends more prominence to a syllable than a rise. An experiment will be described, in which this difference in prominence between a rise and a fall is measured for various declination slopes. The results are in good agreement with the predictions of the model.\n",
    ""
   ]
  },
  "hirst93_prosody": {
   "authors": [
    [
     "Daniel",
     "Hirst"
    ]
   ],
   "title": "Peak, boundary and cohesion characteristics of prosodic grouping",
   "original": "pro3_032",
   "page_count": 6,
   "order": 6,
   "p1": "32",
   "pn": "37",
   "abstract": [
    "Prosodic grouping can be defined as the way in which phonological units are assumed to join together to form larger units. Such grouping has, at various times and by various authors, been accounted for by appealing to one or more of three distinct but inter-related characteristics which I refer to here as peaks (= prominence, headedness), boundaries  (= disjunctive, discontinuity) and cohesion. (= juncture, continuity).\n",
    "There is a certain redundancy in these three characteristics. Thus boundaries and cohesion, for example, are mutually exclusive, together defining prosodic goups (=units, constituents or domains). The relationship between domains and groups is more subtle and also more theory dependent. Halle & Vergnaud (1987) argue that the pure representation of heads (= peaks) and the pure representation of domains (= groups) constitute \"conjugate representations\" which together define the notion of government: \"the property of being a head is the same as that of being a governing element in a constituent, and the property of being in some domain is the same as that of being governed by some head.\" (p. 16)\n",
    "Despite this redundancy, I argue that these three characteristics are worth distinguishing when we look at the way prosodic constituents are defined. Before looking at the way they apply to spoken language, as an exercise it may be interesting to see how these concepts can be applied to written language where the notion of constituents seems more easily defined.\n",
    ""
   ]
  },
  "campbell93_prosody": {
   "authors": [
    [
     "W. Nick",
     "Campbell"
    ]
   ],
   "title": "Durational cues to prominence and grouping",
   "original": "pro3_038",
   "page_count": 4,
   "order": 7,
   "p1": "38",
   "pn": "41",
   "abstract": [
    "This paper discusses the analysis of prosody in a speech-to-speech-through-machine environment and describes the types of processing that can be used to facilitate transfer of extra-textual information in automatic speech translation. In particular, it details the use and contribution of duration-based sub-routines in such a system.\n",
    ""
   ]
  },
  "fant93_prosody": {
   "authors": [
    [
     "Gunnar",
     "Fant"
    ],
    [
     "Anita",
     "Kruckenberg"
    ]
   ],
   "title": "Towards an integrated view of stress correlates",
   "original": "pro3_042",
   "page_count": 4,
   "order": 8,
   "p1": "42",
   "pn": "45",
   "abstract": [
    "Previous analysis of duration and of F0 as stress correlates in Swedish prose reading, Fant and Kruckenherg (1989), Fant, Kruckenberg and Nord (1992), have been extended and work has been initiated on the study of intensity, voice source properties and segmental contrasts as prosodic parameters. The hierarchy of duration over F0 and intensity is established. Although a small average intensity difference is found between stressed and unstressed syllables, the major role of intensity, apart from determining the loudness level, appears to be that of supplementing overall F0 contours within breathgroups. A special phenomenon in Swedish is the inverse relation between emphasis and intensity of close vowels due to articulatory narrowing.\n",
    ""
   ]
  },
  "naganomadsen93_prosody": {
   "authors": [
    [
     "Yasuko",
     "Nagano-Madsen"
    ]
   ],
   "title": "The grouping function of F0 and duration in two prosodically diverse languages - Eskimo and Yoruba",
   "original": "pro3_046",
   "page_count": 4,
   "order": 9,
   "p1": "46",
   "pn": "49",
   "abstract": [
    "This paper discusses how F0 and duration are utilized as local prosodic cues in two prosodically diverse languages - Eskimo and Yoruba. The analysis of text-reading and radio news-broadcasts has indicated that (1) F0 and duration are used in a mutually exclusive way in the two languages, (2) different relationships exists between F0 and duration for the two languages, but (3) there is a similar principle in the use of local prosodic cue in dividing a paragraph into smaller constituents.\n",
    ""
   ]
  },
  "wichmann93_prosody": {
   "authors": [
    [
     "Anne",
     "Wichmann"
    ]
   ],
   "title": "F0 troughs and prosodic phrasing",
   "original": "pro3_050",
   "page_count": 4,
   "order": 10,
   "p1": "50",
   "pn": "53",
   "abstract": [
    "This paper describes prosodic boundary phenomena in naturally occurring speech. In two different speaking styles, read and spontaneous, a systematic low trough in the f0 contour is found to correlate with both syntax and topic structure. There is also evidence for systematic topline declination between such boundaries, but only in the read speech.\n",
    ""
   ]
  },
  "levac93_prosody": {
   "authors": [
    [
     "Louise",
     "Levac"
    ],
    [
     "Henrietta J.",
     "Cedergren"
    ],
    [
     "Hélène",
     "Perreault"
    ]
   ],
   "title": "Phonetic evidence of narrow and wide temporal scope for prosodic constituents in French",
   "original": "pro3_054",
   "page_count": 4,
   "order": 11,
   "p1": "54",
   "pn": "57",
   "abstract": [
    "This research addresses the issue of motivating surface prosodic structure in spontaneous French corpora through the use of three complementary methods: auditory, acoustic-phonetic and distributional analyses. This hybrid phonetic-phonological approach has allowed the identification of four distinct levels of prosodic grouping: the intonational phrase, the rhythmic group, morphophonological binding and the syllable.\n",
    ""
   ]
  },
  "fretheim93_prosody": {
   "authors": [
    [
     "Thorstein",
     "Fretheim"
    ],
    [
     "Randi Alice",
     "Nilsen"
    ]
   ],
   "title": "How to tell h% from l% in right-detached expressions in Norwegian",
   "original": "pro3_058",
   "page_count": 4,
   "order": 12,
   "p1": "58",
   "pn": "61",
   "abstract": [
    "Native listeners' perception and identification of boundary tone - either tow (L%) or high (H%) - in East Norwegian intonation contours is determined by more than just the presence of a falling or a rising tune at the end of the contour. Empirical evidence supports the claim that the H%-L% distinction in syntactically right-detached particles which are lexically specified for boundary tone is accessed most easily if H% is expressed inside and L% outside a focal Foot. This paper accounts for the observed constraints.\n",
    ""
   ]
  },
  "auberge93_prosody": {
   "authors": [
    [
     "Véronique",
     "Aubergé"
    ]
   ],
   "title": "Prosody modeling with a dynamic lexicon of intonative forms: application for text-to-speech synthesis",
   "original": "pro3_062",
   "page_count": 4,
   "order": 13,
   "p1": "62",
   "pn": "65",
   "abstract": [
    "We propose here a methodology and tools for the semi-automatic constitution of a intonative generation module..\n",
    "The first stage of the work was the analysis of a corpus recorded by a reference speaker and based on a set of linguistic presuppositions. These presuppositions are based on the concept of some structural rendez-vous between the different levels of text on one part and the prosody, on the other part The processing of the data corpus was organized in a top-down hierarchy: sentences, clauses, groups and lexical units. The minimal symbolic unit is the syllable. For every level in the hierarchy, several initial classes ofFo contours are defined, each initially described by a maximal set of linguistic parameters. The validity of each class is first verified. Then the unification of the classes is systematically tested, using minimal pairs oppositions on the linguistic parameters. For every final class an average-contour is computed, which is a global form for this class. The result is a hierarchically structured dynamic contour lexicon of global intonative forms for which every representative is associated with a minimal set of distinctive attributes.\n",
    "Generation of prosody then consists in the calculation of prosodic patterns by the top-down cumulative superpositions of contours taken from the lexicon. An application is the automatic generation of prosody in a text-to-speech synthesis system, which must be adapted to a given application.\n",
    ""
   ]
  },
  "barbosa93_prosody": {
   "authors": [
    [
     "P.",
     "Barbosa"
    ],
    [
     "Gérard",
     "Bailly"
    ]
   ],
   "title": "Generation and evaluation of rhythmic patterns for text-to-speech synthesis",
   "original": "pro3_066",
   "page_count": 4,
   "order": 14,
   "p1": "66",
   "pn": "69",
   "abstract": [
    "This paper presents a characterization of durational contours based on phasing relations between noticeable acoustic events and an internal clock. We generate segmental durations in two stages : the duration of a rhythmic programming unit is computed according to a reference clock and then is distributed among its segmental constituents. A perception experiment evaluates the necessity of the rhythmic patterns found in analysis. A method for mastering speaker's speech rate is described and is analysed to propose some guidelines for the integration of the pause phenomenon into automatic generation.\n",
    ""
   ]
  },
  "epitropakis93_prosody": {
   "authors": [
    [
     "George",
     "Epitropakis"
    ],
    [
     "Nikos",
     "Yiourgalis"
    ],
    [
     "George",
     "Kokkinakis"
    ]
   ],
   "title": "High quality intonation algorithm for the greek TTS - system",
   "original": "pro3_070",
   "page_count": 4,
   "order": 15,
   "p1": "70",
   "pn": "73",
   "abstract": [
    "This article presents a complete algorithm for the generation of intonation (F0 contours) for the Greek Text-To-Speech system, based on a multi-layer label structure that is constructed for the phonemes representing the input text This structure consists of the phoneme's distinctive features, the position of the syllable that the phoneme belongs to, the prosodic label of the word that the phoneme belongs to, and the phoneme's prosodic context in the sentence. According to the contents of that structure, the algorithm assigns to each phoneme of the input sentence a target pitch level to be reached either at the beginning, or the middle, or the end of the phoneme. When all the phonemes have been assigned the appropriate F0 level, the overall pitch contour is constructed by linear interpolation between the successive F0 levels. Although the method proposed seems to be a rather abstract approach, it takes into consideration linguistic, phonotactics and metrical constraints of the input and not linguistic constraints alone. In addition, the method is especially suited for languages, such as Greek, which are inflectionally rich and have great freedom of word-order.\n",
    ""
   ]
  },
  "lopezgonzalo93_prosody": {
   "authors": [
    [
     "Eduardo",
     "López-Gonzalo"
    ],
    [
     "Luis A.",
     "Hernández-Gómez"
    ]
   ],
   "title": "Prosodic modelling for a text-to-speech system in Spanish",
   "original": "pro3_074",
   "page_count": 4,
   "order": 16,
   "p1": "74",
   "pn": "77",
   "abstract": [
    "In this contribution, we present the results in modeling Spanish prosody for a text-to-speech system based on units concatenation using a TD-PSOLA synthesizer. For this purpose, we have developed a new methodology to transfer to a text-to-speech system the prosody of one speaker considering both fundamental frequency and duration jointly, trying to take into account their interactions. The results on a corpus test over the system shows very good intelligibility and naturalness.\n",
    ""
   ]
  },
  "quazza93_prosody": {
   "authors": [
    [
     "Silvia",
     "Quazza"
    ],
    [
     "Pier Luigi",
     "Salza"
    ],
    [
     "Stefano",
     "Sandri"
    ],
    [
     "Alberto",
     "Spini"
    ]
   ],
   "title": "Prosodic control in a text-to-speech system for Italian",
   "original": "pro3_078",
   "page_count": 4,
   "order": 17,
   "p1": "78",
   "pn": "81",
   "abstract": [
    "The paper illustrates a TTS-oriented model of prosody generation for Italian, which tries to account for the relations linking the prosodic parameters to relevant linguistic features. A proper rule development system allows to express contextual rules and to maintain the alignment between different linguistic representation levels.\n",
    ""
   ]
  },
  "stensby93_prosody": {
   "authors": [
    [
     "Sverre",
     "Stensby"
    ],
    [
     "Berit",
     "Horvei"
    ],
    [
     "Georg E.",
     "Ottesen"
    ]
   ],
   "title": "Lexicon and prosodic structure in a text-to-speech system",
   "original": "pro3_082",
   "page_count": 4,
   "order": 18,
   "p1": "82",
   "pn": "85",
   "abstract": [
    "This article is a presentation of a pronunciation lexicon and its use in improving prosody in a text-to-speech system. The inclusion of a lexicon is a natural way of giving synthesis systems information of word class and word pronunciation. The grammatical information is used to disambiguate homographs and to form a basis for prosodic structuring. The realized prosody is based on patterns for rhythmical units named feet and utilizes the information of word tone and pronunciation found in the lexicon.\n",
    ""
   ]
  },
  "taylor93_prosody": {
   "authors": [
    [
     "Paul",
     "Taylor"
    ]
   ],
   "title": "Synthesizing intonation using the RFC model",
   "original": "pro3_086",
   "page_count": 4,
   "order": 19,
   "p1": "86",
   "pn": "89",
   "abstract": [
    "This paper describes an implementation of the rise/fall/connection (RFC) model of intonation for use in the speech synthesis component of a machine interpretation system. The phonological input is described, as is the algorithm which converts this to a rise/fall/connection description, and eventually to an F0 contour. As we wish to model different speakers' intonational characteristics, some details are described on the method for adapting the model's parameters to match the behaviour of a given speaker.\n",
    ""
   ]
  },
  "hirschberg93_prosody": {
   "authors": [
    [
     "Julia",
     "Hirschberg"
    ]
   ],
   "title": "Studies of intonation and discourse",
   "original": "pro3_090",
   "page_count": 6,
   "order": 20,
   "p1": "90",
   "pn": "95",
   "abstract": [
    "Research on intonation and discourse falls into two major categories: work on the intonational correlates of discourse structure and work on accent and information status. In both categories, problems of specifying an adequate and independently motivated discourse model hinder evaluation of results and generalization across experiments. Also, much work remains to be done on combining these results into general models capturing the mapping between intonational features and discourse features.\n",
    ""
   ]
  },
  "swerts93_prosody": {
   "authors": [
    [
     "Marc",
     "Swerts"
    ]
   ],
   "title": "On the prosodic prediction of discourse finality",
   "original": "pro3_096",
   "page_count": 4,
   "order": 21,
   "p1": "96",
   "pn": "99",
   "abstract": [
    "It is investigated whether the approaching end of a spontaneously produced description is presignalled by prosodic means. Experiment I tries to determine to what extent listeners are able to estimate (on the basis of prosodic cues) how far a given utterance is situated from the end of a description. Experiment II is set up to systematically test - by means of manipulated synthetic prosody - the cue strength of speech melody and duration as predictors of discourse finality.\n",
    ""
   ]
  },
  "botinis93_prosody": {
   "authors": [
    [
     "Antonis",
     "Botinis"
    ]
   ],
   "title": "Intonation and prosodic coherence in greek discourse",
   "original": "pro3_100",
   "page_count": 4,
   "order": 22,
   "p1": "100",
   "pn": "103",
   "abstract": [
    "The present contribution is part of a larger investigation on tonal structuring in spontaneous Greek discourse. In this paper, we present our observations on prosodic coherence and the role of intonation in signalling different types of prosodic boundaries. Our analysis is concentrated on tonal sequences that may be used at intonation unit boundaries. The results support the view that various combinations of prosodic parameters are used for discourse segmentation, but they also bring into light evidence that different tonal manifestations at prosodic boundaries may imply different prosodic coherence and discourse interpretation.\n",
    ""
   ]
  },
  "garrido93_prosody": {
   "authors": [
    [
     "Juan María",
     "Garrido"
    ]
   ],
   "title": "Analysis of global pitch contour domains at paragraph level in Spanish reading text",
   "original": "pro3_104",
   "page_count": 4,
   "order": 23,
   "p1": "104",
   "pn": "107",
   "abstract": [
    "In this paper a study of F0 patterns at paragraph level is presented. The goals of this work are the search of a domain for the 'basic intonation unit' within the paragraph and the validation of the existence of an F0 pattern for the whole paragraph. The results suggest that it is necessary to define a special linguistic unit that covers the scope of these patterns. They also seem to indicate that there is some general tendency to a global declination in the paragraphs, specially in the bottomline, and that there exists some kind of partial reset working at the internal boundaries of the paragraph.\n",
    ""
   ]
  },
  "geluykens93_prosody": {
   "authors": [
    [
     "Ronald",
     "Geluykens"
    ],
    [
     "Marc",
     "Swerts"
    ]
   ],
   "title": "Local and global prosodic cues to discourse organization in dialogues",
   "original": "pro3_108",
   "page_count": 4,
   "order": 24,
   "p1": "108",
   "pn": "111",
   "abstract": [
    "It is experimentally investigated to what extent speakers use prosody to signal topic- and turn-boundaries non-ambiguously to a listener. Results show that local and global melodic features are employed to structure both information and interaction.\n",
    ""
   ]
  },
  "batliner93_prosody": {
   "authors": [
    [
     "Anton",
     "Batliner"
    ],
    [
     "C.",
     "Weiand"
    ],
    [
     "Andreas",
     "Kießling"
    ],
    [
     "Elmar",
     "Nöth"
    ]
   ],
   "title": "Why sentence modality in spontaneous speech is more difficult to classify and why this fact is not too bad for prosody",
   "original": "pro3_112",
   "page_count": 4,
   "order": 25,
   "p1": "112",
   "pn": "115",
   "abstract": [
    "\"You crazy,\" said Max. It was either a statement or a question. (John le Carre: Tinker Tailor Soldier Spy)\n",
    "\"So you're our man, then,\" he said. It was half statement, half question. (Josef Skvorecky: The Engineer of Human Souls)\n",
    "We show in this paper that the labeling of sentence modality in German, esp. of questions vs. non-questions, is more difficult for spontaneous than for read speech and easier for non-elliptic than for elliptic utterances. However, the prosodic marking of sentence modality is more important in elliptic utterances that occur more often in spontaneous speech.\n",
    ""
   ]
  },
  "yang93_prosody": {
   "authors": [
    [
     "Li-chiung",
     "Yang"
    ]
   ],
   "title": "Prosodic diversity in Mandarin natural discourse",
   "original": "pro3_116",
   "page_count": 4,
   "order": 26,
   "p1": "116",
   "pn": "119",
   "abstract": [
    "Expressive rhythm and melodic structures permeate natural discourse. This study examines the prosodic system of Mandarin Chinese by acoustically and perceptually analyzing discourse data. Pitch shapes often reflect discourse intentions, underlying cognitive states, and accommodation to intonational conflict and progression. It is found that rhythm, iconicity and inversion act fundamentally to connect sound with meaning.\n",
    ""
   ]
  },
  "bacri93_prosody": {
   "authors": [
    [
     "Nicole",
     "Bacri"
    ],
    [
     "Marie-Hélène",
     "Banel"
    ]
   ],
   "title": "Rhythmic patterns and lexical parsing in French",
   "original": "pro3_120",
   "page_count": 4,
   "order": 27,
   "p1": "120",
   "pn": "123",
   "abstract": [
    "Two experiments examined the effects of usual and reverse rhythmic patterns on two- syllable sequence segmentation. The usual short-long pattern impeded parsing of monosyllabic words embedded in disyllabic words. In Experiment 2, focusing subjects'attention on the timing structure strengthened this effect. Implications for speech recognition models are discussed.\n",
    ""
   ]
  },
  "caelenhaumont93_prosody": {
   "authors": [
    [
     "Geneviève",
     "Caelen-Haumont"
    ]
   ],
   "title": "Duration and energy indices: a convergent deep organization of grouping and phrasing",
   "original": "pro3_124",
   "page_count": 4,
   "order": 28,
   "p1": "124",
   "pn": "127",
   "abstract": [
    "The aim of this paper is to present the results of a study on duration and energy indices in a context, of text readings with tasks. This study is not traditional because the data are not analyzed in the respect, of the prosodic organization of all the linguistic units which compose the phrases. In fact the study is based on the deep relative organization of duration and energy values of the lexical items (internal and external relationships) at different phrase levels. On the whole the study takes into account 10 indices.\n",
    ""
   ]
  },
  "guaitella93_prosody": {
   "authors": [
    [
     "Isabelle",
     "Guaïtella"
    ]
   ],
   "title": "Functional, acoustical and perceptual analysis of vocal hesitations in spontaneous speech",
   "original": "pro3_128",
   "page_count": 4,
   "order": 29,
   "p1": "128",
   "pn": "131",
   "abstract": [
    "The aim of this study is to reconsider and to show the interest of the analysis of a phenomenon which is specific to spontaneous speech: tvocal hesitations. These latter are often assimilated to silent pauses. Acoustical investigations led us to shed some light on the perceptual and communicative functions of vocal hesitations. This study is based on a general description of the rhythmic organisation of spontaneous speech. We demonstrate that both functions and acoustic manifestations of vocal hesitation are specific.\n",
    ""
   ]
  },
  "heuven93_prosody": {
   "authors": [
    [
     "Vincent J. van",
     "Heuven"
    ]
   ],
   "title": "On the temporal domain of focal accent",
   "original": "pro3_132",
   "page_count": 4,
   "order": 30,
   "p1": "132",
   "pn": "135",
   "abstract": [
    "Accented words are longer than their unaccented counterparts. Our contribution studies the domain of this lengthening effect: is it the (stem) morpheme, the (complex) word, or the phrase? We present preliminary evidence, from the literature and from a recent experiment by ourselves, that the lengthening domain extends beyond the monomorphemic word, but not beyond the level of the compound.\n",
    ""
   ]
  },
  "hofhuis93_prosody": {
   "authors": [
    [
     "Elise",
     "Hofhuis"
    ]
   ],
   "title": "Establishing prosodic structure by measuring segment duration",
   "original": "pro3_136",
   "page_count": 4,
   "order": 31,
   "p1": "136",
   "pn": "139",
   "abstract": [
    "In this paper we describe two experiments which show how knowledge about segment durations can de used to decide between prosodic theories. One experiment shows us that unstressed word-final heavy syllables do not form separate feet. A second experiment demonstrates that word initial monosyllabic feet are not feet postlexically.\n",
    ""
   ]
  },
  "kieling93_prosody": {
   "authors": [
    [
     "Andreas",
     "Kießling"
    ],
    [
     "Ralf",
     "Kompe"
    ],
    [
     "Heinrich",
     "Niemann"
    ],
    [
     "Elmar",
     "Nöth"
    ],
    [
     "Anton",
     "Batliner"
    ]
   ],
   "title": "roger, \"sorry\", \"i'm still listening\": dialog guiding signals in information retrieval dialogs",
   "original": "pro3_140",
   "page_count": 4,
   "order": 32,
   "p1": "140",
   "pn": "143",
   "abstract": [
    "During any kind of information retrieval dialog, the repetition of parts of information just given by the dialog partner can often be observed. As these repetitions are usually elliptic, the intonation is very important for determining the speakers intention. In this paper prototypically the times of day repeated by the customer in train table inquiry dialogs are investigated. A scheme is developed for the officers reactions depending on the intonation of these repetitions; it has been integrated into our speech understanding and dialog system EVAR (cf. [6]). Gaussian classifiers were trained for distinguishing the dialog guiding signals confirmation, question and feedback; recognition rates of up to 87.5% were obtained.\n",
    ""
   ]
  },
  "kowtko93_prosody": {
   "authors": [
    [
     "Jacqueline",
     "Kowtko"
    ]
   ],
   "title": "Cross-speaker influences on intonation in dialogue",
   "original": "pro3_144",
   "page_count": 4,
   "order": 33,
   "p1": "144",
   "pn": "147",
   "abstract": [
    "Following up previous claims that a mapping exists between intonation contour and discourse function, this paper provides evidence that another factor is involved, that of cross-speaker influence: there are systematic relationships between adjacent speakers' contours.\n",
    ""
   ]
  },
  "krull93_prosody": {
   "authors": [
    [
     "Diana",
     "Krull"
    ]
   ],
   "title": "Word-prosodic features in estonian conversational speech: some preliminary results",
   "original": "pro3_148",
   "page_count": 4,
   "order": 34,
   "p1": "148",
   "pn": "151",
   "abstract": [
    "Estonian has three distinctive degrees of quantity: short, long and overlong. This paper reports an investigation on the temporal and tonal correlates of quantity in the natural conversation of one Estonian speaker. The results show statistically significant differences between quantities only for the temporal correlates. The tonal correlates had a considerable overlapping between quantities.\n",
    ""
   ]
  },
  "leandri93_prosody": {
   "authors": [
    [
     "Sylvie",
     "Leandri"
    ]
   ],
   "title": "Prosodic aspects of reported speech",
   "original": "pro3_152",
   "page_count": 4,
   "order": 35,
   "p1": "152",
   "pn": "155",
   "abstract": [
    "Trying to characterize reported speech compare to direct speech, I discuss some prosodic properties thanks to a statistic study of the mean f0 values measured at different level in the utterances.\n",
    ""
   ]
  },
  "mertens93_prosody": {
   "authors": [
    [
     "Piet",
     "Mertens"
    ]
   ],
   "title": "International grouping, boundaries, and syntactic structure in French",
   "original": "pro3_156",
   "page_count": 4,
   "order": 36,
   "p1": "156",
   "pn": "159",
   "abstract": [
    "This paper describes the units and rules involved in (1) the lexicon-prosody interface, (2) the intonation grammar, (3) prosodic grouping, and (4) the syntax-prosody interface. All units are depicted in a multi-layered representation of prosodic structure.\n",
    ""
   ]
  },
  "hansen93_prosody": {
   "authors": [
    [
     "Peter Molbæk",
     "Hansen"
    ],
    [
     "Niels Reinholt",
     "Petersen"
    ],
    [
     "Ebbe",
     "Spang-Hanssen"
    ]
   ],
   "title": "Syntax, pauses, and temporal relations in the final part of the sentence",
   "original": "pro3_160",
   "page_count": 4,
   "order": 37,
   "p1": "160",
   "pn": "163",
   "abstract": [
    "The paper is concerned with sentence final phenomena, viz. the question of final lengthening, and the occurrence of pauses in Danish news reading. The main findings were (1) that a complementary relationship exists between preboundary lengthening and the occurrence of a silent interval, sentence internally as well as between sentences; and (2) that there is a tendency for pauses to be overrepresented toward the end of the sentence. It is speculated that the latter tendency is related to information structure.\n",
    ""
   ]
  },
  "nakatani93_prosody": {
   "authors": [
    [
     "Christine",
     "Nakatani"
    ]
   ],
   "title": "Accenting on pronouns and proper names in spontaneous narrative",
   "original": "pro3_164",
   "page_count": 4,
   "order": 38,
   "p1": "164",
   "pn": "167",
   "abstract": [
    "This paper reports empirical findings on discourse factors affecting the accentuation of pronouns and proper names. We account for the distributions of accent on referring expressions in a narrative sample by proposing a discourse constraint on the interpretation of accent function. Empirical support for this view is presented based on analysis of the discourse functions of accented subject pronouns within the framework of CENTERING THEORY.\n",
    ""
   ]
  },
  "touati93_prosody": {
   "authors": [
    [
     "Paul",
     "Touati"
    ]
   ],
   "title": "Prosodic aspects of Political rhetoric",
   "original": "pro3_168",
   "page_count": 4,
   "order": 39,
   "p1": "168",
   "pn": "171",
   "abstract": [
    "In this paper, I addressed the issue of rhetorical prosody in French politics. Overall pitch variation is analyzed as expression of a paradigmatic contrast between a pre-electoral persuasive speech and a pathos-oriented post-electoral press-conference, and a syntagmatic change within the specific setting of the pre-electoral speech. As a result of this analysis, I wish to propose a two-fold categorization of overall pitch variation in French: one in terms of range and the other in terms of register.\n",
    ""
   ]
  },
  "zitter93_prosody": {
   "authors": [
    [
     "Aart De",
     "Zitter"
    ],
    [
     "Bert Van",
     "Coile"
    ]
   ],
   "title": "Intonational consequences of varying the accent location",
   "original": "pro3_172",
   "page_count": 4,
   "order": 40,
   "p1": "172",
   "pn": "175",
   "abstract": [
    "An experiment was carried out to investigate the effect of varying the location of the (unique) sentence accent on the concrete melodic behavior of that accent. More specifically, we measured the onset, the duration and the size of both the rise and the fall on the so-called 'pointed hat' on the accent. The main finding was that accents are getting smaller the later they occur in the sentence.\n",
    ""
   ]
  },
  "batliner93b_prosody": {
   "authors": [
    [
     "Anton",
     "Batliner"
    ],
    [
     "Susanne",
     "Burger"
    ],
    [
     "B.",
     "Johne"
    ],
    [
     "Andreas",
     "Kießling"
    ]
   ],
   "title": "MÜSLI: a classification scheme for laryngealizations",
   "original": "pro3_176",
   "page_count": 4,
   "order": 41,
   "p1": "176",
   "pn": "179",
   "abstract": [
    "We developed a classification scheme for laryngealizations that can be used to discriminate the many different shapes of laryngealizations with different feature values. Potential applications are phonetic transcription and automatic detection. The scheme was developed and tested with a database from 4 speakers that contains more than 1200 laryngealizations.\n",
    ""
   ]
  },
  "bruce93_prosody": {
   "authors": [
    [
     "Gösta",
     "Bruce"
    ],
    [
     "Björn",
     "Granström"
    ],
    [
     "Kjell",
     "Gustafson"
    ],
    [
     "David",
     "House"
    ]
   ],
   "title": "Prosodic modelling of phrasing in Swedish",
   "original": "pro3_180",
   "page_count": 4,
   "order": 42,
   "p1": "180",
   "pn": "183",
   "abstract": [
    "In this contribution we will give a summary report on a project on prosodic phrasing in Swedish. Examples of three different methodological approaches will be given: speech analysis, speech synthesis and prosodic parsing. The results include expansions to the model of Swedish prosody.\n",
    ""
   ]
  },
  "carbonell93_prosody": {
   "authors": [
    [
     "Noëlle",
     "Carbonell"
    ],
    [
     "Yves",
     "Laprie"
    ]
   ],
   "title": "Automatic detection of prosodic cues for segmenting continuous speech into supralexical units",
   "original": "pro3_184",
   "page_count": 4,
   "order": 43,
   "p1": "184",
   "pn": "187",
   "abstract": [
    "We are currently working on the automatic detection of syntagm and word boundaries in French, from the study of pitch and rhythm temporal evolution. After a brief presentation of our method, we discuss results obtained on various continuous speech corpora .\n",
    ""
   ]
  },
  "caspers93_prosody": {
   "authors": [
    [
     "Johanneke",
     "Caspers"
    ],
    [
     "Vincent J. van",
     "Heuven"
    ]
   ],
   "title": "Perception of low-anchoring versus high-anchoring of dutch accent-lending pitch rises",
   "original": "pro3_188",
   "page_count": 4,
   "order": 44,
   "p1": "188",
   "pn": "191",
   "abstract": [
    "A perception experiment was conducted to evaluate the hypothesis, derived from earlier production data, that the onset of the Dutch accent-lending pitch rise ('l') is attached to the syllable onset. The accent-lending rise, either anchored with its onset ('low-anchor') to the syllable onset, or with its peak ('high-anchor') at 50 ms after the vowel onset, was presented to listeners in a discrimination and a preference test. Results reveal that, counter to what the relevant literature suggests, there is a preference for the low-anchor, increasing with the magnitude of the shift between the two types of rise.\n",
    ""
   ]
  },
  "gunther93_prosody": {
   "authors": [
    [
     "Carsten",
     "Günther"
    ]
   ],
   "title": "A cognitive approach to planning and representation of prosodic features in a concept-to-speech system",
   "original": "pro3_192",
   "page_count": 4,
   "order": 45,
   "p1": "192",
   "pn": "195",
   "abstract": [
    "This paper presents a cognitive approach to prosodic planning in a language generation system. The macro- and microprosodic planning component is part of a computational modeling of main processing stages of the human language production process. The architecture of the system which is motivated by appropriate psycholinguistic insights, and some representational formats of prosodic knowledge are introduced.\n",
    ""
   ]
  },
  "hargrove93_prosody": {
   "authors": [
    [
     "Patricia M.",
     "Hargrove"
    ],
    [
     "Nancy S.",
     "McGarr"
    ]
   ],
   "title": "A transdisciplinary model for prosody applied to the teaching of clinical populations",
   "original": "pro3_196",
   "page_count": 3,
   "order": 46,
   "p1": "196",
   "pn": "199",
   "abstract": [
    "This presentation describes the Prosodic Teaching Model which is an integrated approach to viewing the prosody of speech and language impaired persons. The Prosodic Teaching Model consists of two major divisions: prosodic features and prosodic components. The prosodic features include pitch, loudness, duration, and pause; the prosodic components comprise tempo, intonation, stress, and rhythm.\n",
    ""
   ]
  },
  "hirose93_prosody": {
   "authors": [
    [
     "Keikichi",
     "Hirose"
    ],
    [
     "Nobuaki",
     "Minematsu"
    ],
    [
     "Mika",
     "Ito"
    ]
   ],
   "title": "Experimental study on the role of prosodic features in the human process of spoken word perception",
   "original": "pro3_200",
   "page_count": 4,
   "order": 47,
   "p1": "200",
   "pn": "203",
   "abstract": [
    "As a step toward the clarification and formulation of the human process of speech perception through prosodic features, perceptual experiments were conducted on the transmission of accent types as well as on the transmission of word meaning using synthetic speech of Japanese words of four morae. As for the transmission of word meaning, the role of prosodic features for word identification was found to be largest for type 1 accent. This is because the type 1 accent has a falling in the fundamental frequency contour at the beginning portion of the word and, therefore, the prosodic features can be utilized before the perception of whole segmental features. As for the transmission of accent types, several results were obtained implying the existence of the process for accent-type identification aside from the process for perceiving segmental features.\n",
    ""
   ]
  },
  "hirst93b_prosody": {
   "authors": [
    [
     "Daniel",
     "Hirst"
    ],
    [
     "Albert Di",
     "Cristo"
    ],
    [
     "Martine Le",
     "Besnerais"
    ],
    [
     "Zohra",
     "Najim"
    ],
    [
     "Pascale",
     "Nicolas"
    ],
    [
     "Pascal",
     "Romeas"
    ]
   ],
   "title": "Multi-lingual modelling of intonation patterns",
   "original": "pro3_204",
   "page_count": 4,
   "order": 48,
   "p1": "204",
   "pn": "207",
   "abstract": [
    "An account is given of an ongoing research programme developping a general method of investigation applicable to the intonation systems of different languages. At present, four languages in particular are being studied. : French, English, Spanish and Arabic. Four levels of prosodic representation are distinguished : underlying phonological, surface phonological, phonetic and acoustic. Each level is required to be interpretable in terms of the immediately superior and inferior levels. Automatic and semi-automatic procedures are being developped for this task.\n",
    ""
   ]
  },
  "horne93_prosody": {
   "authors": [
    [
     "Merle",
     "Horne"
    ],
    [
     "Marcus",
     "Filipsson"
    ],
    [
     "Christer",
     "Johansson"
    ],
    [
     "Mats",
     "Ljungqvist"
    ],
    [
     "Anders",
     "Lindstrom"
    ]
   ],
   "title": "Improving the prosody in TTS systems: morphological and lexical-semantic methods for tracking 'new' vs. 'given' information",
   "original": "pro3_208",
   "page_count": 4,
   "order": 49,
   "p1": "208",
   "pn": "211",
   "abstract": [
    "The design of an algorithm for referent tracking in a restricted domain is presented. The algorithm allows one to preprocess a text and automatically tag words as either contextually 'New' or 'Given'. The procedure involves computational modelling of lexical semantic identity of sense relations as well as information on inflexional/derivational morphology and compounding. Referent identity is defined on head-word representations derived from the text input on the basis of the inflexional expansion rules contained in a lemmatized lexicon of Swedish. Information on the New/Given status of words can subsequently be used in the F0-generating component of the text-to-speech system, to trigger the assignment of focal vs non-focal word accents.\n",
    ""
   ]
  },
  "keller93_prosody": {
   "authors": [
    [
     "Eric",
     "Keller"
    ],
    [
     "Brigitte",
     "Zellner"
    ],
    [
     "Stefan",
     "Werner"
    ],
    [
     "Nicole",
     "Blanchoud"
    ]
   ],
   "title": "The prediction of prosodic timing: rules for final syllable lengthening in French",
   "original": "pro3_212",
   "page_count": 4,
   "order": 50,
   "p1": "212",
   "pn": "215",
   "abstract": [
    "Timing is an essential part of prosody, since it contributes to the semantic and syntactic modulations of speech conveyed by accent and intonation. Theoretical and empirical considerations suggest that temporal organization takes two main forms. First, it is a necessary corollary of accent placement and intonational modification. Second, it manifests itself in prolongations, pauses and hesitations related to sentence structure. A set of rules for the second set of temporal modulations is presented. In contrast to previous work, such rules depend only minimally on syntactic structures and can be formulated nearly entirely in simple phonological terms.\n",
    ""
   ]
  },
  "mobius93_prosody": {
   "authors": [
    [
     "Bernd",
     "Möbius"
    ]
   ],
   "title": "Perceptual evaluation of rule-generated intonation contours for German interrogatives",
   "original": "pro3_216",
   "page_count": 4,
   "order": 51,
   "p1": "216",
   "pn": "219",
   "abstract": [
    "This paper presents the results of a perceptual experiment that was carried out in order to evaluate naturalness and adequacy of artificial, rule-generated intonation contours for German interrogatives. In previously reported experiments, the ratings for artificial intonation patterns of declaratives were satisfactory while those for interrogatives were not. Therefore, the present study aimed at improving the rules for echo, yes/no, and wh-questions. The integration of several additional features contributed to a more adequate generation of German interrogative intonation contours.\n",
    ""
   ]
  },
  "pasdeloup93_prosody": {
   "authors": [
    [
     "Valérie",
     "Pasdeloup"
    ],
    [
     "José",
     "Morais"
    ],
    [
     "Régine",
     "Kolinsky"
    ]
   ],
   "title": "Perceptual evidence for separate processing of stress pattern and phonemic string",
   "original": "pro3_220",
   "page_count": 4,
   "order": 52,
   "p1": "220",
   "pn": "223",
   "abstract": [
    "In order to determine if lexical stress pattern and phonemic string are represented separately at some level of processing, a target word recognition task was used under dichotic listening presentation. Two stimuli were presented simultaneously, one to one ear and one to the other ear. The stimuli are constructed in such a way that, if listeners combine the phonemic string from the stimulus presented to one ear with the stress pattern from the stimulus presented to the other ear, they experience the illusory perception of a word which corresponds to the prespecified target. The results suggest that stress pattern and segmental string can be represented separately at least at a prelexical level.\n",
    ""
   ]
  },
  "santi93_prosody": {
   "authors": [
    [
     "Serge",
     "Santi"
    ],
    [
     "Isabelle",
     "Guaïtella"
    ]
   ],
   "title": "Judgement on quality and diagnostic evaluation of synthetic prosody",
   "original": "pro3_224",
   "page_count": 4,
   "order": 53,
   "p1": "224",
   "pn": "227",
   "abstract": [
    "Two original methods of evaluation of synthetic prosody have been developped and applied to three prosodic rule generators using four French dialogue oriented applications (plane tickets reservation, remote inquiry of databases, etc.). Our data show a good correspondance between the results of two tests. They are both capable of discriminating between algorithms according to each type of application. Each method seem to meet our expectations, i.e., evaluation of quality only vs diagnostic evaluation. The question of what is to be evaluated must be answered before determining how to evaluate.\n",
    ""
   ]
  },
  "terken93_prosody": {
   "authors": [
    [
     "Jacques",
     "Terken"
    ]
   ],
   "title": "Issues in the perception of prosody",
   "original": "pro3_228",
   "page_count": 6,
   "order": 54,
   "p1": "228",
   "pn": "233",
   "abstract": [
    "Three issues in the perception of prosody are discussed: the perception of pitch variation, of prominence and of phrase boundaries. Also, the relation of these issues to the transcription of prosody is treated, and a number of remaining questions are addressed.\n",
    ""
   ]
  },
  "dalessandro93_prosody": {
   "authors": [
    [
     "Christophe",
     "d'Alessandro"
    ]
   ],
   "title": "A numerical model of pitch perception for short-duration vocal tones: application to intonation analysis",
   "original": "pro3_234",
   "page_count": 4,
   "order": 55,
   "p1": "234",
   "pn": "237",
   "abstract": [
    "An algorithm for automatic intonation analysis is described. It is based on a two-parameter model of weighted time-averaging with threshold for pitch perception. This model can be considered as a non-linear fitter. In a first stage speech is decomposed into short-duration tonal segments using short-term energy. In a second stage these short-duration tones are analyzed using the numerical model. A set of short (static and dynamic) tones are then obtained, together with their (constant or time-varying) pitches. Stylized F0 contours are reconstructed from this set of tones. Stylized contours are resynthesized, and give synthetic sentences which are perceptually identical with natural sentences.\n",
    ""
   ]
  },
  "reyelt93_prosody": {
   "authors": [
    [
     "Matthias",
     "Reyelt"
    ]
   ],
   "title": "Experimental investigation on the perceptual consistency and the automatic recognition of prosodic units in spoken German",
   "original": "pro3_238",
   "page_count": 4,
   "order": 56,
   "p1": "238",
   "pn": "241",
   "abstract": [
    "A corpus of about 500 sentences has been prosodically labelled by five students. They marked intonational phrase boundaries and accented syllables. The paper describes the inventory of prosodic labels that was used in the experiment and the resulting consistency of the parallel transcriptions. Also some preliminary results of the automatic recognition of these prosodic categories are presented.\n",
    ""
   ]
  },
  "bosch93_prosody": {
   "authors": [
    [
     "Louis ten",
     "Bosch"
    ]
   ],
   "title": "Algorithmic classification of pitch movements",
   "original": "pro3_242",
   "page_count": 4,
   "order": 57,
   "p1": "242",
   "pn": "245",
   "abstract": [
    "In this paper, we discuss the construction of an algorithm that classifies pitch movements according to the IPO intonation labelling. The classification is performed by a feed-forward network, interpreted as a multi-linear classifier. In speaker-independent tests on a corpus of speech read by non-professionals, up to 81 % of the 279 pitch movements in the test corpus were correctly classified. These results are obtained by using information from the sampled speech data files only; a grammar will be used in the second stage of this study. Keywords: Automatic classification, multi-linear classification, IPO-intonation system, speech recognition.\n",
    ""
   ]
  },
  "sluijter93_prosody": {
   "authors": [
    [
     "Agaath M. C.",
     "Sluijter"
    ],
    [
     "Vincent J. van",
     "Heuven"
    ]
   ],
   "title": "Perceptual cues of linguistic stress: intensity revisited",
   "original": "pro3_246",
   "page_count": 4,
   "order": 58,
   "p1": "246",
   "pn": "249",
   "abstract": [
    "The general claim that intensity is a weak cue in the perception of stress is reconsidered. This claim is based on perception experiments in which intensity was varied in a naive way: all parts of the spectrum were increased with the same amount of energy. However, stressed syllables are produced with more vocal effort. If a speaker produces more vocal effort, higher frequencies increase more than lower frequencies. We show that the intensity differences as a function of stress are mainly located above 0.5 kHz. Varying intensity in this way would be much more realistic.\n",
    ""
   ]
  },
  "fox93_prosody": {
   "authors": [
    [
     "Robert Allen",
     "Fox"
    ],
    [
     "Ilse",
     "Lehiste"
    ]
   ],
   "title": "Effect of pitch movement timing on perceived duration and prominence in estonian and English listeners",
   "original": "pro3_250",
   "page_count": 4,
   "order": 59,
   "p1": "250",
   "pn": "253",
   "abstract": [
    "This study is one in a series in which we explore the possible influence of a listener's linguistic background on his/her perception of suprasegmental cues in the speech signal. Two experiments investigated the effect of the timing of a pitch rise on the perception of a medial syllable's perceived duration and/or prominence by native speakers of Estonian or American English. Results indicated that English subjects tended to perceive tokens with a later pitch rise as longer and more prominent than those with an early pitch rise. The reverse was true for the Estonian subjects in terms of perception of prominence but for these subjects, the timing of the pitch rise had little effect upon perceived duration.\n",
    ""
   ]
  },
  "fujisaki93_prosody": {
   "authors": [
    [
     "Hiroya",
     "Fujisaki"
    ],
    [
     "Keikichi",
     "Hirose"
    ]
   ],
   "title": "Analysis and perception of intonation expressing paralinguistic information in spoken Japanese",
   "original": "pro3_254",
   "page_count": 4,
   "order": 60,
   "p1": "254",
   "pn": "257",
   "abstract": [
    "In addition to the linguistic information, prosody conveys para,- and non-linguistic information. The present paper deals specifically with the role of intonation in transmitting the speaker's attitude/intention in spoken Japanese. Short declarative sentences, uttered with various attitudes/intentions, were analyzed to find their acoustic correlates. Perceptual experiments were also conducted using the same utterances as stimuli to find out the accuracy/reliability of transmission.\n",
    ""
   ]
  },
  "beckman93_prosody": {
   "authors": [
    [
     "Mary E.",
     "Beckman"
    ]
   ],
   "title": "Modeling the production of prosody",
   "original": "pro3_258",
   "page_count": 6,
   "order": 61,
   "p1": "258",
   "pn": "263",
   "abstract": [
    "This tutorial reviews some of the insights gained from fifteen years of research on the production of prosodic categories, concentrating primarily on modeling fundamental frequency patterns as reflections of intonation and phrasing. It closes with a hint of some at the directions in which this work is being extended to understanding the function of prosody in discourse and to the modeling of other phonetic dimensions.\n",
    ""
   ]
  },
  "kraayeveld93_prosody": {
   "authors": [
    [
     "J.",
     "Kraayeveld"
    ],
    [
     "A. C. M.",
     "Rietveld"
    ],
    [
     "Vincent J. van",
     "Heuven"
    ]
   ],
   "title": "Speaker specificity in prosodic parameters",
   "original": "pro3_264",
   "page_count": 4,
   "order": 62,
   "p1": "264",
   "pn": "267",
   "abstract": [
    "Ten time-integrated prosodic parameters were used to assign read-out and spontaneous speech fragments to the speakers that had produced them. Fifty speakers of standard Dutch participated in the experiment. They were stratified by gender and age. It was found, that the parameters are independent of each other in terms of speaker specificity. In combination, they could correctly assign 73 % of 500 fragments to the 50 speakers. As expected, differences in mean F0 were important for speaker identification, but an analysis without mean F0 still resulted in 56 % correct classification. Identification improves when spontaneous and read-out speech are analysed separately. Thus, speech type is an important factor to control for in speaker identification.\n",
    ""
   ]
  },
  "cristo93_prosody": {
   "authors": [
    [
     "Albert Di",
     "Cristo"
    ],
    [
     "Daniel",
     "Hirst"
    ]
   ],
   "title": "Prosodic regularities in the surface structure of French questions",
   "original": "pro3_268",
   "page_count": 4,
   "order": 63,
   "p1": "268",
   "pn": "271",
   "abstract": [
    "This paper is concerned with the description of the tonal patterning of questions in French. The results are based both on the analysis of interviews recorded from broadcast programes and on an experimental study of simulated dialogues which constitute an intermediate level between read-aloud decontextualised utterances and truly spontaneous speech. Special attention is paid to the recurrent downstepping pitch pattern which appears to constitute an important feature common to most of the basic types of questions analysed here.\n",
    ""
   ]
  },
  "ostendorf93_prosody": {
   "authors": [
    [
     "Mari",
     "Ostendorf"
    ],
    [
     "Patti J.",
     "Price"
    ],
    [
     "Stephanie",
     "Shattuck-Hufnagel"
    ]
   ],
   "title": "Combining statistical and linguistic methods for modeling prosody",
   "original": "pro3_272",
   "page_count": 4,
   "order": 64,
   "p1": "272",
   "pn": "275",
   "abstract": [
    "We describe a general approach to computational modeling of prosody that combines statistical models with linguistic theory. Statistical models provide a mechanism for representing variability, for automatically training parameters, and for analyzing large corpora. Linguistic theory provides model structure and guides feature extraction. We illustrate the approach with examples from our own work and from the work of others.\n",
    ""
   ]
  },
  "martin93_prosody": {
   "authors": [
    [
     "Philippe",
     "Martin"
    ]
   ],
   "title": "Models and reality: from intonation theory to intonation curves",
   "original": "pro3_276",
   "page_count": 4,
   "order": 65,
   "p1": "276",
   "pn": "279",
   "abstract": [
    "There are a few theories of intonation to account for various phonological facts in different languages such as English, French, Swedish, etc. Depending on their respective framework (glossematics, generative or linear phonology, etc.), these theories provide some understanding of observable phenomena of acoustic or auditory nature, such as the evolution of fundamental frequency in the sentence, the perception of syllable pitch and intensity, and so forth. Nevertheless, the apparent large number of discrepancies that appear between the theoretically predicted facts and the physical reality often baffle researchers dealing with the acoustical nature of the speech signal. In their eyes, any theoretical insight on prosody may seem useless. The object of this paper is to discuss some of the reasons for these discrepancies through examples, and to provide a better understanding of what an intonation theory delivers.\n",
    ""
   ]
  },
  "bartkova93_prosody": {
   "authors": [
    [
     "Katarina",
     "Bartkova"
    ],
    [
     "P.",
     "Haffner"
    ],
    [
     "Danielle",
     "Larreur"
    ]
   ],
   "title": "Intensity prediction for speech synthesis in French",
   "original": "pro3_280",
   "page_count": 4,
   "order": 66,
   "p1": "280",
   "pn": "283",
   "abstract": [
    "The goal of the present study is to predict sound intensity for speech synthesis in French. In order to set up a model for intensity prediction, we first studied intensity variation in natural speech. The data base used was hand segmented and phonetically and syntactically labelled The results of this part of the study were introduced into a rule-based model whose parameters were subsequently optimised using stochastic gradient procedure. Next, a neural network based model was developed and trained using part of the labelled data.\n",
    ""
   ]
  }
 },
 "sessions": [
  {
   "title": "Prominence",
   "papers": [
    "ladd93_prosody",
    "cruttenden93_prosody",
    "grnnum93_prosody",
    "grabe93_prosody",
    "hermes93_prosody"
   ]
  },
  {
   "title": "Grouping",
   "papers": [
    "hirst93_prosody",
    "campbell93_prosody",
    "fant93_prosody",
    "naganomadsen93_prosody",
    "wichmann93_prosody",
    "levac93_prosody",
    "fretheim93_prosody"
   ]
  },
  {
   "title": "Synthesis and TTS Demo",
   "papers": [
    "auberge93_prosody",
    "barbosa93_prosody",
    "epitropakis93_prosody",
    "lopezgonzalo93_prosody",
    "quazza93_prosody",
    "stensby93_prosody",
    "taylor93_prosody"
   ]
  },
  {
   "title": "Discourse",
   "papers": [
    "hirschberg93_prosody",
    "swerts93_prosody",
    "botinis93_prosody",
    "garrido93_prosody",
    "geluykens93_prosody",
    "batliner93_prosody",
    "yang93_prosody"
   ]
  },
  {
   "title": "Prominence, Grouping, and Discourse",
   "papers": [
    "bacri93_prosody",
    "caelenhaumont93_prosody",
    "guaitella93_prosody",
    "heuven93_prosody",
    "hofhuis93_prosody",
    "kieling93_prosody",
    "kowtko93_prosody",
    "krull93_prosody",
    "leandri93_prosody",
    "mertens93_prosody",
    "hansen93_prosody",
    "nakatani93_prosody",
    "touati93_prosody",
    "zitter93_prosody"
   ]
  },
  {
   "title": "Models, Perception, and Applications",
   "papers": [
    "batliner93b_prosody",
    "bruce93_prosody",
    "carbonell93_prosody",
    "caspers93_prosody",
    "gunther93_prosody",
    "hargrove93_prosody",
    "hirose93_prosody",
    "hirst93b_prosody",
    "horne93_prosody",
    "keller93_prosody",
    "mobius93_prosody",
    "pasdeloup93_prosody",
    "santi93_prosody"
   ]
  },
  {
   "title": "Perception",
   "papers": [
    "terken93_prosody",
    "dalessandro93_prosody",
    "reyelt93_prosody",
    "bosch93_prosody",
    "sluijter93_prosody",
    "fox93_prosody",
    "fujisaki93_prosody"
   ]
  },
  {
   "title": "Production, Models, and Synthesis",
   "papers": [
    "beckman93_prosody",
    "kraayeveld93_prosody",
    "cristo93_prosody",
    "ostendorf93_prosody",
    "martin93_prosody",
    "bartkova93_prosody"
   ]
  }
 ]
}