{
 "title": "SALTMIL Workshop on interoperability between people in the creation of language resources for less-resourced languages",
 "startDate": "27/5/2008",
 "endDate": "27/5/2008",
 "location": "",
 "conf": "SALTMIL",
 "year": "2008",
 "name": "saltmil_2008",
 "series": "SALTMIL",
 "SIG": "SaLTMIL",
 "title1": "SALTMIL Workshop on interoperability between people in the creation of language resources for less-resourced languages",
 "date": "27 May 2008",
 "booklet": "saltmil_2008.pdf",
 "papers": {
  "rognvaldsson08_saltmil": {
   "authors": [
    [
     "Eiríkur",
     "Rögnvaldsson"
    ]
   ],
   "title": "Icelandic Language Technology Ten Years Later",
   "original": "1",
   "page_count": 5,
   "order": 1,
   "p1": "1",
   "pn": "5",
   "abstract": [
    "We describe the establishment and development of Icelandic language technology since its very beginning ten years ago. The ground was laid with a report from a committee appointed by the Minister of Education, Science and Culture in 1998. In this report, which was delivered in the spring of 1999, the committee proposed several actions to establish Icelandic language technology. This paper reviews the concrete tasks that the committee listed as important and their current status. It is shown that even though we still have a long way to go to reach all the goals set in the report, good progress has been made in most of the tasks. Icelandic participation in Nordic cooperation on language technology has been vital in this respect. In the final part of the paper, we speculate on the cost of Icelandic language technology and the future prospects of a small language like Icelandic in the age of information technology.\n"
   ]
  },
  "simpson08_saltmil": {
   "authors": [
    [
     "Heather",
     "Simpson"
    ],
    [
     "Christopher",
     "Cieri"
    ],
    [
     "Kazuaki",
     "Maeda"
    ],
    [
     "Kathryn",
     "Baker"
    ],
    [
     "Boyan",
     "Onyshkevych"
    ]
   ],
   "title": "Human Language Technology Resources for Less Commonly Taught Languages: Lessons Learned Toward Creation of Basic Language Resources",
   "original": "10",
   "page_count": 5,
   "order": 2,
   "p1": "7",
   "pn": "11",
   "abstract": [
    "The REFLEX-LCTL (Research on English and Foreign Language Exploitation) program, sponsored by the United States government, was a medium-scale effort in simultaneous creation of basic language resources for several less commonly taught languages (LCTLs). To address some of the gaps in language technologies and resources, and to spur new research in this area, two REFLEX-LCTL sites constructed language packs for 19 LCTLs, and distributed them to research and development also funded by the program. This paper will focus on the work done at the Linguistic Data Consortium (LDC). LDC created language packs for 13 out of the 19 languages: Amazigh (Berber), Bengali, Hungarian, Kurdish, Pashto, Punjabi, Tamil, Tagalog, Thai, Tigrinya, Urdu, Uzbek, and Yoruba. Discussed are the goals and reasoning behind the language choice and language pack construction, and more in depth on the human resource and technology challenges in creating these language packs.\n"
   ]
  },
  "pala08_saltmil": {
   "authors": [
    [
     "Karel",
     "Pala"
    ],
    [
     "Sonja",
     "Bosch"
    ],
    [
     "Christiane",
     "Fellbaum"
    ]
   ],
   "title": "Building resources for African languages",
   "original": "11",
   "page_count": 6,
   "order": 3,
   "p1": "13",
   "pn": "18",
   "abstract": [
    "We report on work towards the creation of African Languages WordNet, comprised of interlinked semantic networks in several African languages that are known to have limited language resources. Adding these languages to the WordNet family will enable NLP applications for each of the languages in isolation. Moreover, linking the African Wordnets to one another and to the many global WordNets will make crosslinguistic information retrieval and question answering possible, and significantly aid machine translation. In this paper it is demonstrated how collaborative work between people, using existing tools, can contribute to the building of large text corpora and subsequently address the challenge of limited availability of language resources. The long term aim is the development of aligned WordNets for Bantu languages spoken in South Africa as multilingual knowledge resources which could be extended to include a wide variety of related languages from other parts of Africa.\n"
   ]
  },
  "tyers08_saltmil": {
   "authors": [
    [
     "Francis M.",
     "Tyers"
    ],
    [
     "Jacques A.",
     "Pienaar"
    ]
   ],
   "title": "Extracting bilingual word pairs from Wikipedia",
   "original": "3",
   "page_count": 4,
   "order": 4,
   "p1": "19",
   "pn": "22",
   "abstract": [
    "A bilingual dictionary or word list is an important resource for many purposes, among them, machine translation. For many language pairs these are either non-existent, or very often unavailable owing to licensing restrictions. We describe a simple, fast and computationally inexpensive method for extracting bilingual dictionary entries from Wikipedia (using the interwiki link system) and assess the performance of this method with respect to four language pairs. Precision was found to be in the 69­92% region, but open to improvement."
   ]
  },
  "luengo08_saltmil": {
   "authors": [
    [
     "Iker",
     "Luengo"
    ],
    [
     "Eva",
     "Navas"
    ],
    [
     "Iñaki",
     "Sainz"
    ],
    [
     "Ibon",
     "Saratxaga"
    ],
    [
     "Jon",
     "Sanchez"
    ],
    [
     "Igor",
     "Odriozola"
    ],
    [
     "Juan J.",
     "Igarza"
    ],
    [
     "Inma",
     "Hernaez"
    ]
   ],
   "title": "Building a Basque/Spanish bilingual database for speaker verification",
   "original": "4",
   "page_count": 4,
   "order": 5,
   "p1": "23",
   "pn": "26",
   "abstract": [
    "Research groups aiming to record new speech databases for minority languages have to face a series of difficulties, such as the lack of previous resources, the scarcity of fluent speakers and the shortage of funding for the project. Sometimes it is possible to take advantage of recording campaigns for other projects, and extend them in order to make some recordings in that language for every contributor that is able to speak it. In this way, new databases can be recorded with little extra effort, as the campaign is already prepared and funded. Using this technique, a new Basque/Spanish bilingual database has been created. Thanks to this database, some research is being undertaken on Basque/Spanish bilingual speaker verification systems. We present a description of the resulting database and the difficulties encountered during its acquisition.\n"
   ]
  },
  "novak08_saltmil": {
   "authors": [
    [
     "Attila",
     "Novák"
    ]
   ],
   "title": "Language resources for Uralic minority languages",
   "original": "8",
   "page_count": 6,
   "order": 6,
   "p1": "27",
   "pn": "32",
   "abstract": [
    "Most members of the Uralic language family are small minority languages spoken on the territory of the Russian Federation, which all are endangered. In past and ongoing projects, computational morphologies and annotated corpora have been and are being created for several of these Uralic minority languages: Udmurt, Komi-Zyrian, Eastern Mari, Northern Mansi, and the Kazym and Synya dialects of Khanty, Tundra Nenets and Nganasan. This article presents the morphological analyzers and other annotation tools and the resources developed and used during the projects."
   ]
  },
  "viejo08_saltmil": {
   "authors": [
    [
     "Xulio",
     "Viejo"
    ],
    [
     "Roser",
     "Saurí"
    ],
    [
     "Ángel",
     "Neira"
    ]
   ],
   "title": "Eslema. Towards a Corpus for Asturian",
   "original": "9",
   "page_count": 6,
   "order": 7,
   "p1": "33",
   "pn": "38",
   "abstract": [
    "We present Eslema, the first project devoted to building a corpus for Asturian, which is carried out at Oviedo University. Eslema receives minor funding from the Spanish government, which is fundamental for basic issues such as equipment acquisition. However, it is insufficient for hiring researchers for a reasonable period of time. The scarcity of funding prompted us to look for much needed resources in entities with no institutional relation to the project, such as publishing companies and radio stations. In addition, we have started collaborations with external research groups. We are for example initiating a project devoted to developing a wiki-based platform, to be used by the community of Asturian speakers, for loading and annotating texts in Eslema. That will benefit both our project, allowing to enlarge the corpus at a minimum cost, and the Asturian community, causing a stronger presence of Asturian in information technologies and, as a consequence, boosting the confidence of speakers in their language, which will hopefully contribute to slow down the serious process of substitution it is currently undergoing."
   ]
  }
 },
 "sessions": [
  {
   "title": "Papers",
   "papers": [
    "rognvaldsson08_saltmil",
    "simpson08_saltmil",
    "pala08_saltmil",
    "tyers08_saltmil",
    "luengo08_saltmil",
    "novak08_saltmil",
    "viejo08_saltmil"
   ]
  }
 ]
}