{
 "title": "SEMDIAL 2017 (SaarDial) Workshop on the Semantics and Pragmatics of Dialogue",
 "location": "Saarbrücken, Germany",
 "startDate": "15/8/2017",
 "endDate": "17/8/2017",
 "URL": "http://www.saardial.uni-saarland.de/",
 "chair": "Chairs: Volha Petukhova and Ye Tian",
 "conf": "SemDial",
 "year": "2017",
 "name": "semdial_2017",
 "series": "",
 "SIG": "",
 "title1": "SEMDIAL 2017",
 "title2": "(SaarDial) Workshop on the Semantics and Pragmatics of Dialogue",
 "date": "15-17 August 2017",
 "papers": {
  "aina17_semdial": {
   "authors": [
    [
     "Laura",
     "Aina"
    ],
    [
     "Natalia",
     "Philippova"
    ],
    [
     "Valentin",
     "Vogelmann"
    ],
    [
     "Raquel",
     "Fernández"
    ]
   ],
   "title": "Referring Expressions and Communicative Success in Task-oriented Dialogues",
   "original": "1",
   "page_count": 9,
   "order": 1,
   "p1": 1,
   "pn": 9,
   "abstract": [
    "This paper studies lexical and structural properties of coreference chains in task-oriented dialogue and investigates their relationship with perceived and factual communicative success. In line with previous literature, our quantitative analysis shows that lexical entrainment is the most reliable predictor of task success, among the ones we compute. But also that there is a complex relationship between these factors -- for example, neither high nor low, but rather intermediate levels of lexical alignment predict high perceived and factual success. "
   ],
   "doi": "10.21437/SemDial.2017-1"
  },
  "dobnik17_semdial": {
   "authors": [
    [
     "Simon",
     "Dobnik"
    ],
    [
     "Amelie",
     "Åstbom"
    ]
   ],
   "title": "(Perceptual) grounding as interaction",
   "original": "2",
   "page_count": 10,
   "order": 2,
   "p1": 10,
   "pn": 19,
   "abstract": [
    "We examine how changing perceptual contexts affects grounding of words (spatial descriptions) in perceptual features and argue that grounding is interactive. We discuss two effects of perceptual context. Grounding of spatial descriptions may be affected by the richness of the perceptual context which allows us to build more complex representations of scenes. Secondly, perceptual grounding is dependent on the task (and associated attention) which affects the preference of features. The second property connects perceptual grounding closely to linguistic grounding in dialogue. We also argue that dynamic perceptual grounding has implications for the words-as-classifiers approach to semantics."
   ],
   "doi": "10.21437/SemDial.2017-2"
  },
  "ferre17_semdial": {
   "authors": [
    [
     "Gaelle",
     "Ferre"
    ],
    [
     "Suzanne",
     "Renaudier"
    ]
   ],
   "title": "Unimodal and Bimodal Backchannels in Conversational English",
   "original": "3",
   "page_count": 11,
   "order": 3,
   "p1": 20,
   "pn": 30,
   "abstract": [
    "This paper presents the differences in use of verbal (yeah, (mh)mh, okay . . . ) and visual backchannels (head nods, shakes, tilts), e.g. unimodal backchannels, as well as bimodal backchannels that combine a verbal token and a head movement in conversational English. We analyze the participants’ gaze-pattern not only before the production of a BC but also during and immediately after its delivery. We also analyze their placement regarding the main speaker’s turn and within the discourse topic. Lastly, we discuss their functions. Our findings reveal that each type of BC shows a different picture from the other two both in terms of where they occur within the main speaker’s turn and what their functions are. We however do not confirm previous observations regarding the constraints on their occurrence within a discourse topic."
   ],
   "doi": "10.21437/SemDial.2017-3"
  },
  "kiss17_semdial": {
   "authors": [
    [
     "Angelika",
     "Kiss"
    ]
   ],
   "title": "Meta-conversational since when-questions and the common ground",
   "original": "4",
   "page_count": 10,
   "order": 4,
   "p1": 31,
   "pn": 40,
   "abstract": [
    "This paper presents some novel properties of the Negative Wh-Construction. It is argued here that not all wh-phrases participating in the construction can be analyzed the same. Namely, since when-questions reject some aspect of the previous speech act, and not necessarily the propositional content, as opposed to Negative Wh-constructions with 'where'. "
   ],
   "doi": "10.21437/SemDial.2017-4"
  },
  "kumar17_semdial": {
   "authors": [
    [
     "Abhinav",
     "Kumar"
    ],
    [
     "Jillian",
     "Aurisano"
    ],
    [
     "Barbara",
     "Di Eugenio"
    ],
    [
     "Andrew",
     "Johnson"
    ],
    [
     "Abeer",
     "Alsaiari"
    ],
    [
     "Nigel",
     "Flowers"
    ],
    [
     "Alberto",
     "Gonzalez"
    ],
    [
     "Jason",
     "Leigh"
    ]
   ],
   "title": "Multimodal Coreference Resolution for Exploratory Data Visualization Dialogue: Context-Based Annotation and Gesture Identification",
   "original": "5",
   "page_count": 11,
   "order": 5,
   "p1": 41,
   "pn": 51,
   "abstract": [
    "The goals of our work are twofold: gain insight into how humans interact with complex data and visualizations thereof in order to make discoveries; and use our findings to develop a dialogue system for exploring data visualizations. In our work to date, we have collected a multimodal dialogue corpus and developed a pipeline that creates visualizations from spoken utterances. In this paper, we focus on the multimodal and contextual information that can give the system additional insight into the user’s intention, both through gestures and utterances nearby the actual request. To this end, we have annotated our corpus for context and both speech and gesture information; we developed a classifier for identifying rich themes found in the annotated context, in order to refine the interpretation of the request; and we have developed gesture detection using Kinect."
   ],
   "doi": "10.21437/SemDial.2017-5"
  },
  "larsson17_semdial": {
   "authors": [
    [
     "Staffan",
     "Larsson"
    ],
    [
     "Jenny",
     "Myrendal"
    ]
   ],
   "title": "Dialogue Acts and Updates for Semantic Coordination",
   "original": "6",
   "page_count": 8,
   "order": 6,
   "p1": 52,
   "pn": 59,
   "abstract": [
    "This paper sketches a formal account of semantic coordination, combining parts of two dialogue act taxonomies related to semantic coordination and relating these to meaning updates both on an abstract level and at a more detailed level using TTR."
   ],
   "doi": "10.21437/SemDial.2017-6"
  },
  "marzuki17_semdial": {
   "authors": [
    [
     "Ernisa",
     "Marzuki"
    ],
    [
     "Hannah",
     "Rohde"
    ],
    [
     "Chris",
     "Cummins"
    ],
    [
     "Gareth",
     "Clegg"
    ],
    [
     "Holly",
     "Branigan"
    ]
   ],
   "title": "Resuscitation procedures as multi-party dialogue",
   "original": "7",
   "page_count": 10,
   "order": 7,
   "p1": 60,
   "pn": 69,
   "abstract": [
    "Successful out-of-hospital cardiac arrest (OHCA) resuscitation relies upon effective team communication, which is evaluated as an aspect of non-technical skills. However, this communication has been largely neglected from a dialogue perspective. We propose addressing this issue by examining the structure of OHCA interaction and its characteristic dialogue features. We explore how speakers verbally signal and align their current states, and the possible trade-off between directness and politeness. Preliminary data suggests frequent use of Assertions in OHCA communication, as in other medical interactions, but that OHCA situations also involve distinctively high proportions of Action-directives. Current states are mostly signalled using explicit State-awareness utterances. Directives' force is also mitigated by politeness features. We discuss how these findings advance our aim of understanding effective team communication in the OHCA context, and how future work might identify associations between linguistic behaviours and resuscitation outcomes."
   ],
   "doi": "10.21437/SemDial.2017-7"
  },
  "misra17_semdial": {
   "authors": [
    [
     "Amita",
     "Misra"
    ],
    [
     "Shereen",
     "Oraby"
    ],
    [
     "Shubhangi",
     "Tandon"
    ],
    [
     "Sharath",
     "Ts"
    ],
    [
     "Pranav",
     "Anand"
    ],
    [
     "Marilyn",
     "Walker"
    ]
   ],
   "title": "Summarizing Dialogic Arguments from Social Media",
   "original": "14",
   "page_count": 11,
   "order": 14,
   "p1": 126,
   "pn": 136,
   "abstract": [
    "Online argumentative dialogue is a rich source of information on popular beliefs and opinions that could be useful to companies as well as governmental or public policy agencies. Compact, easy to read, summaries of these dialogues would thus be highly valuable. A priori, it is not even\nclear what form such a summary should take. Previous work on summarization has primarily focused on summarizing written texts, where the notion of an abstract of the text is well defined. We collect gold standard training data consisting of five human summaries for each of 161 dialogues on the topics of Gay Marriage, Gun Control and Abortion. We present several different computational models aimed at identifying segments of the dialogues whose content should be used for the summary, using linguistic features and Word2vec features with both SVMs and Bidirectional LSTMs. We show that we can identify the most important arguments by using the dialogue context with a best F-measure of 0.74 for gun control, 0.71 for gay marriage, and 0.67 for abortion."
   ],
   "doi": "10.21437/SemDial.2017-14"
  },
  "nicolas17_semdial": {
   "authors": [
    [
     "Carrara",
     "Nicolas"
    ],
    [
     "Romain",
     "Laroche"
    ],
    [
     "Olivier",
     "Pietquin"
    ]
   ],
   "title": "Online learning and transfer for user adaptation in dialogue systems",
   "original": "15",
   "page_count": 9,
   "order": 15,
   "p1": 137,
   "pn": 145,
   "abstract": [
    "We address the problem of user adaptation in Spoken Dialogue Systems. The goal is to quickly adapt online to a new user given a large amount of dialogues collected with other users. Previous works using Transfer for Reinforcement Learning tackled this problem when the number of source users remains limited. In this paper, we overcome this constraint by clustering the source users: each user cluster, represented by its centroid, is used as a potential source in the state-of-the-art Transfer Reinforcement Learning algorithm. Our benchmark compares several clustering approaches, including one based on a novel metric. All experiments are led on a negotiation dialogue task, and their results show significant improvements over baselines."
   ],
   "doi": "10.21437/SemDial.2017-15"
  },
  "osa17_semdial": {
   "authors": [
    [
     "Adriana",
     "Osa"
    ]
   ],
   "title": "Negotiation of discourse moves: right periphery tags",
   "original": "8",
   "page_count": 7,
   "order": 8,
   "p1": 70,
   "pn": 76,
   "abstract": [
    "In this paper I propose to analyze the Spanish discourse marker \"no?\" as a form that allows the speaker to postpone commitment to a discourse move. This is achieved via projected sets, which are individualized for each discourse participant. I claim that all the functions observed in the previous literature and the non-propositional distribution of \"no?\" can be explained this way, without recurring to different underlying factors."
   ],
   "doi": "10.21437/SemDial.2017-8"
  },
  "papalampidi17_semdial": {
   "authors": [
    [
     "Pinelopi",
     "Papalampidi"
    ],
    [
     "Elias",
     "Iosif"
    ],
    [
     "Alexandros",
     "Potamianos"
    ]
   ],
   "title": "Dialogue Act Semantic Representation and Classification Using Recurrent Neural Networks",
   "original": "9",
   "page_count": 10,
   "order": 9,
   "p1": 77,
   "pn": 86,
   "abstract": [
    "In this work, we present a model that incorporates Dialogue Act (DA) semantics in the framework of Recurrent Neural Networks (RNNs) for DA classification. Specifically, we propose a novel scheme for automatically encoding DA semantics via the extraction of salient keywords that are representative of the DA tags. The proposed model is applied to the Switchboard corpus and achieves 1.7% (absolute) improvement in classification accuracy with respect to the baseline model. We demonstrate that the addition of discourse-level features enhances the DA classification as well as makes the algorithm more robust: the proposed model does not require the preprocessing of dialogue transcriptions."
   ],
   "doi": "10.21437/SemDial.2017-9"
  },
  "petukhova17_semdial": {
   "authors": [
    [
     "Volha",
     "Petukhova"
    ],
    [
     "Harry",
     "Bunt"
    ],
    [
     "Andrei",
     "Malchanau"
    ]
   ],
   "title": "Computing Negotiation Update Semantics in Multi-issue Bargaining Dialogues",
   "original": "10",
   "page_count": 11,
   "order": 10,
   "p1": 87,
   "pn": 97,
   "abstract": [
    "This paper presents a computational approach to modelling pragmatic and semantic aspects of multi-issue bargaining dialogues. The model accounts for actions that shape negotiation structure and actions that express negotiation strategies. The model also accepts a number of negotiation moves as specifications of the semantic content of the performed task-related dialogue acts. The designed dialogue context model specifies the creation, maintenance and transfer of participants' private and shared beliefs. A negotiation agent that operates on this basis was implemented and evaluated against human performance. The approach allows efficient interpretation and generation of negotiation behaviour according to different negotiation strategies."
   ],
   "doi": "10.21437/SemDial.2017-10"
  },
  "shalyminov17_semdial": {
   "authors": [
    [
     "Igor",
     "Shalyminov"
    ],
    [
     "Arash",
     "Eshghi"
    ],
    [
     "Oliver",
     "Lemon"
    ]
   ],
   "title": "Challenging Neural Dialogue Models with Natural Data: Memory Networks Fail on Incremental Phenomena",
   "original": "11",
   "page_count": 9,
   "order": 11,
   "p1": 98,
   "pn": 106,
   "abstract": [
    "Natural, spontaneous dialogue proceeds incrementally on a word-by-word basis; and it contains many sorts of disfluency such as mid-utterance/sentence hesitations, interruptions, and self-corrections. But training data for machine learning approaches to dialogue processing is often either cleaned-up or wholly synthetic in order to avoid such phenomena. The question then arises of how well systems trained on such clean data generalise to real spontaneous dialogue, or indeed whether they are trainable at all on naturally occurring dialogue data. To answer this question, we created a new corpus called bAbI+ by systematically adding natural spontaneous incremental dialogue phenomena such as restarts and self-corrections to the Facebook AI Research's bAbI dialogues dataset. We then explore the performance of a state-of-the-art retrieval model, MemN2N, on this more natural dataset. Results show that the semantic accuracy of the MemN2N model drops drastically; and that although it is in principle able to learn to process the constructions in bAbI+, it needs an impractical amount of training data to do so. Finally, we go on to show that an incremental, semantic parser -- DyLan -- shows 100% semantic accuracy on both bAbI and bAbI+, highlighting the generalisation properties of linguistically informed dialogue models."
   ],
   "doi": "10.21437/SemDial.2017-11"
  },
  "sinclair17_semdial": {
   "authors": [
    [
     "Arabella",
     "Sinclair"
    ],
    [
     "Jon",
     "Oberlander"
    ],
    [
     "Dragan",
     "Gasevic"
    ]
   ],
   "title": "Finding the Zone of Proximal Development: Student-Tutor Second Language Dialogue Interactions",
   "original": "12",
   "page_count": 9,
   "order": 12,
   "p1": 107,
   "pn": 115,
   "abstract": [
    "The goal of dialogue practice for a second language learner is to facilitate their production of dialogue similar to that between native speakers. This paper explores the characteristics of student and tutor dialogue in terms of their differences from classic conversational and task-oriented corpora. Interlocutors have the tendency to align to the language of the other in conversational dialogue, creating a symmetry between speakers which learners of a language may be unable at first to achieve. Our hypothesis is that as a learner's competence increases, symmetry between learner and tutor language increases. We investigate this at both a surface and a deeper level, using automatic measures of linguistic complexity, and dialogue act analysis. The data supports our hypothesis. "
   ],
   "doi": "10.21437/SemDial.2017-12"
  },
  "timpelaughlin17_semdial": {
   "authors": [
    [
     "Veronika",
     "Timpe-Laughlin"
    ],
    [
     "Keelan",
     "Evanini"
    ],
    [
     "Ashley",
     "Green"
    ],
    [
     "Ian",
     "Blood"
    ],
    [
     "Judit",
     "Dombi"
    ],
    [
     "Vikram",
     "Ramanarayanan"
    ]
   ],
   "title": "Designing interactive, automated dialogues for L2 pragmatics learning",
   "original": "13",
   "page_count": 10,
   "order": 13,
   "p1": 116,
   "pn": 125,
   "abstract": [
    "This paper describes an approach to designing interactive, automated dialogues for L2 pragmatics learning. It first outlines advantages and challenges of using automated multi-turn conversations to help learners practice pragmatic moves. In order to deal with a particular challenge--—excessive variability in users' pragmatic performances—--an interactive dialogue aimed at eliciting requests was deployed via a crowdsourcing platform. A total of 328 completed conversations, with both L1 and L2 English speakers, were collected and analyzed with regard to number of turns and requests as well as request strategies elicited in the conversations. Requests were coded based on head acts as direct (D), conventionally indirect (CI), and hint (H). The results revealed interesting patterns in both L1 and L2 speaker responses. For example, even though they were speaking to the same interlocutor, L1 speakers tended to use different request strategies for two distinct requests, dependent on the interaction sequence and prompts within the dialogue. Moreover, further culture-specific variability was identified. Finally, the implications of the findings for the design and use of systematic feedback on pragmatics in computer-assisted language learning applications is discussed."
   ],
   "doi": "10.21437/SemDial.2017-13"
  },
  "higashinaka17_semdial": {
   "authors": [
    [
     "Ryuichiro",
     "Higashinaka"
    ],
    [
     "Kazuki",
     "Sakai"
    ],
    [
     "Hiroaki",
     "Sugiyama"
    ],
    [
     "Hiromi",
     "Narimatsu"
    ],
    [
     "Tsunehiro",
     "Arimoto"
    ],
    [
     "Takaaki",
     "Fukutomi"
    ],
    [
     "Kiyoaki",
     "Matsui"
    ],
    [
     "Yusuke",
     "Ijima"
    ],
    [
     "Hiroaki",
     "Ito"
    ],
    [
     "Shoko",
     "Araki"
    ],
    [
     "Yuichiro",
     "Yoshikawa"
    ],
    [
     "Hiroshi",
     "Ishiguro"
    ],
    [
     "Yoshihiro",
     "Matsuo"
    ]
   ],
   "title": "Argumentative dialogue system based on argumentation structures",
   "original": "abs1",
   "page_count": 2,
   "order": 16,
   "p1": 146,
   "pn": 147,
   "abstract": [
    "In this paper, we present the architecture our argumentative dialogue system that can hold discussions with users by using large-scale argumentation structures. The system can pinpoint argumentation nodes asserted by user utterances and make supportive utterances or rebuttals. The system can be useful for decision-making support as well as promoting better mutual understanding between humans and systems."
   ]
  },
  "katagiri17_semdial": {
   "authors": [
    [
     "Yasuhiro",
     "Katagiri"
    ],
    [
     "Katsuya",
     "Takanashi"
    ],
    [
     "Masato",
     "Ishizaki"
    ],
    [
     "Mika",
     "Enomoto"
    ],
    [
     "Yasuharu",
     "Den"
    ]
   ],
   "title": "Concern-Alignment for Negotiation and Joint Inquiry in Dialogues",
   "original": "abs2",
   "page_count": 2,
   "order": 17,
   "p1": 148,
   "pn": 149,
   "abstract": [
    "`Concern Alignment in Conversations' project aims, through empirical examinations of real-life conversations, to establish a theoretical and descriptive framework to capture discourse structures and underlying rational and affective processes in human-human joint planning interactions at dialogue act exchange level. Concern alignment model has been developed to address convergent negotiation for consensus-building and open-ended joint exploration for maximal satisfaction of participants observed in real-life dialogues. "
   ]
  },
  "keizer17_semdial": {
   "authors": [
    [
     "Simon",
     "Keizer"
    ],
    [
     "Verena",
     "Rieser"
    ]
   ],
   "title": "Towards Learning Transferable Conversational Skills using Multi-dimensional Dialogue Modelling",
   "original": "abs3",
   "page_count": 2,
   "order": 18,
   "p1": 150,
   "pn": 151,
   "abstract": [
    "Statistical approaches to dialogue management have brought improvements in robustness and scalability of spoken dialogue systems, but still rely heavily on in-domain data, thus limiting their cross-domain scalability. In this paper, we present a new multi-dimensional, statistical dialogue management framework, in which transferable conversational skills can be learnt by separating out domain-independent dimensions of communication. Our preliminary experiments demonstrate the effectiveness of such transfer."
   ]
  },
  "kondratyuk17_semdial": {
   "authors": [
    [
     "Daniel",
     "Kondratyuk"
    ],
    [
     "Casey",
     "Kennington"
    ]
   ],
   "title": "Towards a Dialogue System with Long-term, Episodic Memory",
   "original": "abs4",
   "page_count": 2,
   "order": 19,
   "p1": 152,
   "pn": 153,
   "abstract": [
    "Intelligent personal assistants lack long-term memory. We propose graph databases as a extensible solution to this problem by representing relevant knowledge as entities, properties, and relations between them. We demonstrate through two experiments that our approach lends itself to a system that can improve natural language understanding by updating its knowledge dynamically in a generalizable and interpretable fashion."
   ]
  },
  "lison17_semdial": {
   "authors": [
    [
     "Pierre",
     "Lison"
    ],
    [
     "Casey",
     "Kennington"
    ]
   ],
   "title": "Incremental Processing for Neural Conversation Models",
   "original": "abs5",
   "page_count": 2,
   "order": 20,
   "p1": 154,
   "pn": 155,
   "abstract": [
    "We present a simple approach to adapt neural models of dialogue to incremental processing. The approach is validated with a proof-of-concept experiment in a visual reference resolution task. "
   ]
  },
  "miehle17_semdial": {
   "authors": [
    [
     "Juliana",
     "Miehle"
    ],
    [
     "Nadine",
     "Gerstenlauer"
    ],
    [
     "Daniel",
     "Ostler"
    ],
    [
     "Hubertus",
     "Feussner"
    ],
    [
     "Wolfgang",
     "Minker"
    ],
    [
     "Stefan",
     "Ultes"
    ]
   ],
   "title": "An Intelligent Digital Assistant for Clinical Operating Rooms",
   "original": "abs6",
   "page_count": 2,
   "order": 21,
   "p1": 156,
   "pn": 157,
   "abstract": [
    "We present an Intelligent Digital Assistant for Clinical Operating Rooms (IDACO), providing the surgeon assistance in many different situations before and during an ongoing surgery using natural spoken language. The speech interface enables the surgeon to focus on the operation while controlling the technical environment at the same time, without taking care of how to interact with the system. Furthermore, the system monitors the context of the surgery and controls several devices autonomously at the appropriate time."
   ]
  },
  "morishita17_semdial": {
   "authors": [
    [
     "Miwa",
     "Morishita"
    ],
    [
     "Yasunari",
     "Harada"
    ]
   ],
   "title": "Syntactic Priming by Japanese EFL Learners in Dialogue Contexts based on Different Task Types",
   "original": "abs7",
   "page_count": 2,
   "order": 22,
   "p1": 158,
   "pn": 159,
   "abstract": [
    "Most Japanese EFL (English as a foreign language) learners have acquired certain levels of knowledge of English in terms of vocabulary, collocation, and grammar, while in real-time comprehension and production tasks, their performance drops markedly, showing that they have not achieved automatization in utilizing their knowledge of the language. We are conducting a series of studies to verify what types of interactions will help students achieve better automatization and performance in real-time tasks. In this paper, we report on results and plans of several studies to investigate the degree of syntactic priming in different types of tasks where the students are expected to complete certain tasks and/or keep the conversational ball rolling."
   ]
  },
  "qian17_semdial": {
   "authors": [
    [
     "Yao",
     "Qian"
    ],
    [
     "Rutuja",
     "Ubale"
    ],
    [
     "Vikram",
     "Ramanaryanan"
    ],
    [
     "David",
     "Suendermann-Oeft"
    ],
    [
     "Keelan",
     "Evanini"
    ],
    [
     "Patrick",
     "Lange"
    ],
    [
     "Eugene",
     "Tsuprun"
    ]
   ],
   "title": "Towards End-to-End Modeling of Spoken Language Understanding in a Cloud-based Spoken Dialog System",
   "original": "abs8",
   "page_count": 2,
   "order": 23,
   "p1": 160,
   "pn": 161,
   "abstract": [
    "Spoken language understanding (SLU) modules in dialog systems generally perform semantic decoding based on the hypotheses produced by automatic speech recognition (ASR) systems. However, while bootstrapping new spoken dialog applications from scratch in real user environments (that include for instance data collected using VoIP over poor internet connections), ASR performance could take a hit due to factors such as the paucity of training data and train-test data mismatch. To address this issue, this paper proposes an ASR-free end-to-end (E2E) modeling approach to SLU for a cloud-based modular spoken dialog system (SDS). We evaluate the efficiency of our approach on crowdsourced data collected from non-native English speakers interacting with a job interview-based language learning application. Experimental results show that our approach to SLU performs competently relative to the traditional baseline of ASR-hypothesis-based semantic classification and is particularly promising and relevant in situations where the ASR performs poorly."
   ]
  },
  "raveh17_semdial": {
   "authors": [
    [
     "Eran",
     "Raveh"
    ],
    [
     "Ingmar",
     "Steiner"
    ]
   ],
   "title": "A Phonetic Adaptation Module for Spoken Dialogue Systems",
   "original": "abs9",
   "page_count": 2,
   "order": 24,
   "p1": 162,
   "pn": 163,
   "abstract": [
    "This paper presents a novel component for spoken dialogue systems, which adds the functionality of adapting the system’s output based on the user’s input. The adaptation in done on the phonetic level for adopting the user’s speech characteristics without changing the system’s own. An architecture for a spoken dialogue is introduced, in which this module creates a direct link between the automatic speech recognition and text to speech modules."
   ]
  },
  "schnellewalka17_semdial": {
   "authors": [
    [
     "Dirk",
     "Schnelle-Walka"
    ],
    [
     "Vikram",
     "Ramanarayanan"
    ],
    [
     "Stefan",
     "Radomski"
    ],
    [
     "Patrick",
     "Lange"
    ],
    [
     "David",
     "Suendermann-Oeft"
    ]
   ],
   "title": "An Open Source Standards-Compliant Voice Browser with Support for Multiple Language Understanding Implementations",
   "original": "abs10",
   "page_count": 2,
   "order": 25,
   "p1": 164,
   "pn": 165,
   "abstract": [
    "There are several voice browser implementations for dialog systems, but none of them are both open-source and standards-compliant, while retaining compatibility with multiple implementations of system components such as natural language understanding (NLU) and dialog management modules. We present an standards-compliant open source solution that closes this gap while incorporating support for modern dialog concepts like flexible switching of user goals, custom grammar design and adaptivity to users. We show that our implementation can flexibly interface with two different NLU implementations to extract semantic information from user input and expose it to a VoiceXML application which integrates into a cloud-based dialog system that handles real user traffic. "
   ]
  },
  "stab17_semdial": {
   "authors": [
    [
     "Christian",
     "Stab"
    ],
    [
     "Iryna",
     "Gurevych"
    ]
   ],
   "title": "Training Argumentation Skills with Argumentative Writing Support",
   "original": "abs11",
   "page_count": 2,
   "order": 26,
   "p1": 166,
   "pn": 167,
   "abstract": [
    "We present an writing support system for assessing written arguments. Our system incorporates three analysis models allowing for rich feedback about argumentation structure, quality of reasons, and presence of opposing arguments."
   ]
  },
  "trinh17_semdial": {
   "authors": [
    [
     "Anh Duong",
     "Trinh"
    ],
    [
     "Robert J.",
     "Ross"
    ],
    [
     "John D.",
     "Kelleher"
    ]
   ],
   "title": "Incremental Joint Modelling for Dialogue State Tracking",
   "original": "abs12",
   "page_count": 2,
   "order": 27,
   "p1": 168,
   "pn": 169,
   "abstract": [
    "Dialogue State Tracking is an important task in dialogue management as it provides a mechanism to monitor dialogue contributions. In this paper we introduce an Incremental Joint Model as a new approach to the task. Our tracker is capable of incrementally tracking Dialogue States. We base our model and analysis on the datasets provided in the Second Dialogue State Tracking Challenge (DSTC2). Our early stage evaluations are based on comparisons of our tracker with both the baseline model provide by the DSTC2 and also LecTrack: a state-of-the-art incremental LSTM-based tracker. The main finding of our experiments is that moving from an utterance based to incremental word based tracker results in better performance for our RNN based joint task models."
   ]
  },
  "umata17_semdial": {
   "authors": [
    [
     "Ichiro",
     "Umata"
    ],
    [
     "Koki",
     "Ijuin"
    ],
    [
     "Seiichi",
     "Yamamoto"
    ]
   ],
   "title": "Factor Analysis of Gazing Activities in Native and Second Language Conversations",
   "original": "abs13",
   "page_count": 2,
   "order": 28,
   "p1": 170,
   "pn": 171,
   "abstract": [
    "Tendencies of gazing activities during utterances and silence were analyzed in a face-to-face three party conversation setting in a native language (L1) and in a second language (L2). The function of each utterance was categorized according to the Grounding Acts defined by Traum (Traum, 1994) so that gazes during utterances could be analyzed from the viewpoint of grounding in communication (Clark, 1996). Factor analysis showed most gazing activities were influenced by the language difference: the effect of language difference was more salient than that of the functions of utterances. Only listener’s gazes during acknowledgement utterances were affected by a common factor in both L1 and L2 conversations. Correlation analysis of the factor scores and the questionnaire scores toward the partners showed the amount of listener’s gazes strongly affected the speaker’s impression toward the partner only in L2 conversations."
   ]
  },
  "valentino17_semdial": {
   "authors": [
    [
     "Marco",
     "Valentino"
    ],
    [
     "Maria",
     "Di Maro"
    ],
    [
     "Franco",
     "Cutugno"
    ]
   ],
   "title": "Towards a Natural User Interface for Small Groups in Real Museum Environments",
   "original": "abs14",
   "page_count": 2,
   "order": 29,
   "p1": 172,
   "pn": 173,
   "abstract": [
    "In this paper we present a preliminary design and evaluation of a natural user interface for multimodal conversational agents which can be placed in real museums. The natural user interface aims at creating an experience in that users can behave naturally. Specifically, focusing on the requirements\nimposed by a real museum context, our goal is to implement an interface for small groups in order to allow users to interact through their own bodies without additional and auxiliary devices."
   ]
  },
  "yae17_semdial": {
   "authors": [
    [
     "Sunhee",
     "Yae"
    ]
   ],
   "title": "A Transferentive Connective Marker -etaka in Korean: perspectives of grammaticalilzation and pragmatics",
   "original": "abs15",
   "page_count": 2,
   "order": 30,
   "p1": 174,
   "pn": 175,
   "abstract": [
    "This paper aims to address the developmental path of functions and semantics of a connective marker -etaka in Korean from perspectives of grammaticalization and pragmatics. The source of -etaka is a defective verb takuta. The non-finite marker -e connects a verb and taka. The connective marker -etaka designates transferentives, enumeration, emphasis, causality, and condition. This paper focuses on transferentives, emphasis, and condition of -etaka. -Etaka has developed into a postposition, directly attached to a preceding verb. Therefore, its path of grammatical evolution is [lexical verb > functional category > affix]. The mechanism of FFV (Focus Frame of Variation) will illustrate its transferentives, based on the contact or separation between TR (Trajector) and LM (Landmark). It is argued that developmental path from transferentives to hypothetical condition goes toward the increase of subjectification. This paper also argues that the directionality into an attitude stance-marker -etakanun proceeds towards a domain of discourse from a domain of text."
   ]
  }
 },
 "sessions": [
  {
   "title": "Regular Papers",
   "papers": [
    "aina17_semdial",
    "dobnik17_semdial",
    "ferre17_semdial",
    "kiss17_semdial",
    "kumar17_semdial",
    "larsson17_semdial",
    "marzuki17_semdial",
    "osa17_semdial",
    "papalampidi17_semdial",
    "petukhova17_semdial",
    "shalyminov17_semdial",
    "sinclair17_semdial",
    "timpelaughlin17_semdial"
   ]
  },
  {
   "title": "SIGdial/SemDial Special Session",
   "papers": [
    "misra17_semdial",
    "nicolas17_semdial"
   ]
  },
  {
   "title": "Short Papers",
   "papers": [
    "higashinaka17_semdial",
    "katagiri17_semdial",
    "keizer17_semdial",
    "kondratyuk17_semdial",
    "lison17_semdial",
    "miehle17_semdial",
    "morishita17_semdial",
    "qian17_semdial",
    "raveh17_semdial",
    "schnellewalka17_semdial",
    "stab17_semdial",
    "trinh17_semdial",
    "umata17_semdial",
    "valentino17_semdial",
    "yae17_semdial"
   ]
  }
 ],
 "doi": "10.21437/SemDial.2017"
}