{
 "title": "Speech and Language Technology in Education (SLaTE 2011)",
 "location": "Venice, Italy",
 "startDate": "24/8/2011",
 "endDate": "26/8/2011",
 "conf": "SLaTE",
 "year": "2011",
 "name": "slate_2011",
 "series": "SLaTE",
 "SIG": "SLaTE",
 "title1": "Speech and Language Technology in Education",
 "title2": "(SLaTE 2011)",
 "date": "24-26 August 2011",
 "papers": {
  "ling11_slate": {
   "authors": [
    [
     "Wang",
     "Ling"
    ],
    [
     "Isabel",
     "Trancoso"
    ],
    [
     "Rui",
     "Prada"
    ]
   ],
   "title": "An agent based competitive translation game for second language learning",
   "original": "sl11_001",
   "page_count": 4,
   "order": 1,
   "p1": "1",
   "pn": "4",
   "abstract": [
    "This paper describes a competitive language translation game aimed at improving students vocabulary and writing skills. An automated agent is employed as an opponent in order to improve the user’s motivation and maintain the user focused. The agent’s actions are based on statistical machine translation outputs. An evaluation that was performed with 20 Portuguese learners of Mandarin suggested that users were more focused and motivated when playing against the agent than playing alone. Furthermore, the majority of students felt that the system helped them learn Mandarin and would like to use it in the future. The system has a web-based implementation and is easily accessible by language learners.\n",
    "Index Terms. computer assisted language learning, machine translation, automated agent, educational games\n",
    ""
   ],
   "doi": "10.21437/SLaTE.2011-1"
  },
  "correia11_slate": {
   "authors": [
    [
     "Rui",
     "Correia"
    ],
    [
     "Thomas",
     "Pellegrini"
    ],
    [
     "Maxine",
     "Eskenazi"
    ],
    [
     "Isabel",
     "Trancoso"
    ],
    [
     "Jorge",
     "Baptista"
    ],
    [
     "Nuno",
     "Mamede"
    ]
   ],
   "title": "Listening comprehension games for portuguese: exploring the best features",
   "original": "sl11_005",
   "page_count": 4,
   "order": 2,
   "p1": "5",
   "pn": "8",
   "abstract": [
    "This paper investigates which features would be the best to include in a listening comprehension game for European Portuguese. The goal is to develop a method to motivate non-native speakers of Portuguese to engage themselves in activities intended to develop their listening comprehension skills. The approach adopted herein consisted in providing students with several sets of exercises, each set with some slight variations over the previous one. Finally, a questionnaire was presented to the students with the intent of receiving feedback about the most adequate functionalities. The paper also explores students main difficulties with the language so as to define learning models able to adapt the difficulty level of the exercises to each individual’s language proficiency level.\n",
    "Index Terms. CALL, Portuguese, Listening Comprehension, Games\n",
    ""
   ],
   "doi": "10.21437/SLaTE.2011-2"
  },
  "skory11_slate": {
   "authors": [
    [
     "Adam",
     "Skory"
    ],
    [
     "Maxine",
     "Eskenazi"
    ]
   ],
   "title": "Generation of educational content through gameplay",
   "original": "sl11_009",
   "page_count": 4,
   "order": 3,
   "p1": "9",
   "pn": "12",
   "abstract": [
    "Language learning games require large quantities of content to be educational. This paper presents a boot-strapping method to generate game content using a combination of existing digital resources and the human computation of game players themselves. It describes a baseline method for hint generation to be used in a two-player game in which players select hints to assist each other. It then shows that the data gathered from player actions contains significant agreement in evaluation of automatically generated content. The quality of this data is verified against data from tasked-based crowdsourcing. Results demonstrate that this type of data may be used to extend and improve the hint generation method.\n",
    "Index Terms. educational games, language learning, crowdsourcing\n",
    ""
   ],
   "doi": "10.21437/SLaTE.2011-3"
  },
  "coyne11_slate": {
   "authors": [
    [
     "Bob",
     "Coyne"
    ],
    [
     "Cecilia",
     "Schudel"
    ],
    [
     "Michael",
     "Bitz"
    ],
    [
     "Julia",
     "Hirschberg"
    ]
   ],
   "title": "Evaluating a text-to-scene generation system as an aid to literacy",
   "original": "sl11_013",
   "page_count": 4,
   "order": 4,
   "p1": "13",
   "pn": "16",
   "abstract": [
    "We discuss classroom experiments using WordsEye, a system for automatically generating 3D scenes from English textual descriptions. Input is syntactically and semantically processed to identify a set of graphical objects and constraints which are then rendered as a 3D scene. We describe experiments with the system in a summer literacy enrichment program conducted at the Harlem Educational Activities Fund with 6th grade students, in which students using the system had significantly greater improvement in their literary character and story descriptions in pre- and post- test essays compared with a control. Students reported that using the system helped them imagine the events in the stories they were reading better. We also observed that social interaction engendered by this process was a strong motivator.\n",
    "Index Terms. text-to-scene generation\n",
    ""
   ],
   "doi": "10.21437/SLaTE.2011-4"
  },
  "rasmussen11_slate": {
   "authors": [
    [
     "Morten Højfeldt",
     "Rasmussen"
    ],
    [
     "Jack",
     "Mostow"
    ],
    [
     "Zheng-Hua",
     "Tan"
    ],
    [
     "Børge",
     "Lindberg"
    ],
    [
     "Yuanpeng",
     "Li"
    ]
   ],
   "title": "Evaluating tracking accuracy of an automatic reading tutor",
   "original": "sl11_017",
   "page_count": 4,
   "order": 5,
   "p1": "17",
   "pn": "20",
   "abstract": [
    "In automatic reading tutoring, tracking is the process of automatically following a reader through a given target text. When developing tracking algorithms, a measure of the tracking accuracy – how often a spoken word is aligned to the right target text word position – is needed in order to evaluate performance and compare different algorithms. This paper presents a framework for determining the observed tracking error rate. The proposed framework is used to evaluate three tracking strategies: A) follow the reader to whichever word he/she jumps to in the text, B) follow the reader monotonically from left to right ignoring word skips and regressions (going back to a previous text word), and C) the same as B but allowing isolated word skips. Observed tracking error rate for each of the three tracking strategies is: A: 53%, B: 56%, and C: 47%, on 1883 utterances from 25 children.\n",
    "Index Terms. Automatic Reading Tutor, Tracking Speech, Tracking Error Rate\n",
    ""
   ],
   "doi": "10.21437/SLaTE.2011-5"
  },
  "rasmussen11b_slate": {
   "authors": [
    [
     "Morten Højfeldt",
     "Rasmussen"
    ],
    [
     "Børge",
     "Lindberg"
    ],
    [
     "Zheng-Hua",
     "Tan"
    ]
   ],
   "title": "Combining acoustic and language model miscue detection methods for adult dyslexic read speech",
   "original": "sl11_021",
   "page_count": 4,
   "order": 6,
   "p1": "21",
   "pn": "24",
   "abstract": [
    "One important feature of automatic reading tutors is their ability to detect miscues in order to provide feedback to the student and/or to automatically evaluate the student’s reading proficiency. The focus of this paper is on improving accuracy of detecting miscues in dyslexic read speech. We present a miscue detection method that combines a specialized language model and the goodness of pronunciation (GOP) score. The language model is augmented with a subset of the real word substitutions that are observed in the training set. Experiments have been conducted on a corpus containing adult dyslexic read speech. At a miscue detection rate of 34% the false rejection rate (FRR) using only the specialized language model is 2.6%, for the GOP score it’s 3.4%, whereas for a combination of the two miscue detection methods the FRR is only 1.8%, which is a 31% relative improvement of FRR when compared to the specialized language model method.\n",
    "Index Terms. miscue detection, automatic reading tutor, dyslexia, read speech\n",
    ""
   ],
   "doi": "10.21437/SLaTE.2011-6"
  },
  "delmonte11_slate": {
   "authors": [
    [
     "Rodolfo",
     "Delmonte"
    ],
    [
     "Francesco",
     "Stiffoni"
    ]
   ],
   "title": "Using speech synthesis to simulate an interlanguage and learn the Italian lexicon",
   "original": "sl11_025",
   "page_count": 4,
   "order": 7,
   "p1": "25",
   "pn": "28",
   "abstract": [
    "We present work carried out to simulate an interlanguage for English speakers learning Italian with a speech synthesizer made available by Apple. The lexicon is made of the most frequent 30,000 word forms of Italian as extracted from corpora and other similar Frequency Lists. The synthesizer has been filtered by a program in C-language that addresses the internal system of rules running on Apple’s MacinTalk speech synthesizer that allows to modify phones and rhythm. By applying different sets of rules it is possible to simulate knowledge of the phonotactics, phonology and prosody in such a way as to mimic the condition of different stages of an English learner of Italian. Correct pronunciation is produced by an adequately modified Apple’s synthesis for Mexican Spanish.\n",
    ""
   ],
   "doi": "10.21437/SLaTE.2011-7"
  },
  "nichasaide11_slate": {
   "authors": [
    [
     "Ailbhe",
     "Ní Chasaide"
    ],
    [
     "Neasa",
     "Ní Chiaráin"
    ],
    [
     "Christoph",
     "Wendler"
    ],
    [
     "Harald",
     "Berthelsen"
    ],
    [
     "Amelia",
     "Kelly"
    ],
    [
     "Emer",
     "Gilmartin"
    ],
    [
     "Elaine",
     "Ní Dhonnchadha"
    ],
    [
     "Christer",
     "Gobl"
    ]
   ],
   "title": "Towards personalised, synthesis-based content in Irish (gaelic) language education",
   "original": "sl11_029",
   "page_count": 4,
   "order": 8,
   "p1": "29",
   "pn": "32",
   "abstract": [
    "We present a web-based TTS facility, which will eventually provide for the major dialects of Irish. It, along with an ancillary toolkit of language resources, is increasingly being exploited in diverse teaching/learning environments. Further synthesis-based interactive educational platforms are described which are geared to specific learning tasks. These educational applications facilitate a degree of personalisation and can be adapted to the needs and proficiency levels of different types of learners. They further enable learner autonomy. It is emphasised that speech technology applications, such as those illustrated here, may have a particular impact in addressing many of the particular challenges that face teachers/learners of a minority language, such as Irish.\n",
    "Index Terms. TTS, speech synthesis, language learning, Irish, personalisation, Gaelic.\n",
    ""
   ],
   "doi": "10.21437/SLaTE.2011-8"
  },
  "bouillon11_slate": {
   "authors": [
    [
     "Pierrette",
     "Bouillon"
    ],
    [
     "Manny",
     "Rayner"
    ],
    [
     "Nikos",
     "Tsourakis"
    ],
    [
     "Qinglu",
     "Zhang"
    ]
   ],
   "title": "A student-centred evaluation of a web-based spoken translation game",
   "original": "sl11_033",
   "page_count": 4,
   "order": 9,
   "p1": "33",
   "pn": "36",
   "abstract": [
    "We present an evaluation of CALL-SLT, a web-deployed speech-enabled platform for improving fluency in a limited domain, based on the “translation game” idea ofWang and Seneff. The evaluation used 10 Chinese-speaking students of French, who spent an average of about three hours each practising on a set of five lessons covering elementary and intermediate grammar topics in a restaurant domain. We found significant improvements in student performance, measured both in terms of their ability to be recognised correctly by the application and according to written vocabulary and grammar tests.\n",
    "Index Terms. CALL, speech recognition, evaluation, Web, French, Chinese\n",
    ""
   ],
   "doi": "10.21437/SLaTE.2011-9"
  },
  "kane11_slate": {
   "authors": [
    [
     "Mark",
     "Kane"
    ],
    [
     "João P.",
     "Cabral"
    ],
    [
     "Amalia",
     "Zahra"
    ],
    [
     "Julie",
     "Carson-Berndsen"
    ]
   ],
   "title": "Introducing difficulty-levels in pronunciation learning",
   "original": "sl11_037",
   "page_count": 4,
   "order": 10,
   "p1": "37",
   "pn": "40",
   "abstract": [
    "This paper presents a method to introduce the notion of a student selected difficulty level for the task of pronunciation learning of a second language. Three difficulty levels, novice, acceptable and native, are constructed using a tri-/bi- and unigram language model each using a specific set of broad phonetic groups determined using underspecification. The evaluation of the experiment is based on a target language of American English where Nigerian, Hungarian, Indonesian, Syrian, Pakistani and Portuguese students participate. The results show that the addition of difficulty levels returns specific mis-pronunciation information for a student indicating what pronunciation practice is required before they go to the next difficulty level.\n",
    "Index Terms. pronunciation learning, broad phonetic groups\n",
    ""
   ],
   "doi": "10.21437/SLaTE.2011-10"
  },
  "mesbahi11_slate": {
   "authors": [
    [
     "Larbi",
     "Mesbahi"
    ],
    [
     "Denis",
     "Jouvet"
    ],
    [
     "Anne",
     "Bonneau"
    ],
    [
     "Dominique",
     "Fohr"
    ],
    [
     "Irina",
     "Illina"
    ],
    [
     "Yves",
     "Laprie"
    ]
   ],
   "title": "Reliability of non-native speech automatic segmentation for prosodic feedback",
   "original": "sl11_041",
   "page_count": 4,
   "order": 11,
   "p1": "41",
   "pn": "44",
   "abstract": [
    "This paper investigates the reliability of phonetic boundaries obtained through automatic segmentation of non-native speech for automatic prosodic feedback for foreign language learning. Indeed, prosodic feedback requires checking the fundamental frequency and the duration of phonetic segments of the learner utterances with respect to some reference patterns. Segmentation evaluations carried out on non-native speech data show that the automatic segmentation process takes benefit from the introduction of non-native pronunciation variants, and that several phonetic boundaries obtained through automatic segmentation seems to be reliable enough for providing relevant prosodic feedback. This concerns for example boundaries between obstruent sounds, such as plosives and fricatives, and vowel sounds.\n",
    "Index Terms. Language learning, automatic phonetic segmentation, non-native speech.\n",
    ""
   ],
   "doi": "10.21437/SLaTE.2011-11"
  },
  "short11_slate": {
   "authors": [
    [
     "Greg",
     "Short"
    ],
    [
     "Keikichi",
     "Hirose"
    ],
    [
     "Nobuaki",
     "Minematsu"
    ]
   ],
   "title": "Rule-based method for pitch level classification for a Japanese pitch accent CALL system",
   "original": "sl11_045",
   "page_count": 4,
   "order": 12,
   "p1": "45",
   "pn": "48",
   "abstract": [
    "In order to make a CALL system to detect lexical pitch accent errors, we are developing a multi-level pitch pattern recognition algorithm. With this method, it is possible to detect a wider range of pitch accent errors than with previous methods and it is possible to have more flexibility in displaying the pitch pattern to the learner. This rule-based method is based on perceptual experiments in which we made use of speech synthesis to manipulate the pitch of utterances to perform quantitative analysis on accent perception. The recognition is based on two-mora units and the local pitch level pattern for those units. By combining the local pitch level patterns for a word it is possible to derive the two level pitch pattern for the word and also provide a variety of ways to display the word to the language learner. The average agreement rate with the labeling for these units was 75% in the case of the Japanese database and 66% in the case of the non-Japanese database.\n",
    "Index Terms. Japanese pitch accent, classification, perception, CALL system\n",
    ""
   ],
   "doi": "10.21437/SLaTE.2011-12"
  },
  "ananthakrishnan11_slate": {
   "authors": [
    [
     "Gopal",
     "Ananthakrishnan"
    ],
    [
     "Preben",
     "Wik"
    ],
    [
     "Olov",
     "Engwall"
    ],
    [
     "Sherif",
     "Abdou"
    ]
   ],
   "title": "Using an ensemble of classifiers for mispronunciation feedback",
   "original": "sl11_049",
   "page_count": 4,
   "order": 13,
   "p1": "49",
   "pn": "52",
   "abstract": [
    "This paper proposes a paradigm where commonly made segmental pronunciation errors are modeled as pair-wise confusions between two or more phonemes in the language that is being learnt. The method uses an ensemble of support vector machine classifiers with time varying Mel frequency cepstral features to distinguish between several pairs of phonemes. These classifiers are then applied to classify the phonemes uttered by second language learners. Instead of providing feedback at every mispronounced phoneme, the method attempts to provide feedback about typical mispronunciations by a certain student, over an entire session of several utterances. Two case studies that demonstrate how the paradigm is applied to provide suitable feedback to two students is also described in this paper.\n",
    "Index Terms. Support Vector Machines, Time Varying-MFCC, CAPT\n",
    ""
   ],
   "doi": "10.21437/SLaTE.2011-13"
  },
  "fuentes11_slate": {
   "authors": [
    [
     "Maria",
     "Fuentes"
    ],
    [
     "Meritxell",
     "González"
    ]
   ],
   "title": "English language learning activity using spoken language and intelligent computer-assisted technologies",
   "original": "sl11_053",
   "page_count": 4,
   "order": 14,
   "p1": "53",
   "pn": "56",
   "abstract": [
    "This paper presents work in progress on language technologies applied to secondary school education. The application presented integrates several state-of-the-art technologies related to spoken language and intelligent computer-assisted language learning. We envision to show that the technology has reached a level of maturity that suggests that the time may be right to use it to second language learning. To achieve this objective, an activity was designed to be tested at several Spanish high schools. The aim was to carry out a proof of concept in real conditions and to obtain feedback from the students through a questionnaire as well as from the teachers by means of an interview. The activity was designed with the collaboration of some of the teachers at the secondary schools.\n",
    "Index Terms. speech synthesis, speech recognition, natural language processing, dialog system\n",
    ""
   ],
   "doi": "10.21437/SLaTE.2011-14"
  },
  "wolska11_slate": {
   "authors": [
    [
     "Magdalena",
     "Wolska"
    ],
    [
     "Sabrina",
     "Wilske"
    ]
   ],
   "title": "Assessing the effect of type-written form-focused dialogues on spoken language fluency",
   "original": "sl11_057",
   "page_count": 4,
   "order": 15,
   "p1": "57",
   "pn": "60",
   "abstract": [
    "We report on a preliminary study which investigated the effect of form vs. meaning focused computer-based type-written activities on spoken communicative skills of learners of German. Both types of activities were realized as written interactions with a computer-based dialogue system and were framed within a “Directions giving” scenario. The linguistic form in focus was the German dative case in prepositional phrases. The paper introduces the methodology we adopt to assess the learners’ language fluency (holistic fluency ratings and temporal measures of speech) and reports on the results of a pilot experiment.\n",
    "Index Terms. computer-assisted task-based language learning, second-language acquisition, communicative approach, fluency\n",
    ""
   ],
   "doi": "10.21437/SLaTE.2011-15"
  },
  "ryu11_slate": {
   "authors": [
    [
     "Hyuksu",
     "Ryu"
    ],
    [
     "Kyuwhan",
     "Lee"
    ],
    [
     "Sunhee",
     "Kim"
    ],
    [
     "Minhwa",
     "Chung"
    ]
   ],
   "title": "Improving transcription agreement of non-native English speech corpus transcribed by non-natives",
   "original": "sl11_061",
   "page_count": 4,
   "order": 16,
   "p1": "61",
   "pn": "64",
   "abstract": [
    "This paper proposes an economical and effective phonetic transcription method for dealing with a large amount of non-native English speech corpus. The method provides a consistent transcription agreement, although the corpus is transcribed by non-natives. To minimize the possibility of confusion in transcription process, forced aligned phone sequences and a set of possible mispronunciation candidate phones that Korean L2 learners are expected to make are given to the Korean transcribers for reference. The proposed method is evaluated by measuring the transcription agreement using Fleiss’ kappa as well as percentage agreement. Furthermore, the transcription consistency is analyzed by comparing it to that performed on the English corpus transcribed by native speakers. As a result, a transcription agreement of 0.869 is achieved, while the Buckeye corpus transcribed by natives shows a transcription agreement of 0.803.\n",
    "Index Terms. transcription method, transcription agreement, non-native transcriber, forced alignment\n",
    ""
   ],
   "doi": "10.21437/SLaTE.2011-16"
  },
  "wet11_slate": {
   "authors": [
    [
     "Febe de",
     "Wet"
    ],
    [
     "Pieter",
     "Müller"
    ],
    [
     "Christa van der",
     "Walt"
    ],
    [
     "Thomas",
     "Niesler"
    ]
   ],
   "title": "Readability index as a design criterion for elicited imitation tasks in automatic oral proficiency assessment",
   "original": "sl11_105",
   "page_count": 4,
   "order": 17,
   "p1": "105",
   "pn": "108",
   "abstract": [
    "We investigate the effectiveness of using an accepted readability index, the Flesch Reading Ease (FRE) scale, to design prompts for an automatic oral proficiency assessment system. The prompts in question are uttered by the system, and must be repeated from memory by the test subjects, in the form of an elicited imitation exercise. The FRE scores for our prompts are shown to correlate well with the repeat accuracy ratings given to the same prompts by human judges. The prompts are also shown to perform well in the automatic assessment of oral proficiency by means of the elicited imitation tasks with more than one group of university students. We therefore conclude that a readability index, such as the FRE, can be used as a design criterion for prompts in an automated elicited imitation test.\n",
    "Index Terms. elicited imitation task, readability index, Flesch Reading Ease scale, automatic oral proficiency assessment\n",
    ""
   ],
   "doi": "10.21437/SLaTE.2011-17"
  },
  "strik11_slate": {
   "authors": [
    [
     "Helmer",
     "Strik"
    ],
    [
     "Joost van",
     "Doremalen"
    ],
    [
     "Janneke van de",
     "Loo"
    ],
    [
     "Catia",
     "Cucchiarini"
    ]
   ],
   "title": "Improving ASR processing of ungrammatical utterances through grammatical error modeling",
   "original": "sl11_109",
   "page_count": 4,
   "order": 18,
   "p1": "109",
   "pn": "112",
   "abstract": [
    "Automatic speech recognition (ASR) of non-native utterances with grammatical errors is problematic. A new method which makes it possible to better recognize such utterances is presented in the current paper. It can be briefly summarized as follows: extract error patterns automatically from a learner corpus, formulate rewrite rules for these syntactic and morphological errors, build finite state grammars (FSGs), and use these FSGs as language models in ASR systems. All rules used in isolation and in different combinations yield lower word error rates (WERs).\n",
    "Index Terms. computer-assisted language learning (CALL), non-native speech, grammatical errors, automatic speech recognition (ASR), language modeling\n",
    ""
   ],
   "doi": "10.21437/SLaTE.2011-18"
  },
  "bodnar11_slate": {
   "authors": [
    [
     "Stephen",
     "Bodnar"
    ],
    [
     "Bart Penning de",
     "Vries"
    ],
    [
     "Catia",
     "Cucchiarini"
    ],
    [
     "Helmer",
     "Strik"
    ],
    [
     "Roeland van",
     "Hout"
    ]
   ],
   "title": "Feedback in an ASR-based CALL system for L2 syntax: a feasibility study",
   "original": "sl11_113",
   "page_count": 4,
   "order": 19,
   "p1": "113",
   "pn": "116",
   "abstract": [
    "In the FASOP project, we are interested in using CALL systems to study issues in foreign language learning, particularly those related to the acquisition of spoken proficiency. Specifically, we use ASR in a CALL system that provides oral practice exercises to investigate the role of corrective feedback in syntax acquisition of Dutch L2. To investigate the feasibility of this proposal we built and tested a CALL system in a pilot experiment. This paper analyses the accuracy of the feedback in the system, showing that it performs accurately. We also provide an overview of learner behaviour in the exercises, with a view to understanding how learners respond to feedback, and to system errors. Based on our analysis, we suggest ways of improving the feedback that might increase training effectiveness without exceeding the limits of the ASR technology.\n",
    "Index Terms. CALL, ASR, grammar, corrective feedback\n",
    ""
   ],
   "doi": "10.21437/SLaTE.2011-19"
  },
  "rayner11_slate": {
   "authors": [
    [
     "Manny",
     "Rayner"
    ],
    [
     "Ian",
     "Frank"
    ],
    [
     "Cathy",
     "Chua"
    ],
    [
     "Nikos",
     "Tsourakis"
    ],
    [
     "Pierrette",
     "Bouillon"
    ]
   ],
   "title": "For a fistful of dollars: using crowd-sourcing to evaluate a spoken language CALL application",
   "original": "sl11_117",
   "page_count": 4,
   "order": 20,
   "p1": "117",
   "pn": "120",
   "abstract": [
    "We present an evaluation of a Web-deployed spoken language CALL system, carried out using crowd-sourcing methods. The system, “Survival Japanese”, is a crash course in tourist Japanese implemented within the platform CALL-SLT. The evaluation was carried out over one week using the Amazon Mechanical Turk. Although we found a high proportion of attempted scammers, there was a core of 23 subjects who used the system in a responsible manner. The evidence that these subjects learned from their 111 sessions and 9092 spoken interactions was significant at P =0.001. Our conclusion is that crowd-sourcing is a potentially valid method for evaluating spoken CALL systems.\n",
    "Index Terms. CALL, crowd-sourcing, speech recognition, evaluation, Japanese\n",
    ""
   ],
   "doi": "10.21437/SLaTE.2011-20"
  },
  "berkling11_slate": {
   "authors": [
    [
     "Kay",
     "Berkling"
    ],
    [
     "Johanna",
     "Fay"
    ],
    [
     "Sebastian",
     "Stüker"
    ]
   ],
   "title": "Speech technology-based framework for quantitative analysis of German spelling errors in freely composed children’s texts",
   "original": "sl11_065",
   "page_count": 4,
   "order": 21,
   "p1": "65",
   "pn": "68",
   "abstract": [
    "Reading and writing are core competencies of any society. In Germany, international and national comparative studies such as PISA (Programme for International Student Assessment) or PIRLS (Progress in International Reading Literacy Study - IGLU in German) have shown that around 25% of German school children do not reach the minimal competence level necessary to function effectively in society by the age of 15. In order to teach writing to school children more effectively, a detailed analysis of their spelling errors can help in deriving individually tuned exercises. The work presented here forms the basis for frequently repeatable diagnosis and automatic error profiling on freely written text. We perform an automatic analysis on transcribed children’s texts, whereas the orthographically correct target is already known. The algorithm is able to identify 25 different types of errors defined by educators without manual intervention. The errors found were checked by the authors who agree with the completeness and correctness of the classified errors. The capability to automatically analyze spelling errors has not been achieved for the German language until now and the work presented here opens new perspectives on large scale data analysis about the development of written language in children that has previously not been possible for the German language.\n",
    "Index Terms. Spelling Errors, German Language, Spelling Diagnosis, Children, Tutoring, Education\n",
    ""
   ],
   "doi": "10.21437/SLaTE.2011-21"
  },
  "medero11_slate": {
   "authors": [
    [
     "Julie",
     "Medero"
    ],
    [
     "Mari",
     "Ostendorf"
    ]
   ],
   "title": "Identifying targets for syntactic simplification",
   "original": "sl11_069",
   "page_count": 4,
   "order": 22,
   "p1": "69",
   "pn": "72",
   "abstract": [
    "Most work on automatic text simplification considers lexical difficulty separate from syntactic simplification. In this study, we use both factors together to predict a variety of sentence changes, including the standard problems of splitting and shortening, as well as expanding to define difficult words that are important to the topic. We leverage a variety of lexical and parse features, as well as a score of the relatedness of a sentence to the topic of its document.\n",
    "Index Terms. text simplification, parse complexity\n",
    ""
   ],
   "doi": "10.21437/SLaTE.2011-22"
  },
  "xu11_slate": {
   "authors": [
    [
     "Yushi",
     "Xu"
    ],
    [
     "Stephanie",
     "Seneff"
    ]
   ],
   "title": "A generic framework for building dialogue games for language learning: application in the flight domain",
   "original": "sl11_073",
   "page_count": 4,
   "order": 23,
   "p1": "73",
   "pn": "76",
   "abstract": [
    "This paper presents a generic web-based dialogue game framework, “Mercurial”, for language learning. The system capabilities are demonstrated within a flight domain application. The system randomly generates a flight-booking scenario according to the current difficulty level. The student accomplishes the scenario by interacting with the system through speech. The system gives real-time feedback on the dialogue progress and scores, and summarizes the whole dialogue at the end of each scenario. The system uses generic language understanding, language generation, dialogue management, and user simulation modules to conduct the dialogue and give contextual help. Preliminary experiments yielded positive feedback from the subjects.\n",
    ""
   ],
   "doi": "10.21437/SLaTE.2011-23"
  },
  "tsourakis11_slate": {
   "authors": [
    [
     "Nikos",
     "Tsourakis"
    ],
    [
     "Manny",
     "Rayner"
    ],
    [
     "Pierrette",
     "Bouillon"
    ]
   ],
   "title": "Evaluation of a mobile language learning system using language-neutral prompts",
   "original": "sl11_077",
   "page_count": 4,
   "order": 24,
   "p1": "77",
   "pn": "80",
   "abstract": [
    "We describe two versions of a prototype system for computer assisted language learning hosted on a mobile device. In both versions, the student is given prompts by the machine, which they then have to render in the L2. The two versions differ with respect to the modality of the prompt: one presents it as an L1-based text string, while the other one presents it in pictorial form. The two versions were tested on a group of 32 high school students as part of the Geneva University Student Week. Our findings suggest that male students found the pictorial version significantly easier to use, while female students preferred the text version.\n",
    "Index Terms. mobile spoken language learning systems, gender differences in HCI, text vs. images in HCI\n",
    ""
   ],
   "doi": "10.21437/SLaTE.2011-24"
  },
  "nagata11_slate": {
   "authors": [
    [
     "Ryo",
     "Nagata"
    ],
    [
     "Toshiaki",
     "Marueki"
    ],
    [
     "Kotaro",
     "Funakoshi"
    ],
    [
     "Tatsuya",
     "Kitamura"
    ],
    [
     "Mikio",
     "Nakano"
    ]
   ],
   "title": "A method for predicting stressed words in English jazz chants",
   "original": "sl11_081",
   "page_count": 4,
   "order": 25,
   "p1": "81",
   "pn": "84",
   "abstract": [
    "To acquire a second language, one must develop an ear and tongue for the correct stress and intonation patterns of that language. In English language teaching, there is an effective method called Jazz Chants for working on the sound system. In this paper, we propose a method for predicting stressed words, which play a crucial role in Jazz Chants. The proposed method is specially designed for stress prediction in Jazz chants. It exploits several sources of information including words, POSs, sentence types, and the constraint on the number of stressed words in a chant text. Experiments show that the proposed method achieves an &# 4;-measure of 0.936 and outperforms the other methods implemented for comparison. The proposed method is expected to be useful in supporting non-native teachers of English when they teach chants to students and create chant texts with stress marks from arbitrary texts.\n",
    "Index Terms. language learning, stress prediction, teaching material generation, Jazz Chants, stress-timed rhythm\n",
    ""
   ],
   "doi": "10.21437/SLaTE.2011-25"
  },
  "lee11_slate": {
   "authors": [
    [
     "Kyusong",
     "Lee"
    ],
    [
     "Soo-Ok",
     "Kweon"
    ],
    [
     "Sungjin",
     "Lee"
    ],
    [
     "Hyungjong",
     "Noh"
    ],
    [
     "Jinsik",
     "Lee"
    ],
    [
     "Jonghoon",
     "Lee"
    ],
    [
     "Hae-Ri",
     "Kim"
    ],
    [
     "Gary Geunbae",
     "Lee"
    ]
   ],
   "title": "Effects of language learning game on Korean elementary school students",
   "original": "sl11_085",
   "page_count": 4,
   "order": 26,
   "p1": "85",
   "pn": "88",
   "abstract": [
    "This paper introduces a preliminary study on affective effects of Spoken Dialog-Based Language Learning Game (DB-LLG) currently under the development in our research group. DB-LLG is an educational game designed for language learners to convey interactive conversations with in-game characters in interactive immersive environments, such as post office, library, shops, on the street, etc. Students have meaningful interactions with Non Player Characters to complete tasks in each game mission. We used the Wizard-of-Oz method as a preliminary technique to explore various affective effects resulting from students. dialog behaviors during the game. A total of 10 elementary school students, ranging in age from 12 to 13, participated in the experiment. The pre/post survey questionnaires were conducted to investigate the effect of DB-LLG approach on the affective factors of learning English. The results showed that DB-LLG significantly encourages students. satisfaction, interest, and learnability, while slightly decreasing students. pre-existing confidence.\n",
    "Index Terms. language learning game, computer-assisted language learning, CALL, Wizard-of-Oz, WOZ\n",
    ""
   ],
   "doi": "10.21437/SLaTE.2011-26"
  },
  "klenner11_slate": {
   "authors": [
    [
     "Manfred",
     "Klenner"
    ],
    [
     "Simon",
     "Clematide"
    ],
    [
     "Michi",
     "Amsler"
    ]
   ],
   "title": "Semi-automatic test generation for tandem learning",
   "original": "sl11_089",
   "page_count": 4,
   "order": 27,
   "p1": "89",
   "pn": "92",
   "abstract": [
    "We introduce a Web-based CALL architecture that facilitates the construction of learner-customized multiple choice tests in a cross-lingual tandem language learning environment. Mistakes made by the learner are manually corrected and classified by his tandem partner, who acts as a tutor. If the learner has problems to identify and correct his mistakes, or if he likes to practice, he can generate two kinds of tests that are automatically produced on the basis of the tutor’s error classifications. We describe the NLP components behind our test generator, give a preliminary evaluation of the quality of the generated tests, and present the current state of our Web application.\n",
    "Index Terms. CALL, NLP, Syntactic Analysis, Tandem Learning\n",
    ""
   ],
   "doi": "10.21437/SLaTE.2011-27"
  },
  "kim11_slate": {
   "authors": [
    [
     "Yeon-Jun",
     "Kim"
    ],
    [
     "Mark C.",
     "Beutnagel"
    ]
   ],
   "title": "Automatic assessment of american English lexical stress using machine learning algorithms",
   "original": "sl11_093",
   "page_count": 4,
   "order": 28,
   "p1": "93",
   "pn": "96",
   "abstract": [
    "This paper introduces a method to assess lexical stress patterns in American English words automatically using machine learning algorithms, which could be used on the computer assisted language learning (CALL) system. We aim to model human production concerning lexical stress patterns by training stress patterns in a native speaker’s utterances and making use of it to detect erroneous stress patterns from a trainee. In this paper, all the possible lexical stress patterns in 3- and 4-syllable American English words are presented and four machine learning algorithms, CART, AdaBoost+CART, SVM and MaxEnt, are trained with acoustic measurements from a native speaker’s utterances and corresponding stress patterns. Our experimental results show that MaxEnt correctly classified the best, 83.3% stress patterns of 3-syllable words and 88.7% of 4-syllable words.\n",
    "Index Terms. automatic assessment, lexical stress, machine learning\n",
    ""
   ],
   "doi": "10.21437/SLaTE.2011-28"
  },
  "pietquin11_slate": {
   "authors": [
    [
     "Olivier",
     "Pietquin"
    ],
    [
     "Lucie",
     "Daubigney"
    ],
    [
     "Matthieu",
     "Geist"
    ]
   ],
   "title": "Optimization of a tutoring system from a fixed set of data",
   "original": "sl11_097",
   "page_count": 4,
   "order": 29,
   "p1": "97",
   "pn": "100",
   "abstract": [
    "In this paper, we present a general method for optimizing a tutoring system with a target application in the domain of second language acquisition. More specifically, the optimisation process aims at learning the best sequencing strategy for switching between teaching and evaluation sessions so as to maximise the increase of knowledge of the learner in an adapted manner. The most important feature of the proposed method is that it is able to learn an optimal strategy from a fixed set of data, collected with a hand-crafted strategy. This way, no model (neither cognitive nor probabilistic) of learners is required but only observations of their behavior when interacting with a simple (non-optimal) system. To do so, a particular batch-mode approximate dynamic programming algorithm is used, namely the Least Square Policy Iteration algorithm. Experiments on simulated data provide promising results.\n",
    "Index Terms. Tutoring systems, approximate dynamic programming\n",
    ""
   ],
   "doi": "10.21437/SLaTE.2011-29"
  },
  "vundela11_slate": {
   "authors": [
    [
     "Meena",
     "Vundela"
    ],
    [
     "A.V.S.L.G",
     "Swetha"
    ],
    [
     "Kishore",
     "Prahallad"
    ]
   ],
   "title": "A vocabulary acquisition framework using audio books",
   "original": "sl11_101",
   "page_count": 4,
   "order": 30,
   "p1": "101",
   "pn": "104",
   "abstract": [
    "In this paper, we describe a framework for vocabulary acquisition using audio books. The proposed framework performs automatic alignment of text and large speech files in audio books. This enables highlighting of words and sentences during voice over. The proposed framework can be easily extended to a large number of audio books. We evaluate this framework on a set of subjects between the age of 7-13 years, and demonstrate the effectiveness of such framework for vocabulary acquisition.\n",
    "Index Terms. Audio books, Incidental vocabulary acquisition\n",
    ""
   ],
   "doi": "10.21437/SLaTE.2011-30"
  },
  "saz11_slate": {
   "authors": [
    [
     "Oscar",
     "Saz"
    ],
    [
     "Maxine",
     "Eskenazi"
    ]
   ],
   "title": "Identifying confusable contexts for automatic generation of activities in second language pronunciation training",
   "original": "sl11_121",
   "page_count": 4,
   "order": 31,
   "p1": "121",
   "pn": "124",
   "abstract": [
    "This paper presents a new technique in the development of tools for Computer-Aided Language Learning (CALL) in Second Language (L2) pronunciation training. Instead of the usual pinpointing and feedback strategies, which address all production errors in the L2 speaker equally, this technique aims at honing in on where a pronunciation error can lead to a confusion in the transmission of the message and providing these contexts for practice. To provide this new correction strategy, it is necessary to first identify the words and contexts which can lead to a confusion in a message when there is a mispronunciation in them. This paper describes a Basic Identification of Confusable Contexts (BICC) procedure for detecting these cases providing a measure of their relevance. It also includes a methodological validation of BICC with humans assessing the quality and comprehensibility of a dataset of automatically generated sentences which shows that the prediction of these contexts is possible with good precision.\n",
    "Index Terms. second language, pronunciation training, natural language processing, confusable contexts\n",
    ""
   ],
   "doi": "10.21437/SLaTE.2011-31"
  },
  "stanley11_slate": {
   "authors": [
    [
     "Theban",
     "Stanley"
    ],
    [
     "Kadri",
     "Hacioglu"
    ],
    [
     "Bryan",
     "Pellom"
    ]
   ],
   "title": "Statistical machine translation framework for modeling phonological errors in computer assisted pronunciation training system",
   "original": "sl11_125",
   "page_count": 4,
   "order": 32,
   "p1": "125",
   "pn": "128",
   "abstract": [
    "Computer Assisted Pronunciation Training (CAPT) is becoming more and more popular among language learners. Most effective CAPT systems take advantage of the learner’s L1 and cater exercises and feedback specific to the language transfer effects. This paper presents a statistical machine translation (MT) based approach to model salient phonological errors present in an L1 population. The output of the MT system is coupled with a speech recognition system to detect non-native phonological errors. On a Korean learners of English corpus, the MT approach shows a 32.9% relative improvement in phone error detection and a 49% relative improvement in phone error identification compared to edit distance based modeling techniques. Similar performance improvements were observed on Japanese learners of English corpus.\n",
    "Index Terms. phonological error modeling, machine translation, speech recognition\n",
    ""
   ],
   "doi": "10.21437/SLaTE.2011-32"
  },
  "jokisch11_slate": {
   "authors": [
    [
     "Oliver",
     "Jokisch"
    ],
    [
     "Hongwei",
     "Ding"
    ],
    [
     "Rüdiger",
     "Hoffmann"
    ]
   ],
   "title": "Acoustic analysis of postvocalic /l/ in Chinese learners of German in the context of an overall perception experiment",
   "original": "sl11_129",
   "page_count": 4,
   "order": 33,
   "p1": "129",
   "pn": "132",
   "abstract": [
    "A foreign accent involves discrete phonetic features which can be acoustically analyzed. However, these phonetic features are often masked perceptually by other features, such as prosodic features. This study presents an acoustic analysis of the postvocalic /l/ in Chinese learners, as an example, and puts these results into context with a perception test, which targets the overall aspects of an audible foreign accent.\n",
    "Mandarin Chinese does not allow consonant finals except /n/ and /ng/ which leads to the question, how well can Mandarin speakers of German produce a clear /l/ in syllable final position. This study investigates 490 German speech tokens with embedded postvocalic /l/ produced by 12 Mandarin speakers from three different proficiency levels, as well as two native German reference speakers. The acoustic analysis indicates that the /l/ productions of Mandarin speakers are darker than those of native Germans. No relationship could be found between darkness of /l/ and proficiency levels. The data reveals that preceding back vowels favour dark realization and vocalization of /l/.\n",
    "A perception test involving the produced tokens with 10 native German listeners suggests that dark realization of /l/ contributes to foreign accent, while other factors - such as expectation and previous knowledge of listeners or overall accent strength and prosodic quality – influence the postvocalic /l/ assessment.\n",
    "",
    "",
    "Index Terms. Foreign language acquisition, Chinese, German, postvocalic /l/, acoustic analysis, perception test\n",
    ""
   ],
   "doi": "10.21437/SLaTE.2011-33"
  },
  "husby11_slate": {
   "authors": [
    [
     "Olaf",
     "Husby"
    ],
    [
     "Åsta",
     "Øvregaard"
    ],
    [
     "Preben",
     "Wik"
    ],
    [
     "Øyvind",
     "Bech"
    ],
    [
     "Egil",
     "Albertsen"
    ],
    [
     "Sissel",
     "Nefzaoui"
    ],
    [
     "Eli",
     "Skarpnes"
    ],
    [
     "Jacques",
     "Koreman"
    ]
   ],
   "title": "Dealing with L1 background and L2 dialects in Norwegian CAPT",
   "original": "sl11_133",
   "page_count": 4,
   "order": 34,
   "p1": "133",
   "pn": "136",
   "abstract": [
    "This article describes the CALST project, in which the primary aim is to develop Ville-N, a CAPT system for learners of Norwegian as a second language. Since there is no accepted pronunciation standard in Norwegian, the system uses four dialects (represented by one male and one female speaker each). Ville-N makes use of L1-L2map, a tool for multi-lingual contrastive analysis, to generate a list of expected pronunciation problems. These can be used to tailor pronunciation and listening exercises. The tool can also be used for other target languages. We propose L1-L2map as a collaborative tool for the CAPT community.\n",
    "Index Terms. CAPT, Ville-N, Norwegian, dialects, multi-lingual contrastive analysis, L1-L2map\n",
    ""
   ],
   "doi": "10.21437/SLaTE.2011-34"
  },
  "honig11_slate": {
   "authors": [
    [
     "Florian",
     "Hönig"
    ],
    [
     "Anton",
     "Batliner"
    ],
    [
     "Elmar",
     "Nöth"
    ]
   ],
   "title": "How many labellers revisited – naïves, experts, and real experts",
   "original": "sl11_137",
   "page_count": 4,
   "order": 35,
   "p1": "137",
   "pn": "140",
   "abstract": [
    "A database of non-native German productions was annotated by three different groups: by experts using detailed, localised labels as well as coarse, global labels, and by phoneticians and na¨ýve subjects, using the same coarse global labels. For the detailed annotation, segmental and supra-segmental labels were given segment-based and word-based. The global annotation consisted of a turn-based assessment of intelligibility, nonnative accent, melody, and rhythm. Moreover, we use a large, specialised prosodic feature vector for modelling native vs. nonnative speech. We study relationships between detailed and global labels, analyse the quality of expert and na¨ýve labellers, and present an automatic system for predicting a speaker’s score for the global labels.\n",
    "Index Terms. non-native prosody, speech melody, rhythm, inter-labeller agreement, regression system, performance model, experts vs. naïve judges\n",
    ""
   ],
   "doi": "10.21437/SLaTE.2011-35"
  },
  "tsubaki11_slate": {
   "authors": [
    [
     "Hajime",
     "Tsubaki"
    ],
    [
     "Mariko",
     "Kondo"
    ]
   ],
   "title": "Analysis of L2 English speech corpus by automatic phoneme alignment",
   "original": "sl11_141",
   "page_count": 4,
   "order": 36,
   "p1": "141",
   "pn": "144",
   "abstract": [
    "This study tested the application of adapted HTK for automatic alignment of speech corpus of Asian speakers’ English. The HTK tool with TIMIT has problems in aligning non-native speakers’ English. New sets of phoneme sequences for each word were listed to test if an adapted alignment module could accurately analyze pronunciation of Japanese speakers’ English. The new sets of phoneme sequences produced better alignment of Japanese accented English and showed that the L2 incorporated new alignment module could perform more accurate automatic alignment of L2 English data. The same methods should be able to be applied to other language data.\n",
    "Index Terms. automatic alignment, HTK, TIMIT, speech corpus, L2 English\n",
    ""
   ],
   "doi": "10.21437/SLaTE.2011-36"
  },
  "kato11_slate": {
   "authors": [
    [
     "Shuhei",
     "Kato"
    ],
    [
     "Greg",
     "Short"
    ],
    [
     "Nobuaki",
     "Minematsu"
    ],
    [
     "Chiharu",
     "Tsurutani"
    ],
    [
     "Keikichi",
     "Hirose"
    ]
   ],
   "title": "Comparison of native and non-native evaluations of the naturalness of Japanesewords with prosody modified through voice morphing",
   "original": "sl11_145",
   "page_count": 4,
   "order": 37,
   "p1": "145",
   "pn": "148",
   "abstract": [
    "Information on what kinds of mispronunciation cause the great- est loss in naturalness can be used in guidance to help learn- ers achieve their goals of speaking with good pronunciation. We recorded Japanese words spoken by bilinguals in Tokyo Japanese and in foreign accents (English and Korean) and mor- phed them together with STRAIGHT emphasizing different acoustic parameters. By using STRAIGHT, we can simulate a wide variety of English-accented and Korean-accented pronun- ciations of Japanese. Then, we had native Japanese speakers and non-native speakers (Australian) evaluate the naturalness of these morphed utterances. The experimental results showed that Australian learners were very insensitive to the difference between native and non-native pitch although Japanese speakers were critically sensitive to these errors. Following these results, we give some pedagogical suggestions on what kind of pronun- ciation guidance is necessary for learners to become aware of what is unnatural to native speakers.\n",
    "Index Terms. Foreign language learning, foreign accent, Japanese, naturalness, acoustic morphing, listening test\n",
    ""
   ],
   "doi": "10.21437/SLaTE.2011-37"
  },
  "hussein11_slate": {
   "authors": [
    [
     "Hussein",
     "Hussein"
    ],
    [
     "Hue San",
     "Do"
    ],
    [
     "Hansjörg",
     "Mixdorff"
    ],
    [
     "Hongwei",
     "Ding"
    ],
    [
     "Qianyong",
     "Gao"
    ],
    [
     "Guoping",
     "Hue"
    ],
    [
     "Si",
     "Wei"
    ],
    [
     "Zhao",
     "Chao"
    ]
   ],
   "title": "Mandarin tone perception and production by German learners",
   "original": "sl11_149",
   "page_count": 4,
   "order": 38,
   "p1": "149",
   "pn": "152",
   "abstract": [
    "This paper reports on the continued activities to develop a computer-aided phonetic learning system for German learners of Mandarin. In the current study we used a corpus which consists of disyllables and sentences that were produced by first-year German students and native speakers of Mandarin. Half of the German group had attended an additional phonetic seminar. The first experiment was a tone identification test of Mandarin disyllables and production test thereof, followed by a sentence production experiment in which the subjects produced Chinese sentences in both reading and speaking mode. Prosodic features (rhythmic and intonational) of Mandarin tones between German learners and Chinese native speakers were compared. The results based on the annotations of an expert and analysis of prosodic features of Mandarin tones show that German learners who attended the weekly seminar were able to pronounce the tones better than those who did not attend the weekly seminar.\n",
    "Index Terms. Computer-Aided Language Learning (CALL), Mandarin tones, prosodic analysis\n",
    ""
   ],
   "doi": "10.21437/SLaTE.2011-38"
  },
  "sitaram11_slate": {
   "authors": [
    [
     "Sunayana",
     "Sitaram"
    ],
    [
     "Jack",
     "Mostow"
    ],
    [
     "Yuanpeng",
     "Li"
    ],
    [
     "Anders",
     "Weinstein"
    ],
    [
     "David",
     "Yen"
    ],
    [
     "Joe",
     "Valeri"
    ]
   ],
   "title": "What visual feedback should a reading tutor give children on their oral reading prosody?",
   "original": "sl11_153",
   "page_count": 4,
   "order": 39,
   "p1": "153",
   "pn": "156",
   "abstract": [
    "An automated reading tutor that models and evaluates children's oral reading prosody should also be able to respond dynamically with feedback they like, understand, and benefit from. We describe visual feedback that Project LISTEN's Reading Tutor generates in realtime by mapping prosodic features of children's oral reading to dynamic graphical features of displayed text. We present results from preliminary usability studies of 20 children aged 7-10. We also describe an experiment to test whether such visual feedback elicits oral reading that more closely matches the prosodic contours of adult narrations. Effective feedback on prosody could help children become fluent, expressive readers.\n",
    "Index Terms. prosody, visual feedback, intelligent tutoring systems, children, speech technology for education.\n",
    ""
   ],
   "doi": "10.21437/SLaTE.2011-39"
  }
 },
 "sessions": [
  {
   "title": "Language Games",
   "papers": [
    "ling11_slate",
    "correia11_slate",
    "skory11_slate"
   ]
  },
  {
   "title": "Reading and Literacy",
   "papers": [
    "coyne11_slate",
    "rasmussen11_slate",
    "rasmussen11b_slate"
   ]
  },
  {
   "title": "Speech Synthesis",
   "papers": [
    "delmonte11_slate",
    "nichasaide11_slate"
   ]
  },
  {
   "title": "Spoken Language",
   "papers": [
    "bouillon11_slate",
    "kane11_slate",
    "mesbahi11_slate",
    "short11_slate",
    "ananthakrishnan11_slate",
    "fuentes11_slate",
    "wolska11_slate",
    "ryu11_slate",
    "wet11_slate",
    "strik11_slate",
    "bodnar11_slate",
    "rayner11_slate"
   ]
  },
  {
   "title": "Written Text",
   "papers": [
    "berkling11_slate",
    "medero11_slate"
   ]
  },
  {
   "title": "CALL",
   "papers": [
    "xu11_slate",
    "tsourakis11_slate",
    "nagata11_slate",
    "lee11_slate",
    "klenner11_slate",
    "kim11_slate",
    "pietquin11_slate",
    "vundela11_slate"
   ]
  },
  {
   "title": "Pronunciation",
   "papers": [
    "saz11_slate",
    "stanley11_slate",
    "jokisch11_slate",
    "husby11_slate"
   ]
  },
  {
   "title": "L2 Speech Annotation",
   "papers": [
    "honig11_slate",
    "tsubaki11_slate"
   ]
  },
  {
   "title": "Prosody",
   "papers": [
    "kato11_slate",
    "hussein11_slate",
    "sitaram11_slate"
   ]
  }
 ],
 "doi": "10.21437/SLaTE.2011"
}