{
 "title": "First Iberian SLTech (SLTech 2009)",
 "location": "Porto Salvo, Portugal",
 "startDate": "3/9/2009",
 "endDate": "4/9/2009",
 "conf": "SLTech",
 "year": "2009",
 "name": "sltech_2009",
 "series": "",
 "SIG": "",
 "title1": "First Iberian SLTech",
 "title2": "(SLTech 2009)",
 "date": "3-4 September 2009",
 "booklet": "sltech_2009.pdf",
 "papers": {
  "acero09_sltech": {
   "authors": [
    [
     "Alex",
     "Acero"
    ]
   ],
   "title": "Building accurate and user-friendly speech systems",
   "original": "isl9_003",
   "page_count": 1,
   "order": 1,
   "p1": "3",
   "pn": "",
   "abstract": [
    "While accurate speech recognition engines are critical to successful speech applications, there are other factors than can impact user experience even more than the accuracy of the engine itself. For example, the grammar the ASR engine uses should predict what the user will say but its often hard for an application developer to design a grammar that will result in high system accuracy. I will show how datadriven techniques can be used to build accurate grammars in a straightforward way. Ill also describe a technique that uses a statistical language model and an inverted index and which can be used for applications such as voice search or SMS dictation and results in high accurate end-to-end systems.   Even an accurate speech recognition system is not enough for good user experience because such systems will always make errors and its critical to provide a graceful error recovery mechanism. Also, users have a choice between speaking, touching a screen, or typing and may choose to not speak unless this is better than the alternative. I will show designs for several systems that take into account this in voice search, education and the automobile.\n",
    ""
   ]
  },
  "torresgoterris09_sltech": {
   "authors": [
    [
     "Francisco",
     "Torres Goterris"
    ]
   ],
   "title": "A task-independent stochastic dialog manager for the EDECAN project",
   "original": "isl9_009",
   "page_count": 4,
   "order": 2,
   "p1": "9",
   "pn": "12",
   "abstract": [
    "The adaptation of a stochastic dialog manager to work in a new domain is presented. A dialog manager, previously developed to attend a specific task (queries about train services), has been modified to be used in a different domain (a sport courts booking system). The new manager deals with both tasks, just loading their corresponding bigram models and configuration files. A user simulator technique has been applied to acquire a corpus, and to automatically learn the models. The dialog manager using the learnt models has been evaluated, achieving satisfactory results for using them in an acquisition with real users.\n",
    "",
    "",
    "Index Terms: dialog management, stochastic models, domain independence, user simulation.\n",
    ""
   ]
  },
  "simoe09_sltech": {
   "authors": [
    [
     "Alberto",
     "Simõe"
    ],
    [
     "Xavier",
     "Gómez Guinovart"
    ]
   ],
   "title": "Terminology extraction from English-portuguese and English-galician parallel corpora based on probabilistic translation dictionaries and bilingual syntactic patterns",
   "original": "isl9_013",
   "page_count": 4,
   "order": 3,
   "p1": "13",
   "pn": "16",
   "abstract": [
    "This paper presents a research on parallel corpora-based bilingual terminology extraction based on the occurrence of bilingual morphosyntactic patterns in the probabilistic translation dictionaries generated by NATools. To evaluate this method, we carried out an experiment in which both the level of lexical cohesion of the term candidates and their specificity with respect to a non-terminological corpus of the target language were taken into account. The evaluation results show a high degree of accuracy of the terminology extraction based on probabilistic translation dictionaries complemented by bilingual syntactic patterns.\n",
    "",
    "",
    "Index Terms: bilingual terminology extraction, probabilistic translation dictionaries\n",
    ""
   ]
  },
  "aguilo09_sltech": {
   "authors": [
    [
     "Mateu",
     "Aguilo"
    ],
    [
     "Taras",
     "Butko"
    ],
    [
     "Andrey",
     "Temko"
    ],
    [
     "Climent",
     "Nadeu"
    ]
   ],
   "title": "A hierarchical architecture for audio segmentation in a broadcast news task",
   "original": "isl9_017",
   "page_count": 4,
   "order": 4,
   "p1": "17",
   "pn": "20",
   "abstract": [
    "In the broadcast news domain audio segmentation is an important pre-processing step for other speech technologies like speech recognition and speech diarization. In this work we propose an architecture that allows to integrate the individual detections of various acoustic classes. By implementing a different algorithm adapted to the characteristics of each class, we can obtain much better results than using a generic detector for all classes. Additionally, new features suited to detect telephone channel speech over wideband music that improve the accuracy are also introduced.\n",
    "",
    "",
    "Index Terms: audio segmentation, acoustic event detection, music detection, telephone speech, software architecture\n",
    ""
   ]
  },
  "teixeira09_sltech": {
   "authors": [
    [
     "Carlos",
     "Teixeira"
    ],
    [
     "Ana",
     "Respício"
    ],
    [
     "Catarina",
     "Ribeiro"
    ]
   ],
   "title": "Browsing multilingual making-ofs",
   "original": "isl9_021",
   "page_count": 4,
   "order": 5,
   "p1": "21",
   "pn": "24",
   "abstract": [
    "The present work describes a new film player that enriches cinematographic experience and boost film-viewer interaction. A multilingual subtitle time alignment algorithm provides natural browsing links between film and the corresponding making-of. Results are presented for a set of known English spoken films, also using the corresponding Portuguese and Spanish subtitles.\n",
    "",
    "",
    "Index Terms: multilingual processing, subtitle alignment, making-of alignment, interactive cinematography.\n",
    ""
   ]
  },
  "schulz09_sltech": {
   "authors": [
    [
     "Henrik",
     "Schulz"
    ],
    [
     "José A. R.",
     "Fonollosa"
    ]
   ],
   "title": "A Catalan broadcast conversational speech database",
   "original": "isl9_027",
   "page_count": 3,
   "order": 6,
   "p1": "27",
   "pn": "29",
   "abstract": [
    "Data driven methods in speech and linguistic research, and system develoment require appropriate speech databases. A new Catalan speech database has been developed with a particular emphasis on broadcast conversational speech. The article describes origin and nature of the broadcasts and its acoustic environment. Annotation and transcription provide statistics on specific phenomena of exhibited speech, speaker characteristics and acoustic events. It concludes with perspective uses and limitations.\n",
    "",
    "",
    "Index Terms: Catalan, audio video speech database, broadcast conversation, literal transcription, spontaneous speech\n",
    ""
   ]
  },
  "bordel09_sltech": {
   "authors": [
    [
     "Germán",
     "Bordel"
    ],
    [
     "Arantza",
     "Casillas"
    ],
    [
     "Mikel",
     "Penagarikano"
    ],
    [
     "Luis J.",
     "Rodríguez-Fuentes"
    ],
    [
     "Amparo",
     "Varona"
    ]
   ],
   "title": "An XML resource definition for spoken document retrieval",
   "original": "isl9_031",
   "page_count": 4,
   "order": 7,
   "p1": "31",
   "pn": "34",
   "abstract": [
    "In this paper, an XML resource definition is presented fitting in with the architecture of a multilingual (Spanish, English, Basque) spoken document retrieval system. The XML resource not only stores all the information extracted from the audio signal, but also adds the structure required to create an index database and retrieve information according to various criteria. The XML resource is based on the concept of segment and provides generic but powerful mechanisms to characterize segments and group segments into sections. Audio and video files described through this XML resource can be easily exploited in other tasks, such as topic tracking, speaker diarization, etc.\n",
    ""
   ]
  },
  "zapparoli09_sltech": {
   "authors": [
    [
     "Zilda Maria",
     "Zapparoli"
    ]
   ],
   "title": "CORPOR system: corpora of the Portuguese language as spoken in S\u001d\u0003o Paulo",
   "original": "isl9_035",
   "page_count": 4,
   "order": 8,
   "p1": "35",
   "pn": "38",
   "abstract": [
    "This work briefly discusses the construction of the Orthographic and Phonetic Information Databases of the Portuguese Language Spoken in the State of São Paulo (São Paulo City, Campinas, Itu) in a Relational Database System. Informatics resources were used to store, process and analyze authentic oral language, and the Bases include orthographic and phonetic information about the Portuguese language as spoken in those areas of the state of São Paulo, organized, listed and stored taking into account linguistic and extralinguistic annotations. The results obtained can serve as a valuable aid, for example, in studies requiring automatic processing of the Portuguese language.\n",
    "",
    "",
    "Index Terms: Linguistic Informatics, data processing technologies in Linguistic studies, CorPor project, relational database system, databanks of phonetic and orthographic information about the Portuguese language as spoken in São Paulo, electronic corpora of the Portuguese language as spoken in São Paulo\n",
    ""
   ]
  },
  "rocha09_sltech": {
   "authors": [
    [
     "Martha Alicia",
     "Rocha"
    ],
    [
     "Joan Andreu",
     "Sánchez"
    ]
   ],
   "title": "Machine translation of the Penn treebank to Spanish",
   "original": "isl9_039",
   "page_count": 4,
   "order": 9,
   "p1": "39",
   "pn": "42",
   "abstract": [
    "In this work we explored the problem of translating the Penn Treebank corpus to Spanish. For this problem, we considered Phrase-based Machine Translation techniques. Given that there not exist parallel training data for this corpus, we used a large out-of-domain training data set, and a small hight-quality indomain training data set. We studied simple and effective Domain Adaptation techniques that were used for other applications. We report experiments on a small test set of sentences manually translated from the Penn Treebank corpus.\n",
    "",
    "",
    "Index Terms: Penn Treebank, Machine Translation, Domain Adaptation\n",
    ""
   ]
  },
  "ashby09_sltech": {
   "authors": [
    [
     "Simone",
     "Ashby"
    ],
    [
     "José Pedro",
     "Ferreira"
    ],
    [
     "Sílvia",
     "Barbosa"
    ]
   ],
   "title": "Adapting the unisyn lexicon to portuguese: preliminary issues in the development of LUPo",
   "original": "isl9_043",
   "page_count": 4,
   "order": 10,
   "p1": "43",
   "pn": "46",
   "abstract": [
    "This paper presents some preliminary issues and proposed solutions in the development of an accent-independent pronunciation lexicon for Portuguese, known as the Portuguese Unisyn Lexicon (LUPo). LUPo's objectives are presented within the context of the Portal da Língua Portuguesa knowledge base. Key considerations are addressed for encoding morphological boundaries, treating orthographic forms, and handling loan words. Here, it is argued that the knowledge-driven paradigm exemplified in the original English Unisyn Lexicon, along with the Portal da Língua Portuguesa's relational structure and rich lexicographic content present a good foundation for establishing a tightly integrated and well informed system.\n",
    "",
    "",
    "Index Terms: lexicon, pronunciation, Portuguese accents, morphology, orthography, loan words, dictionary, relational database, speech synthesis\n",
    ""
   ]
  },
  "schulz09b_sltech": {
   "authors": [
    [
     "Henrik",
     "Schulz"
    ],
    [
     "José A. R.",
     "Fonollosa"
    ],
    [
     "David",
     "Rybach"
    ]
   ],
   "title": "A baseline system for the transcription of Catalan broadcast conversation",
   "original": "isl9_049",
   "page_count": 4,
   "order": 11,
   "p1": "49",
   "pn": "52",
   "abstract": [
    "The paper describes aspects, methods and results of the development of an automatic transcription system for Catalan broadcast conversation by means of speech recognition. Emphasis is given to Catalan language, acoustic and language modelling methods and recognition. Results are discussed in context of phenomena and challenges in spontaneous speech, in particular regarding phoneme duration and feature space reduction.\n",
    ""
   ]
  },
  "silva09_sltech": {
   "authors": [
    [
     "B.",
     "Silva"
    ],
    [
     "H.",
     "Mendes"
    ],
    [
     "C.",
     "Lopes"
    ],
    [
     "A.",
     "Veiga"
    ],
    [
     "Fernando",
     "Perdigão"
    ]
   ],
   "title": "A fast discriminative training algorithm for minimum classification error",
   "original": "isl9_053",
   "page_count": 4,
   "order": 12,
   "p1": "53",
   "pn": "56",
   "abstract": [
    "In this paper a new algorithm is proposed for fast discriminative training of hidden Markov models (HMMs) based on minimum classification error (MCE). The algorithm is able to train acoustic models in a few iterations, thus overcoming the slow training speed typical of discriminative training methods based on gradient-descendent. The algorithm tries to cancel the gradient of the objective function in every iteration. Re-estimation expressions of the HMM parameters are derived. Experiments with triphone and word models show that the proposed algorithm always achieves much better results in a single iteration than MCE, MMI or MPE do over several iterations.\n",
    "",
    "",
    "Index Terms: Speech recognition, discriminative training, hidden Markov models.\n",
    ""
   ]
  },
  "lopes09_sltech": {
   "authors": [
    [
     "Carla",
     "Lopes"
    ],
    [
     "Fernando",
     "Perdigão"
    ]
   ],
   "title": "Global discriminative training of a hybrid speech recognizer",
   "original": "isl9_057",
   "page_count": 4,
   "order": 13,
   "p1": "57",
   "pn": "60",
   "abstract": [
    "Hybrid speech recognizers usually involve a frame-based classification followed by a segment alignment system, trained separately. The simplicity of such systems is counterbalanced by the lack of a global optimisation scheme for the whole system. In this paper we propose a discriminative training method for MLP/HMM hybrids based on the optimization of a global cost function at the phone recognition level. The MLP weights, usually updated according to the target values, are now updated according to the misclassifications present in the output of the system. Results are presented for the TIMIT phone recognition task and show that this method compares favourable with recent published results in this task. The global discriminative training method was also applied to a Portuguese speech database leading to promising results.\n",
    "",
    "",
    "Index Terms: discriminative training, hybrid speech recognizers, phone recognition.\n",
    ""
   ]
  },
  "wolf09_sltech": {
   "authors": [
    [
     "Martin",
     "Wolf"
    ],
    [
     "Climent",
     "Nadeu"
    ]
   ],
   "title": "Towards microphone selection based on room impulse response energy-related measures",
   "original": "isl9_061",
   "page_count": 4,
   "order": 14,
   "p1": "61",
   "pn": "64",
   "abstract": [
    "In a room where several distant microphones are capturing signals in parallel, the quality of the recorded speech signals strongly depends on the characteristics of the room impulse responses that describe the wave propagation between each source and each microphone. In this paper we present an initial attempt to investigate the possibility of selecting the microphone that offers the best quality of speech. As we want to apply it to an automatic speech recognition system, we aim to select the microphone according to some optimization criterion that has been inferred from the recognition rate in a prior learning process. Several energy-related measures that carry relevant information of the room impulse response are being considered. They should be estimated directly from the speech signal, possibly in real time, but avoiding the need to estimate the whole room impulse response. In this paper, we present the rationale behind the intended investigation, and offer preliminary experiments for a large vocabulary continuous speech recognition task which show how microphone selection using an ideal relative energy measure can largely improve the recognition rate.\n",
    "",
    "",
    "Index Terms: microphone selection, reverberation, room impulse response, ASR\n",
    ""
   ]
  },
  "coelho09_sltech": {
   "authors": [
    [
     "Luis",
     "Coelho"
    ],
    [
     "Horst-Udo",
     "Hain"
    ],
    [
     "Oliver",
     "Jokisch"
    ],
    [
     "Daniela",
     "Braga"
    ]
   ],
   "title": "Towards an objective voice preference definition for the portuguese language",
   "original": "isl9_067",
   "page_count": 4,
   "order": 15,
   "p1": "67",
   "pn": "70",
   "abstract": [
    "In this paper, it is our aim to define a set of objective acoustic criteria, based on subjective listeners assessment of talent voices, which can help to automatically rate the voice font quality, bearing in mind the objective definition of voice preference for the Portuguese language. For this purpose a multilingual and multispeaker database was recorded and a set of subjective and objective information was obtained. The analysis of the data provided new results that can be successfully used to define the quality of a given voice. The achieved results for Portuguese were compared with those obtained for other language with objective of identifying common properties, which was statistically confirmed with a within a 90% confidence interval.\n",
    "",
    "",
    "Index Terms: voice pleasantness, speech synthesis\n",
    ""
   ]
  },
  "coelho09b_sltech": {
   "authors": [
    [
     "Luis",
     "Coelho"
    ],
    [
     "Daniela",
     "Braga"
    ],
    [
     "Carmen",
     "Garcia-Mateo"
    ]
   ],
   "title": "A detailed analysis and comparison of speech synthesis paradigms",
   "original": "isl9_071",
   "page_count": 4,
   "order": 16,
   "p1": "71",
   "pn": "74",
   "abstract": [
    "Hidden Markov Model based synthesis has gained a special relevance in international speech conference and in contests like the Blizzard Challenge. This developing technology has proved to be quite promising but naturalness is still an achievement to conquer. In this paper we compare two TTS technologies with a human speaker and provide some of the major observed similarities and differences. Our analysis covers time and frequency domains for several acoustical units in order to demonstrate, in this short space, the capabilities of each technology.\n",
    "",
    "",
    "Index Terms: speech synthesis, comparison, HMM synthesis\n",
    ""
   ]
  },
  "martins09_sltech": {
   "authors": [
    [
     "Rui",
     "Martins"
    ],
    [
     "Isabel",
     "Trancoso"
    ],
    [
     "Alberto",
     "Abad"
    ],
    [
     "Hugo",
     "Meinedo"
    ]
   ],
   "title": "Detection of children²s voices",
   "original": "isl9_077",
   "page_count": 4,
   "order": 17,
   "p1": "77",
   "pn": "80",
   "abstract": [
    "This paper reports our recent work on extending our previous gender detector, targeted only at distinguishing between adult male and female voices, to encompass childrens voices as well. The classifiers were based on multilayer perceptrons and Gaussian mixture models and used Perceptual Linear Prediction coefficients, plus deltas, and pitch as features. Despite the small amount of training data for childrens voices, fairly good results were obtained in a test corpus of similar recording conditions (minimum classification error rate of 2.6%). Tests on real life corpora revealed the expected degradation with noisy environments and distant microphones. Tests with transformed female voices intended as cartoon child characters showed that they were mostly classified as childrens voices.\n",
    "",
    "",
    "Index Terms: gender detection, age effects, children voices\n",
    ""
   ]
  },
  "celestino09_sltech": {
   "authors": [
    [
     "Binda",
     "Celestino"
    ],
    [
     "Hugo",
     "Cordeiro"
    ],
    [
     "Carlos",
     "Meneses Ribeiro"
    ]
   ],
   "title": "Unsupervised SVM based 2-speaker clustering",
   "original": "isl9_081",
   "page_count": 3,
   "order": 18,
   "p1": "81",
   "pn": "83",
   "abstract": [
    "This paper proposes two algorithms for the task of 2-speaker unsupervised clustering. The first one creates two SVM models, one for each speaker. The second creates only one SVM model, being each speaker assigned to each class of the same model. These clustering algorithms are based on traditional two-classes SVM and use MLSF coefficients as acoustic features to represent the speakers. Tests were conducted in the audio stream of two interview videos in Portuguese, each one with two male speakers. Results must be considered as preliminary but if the speech segmentation was well conceived no errors were found.\n",
    "Index Terms: speaker clustering, speech segmentation, speaker segmentation, support vector machine, mel line spectrum frequencies.\n",
    ""
   ]
  },
  "ribasgonzalez09_sltech": {
   "authors": [
    [
     "Dayana",
     "Ribas González"
    ],
    [
     "José R.",
     "Calvo de Lara"
    ]
   ],
   "title": "Speaker verification with shifted delta cepstral features: its pseudo-prosodic behavior",
   "original": "isl9_085",
   "page_count": 4,
   "order": 19,
   "p1": "85",
   "pn": "88",
   "abstract": [
    "This paper examines the linear relation between Shifted Delta Cepstral (SDC) features and the dynamic of prosodic features. SDC features were reported to produce superior performance to ¢ features in Language Identification and speaker recognition systems. A selection of more correlated SDC features is used in speaker verification to evaluate its robustness to channel/ handset mismatch. The experiment reflects superior performance of selected SDC features regarding to features in speaker verification using speech samples from NIST 2001 Ahumada database.\n",
    "",
    "",
    "Index Terms: speaker verification, shifted delta cepstral, prosodic features, channel mismatch.\n",
    ""
   ]
  },
  "gonzalezdominguez09_sltech": {
   "authors": [
    [
     "Javier",
     "Gonzalez-Dominguez"
    ],
    [
     "Ignacio",
     "Lopez-Moreno"
    ],
    [
     "Javier",
     "Franco-Pedroso"
    ],
    [
     "Daniel",
     "Ramos"
    ],
    [
     "Doroteo T.",
     "Toledano"
    ],
    [
     "Joaquin",
     "Gonzalez-Rodriguez"
    ]
   ],
   "title": "Multilevel and channel-compensated language recognition: ATVS-UAM systems at NIST LRE 2009",
   "original": "isl9_089",
   "page_count": 4,
   "order": 20,
   "p1": "89",
   "pn": "92",
   "abstract": [
    "This paper presents the systems submitted by ATVS  Biometric Recognition Group at 2009 language recognition evaluation, organized by the National Institute of Standards and Technology of United States (NIST LRE09). Apart from the huge size of the databases involved, two main factors turn the evaluation into a very difficult task. First, the number of languages to be recognized was the biggest of all NIST LRE campaigns (23 different target languages). Second, the database conditions were strongly variable, with telephone speech coming from both broadcast news, extracted from Voice Of America (VOA) broadcast system, and conversational telephone speech (CTS). ATVS participation consisted of state-of-the-art acoustic and highlevel systems incorporating session variability compensation via Factor Analysis. Moreover, a novel back-end based on anchor models was used in order to fuse individual systems prior to one-vs.-all calibration via logistic regression. Results both in development and evaluation corpora show the robustness and excellent performance for most of the languages (among them, Iberian languages such as Spanish and Portuguese).\n",
    ""
   ]
  },
  "simoes09_sltech": {
   "authors": [
    [
     "Alberto",
     "Simões"
    ],
    [
     "José João",
     "Almeida"
    ]
   ],
   "title": "Bilingual example segmentation based on markers hypothesis",
   "original": "isl9_095",
   "page_count": 4,
   "order": 21,
   "p1": "95",
   "pn": "98",
   "abstract": [
    "The Marker Hypothesis was first defined by Thomas Green in 1979. It is a psycho-linguistic hypothesis defining that there is a set of words in every language that marks boundaries of phrases in a sentence. While it remains a hypothesis because nobody has proved it, tests have shows that results are comparable to basic shallow parsers with higher efficiency. The chunking algorithm based on the Marker Hypothesis is simple, fast and almost language independent. It depends on a list of closed-class words, that are already available for most languages. This makes it suitable for bilingual chunking (there is not the requirement for separate language shallow parsers). This paper discusses the use of the Marker Hypothesis combined with Probabilistic Translation Dictionaries for examplebased machine translation resources extraction from parallel corpora.\n",
    "",
    "",
    "Index Terms: Marker Hypothesis, Probabilistic Translation Dictionaries, Translation Examples, Machine Translation\n",
    ""
   ]
  },
  "batista09_sltech": {
   "authors": [
    [
     "Fernando",
     "Batista"
    ],
    [
     "Isabel",
     "Trancoso"
    ],
    [
     "Nuno",
     "Mamede"
    ]
   ],
   "title": "Automatic recovery of punctuation marks and capitalization information for Iberian languages",
   "original": "isl9_099",
   "page_count": 4,
   "order": 22,
   "p1": "99",
   "pn": "102",
   "abstract": [
    "This paper shows experimental results concerning automatic enrichment of the speech recognition output with punctuation marks and capitalization information. The two tasks are treated as two classification problems, using a maximum entropy modeling approach. The approach is language independent as reinforced by experiments performed on Portuguese and Spanish Broadcast News corpora. The discriminative models are trained for a language using spoken and written corpora from that language. This paper provides the first results on Spanish Broadcast News data and the first comparative study between Portuguese and Spanish, on this subject.\n",
    "",
    "",
    "Index Terms: Rich Transcription, Capitalization, Punctuation marks, Speech processing\n",
    ""
   ]
  },
  "poch09_sltech": {
   "authors": [
    [
     "Marc",
     "Poch"
    ],
    [
     "Mireia",
     "Farrús"
    ],
    [
     "Marta R.",
     "Costa-jussà"
    ],
    [
     "José B.",
     "Mariño"
    ],
    [
     "Adolfo",
     "Hernández"
    ],
    [
     "Carlos",
     "Henríquez"
    ],
    [
     "José A. R.",
     "Fonollosa"
    ]
   ],
   "title": "The TALP on-line Spanish-catalan machine-translation system",
   "original": "isl9_105",
   "page_count": 1,
   "order": 23,
   "p1": "105",
   "pn": "",
   "abstract": [
    "In this paper the statistical machine translator (SMT) between Catalan and Spanish developed at the TALP research center (UPC) and its web demonstration are described.\n",
    ""
   ]
  },
  "nunesgoncalves09_sltech": {
   "authors": [
    [
     "Patricia",
     "Nunes Gonçalves"
    ],
    [
     "António",
     "Branco"
    ]
   ],
   "title": "CINTIL-treebank searcher",
   "original": "isl9_107",
   "page_count": 1,
   "order": 24,
   "p1": "107",
   "pn": "",
   "abstract": [
    "This is a short note to support the demonstration of the CINTIL-Treebank Searcher.\n",
    "",
    "",
    "Index Terms: treebank, syntactic analysis, search, Portuguese\n",
    ""
   ]
  },
  "justo09_sltech": {
   "authors": [
    [
     "Raquel",
     "Justo"
    ]
   ],
   "title": "Hierarchical language models based on classes of phrases: formulation, learning and decoding. (original: modelos de lenguaje jer\u0001rquicos basados en clases de phrases: formulaci\u0013n, aprendizaje y decodificaci\u0013n.´) [phd thesis]",
   "original": "isl9_111",
   "page_count": 2,
   "order": 25,
   "p1": "111",
   "pn": "112",
   "abstract": [
    "This thesis focuses on the area of stochastic language modeling. A stochastic language model captures the way in which the combination of words is carried out in a specific language. It does so by making use of probability distributions of linguistic events, such as the frequency of appearance of words in sentences. Large amounts of training data, not always available, are required to get a robust estimation of the parameters defining such models.   In this work, a two-level hierarchical language model, based on classes of phrases, is proposed to deal with data sparseness. Each level in the model is associated to a different knowledge source. In the upper level the relations among classes are taken into account, i.e. relations among abstract entities employed to generalize. In the second level the relations among words are considered. The cooperation between different levels allows to build an improved language model. Within this framework different approaches and ways of combining models are defined and formulated.   Throughout this work language modeling has been explored in the framework of Automatic Speech Recognition (ASR). Thus, a methodology to integrate the proposed models into the decoding stage of the ASR system has been developed. In order to validate the presented approaches an experimental stage has been carried out using different databases. Three different languages and tasks of different complexity, spontaneous speech and read speech,... have been employed.   On the other hand, the use of the proposed hierarchical language models within a dialogue system prototype has been explored. In this case the main goal is to maximize the performance of the system in real working conditions.   Finally, a translation model based on the same hierarchical nature has been defined and formulated. This model has been integrated into a speech translation system. The methodology employed to integrate the language model in the ASR system can be directly applied to this case.\n",
    ""
   ]
  },
  "martins09b_sltech": {
   "authors": [
    [
     "Ciro",
     "Martins"
    ]
   ],
   "title": "Dynamic language modeling for european portuguese [phd thesis]",
   "original": "isl9_113",
   "page_count": 2,
   "order": 26,
   "p1": "113",
   "pn": "114",
   "abstract": [
    "Most of today's methods for transcription and indexation of broadcast audio data are manual. Broadcasters process thousands hours of audio and video data on a daily basis, in order to transcribe that data, to extract semantic information, and to interpret and summarize the content of those documents. The development of automatic and efficient support for these manual tasks has been a great challenge and over the last decade there has been a growing interest in the usage of automatic speech recognition as a tool to provide automatic transcription and indexation of broadcast news and random and relevant access to large broadcast news databases. However, due to the common topic changing over time which characterizes this kind of tasks, the appearance of new events leads to high out-of-vocabulary (OOV) word rates and consequently to degradation of recognition performance. This is especially true for highly inflected languages like the European Portuguese language.   Several innovative techniques can be exploited to reduce those errors. The use of news shows specific information, such as topic-based lexicons, pivot working script, and other sources such as the online written news daily available in the Internet can be added to the information sources employed by the automatic speech recognizer. In this thesis we are exploring the use of additional sources of information for vocabulary optimization and language model adaptation of a European Portuguese broadcast news transcription system. Hence, this thesis had 3 different main contributions: a novel approach for vocabulary selection using Part-Of-Speech (POS) tags to compensate for word usage differences across the various training corpora; language model adaptation frameworks performed on a daily basis for single-stage and multistage recognition approaches; a new method for inclusion of new words in the system vocabulary without the need of additional data or language model retraining.\n",
    ""
   ]
  },
  "candeias09_sltech": {
   "authors": [
    [
     "Sara",
     "Candeias"
    ]
   ],
   "title": "A phonological study of portuguese language variety spoken in Beira interior region: some syntactic and semantic considerations [phd thesis]",
   "original": "isl9_115",
   "page_count": 2,
   "order": 27,
   "p1": "115",
   "pn": "116",
   "abstract": [
    "This study proposes a model for a phonological description of the speech patterns attested in the Portuguese language variety spoken in Beira Interior region (in Fundão, particularly).   Our goal was to present the main phone prototypes, which could be considered in the description of the Portuguese language, taking into account minority speech, particularly. Based in an analytic work, a spontaneous speech database was collected in order to establish the pertinent features set in the referred to variety. In accordance with the so-called Functionalist Theory, sounds are considered by the fact that speech is perceived (and produced) regarding those distinctive features terms, which are correlated with an optimal-center-of-gravity region. Therefore, our approach explored the view that Categorical Perception, as Quantal Theory and Optimality Theory could support phonological system and (allo)phone inventories.   The collected database comprises 142.040 (allo)phone occurrences. The (allo)phone realizations are described and analysed according to the syllabic context as a finer-grained category. For that reason, phonological system description considered all structures of vocalic and consonantal phones, including allophone dispersion. Phones in contact in a speech chain scope were also taking into account, specifically in a V-to-V context.   The proposed phonological system description is supported by a statistical analysis of the frequency in relative and absolute values. It is suggested that these phonological phenomena maps may have their correlation in the Verb and Personal Pronoun syntactic-semantic categories too.   Our belief was that phonological and phonetic-based of Portuguese variety spoken in Beira Interior contributes ultimately to extend (or redefine) the linguistic knowledge of Portuguese language.\n",
    ""
   ]
  },
  "oliveira09_sltech": {
   "authors": [
    [
     "Catarina",
     "Oliveira"
    ]
   ],
   "title": "From grapheme to gesture. linguistic contributions for an articulatory based text-to-speech system´ (original: do grafema ao gesto. contributos lingusticos para um sistema de sntese de base articulat\u0013ria) [phd thesis]",
   "original": "isl9_117",
   "page_count": 2,
   "order": 28,
   "p1": "117",
   "pn": "118",
   "abstract": [
    "Motivated by the central purpose of contributing for the construction, in the long term, of a complete text-to-speech system based in articulatory synthesis, we develop a linguistic model for European Portuguese (EP), based on TADA system (TAsk Dynamic Application), that aimed at the automatic attainment of the articulators trajectory from the input text.   The specification of this purpose determined the development of a set of tasks, namely the 1) implementation and evaluation of two automatic syllabification systems and two grapheme-to-phoneme (G2P) conversion systems, in view of the transformation of the input in an appropriate format to the TADA; 2) the creation of a gestural database for the EP sounds, in so that each phone obtained at the output of the g2p system could have correspondence with a set of articulatory gestures adapted for EP; 3) the dynamic analysis of nasality, on the basis of an articulatory and perceptive study.   The two automatic syllabification algorithms implemented and tested make appeal to phonological knowledge on the structure of the syllable, being the first one based in finite state transducers and the second one a faithful implementation of Mateus & d'Andrade (2000) proposals. The performance of these algorithms - especially the second - was similar to the one of other systems with the same potentialities.   Regarding grapheme-to-phone conversion, we follow a methodology based on manual rules combined with an automatic learning technique. The evaluation results of this system motivated the exploitation of others automatic approaches, finding also to evaluate the impact of the syllabic information integration in the systems.   The gestural description of the European Portuguese sounds, anchored on the theoretical and methodological tenets of the Articulatory Phonology, was based essentially on the analysis of magnetic resonance data (MRI), from which all the measurements were carried out, aiming to obtain the quantitative articulatory parameters. The several gestural configurations proposed have been validated, through a small perceptual test, which allowed identifying the main underlying problems of the gestural proposal. This work provided, for the first time to PE, the development of a first articulatory based text-to-speech system.   The dynamic description of nasal vowels relied either on the magnetic resonance data, for characterization of the oral gestures, either on the data obtained through electromagnetic articulography (EMA), for the study of the velum dynamic and of its relation with the remaining articulators. Besides that, a perceptive test was performed, using TADA and SAPWindows, to evaluate the sensibility of the Portuguese listeners to the variations in the height of velum and alterations in the intergestural coordination. This study supported an abstract interpretation (in gestural terms) of the EP nasal vowels and allowed also to clarify crucial aspects related with its production and perception.\n",
    ""
   ]
  },
  "branco09_sltech": {
   "authors": [
    [
     "António",
     "Branco"
    ]
   ],
   "title": "Natural language science and technology at the university of Lisbon, department of informatics: the NLX group",
   "original": "isl9_121",
   "page_count": 2,
   "order": 29,
   "p1": "121",
   "pn": "122",
   "abstract": [
    "This is a brief presentation of the NLX-Natural Language and Speech Group and its past and ongoing activities and results as of July 2009.\n",
    "",
    "",
    "Index Terms: natural language processing, human language technology, computational linguistics, laboratory, Portuguese, University of Lisbon, NLX Group\n",
    ""
   ]
  },
  "branco09b_sltech": {
   "authors": [
    [
     "Antonio",
     "Branco"
    ],
    [
     "Francisco",
     "Costa"
    ],
    [
     "Eduardo",
     "Ferreira"
    ],
    [
     "Pedro",
     "Martins"
    ],
    [
     "Filipe",
     "Nunes"
    ],
    [
     "Joao",
     "Silva"
    ],
    [
     "Sara",
     "Silveira"
    ]
   ],
   "title": "LX-center: a center of online services for education, research and development on natural language science and technology",
   "original": "isl9_123",
   "page_count": 1,
   "order": 30,
   "p1": "123",
   "pn": "",
   "abstract": [
    "This is a short note that supports the demonstration of the LX-Center at the 1st Joint SIG-IL/Microsoft Workshop on Speech and Language Technologies for Iberian.\n",
    "",
    "",
    "Index Terms: natural language processing, computational linguistics, online services, Portuguese\n",
    ""
   ]
  },
  "torres09_sltech": {
   "authors": [
    [
     "María Inés",
     "Torres"
    ],
    [
     "Raquel",
     "Justo"
    ],
    [
     "A.",
     "Pérez"
    ],
    [
     "V.",
     "Guijarrubia"
    ],
    [
     "J. M.",
     "Olaso"
    ],
    [
     "G.",
     "Sánchez"
    ],
    [
     "E.",
     "Alonso"
    ],
    [
     "J. M.",
     "Alcaide"
    ]
   ],
   "title": "Pattern recognition and speech technologies (http://grah.ehu.es)",
   "original": "isl9_125",
   "page_count": 1,
   "order": 31,
   "p1": "125",
   "pn": "",
   "abstract": [
    "The Pattern Recognition & Speech Technology group (PR&ST) is devoted to the research and technological development in areas related to pattern recognition and speech and language technologies. We are also aimed to advise PhD students, to train technical experts and to transfer technology to companies.\n",
    ""
   ]
  },
  "torres09b_sltech": {
   "authors": [
    [
     "María Inés",
     "Torres"
    ],
    [
     "Eduardo",
     "Lleida"
    ],
    [
     "Emilio",
     "Sanchis"
    ],
    [
     "Ricardo de",
     "Córdoba"
    ],
    [
     "Javier",
     "Macías-Guarasa"
    ]
   ],
   "title": "SD-TEAM: interactive learning, self-evaluation and multimodal technologies for multidomain spoken dialog systems",
   "original": "isl9_127",
   "page_count": 4,
   "order": 32,
   "p1": "127",
   "pn": "130",
   "abstract": [
    "Speech technology currently supports the development of dialogue systems that function in limited domains for which they were trained and in conditions for which they were designed, that is, specific acoustic conditions, speakers etc. The international scientific community has made significant efforts in exploring methods for adaptation to different acoustic contexts, tasks and types of user. However, further work is needed to produce multimodal spoken dialogue systems capable of exploiting interactivity to learn online in order to improve their performance.   The goal is to produce flexible and dynamic multimodal, interactive systems based on spoken communication, capable of detecting automatically their operating conditions and especially of learning from user interactions and experience through evaluating their own performance. Such ?living? systems will evolve continuously and without supervision until user satisfaction is achieved. Special attention will be paid to those groups of users for which adaptation and personalisation is essential: amongst others, people with disabilities which lead to communication difficulties (hearing loss, dysfluent speech, ...), mobility problems and non-native users.   In this context, the SD-TEAM Project aims to advance the development of technologies for interactive learning and evaluation. In addition, it will develop flexible distributed architectures that allow synergistic interaction between processing modules from a variety of dialogue systems designed for distinct tasks, user groups, acoustic conditions, etc. These technologies will be demonstrated via multimodal dialogue systems to access to services from home and to access to unstructured information, based on the multi-domain systems developed in the previous project TIN2005-08660-C04.\n",
    ""
   ]
  },
  "bonafonte09_sltech": {
   "authors": [
    [
     "Antonio",
     "Bonafonte"
    ],
    [
     "Lourdes",
     "Aguilar"
    ],
    [
     "Ignasi",
     "Esquerra"
    ],
    [
     "Sergio",
     "Oller"
    ],
    [
     "Asunción",
     "Moreno"
    ]
   ],
   "title": "Recent work on the FESTCAT database for speech synthesis",
   "original": "isl9_131",
   "page_count": 2,
   "order": 33,
   "p1": "131",
   "pn": "132",
   "abstract": [
    "This paper presents our work around the FESTCAT project, whose main goal was the development of voices for the Festival suite in Catalan. In the first year, we produced the corpus and the speech data needed for build 10 voices using the Clunits (unit selection) and the HTS (Markov models) methods. The resulting voices are freely available on the web page of the project and included in Linkat, a Catalan distribution of Linux. More recently, we have updated the voices using new versions of HTS, other technology (Multisyn) and we have produced a child voice. Furthermore, we have performed a prosodic labeling and analysis of the database using the break index labels proposed in the ToBI system aimed to improve the intonation of the synthetic speech.\n",
    "",
    "",
    "Index Terms: speech synthesis, databases, Festival voices, prosody analysis\n",
    ""
   ]
  },
  "teixeira09b_sltech": {
   "authors": [
    [
     "António",
     "Teixeira"
    ],
    [
     "Catarina",
     "Oliveira"
    ],
    [
     "Paula",
     "Martins"
    ],
    [
     "Inês",
     "Domingues"
    ],
    [
     "Augusto",
     "Silva"
    ]
   ],
   "title": "The project HERON",
   "original": "isl9_133",
   "page_count": 2,
   "order": 34,
   "p1": "133",
   "pn": "134",
   "abstract": [
    "In the project HERON, we developed a framework for articulatory speech synthesis for European Portuguese. The system combines several modules, developed or adapted in the project. The Linguistic Processing model uses new syllabification and grapheme-to-phone modules developed in the project. The construction of the gestural scores is performed using an adapted version of TADA (TAsk Dynamic Application), made available for research by Haskins Laboratories. Other important result from HERON was the (first) comprehensive MRI database for European Portuguese and analyses conducted on this data. Two new Electromagnetic Midsagital (EMMA) corpora were also acquired, at GIPSA-Lab in Grenoble, one for EP nasals, and the other, of smaller dimension, relative to EP laterals.\n",
    ""
   ]
  },
  "braga09_sltech": {
   "authors": [
    [
     "Daniela",
     "Braga"
    ],
    [
     "António",
     "Calado"
    ],
    [
     "Pedro",
     "Silva"
    ],
    [
     "Miguel",
     "Sales Dias"
    ]
   ],
   "title": "Microsoft language development center²s activities in 2008/2009",
   "original": "isl9_137",
   "page_count": 1,
   "order": 35,
   "p1": "137",
   "pn": "",
   "abstract": [
    "Microsoft Language Development Center was launched in 2005, integrated in the Portuguese Microsoft (MS) subsidiary. MLDC (http://www.microsoft.com/portugal/mldc) is the first MS R&D center with the mission to bring key language component product development to Europe and neighboring regions. MLDC acts as an expansion branch of the Redmond based product group, responsible for speech R&D in Microsoft and benefits from its experience, technological background and support. The Global Speech Development Group in MS has four locations: Redmond (USA), Mountain View (Silicon Valley, USA), Porto Salvo (Portugal) and Beijing (China). MLDC works closely with the Mountain View, Redmond and Beijing groups in a multicultural and multidisciplinary team dealing with all aspects of ASR, TTS and speech applications for a large number of languages. MLDC staff included 17 researchers (including 3 PhDs), software engineers and computational linguistics in Fiscal Year 2009 and currently includes 11 people in the beginning of Fiscal Year 2010.\n",
    ""
   ]
  }
 },
 "sessions": [
  {
   "title": "Keynote",
   "papers": [
    "acero09_sltech"
   ]
  },
  {
   "title": "Systems and Applications",
   "papers": [
    "torresgoterris09_sltech",
    "simoe09_sltech",
    "aguilo09_sltech",
    "teixeira09_sltech"
   ]
  },
  {
   "title": "Resources and Tools",
   "papers": [
    "schulz09_sltech",
    "bordel09_sltech",
    "zapparoli09_sltech",
    "rocha09_sltech",
    "ashby09_sltech"
   ]
  },
  {
   "title": "Speech Recognition",
   "papers": [
    "schulz09b_sltech",
    "silva09_sltech",
    "lopes09_sltech",
    "wolf09_sltech"
   ]
  },
  {
   "title": "Speech Synthesis",
   "papers": [
    "coelho09_sltech",
    "coelho09b_sltech"
   ]
  },
  {
   "title": "Gender, Speaker, and Language Recognition",
   "papers": [
    "martins09_sltech",
    "celestino09_sltech",
    "ribasgonzalez09_sltech",
    "gonzalezdominguez09_sltech"
   ]
  },
  {
   "title": "Language Processing",
   "papers": [
    "simoes09_sltech",
    "batista09_sltech"
   ]
  },
  {
   "title": "Demos",
   "papers": [
    "poch09_sltech",
    "nunesgoncalves09_sltech"
   ]
  },
  {
   "title": "Recent PhD's",
   "papers": [
    "justo09_sltech",
    "martins09b_sltech",
    "candeias09_sltech",
    "oliveira09_sltech"
   ]
  },
  {
   "title": "Groups and Projects",
   "papers": [
    "branco09_sltech",
    "branco09b_sltech",
    "torres09_sltech",
    "torres09b_sltech",
    "bonafonte09_sltech",
    "teixeira09b_sltech",
    "braga09_sltech"
   ]
  }
 ]
}