{
 "series": "SMM",
 "title": "SMM21, Workshop on Speech, Music and Mind 2021",
 "location": "Brno University of Technology, Brno, Czechia",
 "startDate": "27/08/2021",
 "endDate": "27/08/2021",
 "URL": "https://speech.fit.vutbr.cz/events/SMM21/index.html",
 "chair": "Chairs: Meghna A Pandharipande, Pavel Matejka, Venkata S Viraraghavan, João P Cabral, Alexander Schindler",
 "intro": "intro.pdf",
 "conf": "SMM",
 "year": "2021",
 "name": "smm_2021",
 "SIG": "",
 "title1": "SMM21, Workshop on Speech, Music and Mind 2021",
 "date": "27 August 2021",
 "booklet": "smm_2021.pdf",
 "papers": {
  "alluri21_smm": {
   "authors": [
    [
     "Vinoo",
     "Alluri"
    ]
   ],
   "title": "My Music and I: The interplay between music and individual differences",
   "original": "keynote_alluri",
   "page_count": 0,
   "order": 1,
   "p1": "",
   "pn": "",
   "abstract": [
    "Music is known to impact moods in positive ways and promote well-being. Musical preferences and habits have been associated with an individual’s requirement to satisfy and reinforce their psychological needs. In fact, an individual’s musical preferences and habits have been considered a mirror to who they are emotionally, socially, and cognitively. Empirical evidence is emerging that allows decoding individual traits and states based on their musical choices and engagement styles. Certain kinds of musical engagement have also been found to be associated with measures of ill-health including risk of depression and antisocial behavior, particularly in youth. In my talk I will outline research on how individual differences affect our perception and choice of music, in addition to how the latter allows us to examine and identify individual differences.\n"
   ]
  },
  "oore21_smm": {
   "authors": [
    [
     "Sageev",
     "Oore"
    ]
   ],
   "title": "Music of Speech, and Speech of Depression",
   "original": "keynote_oore",
   "page_count": 0,
   "order": 4,
   "p1": "",
   "pn": "",
   "abstract": [
    "I will describe some machine learning (ML) tools that we can use for processing music and for processing the acoustics of speech. I will then present some connections between music and speech, and between speech and depression, and I will discuss how such ML tools can help us explore these connections.\n"
   ]
  },
  "kumar21_smm": {
   "authors": [
    [
     "Botsa Kishore",
     "Kumar"
    ],
    [
     "Paidi",
     "Gangamohan"
    ],
    [
     "Suryakanth V",
     "Gangashetty"
    ]
   ],
   "title": "Contribution of F0 Contour Level, F0 Contour Shape and Durations Towards Perception of Lombard Speech",
   "original": "SMM21_paper_3",
   "page_count": 5,
   "order": 6,
   "p1": 16,
   "pn": 20,
   "abstract": [
    "Lombard speech, that is speech spoken in noise, has considerable changes in the speech production mechanism both at source level and system level compared to speech produced in normal/neutral speech. At source level, previous studies have shown that there is increase in fundamental frequency (F0), but it is unclear that the importance of F0 contour shape and F0 contour level in lombard speech. These perceptual studies carried out in this paper highlight the role of F0 contour shape and F0 contour level along with the durations. A set of six different experiments were conducted by modifying durations and both F0 contour shape and level. These experiments are performed on samples from the Hurricane Challenge-2013 database. Perceptual results show that the contribution of F0 contour level is more than F0 contour shape and durations.\n"
   ],
   "doi": "10.21437/SMM.2021-4"
  },
  "gangamohan21_smm": {
   "authors": [
    [
     "P",
     "Gangamohan"
    ],
    [
     "Botsa Kishore",
     "Kumar"
    ],
    [
     "Suryakanth V",
     "Gangashetty"
    ]
   ],
   "title": "Analysis of Glottal Activity of High Arousal and Falsetto Voice",
   "original": "SMM21_paper_4",
   "page_count": 5,
   "order": 7,
   "p1": 21,
   "pn": 25,
   "abstract": [
    "Speech produced in emotionally charged states like anger, happiness, shout, etc., belongs to high arousal. There are changes in the voice quality of production, mainly in the excitation source characteristics. The main features observed from the acoustic signal are increase in fundamental frequency (F0), and changes in spectral characteristics. Increase in F0 can also be intentional as in falsetto register. The voice in falsetto register is produced with different quality. A systematic analysis on the glottal activity of high arousal speech (angry, happy and shout) and falsetto is performed in this study. Changes in the excitation source characteristics are examined by analyzing the speech signals using the zero time windowing (ZTW) method. This method gives fine temporal variations of the spectral features. The ratio of high frequency spectral energy to low frequency spectral energy is used for this analysis. The results of the study show that the derived spectral features discriminate falsetto and high arousal speech effectively.\n"
   ],
   "doi": "10.21437/SMM.2021-5"
  },
  "viraraghavan21_smm": {
   "authors": [
    [
     "Venkata S",
     "Viraraghavan"
    ],
    [
     "Arpan",
     "Pal"
    ],
    [
     "R",
     "Aravind"
    ],
    [
     "Hema A",
     "Murthy"
    ]
   ],
   "title": "Distance Metrics to Aid Rāga-selection in Subjective Studies",
   "original": "SMM21_paper_7",
   "page_count": 5,
   "order": 3,
   "p1": 6,
   "pn": 10,
   "abstract": [
    "Recent studies corroborate the beliefs that listening to Indian music is beneficial in terms of mental abilities or mental health. These studies are also akin to those on other genres of music, where similar benefits have been observed. Studies relating to specific rāgas, however, are not as conclusive. The rāga is a key concept in Indian music, and comparable to a mode or scale in Western music. Rāgas are significantly richer than modes/scales due to the deliberate use of continuous pitch variation called gamakas. While most rāgas seem real distinguishable entities, distinctions between some rāgas appear to be due to conditioning. In this paper, we propose a quantitative measure of distance between the histograms of anchor notes in a rāga. Anchor notes were introduced recently to study the nature of gamakas. We consider several distance measures on anchor and CPN-histograms. For each rāga, other rāgas falling in the lower one-third of the range of distances to that rāga are counted as confused. Out of 1560 possible pairs of confusion, 178 (11%), 434 (28%), and 956 (61%) are confused according to, respectively, the Euclidean, cosine and KL-divergence distances between anchor histograms. CPN-histograms show a higher confusion. The Euclidean and cosine distance metrics between anchor-histograms thus help narrow down the choice of rāgas, such as for the experimental and control groups, in studies relating to the mind.\n"
   ],
   "doi": "10.21437/SMM.2021-2"
  },
  "shriram21_smm": {
   "authors": [
    [
     "Jaidev",
     "Shriram"
    ],
    [
     "Sreeharsha",
     "Paruchuri"
    ],
    [
     "Vinoo",
     "Alluri"
    ]
   ],
   "title": "How Much do Lyrics Matter? Analysing Lyrical Simplicity Preferences for Individuals At Risk of Depression",
   "original": "SMM21_paper_8",
   "page_count": 5,
   "order": 2,
   "p1": 1,
   "pn": 5,
   "abstract": [
    "Music affects and in some cases reflects one’s emotional state. Key to this influence is lyrics and their meaning in conjunction with the acoustic properties of the track. Recent work has focused on analysing these acoustic properties and showing that individuals prone to depression primarily consume low valence and low energy music. However, no studies yet have explored lyrical content preferences in relation to online music consumption of such individuals. In the current study, we examine lyrical simplicity, measured as the Compressibility and Absolute Information Content of the text, associated with preferences of individuals at risk for depression. Using the six-month listening history of 541 Last.fm users, we compare lyrical simplicity trends for users grouped as being at risk (At-Risk) of depression from those that are not (No-Risk). Our findings reveal that At-Risk individuals prefer songs with greater information content (lower Compressibility) on average, especially for songs characterised as Sad. Furthermore, we found that At-Risk individuals also have greater variability of Absolute Information Content across their listening history. We discuss the results in light of existing socio-psychological lab-based research on music habits associated with depression and their relevance to naturally occurring online music listening behaviour.\n"
   ],
   "doi": "10.21437/SMM.2021-1"
  },
  "dumpala21_smm": {
   "authors": [
    [
     "Sri Harsha",
     "Dumpala"
    ],
    [
     "Rudolf",
     "Uher"
    ],
    [
     "Stan",
     "Matwin"
    ],
    [
     "Michael",
     "Kiefte"
    ],
    [
     "Sageev",
     "Oore"
    ]
   ],
   "title": "Sine-Wave Speech and Privacy-Preserving Depression Detection",
   "original": "SMM21_paper_9",
   "page_count": 5,
   "order": 5,
   "p1": 11,
   "pn": 15,
   "abstract": [
    "In this work we show that certain characteristics of speech important for depression detection have future potential to allow privacy preservation. Specifically, we are interested in detecting depression from a limited set of acoustic properties of speech, such as, for example, the lower speech formants (F1, F2, F3). Although the full set of formants is generally sufficient to recognize most of the semantic content of the speech, this does not appear to be the case for a single formant. This gives rise to the basic idea we present here, which is (a) to use sine-wave speech for detecting depression based on a strict subset of the formants, together with (b) an initial exploration of the privacy-preserving characteristics of this sine-wave speech. Privacy is an important concern in the application of machine learning techniques to healthcare applications, and our work points towards the future possibility of, for example, sharing anonymized versions of sensitive data (in fact, versions stripped of all semantic content) that still allow some analyses with respect to presence of depression.\n"
   ],
   "doi": "10.21437/SMM.2021-3"
  }
 },
 "sessions": [
  {
   "title": "Keynote speech A",
   "papers": [
    "alluri21_smm"
   ]
  },
  {
   "title": "Session A: Influencing mental states",
   "papers": [
    "shriram21_smm",
    "viraraghavan21_smm"
   ]
  },
  {
   "title": "Keynote speech B",
   "papers": [
    "oore21_smm"
   ]
  },
  {
   "title": "Session B: Detecting mental states",
   "papers": [
    "dumpala21_smm",
    "kumar21_smm",
    "gangamohan21_smm"
   ]
  }
 ],
 "doi": "10.21437/SMM.2021"
}