{
 "title": "Speech Prosody 2012",
 "location": "Shanghai, China",
 "startDate": "22/5/2012",
 "endDate": "25/5/2012",
 "conf": "SpeechProsody",
 "year": "2012",
 "name": "speechprosody_2012",
 "series": "SpeechProsody",
 "SIG": "SProSIG",
 "title1": "Speech Prosody 2012",
 "date": "22-25 May 2012",
 "booklet": "speechprosody_2012.pdf",
 "papers": {
  "hoffmann12_speechprosody": {
   "authors": [
    [
     "Rüdiger",
     "Hoffmann"
    ]
   ],
   "title": "Analysis-by-synthesis in prosody research",
   "original": "sp12_001",
   "page_count": 6,
   "order": 1,
   "p1": "1",
   "pn": "6",
   "abstract": [
    "It was early recognized in the history of speech technology, that prosody plays an essential role in the communication process and that it is therefore necessary to include prosodic components into the speech-based systems for man-computer interaction. Recent text-to-speech (TTS) systems show prosodic components at an elementary level (intonation and duration) for good comprehensibility, but it is also obvious that these components are not powerful enough to produce speech with high naturalness and personality. On the other hand, systems for automatic speech recognition (ASR) consider the prosody more or less implicitly, and we have only few examples where prosodic features are explicitly used for improving the recognition results. This talk is an attempt to give a more general view on the inclusion of prosody in speech technology. During the last decade, reconsidering the paradigm of analysis-by-synthesis (AbS) in speech technology has produced some algorithmic progress in TTS and in ASR as well. The system UASR (Unified Approach for Speech Synthesis and Recognition) of the TU Dresden was designed to demonstrate the AbS approach in a hierarchical way. It is now time to discuss how prosodic components could be included in such systems. The inclusion of rhythmic phenomena seems to be the most difficult but also very promising subtask. Possibly speech processing can benefit from musical signal processing where the identification of rhythm is a very natural task.\n",
    "Index Terms: History of speech technology, Analysis-by- Synthesis, UASR, cognitive systems, hierarchical systems, speech dialogue systems\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-1"
  },
  "sagisaka12_speechprosody": {
   "authors": [
    [
     "Yoshinori",
     "Sagisaka"
    ]
   ],
   "title": "Modeling prosody variations for communicative speech and the second language towards trans-disciplinary scientific understanding",
   "original": "sp12_187",
   "page_count": 7,
   "order": 2,
   "p1": "187",
   "pn": "193",
   "abstract": [
    "In this paper, our research studies on prosody variation modeling are introduced for communicative prosody characterization and the objective evaluation of the second language (L2) timing control characteristics. For communicative prosody characterization, a possibility of lexicon driven control and further needs of dialogue-act modeling are discussed. For the objective evaluation of L2 prosody, the possibility of scientific understanding of timing control characteristics and the needs of perceptual studies are demonstrated. Through the introduction of these studies, I would like to show the necessity and the merits of transdisciplinary research collaboration among multiple research areas relating to speech science and technologies including linguistics, phonetics, speech science, information processing, and language education. Finally, the research efforts are introduced for international research consortium AESOP (Asian English Speech cOrpus Project) to collect commonly sharable learner's spoken language data and knowledge of L2 studies for trans-disciplinary scientific understanding.\n",
    "Index Terms: communicative speech synthesis, second language learning, fundamental frequency control, timing control, para-linguistic information, prosody evaluation, prosody perception\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-2"
  },
  "tao12_speechprosody": {
   "authors": [
    [
     "Jianhua",
     "Tao"
    ]
   ],
   "title": "Prosody modeling",
   "original": "sp12_751",
   "page_count": 0,
   "order": 3,
   "p1": "0",
   "pn": "",
   "abstract": [
    "Prosody is a super-segmental feature of speech and represents various features of speakers or utterances. It is well accepted that the speech prosody can be hierarchically modeled, however it's still the open question that how the hierarchical model is influenced by the acoustic features and context features. Which features are important to label or predict the hierarchical structure for prosody? Among them, pitch accent and phrase play the important roles. In the talk, we will try to give a wide view of the recent research on the hierarchical prosody model, mainly focusing on the features of phrase and pitch accent from acoustical and perceptional aspect in different hierarchical levels. The influence from the syntactic structure will also be introduced. And finally, we will introduce the prediction model for the hierarchical prosody structure and how to use it in text to speech system to get more expressive synthetic results.\n",
    ""
   ]
  },
  "gandour12_speechprosody": {
   "authors": [
    [
     "Jackson T.",
     "Gandour"
    ]
   ],
   "title": "Neural specializations for pitch in tonal languages",
   "original": "sp12_624",
   "page_count": 5,
   "order": 4,
   "p1": "624",
   "pn": "628",
   "abstract": [
    "Tonal languages provide a window for tracing the hierarchical transformation of the pitch of a sound from early sensory to later cognitive stages of processing in the human brain. Hemispheric laterality of pitch is driven by multiple dichotomies or scalar features that apply during real-time intervals at cortical and subcortical levels. Using functional neuroimaging, we show that pitch processing recruits the hemispheres differentially as a function of its phonological relevance to the listener. Mismatch negativity, a neural index of early, cortical processing, shows that pitch processing is shaped by the relative saliency of tonal features. Frequency following response, a neural index of brainstem pitch encoding, shows that enhancement of pitch features is sensitive to rapidly-changing segments of tonal contours, and that ear asymmetries can be modulated by functional changes in pitch based on linguistic status. We conclude that nascent representations of acoustic-phonetic features emerge early along the auditory pathway.\n",
    "Index Terms: perception; pitch; lexical tone; intonation; cerebral cortex; brainstem; auditory electrophysiology; functional brain imaging; experience-dependent plasticity; hemispheric specialization; cue-specific; domain-specific; Mandarin; Cantonese; Thai\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-3"
  },
  "ma12_speechprosody": {
   "authors": [
    [
     "Qiuwu",
     "Ma"
    ]
   ],
   "title": "Bidirectional tone sandhi in Tianjin dialect: problem and analysis",
   "original": "sp12_745",
   "page_count": 4,
   "order": 5,
   "p1": "745",
   "pn": "748",
   "abstract": [
    "The paradoxical problem of Tianjin tone sandhi, first recognized by Chen (1986)[1], has ever been a challenge to current phonological theories. The present paper demonstrates what reasons underlie it and then discusses what problems still exist in the application of some current theories or models in Tianjin tone sandhi.\n",
    "Index Terms: tone sandhi, bidirectionality, derivational path\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-4"
  },
  "karkhedkar12_speechprosody": {
   "authors": [
    [
     "Shreyas A.",
     "Karkhedkar"
    ],
    [
     "Nigel G.",
     "Ward"
    ]
   ],
   "title": "Representing the prosodic context of words using Gaussian mixture models",
   "original": "sp12_007",
   "page_count": 4,
   "order": 6,
   "p1": "7",
   "pn": "10",
   "abstract": [
    "Different words tend to appear in different prosodic contexts. For each word, we would like to be able to characterize its typical prosodic contexts of appearance, and, for applications purposes, we would like to do this using probability distributions. This paper describes the phenomena and the need, and explains a way to use Gaussian Mixture Models for modeling prosody.\n",
    "Index Terms: continuous probability distributions, prosodic features, language modeling, perplexity, lexico-prosodic linkages.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-5"
  },
  "wen12_speechprosody": {
   "authors": [
    [
     "Zhengqi",
     "Wen"
    ],
    [
     "Jianhua",
     "Tao"
    ]
   ],
   "title": "Prosody modification for vocoder based on amplitude spectrum of residual signal",
   "original": "sp12_011",
   "page_count": 4,
   "order": 7,
   "p1": "11",
   "pn": "14",
   "abstract": [
    "This paper describes the prosody modification (pitch and duration) for vocoder based on amplitude spectrum of residual signal. In this vocoder, period component is represented as amplitude spectrum of half pitch period length and aperiod component is estimated from the difference of amplitude spectrum between the constructed period signal and the residual signal. Then, pitch modification is conducted by resampling the period spectrum according to desired pitch period length in frequency domain and duration modification is conducted by adjusting the frame shift length in time domain. Listening tests show that the speech quality of proposed vocoder after modification is not decreased so much and can get comparable performance with STRAIGHT.\n",
    "Index Terms: prosody modification, pitch, duration, amplitude spectrum\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-6"
  },
  "hirst12_speechprosody": {
   "authors": [
    [
     "Daniel",
     "Hirst"
    ]
   ],
   "title": "Prozed: a speech prosody analysis-by-synthesis tool for linguists",
   "original": "sp12_015",
   "page_count": 4,
   "order": 8,
   "p1": "15",
   "pn": "18",
   "abstract": [
    "This paper describes a tool designed to allow linguists to manipulate the prosody of an utterance via a symbolic representation in order to evaluate linguistic models. Prosody is manipulated via a Praat TextGrid which allows the user to modify the rhythm and melody. Rhythm is manipulated by factoring segmental duration into three components: (i) intrinsic duration determined by phonemic identity (ii) local modifications encoded on the rhythm tier and (iii) global variations of speech rate encoded on the intonation tier. Melody is similarly determined by tonal segments on the tonal tier (= pitch accents) and on the intonation tier (= boundary tones) together with global parameters of key and span determining changes of pitch register. The TextGrid is used to generate a Manipulation object which can be used either for immediate interactive assessment of the prosody determined by the annotation, or to generate synthesised stimuli for more formal perceptual experiments.\n",
    "Index Terms: speech synthesis, speech prosody, analysis by synthesis, linguistic models, rhythm, melody\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-7"
  },
  "bigi12_speechprosody": {
   "authors": [
    [
     "Brigitte",
     "Bigi"
    ],
    [
     "Daniel",
     "Hirst"
    ]
   ],
   "title": "SPeech Phonetization Alignment and Syllabification (SPPAS): a tool for the automatic analysis of speech prosody",
   "original": "sp12_019",
   "page_count": 4,
   "order": 9,
   "p1": "19",
   "pn": "22",
   "abstract": [
    "SPASS, SPeech Phonetization Alignment and Syllabification, is a tool to automatically produce annotations which include utterance, word, syllable and phoneme segmentations from a recorded speech sound and its transcription. SPPAS is currently implemented for French, English, Italian and Chinese and there is a very simple procedure to add other languages. The tool is developed for Unix based platforms (Linux, MaxOS and Cygwin on Windows) and is specifically designed to be used directly by linguists in conjunction with other tools for the automatic analysis of speech prosody. The tools will all be distributed under a GPL license.\n",
    "Index Terms: phonetic, annotation, speech prosody, intonation\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-8"
  },
  "na12_speechprosody": {
   "authors": [
    [
     "Xingyu",
     "Na"
    ],
    [
     "Chaomin",
     "Wang"
    ],
    [
     "Xiang",
     "Xie"
    ],
    [
     "Jingming",
     "Kuang"
    ],
    [
     "Yaling",
     "He"
    ]
   ],
   "title": "Tone generation by maximizing joint likelihood of syllabic HMMs for Mandarin speech synthesis",
   "original": "sp12_023",
   "page_count": 4,
   "order": 10,
   "p1": "23",
   "pn": "26",
   "abstract": [
    "A tone generation method by maximizing the joint likelihood of syllabic HMMs is proposed to improve the Mandarin speech synthesis. F0 sequence is generated by jointly maximizing the likelihood of the state-level F0 model and syllable-level tone model under the constraint of mean F0 of the adjacent units. The optimal weight of the tone component is searched in terms of the parameter generation error and correlation coefficients. Objective and subjective evaluations both prove the positive effects of this method. The generation error is reduced by 26.7%, the correlation coefficient is increased by 6.5%, and the prosody perception is significantly improved.\n",
    "Index Terms: speech synthesis, F0 contour, tone generation, speech prosody\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-9"
  },
  "ng12_speechprosody": {
   "authors": [
    [
     "Raymond W. M.",
     "Ng"
    ],
    [
     "Keikichi",
     "Hirose"
    ]
   ],
   "title": "Automatic segmentation of English words using phonotactic and syllable information",
   "original": "sp12_027",
   "page_count": 4,
   "order": 11,
   "p1": "27",
   "pn": "30",
   "abstract": [
    "It is difficult to demonstrate the effectiveness of prosodic features in automatic word recognition. Recently, we applied the suprasegmental concept and proposed an extra layer of acoustic modeling with syllables. Nevertheless, there is a mismatch between the syllable and the word units and that makes subsequent steps after acoustic modeling difficult. In this study, we explore English word segmentation without a pronunciation dictionary. The algorithm is based on phonotactic and pseudosyllable information trained on a direct model with conditional random fields. An F-measure of 0:69 is attained. This result opens the possibility of automatic word recognition with the extra layer of syllable modeling.\n",
    "Index Terms: automatic word recognition, word segmentation, pseudosyllable\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-10"
  },
  "wittenberg12_speechprosody": {
   "authors": [
    [
     "Sören",
     "Wittenberg"
    ],
    [
     "Rüdiger",
     "Hoffmann"
    ]
   ],
   "title": "Framework for consistent speech databases",
   "original": "sp12_031",
   "page_count": 4,
   "order": 12,
   "p1": "31",
   "pn": "34",
   "abstract": [
    "The introduced speech processing framework creates phonetically and prosodically annotated speech databases. It provides with structured data files in eXtensible Markup Language format. Those files include all available information about a recorded utterance inclusively the speech signal. A Document Type Definition (DTD) describes the data structure and provides with the possibilty of automatically data structure validation. That ensures right data reading by human and interoperability between the used speech processing tools. A user can browse the speech databases with a normal web browser. The browser has to support XSL transformation, ECMA script and Scalable Vector Graphics to visualize the content. If the user requests a utterance, the browser gets the requested file with all available information of the corresponding utterance. The advantage of that is that the user obtain same data as a speech processing tool when it uses the underlying file server. The navigation through different speech layers is like browsing a web page. The user clicks on a part he wants to look at and a file embedded ECMA script filters the data and modifies the screen. The script is part of the XSL transformation file. It allows also elementary editing of the utterance content like changing word boundaries by moving the corresponding boundary mark. The changes are committed to the web server, that can handle further processing like integration into a subversion system. Because the whole speech database contents are strings, a standard search engine can be used for database searching. Searching for a phoneme under special context yields to all avialable phonemes with all information of them and also the speech signal.\n",
    "Index Terms: speech database, framework, structured data\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-11"
  },
  "kagomiya12_speechprosody": {
   "authors": [
    [
     "Takayuki",
     "Kagomiya"
    ],
    [
     "Seiji",
     "Nakagawa"
    ]
   ],
   "title": "Perception of Japanese prosodical phonemes through use of a bone-conducted ultrasonic hearing aid",
   "original": "sp12_035",
   "page_count": 4,
   "order": 13,
   "p1": "35",
   "pn": "38",
   "abstract": [
    "Human listeners can perceive speech signals in a voice modulated ultrasonic carrier from a bone-conduction stimulator, even if the listeners are patients with sensorineural hearing loss. Considering this fact, we have been developing a boneconducted ultrasonic hearing aid (BCUHA). The purpose of this study is to evaluate the usability of the BCUHA regarding perception of Japanese prosodic phonemes, specifically, perception of singleton/geminate consonants, short/long vowels and pitch accent. For this purpose, a series of phoneme discrimination experiments was conducted. The results of the experiments showed that no significant difference between airconduction and BCUHA conditions was observed. These results indicate that the BCUHA can transmit short/long vowels, single/geminate consonants and pitch accent information as well as segmental information.\n",
    "Index Terms: hearing aid, ultrasound, bone-conduction, pitch accent, long vowel, geminate consonant, logistic regression analysis\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-12"
  },
  "govind12_speechprosody": {
   "authors": [
    [
     "D.",
     "Govind"
    ],
    [
     "Priyankoo",
     "Sarmah"
    ],
    [
     "S. R. Mahadeva",
     "Prasanna"
    ]
   ],
   "title": "Role of pitch slope and duration in synthesized Mizo tones",
   "original": "sp12_039",
   "page_count": 4,
   "order": 14,
   "p1": "39",
   "pn": "42",
   "abstract": [
    "This paper reports the results of an attempt to synthesize the lexical tones of the Mizo language. Firstly, the study reported in this paper attempts to confirm the findings of previous acoustic studies on Mizo tones. Secondly, using the parameters defined in the previous acoustic studies, the work reported in this paper synthesized Mizo tones and then confirmed the acceptability of the synthesized tones from native speakers of Mizo. The work reported in this paper confirms that (a) mean fundamental frequency (F0) alone cannot be a parameter to recognize Mizo tones; (b) mean F0 and tone slope (Fd) information integrated into synthesized Mizo tones elicit better identification and acceptance and (c) durational information is important for correct identification of rising tones in Mizo.\n",
    "Index Terms: Tone language, contour tone, Mizo, tone synthesis, epoch based prosody modification\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-13"
  },
  "martin12_speechprosody": {
   "authors": [
    [
     "Philippe",
     "Martin"
    ]
   ],
   "title": "Automatic detection of voice creak",
   "original": "sp12_043",
   "page_count": 4,
   "order": 15,
   "p1": "43",
   "pn": "46",
   "abstract": [
    "The analysis of large spontaneous speech corpora reveals that creaky mode appears more frequently than expected, especially for young female speakers. Creaky mode usually creates fundamental frequency measurement errors and creaky voice segments must be often identified manually beforehand to avoid erroneous reading of F0 in large speech databases. Various approaches have been proposed to identify creaky segments with diplophonic and vocal fry automatically, based on autocorrelation, AMDF, HMM, pitch markers, etc. The approach proposed here is based on narrow band Fourier spectrum analysis, operating not on a single frame but on the evaluation of sudden changes in the harmonic distribution of consecutive frames. The implemented algorithm simulates the visual detection of creak from spectrographic display where so-called sub harmonics appear on short voice segments.\n",
    "Index Terms: creaky voice, diplophonia, vocal fry, fundamental frequency, spontaneous speech.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-14"
  },
  "martin12b_speechprosody": {
   "authors": [
    [
     "Philippe",
     "Martin"
    ]
   ],
   "title": "Multi methods pitch tracking",
   "original": "sp12_047",
   "page_count": 4,
   "order": 16,
   "p1": "47",
   "pn": "50",
   "abstract": [
    "The elaboration of rather large spontaneous speech corpora frequently implies the collection of data recorded with poor acoustic quality which may affect its acoustic analysis, and particularly fundamental frequency tracking (F0). Indeed, F0 analysis is particularly sensitive to distortion due to low signal to noise ratio, filtering of low frequencies, encoding in compressed formats (mp3, wma, …), room echo, not to mention the presence of external sound sources (car engine, overlapping speech segments, etc.).   In order to obtain a more reliable F0 analysis, it can be noted that some fundamental frequency algorithms are more reliable than others on specific voiced segments, depending on complex characteristics such as rate of F0 change, intensity of the first harmonic, presence of echo, etc.   For that reason a system (implemented in the software package WinPitch) is proposed to allow the user to select various tracking algorithms, adjust their parameters and apply a selected tracking method on the speech segments considered. The user is guided in this operation by an underlying narrow band spectrogram, which allows visual checking of the validity of the local F0 analysis by comparison between the F0 curve and the spectrogram low harmonics.\n",
    "Index Terms: speech prosody, fundamental frequency tracking, intonation.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-15"
  },
  "pessoa12_speechprosody": {
   "authors": [
    [
     "Aline Neves",
     "Pessoa"
    ],
    [
     "Beatriz C. A. C.",
     "Novaes"
    ],
    [
     "Sandra",
     "Madureira"
    ],
    [
     "Zuleica A.",
     "Camargo"
    ]
   ],
   "title": "Perceptual and acoustic correlates of speech in a bilateral cochlear implant user",
   "original": "sp12_051",
   "page_count": 4,
   "order": 17,
   "p1": "51",
   "pn": "54",
   "abstract": [
    "Acoustic and perceptual analysis procedures can be thought as useful clinical tools to investigate the speech characteristics of hearing impaired children (HIC). This research aimed at investigating vocal quality and voice dynamics and their acoustic and perceptual correlates in speech samples produced by a three- year ten-month-old male child, who uses bilateral cochlear implant (BCI). The speech samples were collected during a speech therapy session. The perceptual analysis of the vocal quality was based on the Voice Profile Analysis Scheme for Brazilian Portuguese (BP-VPAS - Camargo & Madureira, 2008). The recorded corpus was analyzed by means of the SG Expression Evaluator script (Barbosa, 2009) running on the free software Praat v5.2.10. The measures, which were automatically extracted, comprise the fundamental frequencyf0, first f0 derivative, intensity, spectral slope and long-term mean spectrum. The findings reinforce some correlations between the acoustic and perceptual data, which are relevant to be considered in rehabilitation processes.\n",
    "Index Terms: Auditory Perception; Acoustic Analysis; Cochlear Implant; Speech Corpora\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-16"
  },
  "bartkova12_speechprosody": {
   "authors": [
    [
     "Katarina",
     "Bartkova"
    ],
    [
     "Elisabeth",
     "Delais-Roussarie"
    ],
    [
     "Fabian",
     "Santiago-Vargas"
    ]
   ],
   "title": "PROSOTRAN: a tool to annotate prosodically non-standard data",
   "original": "sp12_055",
   "page_count": 4,
   "order": 18,
   "p1": "55",
   "pn": "58",
   "abstract": [
    "Assigning a prosodic transcription that encompasses all prosodic phenomena (intonation, accentuation and phrasing) is difficult mainly because: (i) encoding all the prosodic phenomena usually supposes a knowledge of the language to transcribe; and (ii) a representation of the various phenomena cannot be achieved without taking into account the three prosodic parameters. In this paper, we present a tool, PROSOTRAN, which automatically assigns to each utterance a multi-tiered transcription that symbolically represents how the three prosodic parameters (F0, duration & energy) do vary over time. Assigning labels to each syllable avoids segmenting the signal into linguistic units that are difficult to define when the language to transcribe is not known.\n",
    "Index Terms: prosodic annotation systems, automatic annotation tools, phonetic implementation and phonological analysis\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-17"
  },
  "abouzleikha12_speechprosody": {
   "authors": [
    [
     "Mohamed",
     "Abou-Zleikha"
    ],
    [
     "Éva",
     "Székely"
    ],
    [
     "Peter",
     "Cahill"
    ],
    [
     "Julie",
     "Carson-Berndsen"
    ]
   ],
   "title": "Multi-level exemplar-based duration generation for expressive speech synthesis",
   "original": "sp12_059",
   "page_count": 4,
   "order": 19,
   "p1": "59",
   "pn": "62",
   "abstract": [
    "The generation of duration of speech units from linguistic in- formation, as one component of a prosody model, is consid- ered to be a requirement for natural sounding speech synthesis. This paper investigates the use of a multi-level exemplar-based model for duration generation for the purposes of expressive speech synthesis. The multi-level exemplar-based model has been proposed in the literature as a cognitive model for the pro- duction of duration. The implementation of this model for dura- tion generation for speech synthesis is not straightforward and requires a set of modifications to the model and that the linguis- tically related units and the context of the target units should be taken into consideration. The work presented in this paper implements this model and presents a solution to these issues through the use of prosodic-syntactic correlated data, full con- text information of the input example and corpus exemplars.\n",
    "Index Terms: speech prosody, duration generation, exemplar- based model\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-18"
  },
  "reichel12_speechprosody": {
   "authors": [
    [
     "Uwe D.",
     "Reichel"
    ]
   ],
   "title": "Automatisation of intonation modelling and its linguistic anchoring",
   "original": "sp12_063",
   "page_count": 4,
   "order": 20,
   "p1": "63",
   "pn": "66",
   "abstract": [
    "This paper presents a fully machine-driven approach for intonation description and its linguistic interpretation. For this purpose, a new intonation model for bottom-up F0 contour analysis and synthesis is introduced, the CoPaSul model which is designed in the tradition of parametric, contour-based, and superpositional approaches. Intonation is represented by a superposition of global and local contour classes that are derived from F0 parameterisation. These classes were linguistically anchored with respect to information status by aligning them with a text which had been coarsely analysed for this purpose by means of NLP techniques. To test the adequacy of this data-driven interpretation a perception experiment was carried out, which confirmed 80% of the findings.\n",
    "Index Terms: intonation, modelling, information status, datadriven, perception\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-19"
  },
  "ogbureke12_speechprosody": {
   "authors": [
    [
     "Kalu U.",
     "Ogbureke"
    ],
    [
     "João P.",
     "Cabral"
    ],
    [
     "Julie",
     "Carson-Berndsen"
    ]
   ],
   "title": "Using noisy speech to study the robustness of a continuous F0 modelling method in HMM-based speech synthesis",
   "original": "sp12_067",
   "page_count": 4,
   "order": 21,
   "p1": "67",
   "pn": "70",
   "abstract": [
    "In parametric text-to-speech synthesis using Hidden Markov Model (HMM), the fundamental frequency (F0) parameter modelling is important because it has a direct effect on the prosody of synthetic speech. F0 is typically modelled by a discrete distribution for unvoiced speech and a continuous distribution for voiced, by using a multi-space distribution (MSD). However, F0 modelling using MSD-HMM is not accurate around the voiced-unvoiced (V-UV) and (UV-V) transitions and it is affected by voicing decision errors of the F0 estimation algorithm. In order to reduce this problem, HMM-based speech synthesisers have been proposed that model F0 using continuous HMM. This approach usually obtains the continuous F0 contours by interpolating F0 in unvoiced regions. The problem with this method is that it is affected by voiced decision errors during speech analysis. For example, if voiced speech segments are incorrectly classified as unvoiced, the F0 contour in this region is obtained by interpolation which might be a poor estimate of the natural F0. This paper proposes to use an F0 estimation method that does not require a hard voiced/unvoiced classification and produces a reasonable smooth F0 contour. The robustness of this method was studied in the conditions of high-quality recorded speech and recorded speech with additive noise. The motivation for using noisy speech was to study the effect of voiced decision errors on the quality of the synthetic speech.\n",
    "Index Terms: continuous F0 modelling, voicing strength, HMM-based speech synthesis\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-20"
  },
  "looze12_speechprosody": {
   "authors": [
    [
     "Céline De",
     "Looze"
    ],
    [
     "Alain",
     "Ghio"
    ],
    [
     "Stefan",
     "Scherer"
    ],
    [
     "Gilles",
     "Pouchoulin"
    ],
    [
     "François",
     "Viallet"
    ]
   ],
   "title": "Automatic analysis of the prosodic variations in Parkinsonian read and semi-spontaneous speech",
   "original": "sp12_071",
   "page_count": 4,
   "order": 22,
   "p1": "71",
   "pn": "74",
   "abstract": [
    "This work presents an automatic analysis of Parkinsonian speech prosody in read and spontaneous tasks. We first evaluate the reliability of existing algorithms for the automatic analysis of speech prosody and show that these tools are efficient for the analysis of Parkinsonian speech if a large amount of data is processed. We then investigate the prosodic characteristics of 25 control and 30 Parkinsonian subjects (in off (non-medicated) state) in both tasks and show that Parkinsonian read and spontaneous speech are characterized by longer pauses as well as smaller variations in pitch range, voice intensity level and articulation rate; these characteristics being all the more marked in semi-spontaneous speech. These results suggest that some linguistic functions, normally expressed via prosodic variations, may not be conveyed in Parkinsonian speech, particularly in a semi-spontaneous task.\n",
    "Index Terms: prosodic variations, automatic measurements and tools, interpausal run, Parkinson disease, dysprosody\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-21"
  },
  "goldman12_speechprosody": {
   "authors": [
    [
     "Jean-Philippe",
     "Goldman"
    ]
   ],
   "title": "Prosodyn: a graphical representation of macroprosody for phonostylistic ambiance change detection",
   "original": "sp12_075",
   "page_count": 4,
   "order": 23,
   "p1": "75",
   "pn": "78",
   "abstract": [
    "Following the ProsoReport, we present a new prosodic tool in Praat allowing a dynamic analysis of prosodic dimensions such as temporal, intonational and accentual parameters, to graphically represent the macro-prosodic variations in Praat. It helps the user to visually detect “ambiance changes” that are supposed to be significant. Two different graphical modes can be activated at the same time: parameters averaged relative to an external macro-segmentation (e.g. utterance, speaker's turns, etc.) and relative to a sliding window for a representation of local speech rate and register. Interactive buttons allow the adjustment of scales and help the user to explore data a macroprosodic level.\n",
    "Index Terms: prosody analysis tool, macroprosody, ambiance change, Praat\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-22"
  },
  "wollermann12_speechprosody": {
   "authors": [
    [
     "Charlotte",
     "Wollermann"
    ],
    [
     "Bernhard",
     "Schröder"
    ],
    [
     "Ulrich",
     "Schade"
    ]
   ],
   "title": "Pitch accent, eyebrows and context – effects on the exhaustivity of answers?",
   "original": "sp12_079",
   "page_count": 4,
   "order": 24,
   "p1": "79",
   "pn": "82",
   "abstract": [
    "We describe an interpretation study on the effect of accentuation, eyebrow movement and context on the exhaustive interpretation of answers. Our material consists of video recordings of nine German speakers who read dialogues with embedded question-answer pairs in which the answer constituted the pragmatic focus of the utterance. For the dialogues we varied the context regarding (un)certainty and (non-)exhaustivity of the answer. The material was presented to 45 subjects, the focus interpretation was tested by presenting pictures showing the (non-)exhaustive reading. In the current analysis we concentrate on a coordination of two noun phrases functioning as focus constituents. When using the pictures showing the nonexhaustive reading, our data show that the influence of the audiovisual prosody is less evident than the contextual influence.\n",
    "Index Terms: audiovisual prosody, exhaustivity, focus\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-23"
  },
  "mixdorff12_speechprosody": {
   "authors": [
    [
     "Hansjörg",
     "Mixdorff"
    ],
    [
     "Plínio A.",
     "Barbosa"
    ]
   ],
   "title": "Alignment of intonational events in German and Brazilian Portuguese – a quantitative study",
   "original": "sp12_083",
   "page_count": 4,
   "order": 25,
   "p1": "83",
   "pn": "86",
   "abstract": [
    "This study compares the intonational realizations of reading style as well as story-telling in German and Brazilian Portuguese (BP). By applying the Fujisaki model we can examine the frequencies and alignments of tonal transition, the so-called tone switches. Analysis of accent commands from the different corpora shows that in German 75% of commands can be associated with automatically generated stress labels. In comparison, manually assigned prominence labels can account for 80% of commands. This latter figure is much lower for BP (61%). This suggests that in BP prominence is signaled by F0 cues to a lesser degree. In both languages story-telling is associated with fewer accented syllables, a higher rate of rising tone switches on stressed syllables and a broader distribution of accent command amplitudes than reading style.\n",
    "Index Terms: intonation modeling, speaking styles, crosslinguistic prosody\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-24"
  },
  "yeh12_speechprosody": {
   "authors": [
    [
     "Chia-Hsin",
     "Yeh"
    ],
    [
     "Jung-Yueh",
     "Tu"
    ]
   ],
   "title": "The effect of language attrition and tone sandhi on Taiwanese tonal processing",
   "original": "sp12_087",
   "page_count": 4,
   "order": 26,
   "p1": "87",
   "pn": "90",
   "abstract": [
    "This study investigates the effect of language attrition and tone sandhi on speech processing of Taiwanese tones. The mid level tone was previously found to be the most confusing category, and is largely confused with low-falling tone. This study argues that the tonal errors are caused by the effect of language attrition and tone sandhi. Three perception and one production tasks were conducted on 15 fluent speakers and 30 attriters. The results show that attriters significantly make more errors than fluent speakers. In the production task, both groups tend to mispronounce mid level tone as low-falling tone, but in the perception tasks, they tend to misperceive the mid level tone as high level tone. The strong tendency is argued to be determined by the effect of tone sandhi and phonetic similarity. The findings support the effect of language attrition, and suggest that both phonetic and phonological factors exert an influence on Taiwanese tonal processing.\n",
    "Index Terms: language attrition, mid level tone, perception-production asymmetry, phonetic similarity, tone sandhi\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-25"
  },
  "graetzer12_speechprosody": {
   "authors": [
    [
     "Simone",
     "Graetzer"
    ],
    [
     "John",
     "Hajek"
    ],
    [
     "Janet",
     "Fletcher"
    ]
   ],
   "title": "The effects of prosodic context and word position on Gupapuyngu vowels",
   "original": "sp12_091",
   "page_count": 4,
   "order": 27,
   "p1": "91",
   "pn": "94",
   "abstract": [
    "This paper presents an acoustical analysis of vowels in a Northern Australian language, Gupapuyngu, in order to investigate whether vowels in CVCV words differ according to prosodic prominence and word position. It is shown that back vowels are produced with a narrower constriction when prosodically prominent and word-initial. However, in general, vowels tend not to be hyperarticulated under conditions of word-initial prosodic prominence. These results are interpreted in terms of perceptual distinctiveness and articulatory strengthening.\n",
    "Index Terms: Australian, Gupapuyngu, acoustics, vowel\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-26"
  },
  "wang12_speechprosody": {
   "authors": [
    [
     "C. Y.",
     "Wang"
    ],
    [
     "C. J.",
     "Tang"
    ]
   ],
   "title": "The falsetto tones of the dialects in Hubei province",
   "original": "sp12_095",
   "page_count": 4,
   "order": 28,
   "p1": "95",
   "pn": "98",
   "abstract": [
    "Falsetto phonation was applied to produce Shangsheng/Rising Tone in the early stage of Chinese tonal development (ca. 400-700 AD) and this phonation type is still in use in the tonal systems of several major Chinese dialect-groups now. In Hubei province, falsetto tones are found in three cities, Songzi, Jingmen and Jianli. In the tonal systems of these three dialects, the tone values show some noteworthy correspondences. In order to present the contemporary state of the falsetto tones and explore the tonal evolution through the synchronic field data, we conducted this research and chose Songzi as our starting point. Based on Evolutionary Phonology and the Multi-Register and Four-Level Tonal Model, three geographically connected and phonologically related dialects are found in Songzi: Weishui Type in the south, Nanhai Type in the middle, and Songzihe Type in the north. They share almost identical onset and rime systems, and their tonal systems are different but related. Weishui maintains a Rusheng/Entering Tone in falsetto or fortis voice and there are five tones in its tonal system; Rusheng has disappeared in Nanhai and four tones remain which are the same as their counterparts in Weishui; there is no Rusheng in Songzihe either, and it shares Yangping/Low Level Tone and Shangsheng with Weishui and Nanhai, but the tone values of its Yinping/High Level Tone and Qusheng/Departing Tone are involved in a tonal flip-flop with their counterparts of the other two dialects. These three synchronic tonal systems show a diachronic chain shift. At present, the Weishui's Rusheng which is in falsetto or fortis voice is moving down in two ways: an overall falling (the pitch falls while the contour maintains), and the lowering of the tone tail. These findings offer us the chance to detect the initial changes in the chain shift of these three tonal systems and evaluate their impact to the phonological systems. [Remark by ISCA Archive: Chinese characters were omitted in the HTML version of this abstract. To view them, please refer to the full paper.]\n",
    "Index Terms: falsetto, tone, phonation type, evolutionary phonology, the Multi-Register and Four-Level Tonal Model\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-27"
  },
  "xu12_speechprosody": {
   "authors": [
    [
     "Bo Robert",
     "Xu"
    ],
    [
     "Peggy",
     "Mok"
    ]
   ],
   "title": "Cross-linguistic perception of intonation by Mandarin and Cantonese listeners",
   "original": "sp12_099",
   "page_count": 4,
   "order": 29,
   "p1": "99",
   "pn": "102",
   "abstract": [
    "The question intonation patterns of Mandarin and Cantonese are distinctive. While Mandarin relies on the global F0 contour, Cantonese depends on a boundary tone. A crosslinguistic perception test was conducted with Mandarin and Cantonese listeners to investigate their use of pitch in identifying intonation patterns in familiar and unfamiliar languages. Forced identification tasks were used. The perception results confirmed previously established intonation patterns of the two languages. The results also revealed the universal features of pitch that listeners use to differentiate intonation types. However, language specific and tone specific factors also play a part in the perception process. Therefore, perception of intonation is an interaction of the universal biological process and language-tone specific process.\n",
    "Index Terms: intonation, cross-linguistic perception, Cantonese, Mandarin\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-28"
  },
  "qin12_speechprosody": {
   "authors": [
    [
     "Zuxuan",
     "Qin"
    ]
   ],
   "title": "Prosodic word in Chengdu dialect",
   "original": "sp12_103",
   "page_count": 4,
   "order": 30,
   "p1": "103",
   "pn": "106",
   "abstract": [
    "This paper will present a study on the prosodic word (hereafter PW) in Chengdu Dialect (CD), one of the prosodic constituents in the prosodic hierarchy. It argues for the existence of PW in CD by showing 1) that PW, as defined perceptually as an inseparable entity, constitutes the convergent domain of the application of a few tone and segmental sandhi rules, and 2) that this PW can not be matched with any constituent in the morpho-syntactic hierarchy, and 3) the domain of the application of these sandhi rules can not be stated in morpho-syntactic terms.\n",
    "Index Terms: Chengdu Dialect, prosodic word, prosodic constituents, morphology-phonology mismatch\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-29"
  },
  "huff12_speechprosody": {
   "authors": [
    [
     "Christopher",
     "Huff"
    ],
    [
     "Elinor",
     "Payne"
    ]
   ],
   "title": "Disambiguation of tonally unspecified Mandarin syllables",
   "original": "sp12_107",
   "page_count": 4,
   "order": 31,
   "p1": "107",
   "pn": "110",
   "abstract": [
    "The interpretation of written Mandarin monosyllables presented in tonally unspecified pinyin was investigated for 22 native speakers. Results showed a preference for high relative lexical frequency and, to a lesser extent low homophone density candidates, with some interaction between these two factors: where one candidate in a homophone cohort had a particularly high frequency, cohort density was found to play little or no role in selection. Where the frequency of the two most frequent candidates was comparable, characters from lower density tonal homophone cohorts were preferred. These results indicate a strong role for relative lexical frequency and, through the weaker homophone density effect a lesser role for tone, in Mandarin homophone disambiguation.\n",
    "Index Terms: tone, Mandarin, homophony\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-30"
  },
  "wu12_speechprosody": {
   "authors": [
    [
     "Lihan",
     "Wu"
    ],
    [
     "Qiuwu",
     "Ma"
    ]
   ],
   "title": "A global perspective on Chinese intonation",
   "original": "sp12_111",
   "page_count": 4,
   "order": 32,
   "p1": "111",
   "pn": "114",
   "abstract": [
    "An analysis procedure of Chinese intonation is tentatively proposed from a global perspective. This procedure starts from an observation of the interaction among three prosodic parameters and the hierarchical systems of production by looking at three continuums of utterances, followed by developing a system of acoustic and perceptual based features which can be further applied to the analysis of various types of intonation. This procedure is demonstrated by investigating into the five-syllable utterances produced by a male speaker. This pilot study suggests that the hierarchies of both duration and intensity might go up in a non-linear way in a speaker's mind, while the degree of pitch measured in semitone increases in a linear way. The selection and combination of global features indicate the restriction coming from both extrinsic (the communicative principle of explicitness) and intrinsic factors (the constraint of physical realization).\n",
    "Index Terms: Chinese intonation, global feature, continuum, prosodic parameters\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-31"
  },
  "camargo12_speechprosody": {
   "authors": [
    [
     "Zuleica A.",
     "Camargo"
    ],
    [
     "Sandra",
     "Madureira"
    ],
    [
     "Aline Neves",
     "Pessoa"
    ],
    [
     "Luiz Carlos",
     "Rusilo"
    ]
   ],
   "title": "Voice quality and gender: some insights on correlations between perceptual and acoustic dimensions",
   "original": "sp12_115",
   "page_count": 4,
   "order": 33,
   "p1": "115",
   "pn": "118",
   "abstract": [
    "The present study aims at characterizing, from the perceptual and acoustic points of view, differences in voice quality settings related to gender. The corpus was composed by speech samples recorded by 38 subjects (19 male and 19 female), aging from 20 to 58 years-old. The audio samples were analyzed in PRAAT by means of the SG Expression Evaluator Script, which extracts f0 and f0 first derivate, intensity, spectral slope and long-term average spectrum measures. The same samples were perceptually evaluated by means of the Vocal Profile Analysis Scheme. The acoustic measures and voice quality settings judgments were statistically analyzed by means of discriminant analysis and cluster agglomerative hierarchical analysis procedures. The statistical data showed the power of f0 and spectral slope measures as well as the influence of some supralaryngeal voice quality settings in differentiating speaker`s gender. Gender was found to be an influential variable.\n",
    "Index Terms: Speech Acoustics; Voice Quality; Perception; Statistical Analysis; Extralinguistic Factors.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-32"
  },
  "caelenhaumont12_speechprosody": {
   "authors": [
    [
     "Geneviève",
     "Caelen-Haumont"
    ]
   ],
   "title": "Towards the Mo Piu tonal system: first results on an undocumented south-asian language",
   "original": "sp12_119",
   "page_count": 4,
   "order": 34,
   "p1": "119",
   "pn": "122",
   "abstract": [
    "This paper presents the first results on the Mo Piu tonal system. This language is undocumented, unwritten and moreover in great danger. As the tasks of labeling phonetics and tones is hard to carry out when references on the language are lacking, this paper aims at presenting our method to try to build reliable data in order to understand the tonal system, and the main findings concerning the Mo Piu tonal system and finally at leading a comparison between these first results and the White Hmong tonal system.\n",
    "Index Terms: undocumented language, tonal system, isolated words, automatic tones labeling.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-33"
  },
  "karlsson12_speechprosody": {
   "authors": [
    [
     "Anastasia",
     "Karlsson"
    ],
    [
     "Arthur",
     "Holmer"
    ]
   ],
   "title": "Functions of word order and intonation in information structuring in Puyuma",
   "original": "sp12_123",
   "page_count": 4,
   "order": 35,
   "p1": "123",
   "pn": "126",
   "abstract": [
    "This paper presents the first results of analyzing the functions of intonation and word order in Puyuma. Puyuma is an endangered Austronesian language spoken in Taiwan. As other languages of this branch, Puyuma is verb initial and displays variations in word order, so that VOS, SVO and VSO are attested. The aim of our study is to explain these word variations. We investigate the connection between information structure, word order and intonation in three Formosan languages: Puyuma, Seediq and Bunun. We show that in Puyuma information structure is reflected in word order while the main function of intonation is to cue phrasing. The study is performed on semi-spontaneous speech.\n",
    "Index Terms: intonation, word order, information structure, phrasing, Puyuma.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-34"
  },
  "audrit12_speechprosody": {
   "authors": [
    [
     "Stéphanie",
     "Audrit"
    ],
    [
     "Tea",
     "Pršir"
    ],
    [
     "Antoine",
     "Auchlin"
    ],
    [
     "Jean-Philippe",
     "Goldman"
    ]
   ],
   "title": "Sport in the media: a contrasted study of three sport live media reports with semi-automatic tools",
   "original": "sp12_127",
   "page_count": 4,
   "order": 36,
   "p1": "127",
   "pn": "130",
   "abstract": [
    "This communication presents a phonostylistic description of sport live media reports, contrasting three different sports, basketball, football ('soccer') and rugby. It is based on 12- minute long recordings for each sport. The corpus is aligned at a phone level with EasyAlign, and manually annotated for the type of event in the game. It is analyzed with ProsoReport and ProsoDyn tools, a set of Praat scripts that aims at detecting in a dynamic way macro-prosodic “ambiance changes” in speech, based on robust relativized prosodic measures (F0, duration, intensity). Dynamic macro-prosodic contrasts between sports show their specificity, as well as what their family resemblance rests on, as contrasted to another speech genre (reading aloud). At the same time, this communication evaluates the semi-automatic ProsoDyn toolkit's robustness on noisy data such as sport live report.\n",
    "Index Terms: sport live report; phono-genre prosody; phonostylistic dynamic description; semi-automatic prosodic description tools\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-35"
  },
  "martin12c_speechprosody": {
   "authors": [
    [
     "Philippe",
     "Martin"
    ]
   ],
   "title": "The autosegmental-metrical prosodic structure: not fit for French?",
   "original": "sp12_131",
   "page_count": 4,
   "order": 37,
   "p1": "131",
   "pn": "134",
   "abstract": [
    "Since two decades at least, intonation phonology is almost exclusively dominated by the Autosegmental-Metrical model, which appears universally appropriate to describe sentence intonation in most languages. However, careful examination of the AM limitations and drawbacks may question this universality, leading way to improve and possibly modify key properties of this theoretical approach, at least for languages such as French.\n",
    "Index Terms: sentence intonation, autosegmental-metrical, ToBI, prosodic structure, French.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-36"
  },
  "asante12_speechprosody": {
   "authors": [
    [
     "Rogers Krobea",
     "Asante"
    ]
   ],
   "title": "Introducing nasalization in Nkonya",
   "original": "sp12_135",
   "page_count": 4,
   "order": 38,
   "p1": "135",
   "pn": "138",
   "abstract": [
    "This paper examines some aspects of nasalization in Nkonya, a Guang language spoken in the mid-part of Volta Region of Ghana, by the use of the framework of autosegmental phonology. It specifically examines the important role of the syllable in explaining the phenomenon of nasalization and also tentatively postulates that the feature [+nasal] is in the process of getting extinct in Nkonya.\n",
    "Index Terms: nasalization, syllable, autosegmental phonology, Nkonya, Guang language family\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-37"
  },
  "chiu12_speechprosody": {
   "authors": [
    [
     "Tzu-Hsuan",
     "Chiu"
    ],
    [
     "Chen-Yu",
     "Chiang"
    ],
    [
     "Yuan-Fu",
     "Liao"
    ],
    [
     "Jyh-Her",
     "Yang"
    ],
    [
     "Yih-Ru",
     "Wang"
    ],
    [
     "Sin-Horng",
     "Chen"
    ]
   ],
   "title": "Prosody-dependent acoustic modeling for Mandarin speech recognition",
   "original": "sp12_139",
   "page_count": 4,
   "order": 39,
   "p1": "139",
   "pn": "142",
   "abstract": [
    "A study on introducing prosodic information to acoustic modeling (AM) for speech recognition is reported in this paper. It extends the conventional context-dependent (CD) triphone HMM modeling approach to further consider the dependency of phone model on the break type of nearby inter-syllable boundary. Four break types are considered, including major break, minor break, normal non-break, and tightly-coupled non-break. In the training phase, break labeling is automatically accomplished by a Prosody Labeling and Modeling algorithm proposed previously. Then, prosody- and phonetic-dependent phone models are constructed by a standard decision tree-based context clustering of HMMs. The effectiveness of the new AM was examined on a Mandarin syllable recognition task. Experimental results showed that the new approach outperformed the conventional CD-AM on achieving better syllable recognition rate as well as on obtaining a more efficient syllable lattice with better compromise on complexity verse syllable coverage rate.\n",
    "Index Terms: acoustic modeling, speech recognition, prosody-dependent acoustic model, prosodic break\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-38"
  },
  "kane12_speechprosody": {
   "authors": [
    [
     "John",
     "Kane"
    ],
    [
     "Irena",
     "Yanushevskaya"
    ],
    [
     "Ailbhe",
     "Ní Chasaide"
    ],
    [
     "Christer",
     "Gobl"
    ]
   ],
   "title": "Exploiting time and frequency domain measures for precise voice source parameterisation",
   "original": "sp12_143",
   "page_count": 4,
   "order": 40,
   "p1": "143",
   "pn": "146",
   "abstract": [
    "Much of our research has focused on the role of the voice source in the prosody of spoken language, including its linguistic and expressive dimensions. However, as automatic methods, both for deriving the voice source and for modelling it tend to lack robustness, we have generally conducted studies on small amounts of speech data. These studies have involved the use of labour intensive methods which require pulse-by-pulse manual fine-tuning. This paper describes a method to model the voice source automatically by taking into account some of the strategies involved in the manual fine-tuning approach. The method combines exhaustive search, dynamic programming and optimisation methods to overcome the known difficulties of standard automatic algorithms. A quantitative evaluation revealed parameter values for the proposed method that were closer to the reference values, than those obtained using a standard timebased method.\n",
    "Index Terms: voice source, LF model, parameterisation, prosody, dynamic programming\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-39"
  },
  "michelas12_speechprosody": {
   "authors": [
    [
     "Amandine",
     "Michelas"
    ],
    [
     "Mariapaola",
     "D'Imperio"
    ]
   ],
   "title": "Specific contribution of tonal and duration cues to the syntactic parsing of French",
   "original": "sp12_147",
   "page_count": 4,
   "order": 41,
   "p1": "147",
   "pn": "150",
   "abstract": [
    "This study addresses the question of the separate contribution of tonal and duration cues in prosodic boundary marking and their effect in syntactic parsing in French. We used pairs of Noun Phrases whose segmental structure was identical but differing in the potential placement of an Accentual Phrase (AP) or Intermediate Phrase (ip) boundary at their right edge. We artificially manipulated the acoustic cues at AP/ip boundaries to obtain a set of stimuli marked either by one type of cue (either tonal or duration cues) or by both indices. In a two forced-choice completion task (PP-choice or VP-choice), participants gave more PP responses when an AP boundary was marked, either by both cues or only by duration indices, relative to when an ip boundary was present. Specifically, for the ip-boundary level to be identified, participants needed the presence of both types of cues to correctly complete the sentence. These results offer a new understanding of the separate role of acoustic cues in prosodic boundary marking.\n",
    "Index Terms: prosodic boundary, syntactic parsing, Intermediate Phrase, Accentual Phrase, preboundary lengthening, pitch accent scaling, French.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-40"
  },
  "brugos12_speechprosody": {
   "authors": [
    [
     "Alejna",
     "Brugos"
    ],
    [
     "Jonathan",
     "Barnes"
    ]
   ],
   "title": "The auditory kappa effect in a speech context",
   "original": "sp12_151",
   "page_count": 4,
   "order": 42,
   "p1": "151",
   "pn": "154",
   "abstract": [
    "Results of a perception experiment show that the size of the pitch difference between spoken words on either side of a pause affects perception of pause duration, demonstrating that the auditory kappa effect can obtain in speech materials. The auditory kappa effect is an illusion whereby, in a sequence of tones and intervening silent intervals, the perception of the duration of the silent intervals is influenced by the relative pitch of the tones, and has previously been demonstrated only using musical or simple (sinusoidal) tones. This study extends these findings to spoken language materials, suggesting that the influence of pitch on the perception of speech timing needs to be further examined. The results of this study, along with studies showing the complex effects of dynamic pitch on perceived duration, are discussed with respect to implications for phonetic measures of prosodic events, such as relative boundary size and syllable lengthening.\n",
    "Index Terms: speech prosody, duration perception, auditory kappa effect, pitch, timing\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-41"
  },
  "cunningham12_speechprosody": {
   "authors": [
    [
     "Aliel",
     "Cunningham"
    ]
   ],
   "title": "Investigating holistic measures of speech prosody through ratings of filtered speech",
   "original": "sp12_155",
   "page_count": 4,
   "order": 43,
   "p1": "155",
   "pn": "158",
   "abstract": [
    "Prosody has been demonstrated to be a key component in second language acquisition and assessment. This study analyzes raters' ability to distinguish different levels of L1 and L2 prosody when listening to filtered speech. The goal of this study is to investigate how many levels of prosodic proficiency can be made when it is isolated in a filtered speech condition. An experiment was conducted with 45 L2 speech sound clips that had been recorded as a part of the OEPT (Oral English Proficiency Test). The test items used for this project included describing a graph in English and reading aloud an academic passage. These L2 English sound clips were produced by native Mandarin speakers at the novice, intermediate, and advanced levels of English proficiency. For control purposes, another 30 sound clips were recorded of L1 Mandarin and L1 English speakers completing the same task - each in their native language. All sound clips were filtered with a low pass filter of a 500 Hz cutoff in Praat 5.1.18. The results indicated a high correlation between the raters' scores in the filtered condition (listening primarily to prosodic components) and the original scores assigned by raters in an unfiltered condition. This reveals a strong link between the stages of second language prosody acquisition and overall L2 proficiency ratings. The results demonstrate that trained raters' can distinguish typologically distinct prosodic systems when listening to filtered speech, as well as make reliable judgments concerning the L2 prosodic proficiency level.\n",
    "Index Terms: filtered speech, trained raters, second language prosody\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-42"
  },
  "hasegawajohnson12_speechprosody": {
   "authors": [
    [
     "Mark",
     "Hasegawa-Johnson"
    ],
    [
     "Elabbas",
     "Benmamoun"
    ],
    [
     "Eiman",
     "Mustafawi"
    ],
    [
     "Mohamed",
     "Elmahdy"
    ],
    [
     "Rehab",
     "Duwairi"
    ]
   ],
   "title": "On the definition of the word “segmental”",
   "original": "sp12_159",
   "page_count": 4,
   "order": 44,
   "p1": "159",
   "pn": "162",
   "abstract": [
    "Textbooks in phonology often specify a distinction between segmental features (e.g., place and manner of articulation) vs. suprasegmental features (stress and phrasing). The distinction between segmental and suprasegmental features is useful even in autosegmental models like Articulatory Phonology, because it distinguishes between features shared by the different instantiations of a phoneme vs. those not so shared. In a model like Articulatory Phonology, however, there is no requirement that a segmental feature should be synchronous with the other features of the same segment. Classification results are provided from Levantine Arabic, showing that features of the primary articulator of a fricative are acoustically signaled during frication, but that features of the secondary articulator are signaled during the preceding and following vowels, suggesting that the definition of the word “segmental” should not require synchronous implementation.\n",
    "Index Terms: Arabic speech processing, distinctive feature classification, phonology, GMM supervector\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-43"
  },
  "wang12b_speechprosody": {
   "authors": [
    [
     "Miaomiao",
     "Wang"
    ],
    [
     "Miaomiao",
     "Wen"
    ],
    [
     "Keikichi",
     "Hirose"
    ],
    [
     "Nobuaki",
     "Minematsu"
    ]
   ],
   "title": "Emotional voice conversion for Mandarin using tone nucleus model – small corpus and high efficiency",
   "original": "sp12_163",
   "page_count": 4,
   "order": 45,
   "p1": "163",
   "pn": "166",
   "abstract": [
    "The GMM-based spectral conversion techniques were applied to emotion conversion but it was found that spectral transformation alone is not sufficient for conveying the required target emotion. In this paper, we adopt the tone nucleus model to carry the most important information of tones and represent F0 contour for Mandarin speech. And then tone nucleus part is converted to emotional speech from neutral ones. The tone nuclei variations are modeled by the classification and regression tree (CART) and dynamic programming. Compared with previous prosody transforming methods, the proposed method 1) uses only the tone nucleus part of each syllable rather than the whole F0 contour to avoid the data sparseness problems in emotion conversion; 2) builds mapping functions for well-chosen tone nucleus model parameters to better capture Mandarin tonal and emotional information. Using only a modest amount of training data, the perceptual accuracy achieved by our method was shown to be comparable to that obtained by a professional speaker.\n",
    "Index Terms: Emotional voice conversion, Mandarin, Tone nucleus\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-44"
  },
  "li12_speechprosody": {
   "authors": [
    [
     "Ya",
     "Li"
    ],
    [
     "Xuefei",
     "Liu"
    ],
    [
     "Xiaoying",
     "Xu"
    ],
    [
     "Jianhua",
     "Tao"
    ]
   ],
   "title": "Assign stress for interrogative sentences via syntax structure mapping",
   "original": "sp12_167",
   "page_count": 4,
   "order": 46,
   "p1": "167",
   "pn": "170",
   "abstract": [
    "Compared to the prosody study in statement-like sentence, little research has been conducted in interrogative sentence, which will definitely improve the naturalness of spoken dialog system. This paper proposes a computational model to assign stress in interrogative sentences using linguistic knowledge. We firstly investigate the interrogative sentences perceptually to label their stress locations and then summarize a series of syntax-stress mapping rules. The dependency syntax is adopted in this work and automatically obtained by Stanford Parser. All the dependency relations in Stanford Parser are studied and stable stress patterns are assigned. Syntax depth is considered as a factor to weight each dependency relation. Finally, the linear superposition of stress score calculated from each dependency relation is assigned to prosodic words. Experiments show that the weighted accuracy of syntax-stress mapping is 74%. A detailed analysis of results is also provided.\n",
    "Index Terms: stress, speech prosody, syntax, interrogative sentence\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-45"
  },
  "hirose12_speechprosody": {
   "authors": [
    [
     "Keikichi",
     "Hirose"
    ],
    [
     "Hiroya",
     "Hashimoto"
    ],
    [
     "Jun",
     "Ikeshima"
    ],
    [
     "Nobuaki",
     "Minematsu"
    ]
   ],
   "title": "Fundamental frequency contour reshaping in HMM-based speech synthesis and realization of prosodic focus using generation process model",
   "original": "sp12_171",
   "page_count": 4,
   "order": 47,
   "p1": "171",
   "pn": "174",
   "abstract": [
    "Frame-by-frame representation is not appropriate for prosodic features, which are tightly related to speech units spreading a wide time span, such as words, phrases and so on. This causes an inherit problem in fundamental frequency (F0) contour generation by HMM-based speech synthesis. Our formerlydeveloped method, which modify generated F0 contours in the framework of the generation process model, is improved to allow plural phrase components in a breath group. Since the model can clearly relate its commands with linguistic (and para-/non- linguistic) information, the method further enables flexible controls of prosody through manipulating model commands. Prosodic focus is realized in HMM-based speech synthesis as a supplemental process; viewing the differences of command magnitudes/amplitudes between utterances without and with focus. Validity of the method was confirmed by listening experiments of synthetic speech.\n",
    "Index Terms: fundamental frequency contour, generation process model, HMM-based speech synthesis, prosodic focus\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-46"
  },
  "yoshizato12_speechprosody": {
   "authors": [
    [
     "Kota",
     "Yoshizato"
    ],
    [
     "Hirokazu",
     "Kameoka"
    ],
    [
     "Daisuke",
     "Saito"
    ],
    [
     "Shigeki",
     "Sagayama"
    ]
   ],
   "title": "Statistical approach to Fujisaki-Model parameter estimation from speech signals and its quantitative evaluation",
   "original": "sp12_175",
   "page_count": 4,
   "order": 48,
   "p1": "175",
   "pn": "178",
   "abstract": [
    "We have previously proposed a statistical model of speech F0 contours, which is based on the discrete-time version of the Fujisaki model. One advantage of this model is that it allows us to introduce statistical methods to learn the Fujisaki-model parameters from speech F0 contours. This paper proposes several modifications to our previous model and parameter inference algorithm, and quantitatively evaluates the performance of our modified parameter inference algorithm.\n",
    "Index Terms: Speech F0 contours, statistical model, Fujisaki model, hidden Markov model, EM algorithm\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-47"
  },
  "obin12_speechprosody": {
   "authors": [
    [
     "Nicolas",
     "Obin"
    ],
    [
     "Christophe",
     "Veaux"
    ],
    [
     "Pierre",
     "Lanchantin"
    ]
   ],
   "title": "Making sense of variations: introducing alternatives in speech synthesis",
   "original": "sp12_179",
   "page_count": 4,
   "order": 49,
   "p1": "179",
   "pn": "182",
   "abstract": [
    "This paper addresses the use of speech alternatives to enrich speech synthesis systems. Speech alternatives denote the variety of strategies that a speaker can use to pronounce a sentence - depending on pragmatic constraints, speaking style, and specific strategies of the speaker. During the training, symbolic and acoustic characteristics of a unit-selection speech synthesis system are statistically modelled with context-dependent parametric models (GMMs/HMMs). During the synthesis, symbolic and acoustic alternatives are exploited using a generalized Viterbi algorithm (GVA) to determine the sequence of speech units used for the synthesis. Objective and subjective evaluations supports evidence that the use of speech alternatives significantly improves speech synthesis over conventional speech synthesis systems.\n",
    "Index Terms: speech synthesis, speech prosody, speech alternatives.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-48"
  },
  "demenko12_speechprosody": {
   "authors": [
    [
     "Grażyna",
     "Demenko"
    ],
    [
     "Magdalena",
     "Jastrzębska"
    ]
   ],
   "title": "Analysis of voice stress in call centers conversations",
   "original": "sp12_183",
   "page_count": 4,
   "order": 50,
   "p1": "183",
   "pn": "186",
   "abstract": [
    "This paper presents how voice stress is manifested in the acoustic and phonetic structure of the speech signal. Out of few thousand authentic Police 997 emergency phone calls, a few hundred were selected automatically according to their duration (dialogs shorter than 3-4 seconds were omitted). Finally, 45 speakers were chosen for acoustic evaluation, the basis for selection being a perceptual assessment. Basic statistical measurements for stressed and neutral speech run over the database showed the relevance of the arousal dimension in stress processing. The MDVP analysis confirmed statistical significance of such parameters as fundamental frequency and pitch variation, noise-to harmonic-ratio, subharmonics and voice irregularities for stress detection. In case of highly stressful conditions a systematic over-one-octave shift in pitch was observed. Linear Discriminant Analysis based on 9 acoustic features showed it is possible to categorize the following classes: male – stressed and neutral, female stressed and neutral speech. Keywords: call centers interfaces, stressed speech, fundamental frequency\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-49"
  },
  "vosoughi12_speechprosody": {
   "authors": [
    [
     "Soroush",
     "Vosoughi"
    ],
    [
     "Deb",
     "Roy"
    ]
   ],
   "title": "A longitudinal study of prosodic exaggeration in child-directed speech",
   "original": "sp12_194",
   "page_count": 4,
   "order": 51,
   "p1": "194",
   "pn": "197",
   "abstract": [
    "We investigate the role of prosody in child-directed speech of three English speaking adults using data collected for the Human Speechome Project, an ecologically valid, longitudinal corpus collected from the home of a family with a young child. We looked at differences in prosody between child-directed and adult-directed speech. We also looked at the change in prosody of child-directed speech as the child gets older. Results showed significant interactions between speech type and vowel duration, mean F0 and F0 range. We also found significant changes in prosody in child-directed speech as the child gets older.\n",
    "Index Terms: prosody,prosodic exaggeration, duration, fundamental frequency, child-directed speech, adult-direct speech, longitudinal, naturalistic, English\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-50"
  },
  "kato12_speechprosody": {
   "authors": [
    [
     "Shuhei",
     "Kato"
    ],
    [
     "Greg",
     "Short"
    ],
    [
     "Nobuaki",
     "Minematsu"
    ],
    [
     "Keikichi",
     "Hirose"
    ]
   ],
   "title": "Effects of learners' language transfer on native listeners' evaluation of the prosodic naturalness of Japanese words",
   "original": "sp12_198",
   "page_count": 4,
   "order": 52,
   "p1": "198",
   "pn": "201",
   "abstract": [
    "For language learners it can be very difficult to speak with- out a non-native accent. This is due to the phenomenon called language transfer. At times, this can decrease the intelligibility of the speech and make it difficult to convey the correct message to the listener. Thus, many learners have a desire to speak more naturally in order not to be misjudged due to their pronuncia- tion. For this, learners should be provided with some knowledge on what kinds of accents cause greater loss in naturalness when native speakers hear learners. In this paper, word utterances with various kinds and degrees of foreign accentedness were synthesized using a technique to morph the prosodic aspect of an utterance. These variously accented utterances were pre- sented to native speakers, who were asked to judge the natural- ness. This paper describes what degrees of prosodic morphing from native Japanese to American Japanese, Chinese Japanese, and Korean Japanese do and do not affect the naturalness per- ceived by Japanese and what kinds of words produced the least loss in naturalness for the non-native speakers.\n",
    "Index Terms: Foreign language learning, foreign accent, Japanese, naturalness, acoustic morphing, listening test\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-51"
  },
  "wang12c_speechprosody": {
   "authors": [
    [
     "Chiung-Yao",
     "Wang"
    ],
    [
     "Cristina",
     "Schmitt"
    ],
    [
     "Yen-Hwei",
     "Lin"
    ]
   ],
   "title": "Children's acquisition of Mandarin tone 3 sandhi in flat structures",
   "original": "sp12_202",
   "page_count": 4,
   "order": 53,
   "p1": "202",
   "pn": "205",
   "abstract": [
    "The goal of this study is to examine children's acquisition of Mandarin Tone 3 Sandhi (T3S) in flat structures. Syllables in flat structures are parsed either in binary feet from left to right, followed by incorporation of an unparsed syllable or in one large prosodic domain [1-3]. We used an elicited production task to examine non-cyclic parsing strategies in T3S application in sequences of two, three, and five digits. 46 children (ages 3 & 5) and 20 adults were tested. The results show that children could apply T3S non-cyclically in digit sequences, although there were over- and under-application errors. In a five-digit sequence, adults (but not children) produced the predicted binary foot followed by a ternary foot. All age groups used an unpredicted pattern made of a ternary foot followed by a binary foot, which challenges the previous account [1-3]. We argue that there is a clear developmental pattern in children's acquisition of T3S in flat structures, and suggest that foot-building in digits does not always follow the typical foot-building process.\n",
    "Index Terms: Mandarin Tone 3 Sandhi, flat structures, prosodic domains, non-cyclic parsing, child language acquisition\n",
    "s M. Y. Chen, Tone sandhi: Patterns across Chinese dialects. Cambridge: Cambridge University Press, 2000. C. Shih, \"The prosodic domain of tone sandhi in Chinese,\" University of California San Diego PhD dissertation, La Jolla, CA, 1986. C. Shih, \"Mandarin third tone sandhi and prosodic structure,\" in Studies in Chinese phonology, N. Smith & J. Wang eds, Berlin: Mouton de Gruyter, 1997, pp. 81-124.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-52"
  },
  "li12b_speechprosody": {
   "authors": [
    [
     "Chuchu",
     "Li"
    ],
    [
     "Candise Y.",
     "Lin"
    ],
    [
     "Min",
     "Wang"
    ],
    [
     "Nan",
     "Jiang"
    ]
   ],
   "title": "The activation of segmental and tonal information in semantic retrieval among Chinese-English bilingual readers",
   "original": "sp12_206",
   "page_count": 4,
   "order": 54,
   "p1": "206",
   "pn": "209",
   "abstract": [
    "Three experiments using Stroop paradigm were designed in which Chinese-English bilinguals were asked to name the ink color of Chinese characters in Chinese in Experiment 1 and in English in Experiment 2 and 3. The visual stimuli were divided into five critical conditions: color characters, homophones of the color characters (S+T+), different-tone homophones (S+T-), characters that shared the same tones but differed in segments with the color character (S-T+), and neutral character (S-T-). Experiment 1 showed significant Stroop facilitation on all congruent conditions, while Experiment 2 only showed color character Stroop effect. In Experiment 3, an ABAB mixed-block design was used in which participants were asked to read Chinese characters in block A and name the ink color of thecharacters in English in block B. Both the congruent and incongruent S+T+ conditions showed a significant Stroop interference effect. These results suggested that in Chinese naming, both tonal information and segmental information is activated, and that Chinese phonological information, including segmental and tonal information, is not activated automatically in naming in English.\n",
    "Index Terms: syllable segment, tone, cross-language activation, bilingual\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-53"
  },
  "liao12_speechprosody": {
   "authors": [
    [
     "Yuan-Fu",
     "Liao"
    ],
    [
     "Yan-Ting",
     "Chen"
    ],
    [
     "Jhen-Lun",
     "Huang"
    ]
   ],
   "title": "Multi-stage feature normalization for robust German stressed/unstressed syllable classification",
   "original": "sp12_210",
   "page_count": 4,
   "order": 55,
   "p1": "210",
   "pn": "213",
   "abstract": [
    "To develop a German computer assisted language learning (CALL) system for students whose mother's tongues are syllable- or mora-timed, a multi-stage feature normalization scheme which takes both word stress and sentence intonation patterns into consideration is proposed for German stressed/unstressed syllable classification. The main idea is to first apply Fujisaki model and band-pass filtering to pitch and energy contours, respectively, to remove the undesired sentence intonation component and sequentially normalize the extracted features in syllable- and supra-segment-level. Comparing with traditional Z-Score feature normalization baseline, the proposed method achieved lower classification error rate (27.04% vs. 31.34%) on “The Kiel Corpus of Read Speech, Vol. I” database. Besides, by integrating decision tree-based feature selection and long-span contextual prosodic cues, the system performance was further improved to 24.68%.\n",
    "Index Terms: prosodic feature normalization, German stressed/unstressed syllable classification, Fujisaki model\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-54"
  },
  "rongna12_speechprosody": {
   "authors": [
    [
     "A.",
     "Rongna"
    ],
    [
     "Ryoko",
     "Hayashi"
    ]
   ],
   "title": "Accuracy of Japanese pitch accent rises during and after shadowing training",
   "original": "sp12_214",
   "page_count": 4,
   "order": 56,
   "p1": "214",
   "pn": "217",
   "abstract": [
    "We conducted a longitudinal study on the effectiveness of shadowing training for Chinese and Mongolian learners of Japanese. The purpose of the present study was to clarify (1) the effect of longitudinal shadowing training for realization of pitch accent, and (2) to discuss if the difference of effectiveness depends on the learners' proficiency level as well as their first language. 15 Japanese as a foreign language (JFL) learners participated in this study. They are divided into two groups according to their level of Japanese proficiency. Each group was instructed to shadow a dialog ten times without seeing a script for three sessions over a seven week period. The results showed that speech rate and accuracy of pitch accent rose significantly after seven weeks in both groups, but each group was different in the ways of improvement.\n",
    "Index Terms: shadowing, JFL learners, pitch accent, Chinese, Mongolian\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-55"
  },
  "ma12b_speechprosody": {
   "authors": [
    [
     "Huiqin",
     "Ma"
    ],
    [
     "Xiaoxiang",
     "Chen"
    ],
    [
     "Xin",
     "Liu"
    ]
   ],
   "title": "A study of tone acquisition in a Mandarin-speaking child under three",
   "original": "sp12_218",
   "page_count": 4,
   "order": 57,
   "p1": "218",
   "pn": "221",
   "abstract": [
    "Abstract How children acquire their L1 has been predicted and explained under different hypotheses. One is the independence hypothesis [1] and the other is the hypothesis of early interaction [2]. The former claimed that L1 development is constrained by biological maturational processes, with no link to perceptual mechanisms, that is, language development is independent of linguistic environment. The latter was that perceptuo-motor attunements already operate in L1 development, so the ambient and environmental effects can be traced from an early age. Our study attempts to explore which perspective is involved in the process. We conduct an investigation on the acquisition of tone in early language development by using longitudinal data of one Mandarin-speaking child living in Changsha. The tonal acquisition process was analyzed from statistical and phonetic aspects to investigate whether Mandarin-learning infants. tonal development reflect universal or language-specific effects. Our findings reveal that the infant gains a full mastery of tone system of Mandarin till she grew to two years old, or even four months later. Also, as the subject gets more exposure to her mother tongue, her tone production gets approaching to adults., which indicates the effect of ambient language. All these lend adequate support for the hypothesis of early interaction.\n",
    "Index Terms: tone acquisition, children under three, southern Mandarin, the hypothesis of early interaction\n",
    "s Lenneberg, E. H. 1967. Biological foundations of language [M]. New York: Wiley. Boysson-Bardies, B. de, Hallé, P., Sagart, L., Durand, C. 1989. A crosslinguistic investigation of vowel informants in babbling [J]. Journal of Child Language 16: 1-17.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-56"
  },
  "mac12_speechprosody": {
   "authors": [
    [
     "Dang-Khoa",
     "Mac"
    ],
    [
     "Véronique",
     "Aubergé"
    ],
    [
     "Eric",
     "Castelli"
    ],
    [
     "Albert",
     "Rilliard"
    ]
   ],
   "title": "Local vs. global prosodic cues: effect of tones on attitudinal prosody in cross- perception of Vietnamese by French",
   "original": "sp12_222",
   "page_count": 4,
   "order": 58,
   "p1": "222",
   "pn": "225",
   "abstract": [
    "Attitudes or social affects are strongly implied in interaction processing, and specifically to socio-cultural aspects of language. In face-to-face interaction, social affects are expressed through global patterns of prosody. This paper presents a cross-perceptual study of social affects in Vietnamese, a tonal language. Sixteen Vietnamese attitudes with tonal variation were used in a perception experiment with French listeners. The result of this perception test was also compared with that of a perception test on non-tonal Vietnamese stimuli. The results show that French listeners can globally process the local prosodic cues of tones together with the global cues of attitude patterns. The main effect of tone is to reinforce, but not change the confusion clustering.\n",
    "Index Terms: attitude, social affect, tone, global prosodic patterns\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-57"
  },
  "zou12_speechprosody": {
   "authors": [
    [
     "Ting",
     "Zou"
    ],
    [
     "Jinsong",
     "Zhang"
    ],
    [
     "Wen",
     "Cao"
    ]
   ],
   "title": "A comparison study on F0 distribution of tone 2 and tone 3 in Mandarin disyllables by native speakers and Japanese learners",
   "original": "sp12_226",
   "page_count": 4,
   "order": 59,
   "p1": "226",
   "pn": "229",
   "abstract": [
    "In the process of Mandarin learning, Japanese students always have problems when distinguishing Tone 2 and Tone 3, especially in connected speech. So, in this paper, we investigate the production of these two tones in disyllable words on the basis of tone-dependent F0 distribution, trying to show the characteristics of native speakers and the systematic error pattern of Japanese. Getting the error pattern of a specific learner group is of great importance in improving teaching method of Mandarin disyllables, and developing computer assisted mandarin pronunciation technology.\n",
    "Index Terms: Mandarin disyllables, tone production, Japanese learners, F0 distribution, tonal range\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-58"
  },
  "chen12_speechprosody": {
   "authors": [
    [
     "Ao",
     "Chen"
    ],
    [
     "René",
     "Kager"
    ]
   ],
   "title": "Lexical tone perception in early infancy",
   "original": "sp12_230",
   "page_count": 4,
   "order": 60,
   "p1": "230",
   "pn": "233",
   "abstract": [
    "In order to shed light on the perceptual reorganization of lexical tones in the first year of life, in the current study, we tested Dutch native infants (6, 9, 11-month-old) on their discrimination of Mandarin Chinese high rising tone (T2) and low-dipping tone (T3) using a visual fixation paradigm. The infants were habituated on multiple tokens produced by two female native speakers, carrying either Mandarin T2 or T3, and were then tested with two test trials in which the same tone as occurred in habituation (same trial), and the other unheard tone (novel trial) alternated. Their looking time to the same trial and the novel trial were used as indicator for discrimination. Contradictory to earlier studies, 6-month-old Dutch infants failed to discriminate between these two tones while on the other hand, 9-month-old and 11-month-old infants succeeded in doing so. However, if the infants were split in two groups according to the habituation tone, only those who were habituated on T3 were able to discriminate the contrast. The results are discussed from the perspectives of acoustical property of the contrast and perceptual bias reflecting T3 sandhi asymmetry.\n",
    "Index Terms: lexical tone, language acquisition, perceptual reorganization\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-59"
  },
  "wu12b_speechprosody": {
   "authors": [
    [
     "Chen-huei",
     "Wu"
    ],
    [
     "Chilin",
     "Shih"
    ]
   ],
   "title": "A corpus study of native and non-native vowel quality",
   "original": "sp12_234",
   "page_count": 4,
   "order": 61,
   "p1": "234",
   "pn": "237",
   "abstract": [
    "This paper investigates foreign accent by comparing vowel production of native speakers, heritage and non-native learners with data from a large corpus of spontaneous Chinese learner speech. Snippets were evaluated by untrained Mandarin raters on accent ratings and followed up with acoustic analysis of vowel qualities.   The rating result showed a high correlation between accent and pronunciation. It is found that it is easier to improve the goodness of pronunciation, but the impression of accent is hard to change. Duration and formant studies reveal that L1 transfer has long-term impact on accent. The vowel [u] produced by second language learners was more fronted than that by native speakers. The vowel [y] is difficult for learners who associate front vowel with unrounding or, alternatively, whose performance falls between [y] and [u]. The formant space of Mandarin low vowels [a] and [ɑ] produced by learners were in the opposite direction from the way native speakers did or were not distinguished. The research findings have implication on language teaching and pronunciation training method.\n",
    "Index Terms: foreign accent, Mandarin vowels, second language acquisition\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-60"
  },
  "white12_speechprosody": {
   "authors": [
    [
     "Donald",
     "White"
    ],
    [
     "Peggy",
     "Mok"
    ]
   ],
   "title": "A preliminary investigation of the effects of study tours on L2 speech rhythm",
   "original": "sp12_238",
   "page_count": 4,
   "order": 62,
   "p1": "238",
   "pn": "241",
   "abstract": [
    "This study is a preliminary investigation of L2 speech rhythm in a study abroad context. Five students from an Englishmedium secondary school in Hong Kong were recorded twice: once before a 16-day study tour to New Zealand, and once after they returned. Both spontaneous speech and read speech were recorded. Several durational speech rhythm metrics were employed to measure utterances from the two sets of recordings (%V, PVI and Varco of vocalic, intervocalic, and syllabic intervals). The results indicate wide individual differences among the students. Two students showed differences in vocalic and syllabic variability while the other three students had no differences between recordings. As for vowel reduction, four out of five students had significant differences in F2 values in read speech after the study tour. One of these four also had significantly different F1 values. The results, as stated, are preliminary and call for further longitudinal study in this area.\n",
    "Index Terms: speech rhythm, L2 acquisition, Cantonese, English\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-61"
  },
  "todd12_speechprosody": {
   "authors": [
    [
     "Richard",
     "Todd"
    ]
   ],
   "title": "On non-native speaker prosody: identifying \"just-noticeable-differences\" of speaker-ethnicity",
   "original": "sp12_242",
   "page_count": 4,
   "order": 63,
   "p1": "242",
   "pn": "245",
   "abstract": [
    "This study tackles the issue of speaker-nativeness and the minimal cues required for determining particular ethnic groups beyond chance level. The work highlights that the heavily marked nature of some L« speakers\" voices make them fairly easy to single out as being foreign, generally. The investigation shows this is not the case for all non-native speakers, as some characteristics may sound quite like those of the native variety. By taking a finely nuanced approach to speaker-nativeness. -ethnicity, the empirical study uncovers which prosodic aspects remain native-like or become most differentiated during emphatic utterances.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-62"
  },
  "wang12d_speechprosody": {
   "authors": [
    [
     "Meng",
     "Wang"
    ],
    [
     "Xia",
     "Wang"
    ],
    [
     "Yuan",
     "Jia"
    ],
    [
     "Honghua",
     "Zhai"
    ]
   ],
   "title": "Prosodic features of the Chinese EFL learners as they express new information",
   "original": "sp12_246",
   "page_count": 4,
   "order": 64,
   "p1": "246",
   "pn": "249",
   "abstract": [
    "The present study investigates the prosodic features of Jinan EFL learners as they express new vs. given information in terms of accent distribution, phrase segmentation and intonation pattern. According to the present study, under the influence of Jinan dialect, the learners produced errors in the accent position, especially within the multi-syllabic words. Compared with the native speakers, they usually read a sentence with more pauses. Furthermore, they tended to use high tone (H*) or falling tone (H*L) to realize the pitch accent, while the native speakers tended to use low tone (L*) or lowrising (L*H) in a simple declarative sentence.\n",
    "Index Terms: Jinan dialect, prosodic features, accent distribution, phrase segmentation, intonation pattern\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-63"
  },
  "barqueroarmesto12_speechprosody": {
   "authors": [
    [
     "Maria Ángeles",
     "Barquero-Armesto"
    ]
   ],
   "title": "A comparative study on accentual structure between Spanish learners of French interlanguage and French native speakers",
   "original": "sp12_250",
   "page_count": 4,
   "order": 65,
   "p1": "250",
   "pn": "253",
   "abstract": [
    "In this paper, we compare the prosodic structure in Spanish learners of French and in French native speakers. For this, we will consider the accentual structure of both speaker groups during the reading, in French, of the same text in the same conditions. We started by looking at some differences between the Spanish stress system and the French stress system in order to compare Spanish learners' productions to those of French native speakers. We then considered different variables such as position of stress, number of accentual phrases (AP), number of phonic groups (PG), number of APs per PG, number of syllables per AP, total number of pauses, average duration of pauses, as well as syllable duration.   The results show that the Spanish learners' group does not have any difficulty moving stress to the final syllable of the AP, but they have not yet acquired the delimitative function of stress and the concept of stress group. These results reflect an intermediate stage of their interlanguage in which they have mastered some characteristics of L2 prosody but the outcome is still far from that of native speakers.\n",
    "Index Terms: speech prosody, interlanguage, L2 French, Spanish learners^\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-64"
  },
  "rude12_speechprosody": {
   "authors": [
    [
     "Markus",
     "Rude"
    ]
   ],
   "title": "Native-like duration ratio of stressed vs. unstressed syllables through visualizing prosody",
   "original": "sp12_254",
   "page_count": 4,
   "order": 66,
   "p1": "254",
   "pn": "257",
   "abstract": [
    "Japanese language learners of stress-timed languages like English (L2) or German (L3) have problems acquiring the prosody of these languages. The questions are, how to teach prosody in this context efficiently, and. specifically. what role visualizations play in the acquisition of accentuation. Therefore a reading experiment was undertaken, as reported here, in which students read out texts in three formats, among them a curved text with prosody-encoding size variations called prosodic writing (PW). In a pre-test, students read a normal text; in a post-test they read PW. Additionally, access possibilities to corresponding audio files varied among students. The following results were obtained for the accentuation of the German word gzentralh [ts.n.tra.l]: (1) there was a substantial increase in correct accentuation among the 15 students reading PW; (2) of these, all five students without access to audio files corrected their accentuation; and (3) for four of these five, the duration ratio of stressed to unstressed syllables approached the ratio of a native speaker (>2:1). Visualizations might therefore be an efficient tool for teaching certain aspects of prosody.\n",
    "Index Terms: speech prosody, prosodic writing (PW), interference, visualization, stressed syllable, duration ratio.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-65"
  },
  "niebuhr12_speechprosody": {
   "authors": [
    [
     "Oliver",
     "Niebuhr"
    ],
    [
     "Patrycja",
     "Jarzabkowska"
    ],
    [
     "Uta",
     "Lorenz"
    ],
    [
     "Christoph",
     "Schulz"
    ],
    [
     "Farhod",
     "Sodigov"
    ]
   ],
   "title": "Say it again, sam! the prosodic profiles of emphatic reduplication in German",
   "original": "sp12_258",
   "page_count": 4,
   "order": 67,
   "p1": "258",
   "pn": "262",
   "abstract": [
    "Our paper presents an initial investigation into the acoustic form and function of emphatic reduplication in German. We found that emphatic reduplications are used to attract attention in order to prepare listeners for important information. Readspeech data elicited on this basis showed that the emphatic reduplications of grade particles and verbal imperatives both start with a prosodic 'ritardando', but differ subsequently in the overall intonation patterns and their association with either decreasing or increasing stress and accent levels.\n",
    "Index Terms: emphasis, reduplication, prosody, German.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-66"
  },
  "gors12_speechprosody": {
   "authors": [
    [
     "Karin",
     "Görs"
    ],
    [
     "Oliver",
     "Niebuhr"
    ]
   ],
   "title": "Hocus focus – how prosodic profiles of contrastive focus emerge and change in different elicitation contexts",
   "original": "sp12_262",
   "page_count": 4,
   "order": 68,
   "p1": "262",
   "pn": "265",
   "abstract": [
    "The results of a production experiment with 8 native speakers of German show that the acoustic profiles of contrastive focus differ between read monologues, read dialogues and spontaneous dialogues. The differences suggest that contrastive focus is only a matter of F0, and that two F0-related subtypes, comparative and corrective focus, may be distinguished. The additional changes in duration and intensity that were found for corrective focus are not due to establishing an informationstructure contrast, but to signaling emphatic reinforcement.\n",
    "Index Terms: focus, information structure, emphasis, German\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-67"
  },
  "schwab12_speechprosody": {
   "authors": [
    [
     "Sandra",
     "Schwab"
    ],
    [
     "Mathieu",
     "Avanzi"
    ],
    [
     "Jean-Philippe",
     "Goldman"
    ],
    [
     "Pascal",
     "Montchaud"
    ],
    [
     "Isabelle",
     "Racine"
    ]
   ],
   "title": "An acoustic study of penultimate accentuation in three varieties of French",
   "original": "sp12_266",
   "page_count": 4,
   "order": 69,
   "p1": "266",
   "pn": "269",
   "abstract": [
    "The aim of this paper is to provide an acoustical account of penultimate accentuation in some varieties of French. We compare stretches of spontaneous speech produced by 8 Swiss speakers (4 Neuchâtel speakers and 4 Wallis speakers, hereafter \"regional varieties\") with the productions of a group of 4 Parisian speakers (hereafter \"standard variety\"). The results of our study show that penultimate accentuation is less frequent in Parisian French than in the Swiss varieties. More interestingly, the study reveals that the phenomenon has different acoustic correlates not only between the standard variety and the regional varieties, but also within the two regional varieties: while Wallis speakers tend to be closer to Parisian speakers using melodic cues to mark their penultimate syllable as prominent, speakers from Neuchâtel tend to prefer using durational cues to do so.\n",
    "Index Terms: penultimate accentuation, accentual phrase, Parisian French, regional French, spontaneous speech.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-68"
  },
  "avanzi12_speechprosody": {
   "authors": [
    [
     "Mathieu",
     "Avanzi"
    ],
    [
     "Lisa",
     "Brunetti"
    ],
    [
     "Cédric",
     "Gendrot"
    ]
   ],
   "title": "Extra-sentential elements, prosodic restructuring, and information structure. a study of clitic-left dislocation in spontaneous French",
   "original": "sp12_270",
   "page_count": 4,
   "order": 70,
   "p1": "270",
   "pn": "273",
   "abstract": [
    "The aim of this study is to discuss the hypothesis according to which prosodic prominence and pragmatic salience are closely related. To do so, we focus on French clitic-left dislocated subjects, namely those constructions where the subject occupies a position in the left periphery and co-refers with a resumptive clitic pronoun within the main clause. Scholars have made the hypothesis that the different degree of prominence of the pitch accent on the last syllable of the dislocated NP depends on the degree of salience in the discourse: the more the topic referent is salient, the less the pitch accent is prominent. We semi-automatically process 101 sentences extracted from spontaneous speech corpora for prosodic and pragmatic analysis. A comparison of the two coding suggests that the mapping between prominence and salience is not that straightforward in spoken French, as it only concerns the class of shift topics. From this we conclude that if prosodic prominence plays any pragmatic role, it is not that of signaling salience, but rather a particular organization of discourse.\n",
    "Index Terms: clitic left dislocation, prosodic phrasing, prosodic restructuring, prominence, topic, salience, spontaneous French\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-69"
  },
  "lee12_speechprosody": {
   "authors": [
    [
     "Albert",
     "Lee"
    ],
    [
     "Yi",
     "Xu"
    ]
   ],
   "title": "Revisiting focus prosody in Japanese",
   "original": "sp12_274",
   "page_count": 4,
   "order": 71,
   "p1": "274",
   "pn": "277",
   "abstract": [
    "This paper revisits Japanese focus prosody by comparing the realization of contrastive focus vs. neutral focus across 4 focus positions and 2 accenthoods. Post-focus F0 Range compression (PFC) is found only in accented stimuli, while focus in unaccented stimuli is marked by Min F0 lowering. Penultimate focus differs from other focus positions, in terms of its post-focus behavior. Intensity and Duration manifest patterns of focus marker distribution comparable to those of F0. These results combined confirm that focus realization interacts closely with accenthood and focus position, and have implications that may enhance our understanding of Japanese pitch accent in general.\n",
    "Index Terms: focus, post-focus compression, Japanese\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-70"
  },
  "rosenberg12_speechprosody": {
   "authors": [
    [
     "Andrew",
     "Rosenberg"
    ],
    [
     "Erica",
     "Cooper"
    ],
    [
     "Rivka",
     "Levitan"
    ],
    [
     "Julia",
     "Hirschberg"
    ]
   ],
   "title": "Cross-language prominence detection",
   "original": "sp12_278",
   "page_count": 4,
   "order": 72,
   "p1": "278",
   "pn": "281",
   "abstract": [
    "We explore the ability to perform automatic prosodic analysis in one language using models trained on another. If we are successful, we should be able to identify prosodic elements in a language for which little or no prosodically labeled training data is available, using models trained on a language for which such training data exists. Given the laborious nature of manual prosodic annotation, such a process would vastly improve our ability to identify prosodic events in many languages and therefore to make use of such information in downstream processing tasks. The task we address here is the detection of intonational prominence, performing experiments using material from four languages: American English, Italian, French and German. While we do find that cross-language prominence detection is possible, we also find significant language-dependent differences. While we hypothesized that language family might serve as a reliable predictor of cross-language prosodic event detection accuracy, in our experiments this did not prove to be the case. Based upon our results, we suggest some directions that may be able to improve our cross-language approach.\n",
    "Index Terms: prosody, prominence, language independence\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-71"
  },
  "ning12_speechprosody": {
   "authors": [
    [
     "Li-Hsin",
     "Ning"
    ],
    [
     "Chilin",
     "Shih"
    ]
   ],
   "title": "Prosodic effects on garden-path sentences",
   "original": "sp12_282",
   "page_count": 4,
   "order": 73,
   "p1": "282",
   "pn": "285",
   "abstract": [
    "A garden-path sentence has temporary ambiguity that a reader or listener need to resolve. Prosody is well-known to have effects on sentence comprehension so it is expected that it will affect the interpretation of garden-path sentences. However, in an auditory comprehension test with natural speech, the garden-path effect may be unclear because a listener can typically resolve the ambiguity and recover from the garden-path effect when the sentence is completed. Therefore, this paper investigates ways to enhance or suppress gardenpath interpretation in Mandarin by manipulating phrasing with pause insertion and pitch reset. The results show that long pause at the garden-path site enhances the garden-path (wrong) interpretation which cannot be undone by pitch reset that encourages the correct phrasing. The most effective way in prosody to enhance the gardenpath effect in Mandarin requires both long pause and high pitch reset.\n",
    "Index Terms: garden-path effect, pause duration, pitch reset, reaction time, sentence comprehension, Mandarin\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-72"
  },
  "wang12e_speechprosody": {
   "authors": [
    [
     "Ling",
     "Wang"
    ],
    [
     "Bei",
     "Wang"
    ],
    [
     "Yi",
     "Xu"
    ]
   ],
   "title": "Prosodic encoding and perception of focus in Tibetan (anduo dialect)",
   "original": "sp12_286",
   "page_count": 4,
   "order": 74,
   "p1": "286",
   "pn": "289",
   "abstract": [
    "The prosodic realization of focus and its perception in Tibetan (Anduo dialect) were experimentally investigated. Using the question-and-answer paradigm, the speakers were asked to read aloud two target sentences in different focus conditions. Systematic acoustic analysis and statistical tests showed that, (1) On-focus F0 was raised sharply in medial and final focus conditions, but not much in initial focus. In addition, post-focus compression (PFC) occurred in initial and medial focus conditions. (2) Duration lengthening was found (about 11%) in focused words, but not in pre-focus or post-focus words. (3) Intensity was increased significantly (about 1.2 dB) in on-focus words, and decreased in post-focus words (about 0.5 dB). (4) In perception, correct focus identification was near 80% for medial focus, 63.3% for final focus, but only about 40% for initial focus. Overall, except for initial focus, the production and perception of focus in Tibetan were similar to those in Mandarin and English. Key words: Tibetan, focus, intonation, perception\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-73"
  },
  "kaland12_speechprosody": {
   "authors": [
    [
     "Constantijn",
     "Kaland"
    ],
    [
     "Emiel",
     "Krahmer"
    ],
    [
     "Marc",
     "Swerts"
    ]
   ],
   "title": "Accentuation as cue for speaker adaptation",
   "original": "sp12_290",
   "page_count": 4,
   "order": 75,
   "p1": "290",
   "pn": "293",
   "abstract": [
    "A spoken interaction can be viewed as a collaborative process between interlocutors. In order to get a smooth exchange of information, speakers tend to adapt their utterances to their addressees. The present study investigates to what extent prosodic accentuation in Dutch may cue whether speakers adapt to each other. It is known that accents in Dutch can be used to highlight whether information is given or new to the discourse. The current study aims to find evidence for the fact that accents as markers of information status can signal successful adaptation between speakers. In particular, the study uses dialogues in which accent distributions are congruent or incongruent with respect to the given-new distinctions across speaking turns to test whether listeners' judgements about partner adaptation are affected. Results indeed show that listeners can attribute such judgements to pitch accent distributions.\n",
    "Index Terms: discourse prosody, contrastive intonation, accentuation, partner adaptation\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-74"
  },
  "tseng12_speechprosody": {
   "authors": [
    [
     "Chiu-Yu",
     "Tseng"
    ],
    [
     "Chao-Yu",
     "Su"
    ]
   ],
   "title": "Temporal characteristics of emphasis in continuous speech",
   "original": "sp12_294",
   "page_count": 4,
   "order": 76,
   "p1": "294",
   "pn": "297",
   "abstract": [
    "The present study examines how global tempo adjustment can reflect the allocation of emphasis, whether emphasis is a local prosodic phenomenon, whether the degree of perceived emphasis corresponds systematically to speech signal, and whether temporal features can be derived from production analysis. Results from acoustic analysis showed positive correlations between perceived emphasis to both local and global tempo modulations; higher emphasis of higher degree corresponds to overall tempo slowing while duration adjustment of individual phones is independent of segmental make-up. To demonstrate how global tempo modulations by utterance from discourse information may affect local tempo adjustment of by words, we normalized all possible effects of discourse factors and found sharper contrasts between emphasis and non-emphasis. The present results suggest that (1) emphasis should not be treated as a local prosodic phenomenon in continuous speech and (2) emphasis can be better understood by degree of contrast.\n",
    "Index Terms: perceived emphasis, temporal features, overall tempo, discourse structure, normalization, continuous speech\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-75"
  },
  "sorianello12_speechprosody": {
   "authors": [
    [
     "Patrizia",
     "Sorianello"
    ]
   ],
   "title": "A prosodic account of Italian exclamative sentences: a gating test",
   "original": "sp12_298",
   "page_count": 4,
   "order": 77,
   "p1": "298",
   "pn": "301",
   "abstract": [
    "This study investigates the intonation of Bari exclamative sentences. In this Southern variety of Italian, the prosodic features of non-wh exclamatives and broad focus statements have been studied in both production and perception. By means of a gating experiment, stimuli of partial or complete utterances were presented to listeners in order to verify the melodic differences between sentence minimal pairs, i.e. exclamative vs. assertive. Results obtained with listeners suggest that the initial f0 pattern has a very strong effect on the perception of exclamatives.\n",
    "Index Terms: Italian language, exclamative sentences, intonation, gating paradigm.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-76"
  },
  "chang12_speechprosody": {
   "authors": [
    [
     "Yung-hsiang Shawn",
     "Chang"
    ],
    [
     "Chilin",
     "Shih"
    ]
   ],
   "title": "Using map tasks to investigate the effect of contrastive focus on the Mandarin alveolar-retroflex contrast",
   "original": "sp12_302",
   "page_count": 4,
   "order": 78,
   "p1": "302",
   "pn": "305",
   "abstract": [
    "A series of map tasks were designed to investigate whether vowel contexts and prosodic prominence may affect the realizations of the alveolar and retroflex sibilants in Beijing Mandarin and Taiwan Mandarin. Results show that the realizations of the sibilants and their contrast varied by vowel context for most speakers, and were selectively subject to prosodic conditioning for only some speakers. The /u/ vowel context was where the alveolar-retroflex contrast was the least distinct and where an enhanced place contrast was achieved for half of the Beijing Mandarin speakers under focus condition. On the other hand, /u/ was the context where some Taiwan Mandarin speakers showed confusion over the place distinction or hypercorrected in response to focal prominence.\n",
    "Index Terms: focus, vowel context, Mandarin alveolar and retroflex sibilants, Beijing Mandarin, Taiwan Mandarin\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-77"
  },
  "kleber12_speechprosody": {
   "authors": [
    [
     "Felicitas",
     "Kleber"
    ],
    [
     "Jonathan",
     "Harrington"
    ],
    [
     "Ulrich",
     "Reubold"
    ],
    [
     "Jessica",
     "Siddins"
    ]
   ],
   "title": "Compensation for coarticulation in prosodically weak words",
   "original": "sp12_306",
   "page_count": 4,
   "order": 79,
   "p1": "306",
   "pn": "309",
   "abstract": [
    "The goal of this study was to compare production differences in consonant-on-vowel coarticulation in accented and unaccented words with the extent to which listeners compensate differently for these coarticulatory effects. Native speakers of German produced nonsense words such as /pʊp/, /pʏp/, /tʊt/, and /tʏt/ that were either accented or unaccented. In a perception experiment, the same speakers made vowel quality judgements in /pʊp-pʏp/ and /tʊt-tʏt/ continua embedded in contexts in which they were prosodically strong or weak. Consonant-on-vowel coarticulation was found to be greater in the production of prosodically weak words. Listeners compensated for these coarticulatory effects in both prosodic conditions to approximately the same extent. These findings indicate that there was a mismatch between the production and perception of coarticulation in unaccented words. The results are discussed in terms of increased likelihood for sound change to occur in prosodically weak contexts.\n",
    "Index Terms: compensation for coarticulation, accentuation, production-perception relationship, sound change\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-78"
  },
  "mady12_speechprosody": {
   "authors": [
    [
     "Katalin",
     "Mády"
    ]
   ],
   "title": "Deaccentuation in Hungarian and its logical background",
   "original": "sp12_310",
   "page_count": 4,
   "order": 80,
   "p1": "310",
   "pn": "313",
   "abstract": [
    "New information in a sentence is expressed by prosodic prominence in many languages. However, the reverse is less obvious: given information and the lack of emphasis do not necessarily go hand in hand. This is especially true of languages that are not flexible with respect to their sentence-internal accentuation patterns, i.e in which a nucleus shift is not (always) possible. Based on predictions in the literature, we investigated whether deaccentuation is obligatory in Hungarian in certain sentence positions. A production and a perception experiment, the latter based on naturalness judgements, showed that the deaccentuation of the verb is obligatory if a focus other than the verb is present in the sentence. Sentence-initial content words were always accented, no matter whether they expressed given information or not, and mismatching patterns did not elicit low naturalness scores in the perception experiment. Our results show that Hungarian utilises deaccentuation in a different way from Indo-European languages: it serves as an expression of logical structure rather than of information structure.\n",
    "Index Terms: deaccentuation, Hungarian, speech prosody, accent, syntax\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-79"
  },
  "sappok12_speechprosody": {
   "authors": [
    [
     "Christopher",
     "Sappok"
    ],
    [
     "Denis",
     "Arnold"
    ]
   ],
   "title": "On the normalization of syllable prominence ratings",
   "original": "sp12_314",
   "page_count": 4,
   "order": 81,
   "p1": "314",
   "pn": "317",
   "abstract": [
    "The instructions under which raters quantify syllable prominence perception need to be simple in order to maintain immediate reactions. This leads to noise in the rating data that can be dealt with by normalization, e.g. setting central tendency = 0 and dispersion = 1 (as in Z-score normalization). Questions arise such as: Which parameter is adequate here to capture central tendency? Which reference distribution should the normalization be based on? In this paper 16 different normalization methods are evaluated. In a perception experiment using German read speech (prose and poetry), syllable prominence ratings were collected. From the rating data 16 complete “mirror” data-sets were computed according to the 16 methods. Each mirror data-set was correlated with the same set of measures from the underlying acoustic data, focusing on raw syllable duration which is seen as a rather straightforward acoustic aspect of syllable prominence. Correlation coefficients could be raised considerably by selected methods.\n",
    "Index Terms: syllable prominence, syllable duration, perception experiment, normalization, read speech, German\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-80"
  },
  "you12_speechprosody": {
   "authors": [
    [
     "Hie-Jung",
     "You"
    ]
   ],
   "title": "Determining prominence and prosodic boundaries in Korean by non-expert rapid prosody transcription",
   "original": "sp12_318",
   "page_count": 4,
   "order": 82,
   "p1": "318",
   "pn": "321",
   "abstract": [
    "This paper examines how non-expert listeners perceive prominence and prosodic boundaries in Korean using the Rapid Prosody Transcription (RPT) method, developed by Mo, Cole and Lee [9] for American English. While prominence is used to mark prosodically salient or “highlighted” words and phrases, prosodic boundaries demarcate units or “chunks” of speech to mirror the hierarchical relations among prosodic structures. Confirming the findings of earlier studies on American English, nonexpert transcribers of Korean show agreement rates that are well above chance and, show higher agreement rates for prosodic boundaries than prominence. Korean listeners not only perceive prosodic boundaries at sentence-level boundaries corresponding to Intonation Phrase (IP) boundaries in the Korean Tones and Break Indices (ToBI) system, but also at clausal-level boundaries. The findings suggest that cues to boundaries are more salient than cues to prominences in Korean. For the perception of prominence, Korean listeners seem to orient to different cues including prosodic, syntactic and lexical information.\n",
    "Index Terms: speech perception, prosody, Korean prosodic phonology, Rapid Prosody Transcription\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-81"
  },
  "mahrt12_speechprosody": {
   "authors": [
    [
     "Tim",
     "Mahrt"
    ],
    [
     "Jennifer",
     "Cole"
    ],
    [
     "Margaret",
     "Fleck"
    ],
    [
     "Mark",
     "Hasegawa-Johnson"
    ]
   ],
   "title": "Modeling speaker variation in cues to prominence using the Bayesian information criterion",
   "original": "sp12_322",
   "page_count": 4,
   "order": 83,
   "p1": "322",
   "pn": "325",
   "abstract": [
    "This study investigated speaker variation in the production of various acoustic cues of prominence, including duration and in- tensity measures. The Bayesian Information Criterion was used to specify a threshold distinction between cues that are linearly vs. piece-wise linearly predictors of the degree of perceived prominence. For all speakers, some features are linear and some features are discrete in the manner in which they cue promi- nence. However, the results also suggest that speakers differ in the number of prominence distinctions that they make. Under a metrical stress notion of hierarchically layered prominence, our result would suggest that some speakers do not exploit the full range of prominence distinctions offered in English.\n",
    "Index Terms: speech prosody, prominence, Bayesian Informa- tion Criterion, speaker variation, corpus linguistics\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-82"
  },
  "ardali12_speechprosody": {
   "authors": [
    [
     "Mortaza Taheri",
     "Ardali"
    ],
    [
     "Yi",
     "Xu"
    ]
   ],
   "title": "Phonetic realization of prosodic focus in Persian",
   "original": "sp12_326",
   "page_count": 4,
   "order": 84,
   "p1": "326",
   "pn": "329",
   "abstract": [
    "It has been repeatedly observed that focus substantially changes the sentence prosody in many languages not only by increasing F0, duration, and intensity on the focused components but also by compressing the pitch range and intensity of post-focus elements. However, it is not yet fully clear in Persian what the main effect of focus is on pre-focus, on-focus and post-focus elements. To achieve this goal, we have embarked on a full-scale investigation of the phonetic realization of prosodic focus in Persian. The findings of this study reveal that focus dramatically changes the three regions. F0 and duration has significantly increased in on-focus words without any significant change in intensity. Compared to their counterparts, pre-focus elements show weaker intensity but no change in duration and mean F0. Finally post-focus words show significant lowering of F0 and decrease of intensity. The duration of post-focus words remains intact. Thus, according to the present data, it can be concluded that Persian, like English and Mandarin, falls into the category of PFC (postfocus compression) languages.\n",
    "Index Terms: on-focus, pre-focus, post-focus, F0, intensity, duration, post-focus compression, PFC, Persian\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-83"
  },
  "schwab12b_speechprosody": {
   "authors": [
    [
     "Sandra",
     "Schwab"
    ]
   ],
   "title": "Do native Spanish speakers transfer accentual acoustic properties from Spanish to French L2?",
   "original": "sp12_330",
   "page_count": 4,
   "order": 85,
   "p1": "330",
   "pn": "333",
   "abstract": [
    "The aim of this research is to examine whether Spanish speakers transfer some accentual acoustic properties from Spanish to French L2. Native Spanish learners of French and native speakers of French were instructed to read French sentences containing a trisyllabic target pseudoword. In some sentences, the pseudoword was in a stressed position, while in others it was in an unstressed position. Acoustic analysis (duration, F0 and amplitude) were performed on the three vowels of the pseudoword, as well as on the first vowel following the pseudoword. Results showed that Spanish speakers have acquired the knowledge that, contrary to Spanish, stress is fixed in French (on the last syllable), but not that stress is realized at the accentual phrase level rather than at the word level as in Spanish.\n",
    "Index Terms: accentual transfer, Spanish L1, French L2, acoustic parameters, syllabic structure.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-84"
  },
  "lin12_speechprosody": {
   "authors": [
    [
     "Candise Y.",
     "Lin"
    ],
    [
     "Min",
     "Wang"
    ]
   ],
   "title": "The role of lexical knowledge and stress cues in segmentation in second language learners of English",
   "original": "sp12_334",
   "page_count": 4,
   "order": 86,
   "p1": "334",
   "pn": "337",
   "abstract": [
    "This study compared the use of lexical knowledge and stress cues in segmentation by Mandarin second language (L2) of English. Previous research has shown that native English speakers reliably use lexical cues but not stress cues. However, L2 learners may have difficulty using lexical knowledge in segmentation due to their limited vocabulary size. Instead, Mandarin L2 learners may rely on stress cues since Mandarin and English are similar in terms of their stress patterns. Using a cross-modal priming task, results showed that both the native listeners and L2 learners responded faster to initial-stressed target words than final-stressed target words, showing evidence to the use of stress cues in segmentation. No evidence of the use of lexical knowledge was found. It appears that there is cross-linguistic influence of the use of stress cues in segmentation by L2 learners.\n",
    "Index Terms: stress, segmentation, second language learning, spoken word recognition, lexical knowledge\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-85"
  },
  "vargas12_speechprosody": {
   "authors": [
    [
     "Fabián Santiago",
     "Vargas"
    ],
    [
     "Elisabeth",
     "Delais-Roussarie"
    ]
   ],
   "title": "Acquiring phrasing and intonation in French as second language: the case of yes-no questions produced by Mexican Spanish learners",
   "original": "sp12_338",
   "page_count": 4,
   "order": 87,
   "p1": "338",
   "pn": "341",
   "abstract": [
    "In this paper, we propose a study of the final contours and the prosodic structure observed in yes-no questions in French as an L2. Our study consists in a cross-comparison of utterances recorded in French and Spanish in various settings, and produced by 15 Mexican Spanish learners of French (L2), 10 French speakers and 10 Mexican speakers. In the learner s' productions, the intonational structure obtained may display some characteristics of their L1: (i) the final contour consists in an extra-high F0 rise, and (ii) the internal prosodic structure at the level of the Prosodic Word (PWD) is not clearly marked. By contrast, in the utterances realized by the French native speakers, it is clear that the form of the final contour is less important than phrasing. These findings prove that the acquisition of phrasing is more important than the acquisition of tonal patterns in French as an L2.\n",
    "Index Terms: acquisition of prosody in L2, intonation, prosodic phrasing.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-86"
  },
  "yeh12b_speechprosody": {
   "authors": [
    [
     "Chia-Hsin",
     "Yeh"
    ],
    [
     "Chi-Jui",
     "Lu"
    ]
   ],
   "title": "The effect of language attrition on low level tone in Hakka",
   "original": "sp12_342",
   "page_count": 4,
   "order": 88,
   "p1": "342",
   "pn": "345",
   "abstract": [
    "This study examines the sound change of low level tone in Hakka, and compares the change with similar tonal mergers in Cantonese and Taiwanese. The Hakka low level tone largely merges into low-falling tone, and the effect of language attrition is hypothesized as the main factor. Three perception tasks and one production task were conducted on three groups of Hakka speakers: young attriters, young speakers, and older speakers. The results show that the low level tone was the least accurate category in all tasks, and there is a significant difference between fluent speakers and attriters. In addition, young speakers confuse low level tone with low-falling tone only in the production task, but not in the perception ones. The perception-production asymmetry, however, is not found in older speakers. The findings suggest that the effect of language attrition is responsible for the tonal change, and that the phonetic and lexical factors should also be considered to account for the asymmetry.\n",
    "Index Terms: first language attrition, low level tone, sound change, perception-production asymmetry, Hai-lu Hakka\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-87"
  },
  "liu12_speechprosody": {
   "authors": [
    [
     "Liquan",
     "Liu"
    ],
    [
     "René",
     "Kager"
    ]
   ],
   "title": "Non-native tone perception from infant to adult: how consistent and flexible is it?",
   "original": "sp12_346",
   "page_count": 4,
   "order": 89,
   "p1": "346",
   "pn": "349",
   "abstract": [
    "Dutch infants and adults are tested on their discrimination of a lexical tone contrast in Mandarin Chinese and a manipulated tone contrast differing solely in acoustic salience. Results show homogeneous tone discrimination pattern between adults and infants as early as 8-9 months. Specifically, Dutch infants and adults discriminate acoustic salient tonal contrast. When the salience is weakened, Dutch adults and infants after tonal perceptual reorganization phase fail to discriminate the non-native contrast. Their sensitivity is however enhanced with the help of statistical learning or training effect, showing the flexibility of non-native tone perception.\n",
    "Index Terms: speech perception, tone, infant, adult\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-88"
  },
  "schwab12c_speechprosody": {
   "authors": [
    [
     "Sandra",
     "Schwab"
    ],
    [
     "Joaquim",
     "Llisterri"
    ]
   ],
   "title": "The role of the acoustic correlates of stress in the perception of Spanish accentual contrasts by French speakers",
   "original": "sp12_350",
   "page_count": 4,
   "order": 90,
   "p1": "350",
   "pn": "353",
   "abstract": [
    "The aim of this research is to examine the role of the acoustic correlates of lexical stress in the integration of accentual information in French speakers. A shape/pseudoword matching task is used, as it implies not only a low-level acoustic processing, but also a lexical processing. Results show, on the one hand, an influence of the accentual pattern in the perception of stress; on the other, they suggest that French speakers' accentual representations seem to be more rigid than the native Spanish ones.\n",
    "Index Terms: stress deafness, lexical stress contrasts, acoustic correlates, French, Spanish L2.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-89"
  },
  "qiu12_speechprosody": {
   "authors": [
    [
     "ChunAn",
     "Qiu"
    ]
   ],
   "title": "Tone sandhi patterns of Zhenjiang dialect",
   "original": "sp12_354",
   "page_count": 4,
   "order": 91,
   "p1": "354",
   "pn": "357",
   "abstract": [
    "This study presents an acoustic analysis of the citation tones and tone sandhi patterns of bisyllables in Zhenjiang dialect with an attempt to provide an empirical data for the theoretical study of tone sandhi patterns of Zhenjiang dialect. The results demonstrate that this dialect has five citation tones, i.e., Tone1 (42), Tone2 (35), Tone3 (32), Tone4 (55) and Tone5 (5). The acoustic realization of the first syllable, a falling tone, exhibits a more complex pattern than the one previous study has found. This study also examines neutral tone syllables, and proposes that the neutralization of the second syllables results from the assimilation effect of the preceding syllable.\n",
    "Index Terms: Zhenjiang dialect, citation tone, tone sandhi, neutral tone\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-90"
  },
  "he12_speechprosody": {
   "authors": [
    [
     "Xuliang",
     "He"
    ],
    [
     "Judith",
     "Hanssen"
    ],
    [
     "Vincent J. van",
     "Heuven"
    ],
    [
     "Carlos",
     "Gussenhoven"
    ]
   ],
   "title": "Mandarin-accented fall, rise and fall-rise F0 contours in Dutch",
   "original": "sp12_358",
   "page_count": 4,
   "order": 92,
   "p1": "358",
   "pn": "361",
   "abstract": [
    "An experiment was conducted to study how Mandarin Chinese speakers of Dutch produced three Dutch pitch contours (Fall, Rise and Fall-rise) on final syllables in the intonational phrase. It was found that the Fall-Rise was the hardest contour for them to produce. In addition, there were substantial differences between the subjects with higher and those with lower proficiency in Dutch in the realization of the Fall and the Rise, which the higher proficiency subjects produced much as did the native control group.\n",
    "Index Terms: Mandarin speakers of Dutch, Mandarin, Dutch, prosody, intonation contours\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-91"
  },
  "do12_speechprosody": {
   "authors": [
    [
     "Hue San",
     "Do"
    ],
    [
     "Hussein",
     "Hussein"
    ],
    [
     "Hansjörg",
     "Mixdorff"
    ],
    [
     "Oliver",
     "Jokisch"
    ],
    [
     "Hongwei",
     "Ding"
    ],
    [
     "Qianyong",
     "Gao"
    ],
    [
     "Si",
     "Wei"
    ],
    [
     "Guoping",
     "Hu"
    ]
   ],
   "title": "Evaluation of benefits from a computer-aided pronunciation training system for German learners of Mandarin Chinese",
   "original": "sp12_362",
   "page_count": 4,
   "order": 93,
   "p1": "362",
   "pn": "365",
   "abstract": [
    "The paper reports on the benefits of a computer-aided phonetic learning system for German learners of Mandarin. In the current study seven German first-year students of Mandarin Chinese participated in a test run of the phonetic training software. The students took four training units of 30 minute each within a week where they practiced their pronunciation and vocabulary with the software. A test was conducted before and after training in which the students read aloud both Mandarin Chinese disyllables of different tone combinations and words as well as sentences which they have encountered before when using the software. The corpus consisted of 25 tokens which were used in both tests, i.e. before and after the training with the software. The speech signals were recorded and then annotated by an expert regarding syllable components (initial, final and tone). The correctness of the syllable components and tone combinations, confusion partners and F0 parameters of Mandarin tones were compared before and after the training. Ten native speakers of Mandarin rated the degree of foreign accent and intelligibility. The results based on the annotations of an expert, analysis of F0 parameters of Mandarin tones and rating of accent and intelligibility show that the German learners yielded more accurate results of initial, final and tone after having practiced with the phonetic training tool.\n",
    "Index Terms: Computer-Aided Language Learning (CALL), Mandarin tones, prosodic analysis\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-92"
  },
  "qin12b_speechprosody": {
   "authors": [
    [
     "Zhen",
     "Qin"
    ],
    [
     "Peggy",
     "Mok"
    ]
   ],
   "title": "The perception of speech and non-speech tones by tone and non-tone language listeners",
   "original": "sp12_366",
   "page_count": 4,
   "order": 94,
   "p1": "366",
   "pn": "369",
   "abstract": [
    "This study tested how linguistic experience and psychoacoustic factors affect tonal perception of Mandarin, English and French speakers. AX discrimination tasks of speech and non-speech tones were conducted. Results showed that the subjects performed differently in the speech and nonspeech tasks. In the speech task, while the three L1 groups shared some confusable tone pairs due to their acoustical similarity, they differed in specific pairs under the influence of L1 linguistic experience. In the non-speech task, however, the three L1 groups did not have different error patterns of individual pairs. In short, both L1 experience and psychoacoustic similarity of stimuli were found to have an impact on the perception of non-native tones.\n",
    "Index Terms: Tone perception, Linguistic experience, Psychoacoustic similarity, Cross-Linguistic study.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-93"
  },
  "chen12b_speechprosody": {
   "authors": [
    [
     "Xiaoxiang",
     "Chen"
    ],
    [
     "Hongmin",
     "Zhang"
    ],
    [
     "Xiaojing",
     "Xie"
    ]
   ],
   "title": "A study on college non-English majors' acquisition of English stress placement",
   "original": "sp12_370",
   "page_count": 4,
   "order": 95,
   "p1": "370",
   "pn": "373",
   "abstract": [
    "This study is to investigate the acquisition of the English stress system by Chinese adult second language learners whose native language is of a different type from that of English. In the present study, twenty college non-English majors participated in three tasks. Three factors or exactly syllabic structure, lexical class, and stress patterns of known words contributing to the acquisition of English stress system were investigated. First, the participants produced 40 nonwords of different syllabic structures as nouns and verbs in two sentence frames. Second, they were asked to indicate their preference for the first or second syllable stress on the same 40 nonwords. Last, they were asked to write down the real English words they considered to be phonologically similar to the 40 nonwords. The results indicate that syllables with long vowels are likely to attract more stress than syllables with short vowels. Bi-syllabic nouns are likely to receive more first syllable stress than verbs. Analysis of variance on the production and perception data indicated that both syllabic structure and lexical class have an effect on stress placement. In the regression analysis of the three factors, all have significant and unique contribution to the stress placement, with stress pattern of phonological similar real words having the greatest influence. The results showed that phonological theories on English stress placement should consider multiple, competing, probabilistic factors in accounts of main stress placement including syllabic structure, lexical class, and stress patterns of phonologically similar words.\n",
    "Index Terms: stress placement; syllabic structure; lexical class; phonological similar words\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-94"
  },
  "ding12_speechprosody": {
   "authors": [
    [
     "Hongwei",
     "Ding"
    ],
    [
     "Oliver",
     "Jokisch"
    ],
    [
     "Rüdiger",
     "Hoffmann"
    ]
   ],
   "title": "A phonetic investigation of intonational foreign accent in Mandarin Chinese learners of German",
   "original": "sp12_374",
   "page_count": 4,
   "order": 96,
   "p1": "374",
   "pn": "377",
   "abstract": [
    "This study investigates the possible errors related to intonational foreign accent of Mandarin Chinese learners of German. 12 Chinese learners of different levels were asked to read 16 German sentences with typical tonal contours twice: for the first time reading utterances together with the communication intentions were presented; for the second time, additional information of accented syllables was also provided. Two German native speakers also participated in the production experiment as references. Some of the sentences were then assessed by native German listeners. Acoustic measures were conducted to analyze the production of 416 short sentences and phrases. Results show that the foreign accent of Mandarin Chinese learners of German can be attributed to incorrect placement and different phonetic realization of tonal categories, higher beginning pitch levels, more frequent and much greater pitch changes, as well as improper inserted pauses and unaccented syllables. Findings can provide implications for cross language studies and foreign language education.\n",
    "Index Terms: German intonation, Mandarin Chinese learners, intonational foreign accent\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-95"
  },
  "ding12b_speechprosody": {
   "authors": [
    [
     "Hongwei",
     "Ding"
    ]
   ],
   "title": "Perception and production of Mandarin disyllabic tones by German learners",
   "original": "sp12_378",
   "page_count": 4,
   "order": 97,
   "p1": "378",
   "pn": "381",
   "abstract": [
    "This study investigates the possible deviations related to Mandarin disyllabic tone perception and production by German speakers. Nine German subjects are involved in both perception and production tests. The stimuli of tone perception consist of 40 disyllabic words uttered by a standard professional Chinese speaker. These words are also employed as reading material in the production experiment. Statistical analysis and acoustic measures have been carried out to find out the tonal performance of the German learners. Results show that their perception performance is best with the falling tone and worst with the rising tone, although there are some differences between the first and the second syllables. However the production performance exhibits different patterns, each subject has his or her preferred tonal combination. often independent of the target tones. It is further observed that these German subjects are reluctant to produce the second syllable of a disyllabic word in a falling tone. Findings can provide some implications for cross linguistic study and second language acquisition.\n",
    "Index Terms: Mandarin disyllabic words, German learners, learning Chinese tones\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-96"
  },
  "crocco12_speechprosody": {
   "authors": [
    [
     "Claudia",
     "Crocco"
    ],
    [
     "Jens",
     "Baele"
    ]
   ],
   "title": "YN questions in L2 Italian of Dutch speaking learners",
   "original": "sp12_382",
   "page_count": 4,
   "order": 98,
   "p1": "382",
   "pn": "385",
   "abstract": [
    "In this paper we analyze the position of the elbow point L in a corpus of YN questions produced by Dutch speaking learners of Italian with five different competence levels in L2. The analysis shows that latency values increase in the groups with higher competence level in L2, confirming the preliminary results obtained in previous work on dialogical speech. The analysis also shows a strong inter-speaker variability, which has been tentatively attributed to the input received by the students in their learning context.\n",
    "Index Terms: intonation, YN questions, L2, Belgian Dutch, Flemish, Italian, elbow.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-97"
  },
  "turco12_speechprosody": {
   "authors": [
    [
     "Giuseppina",
     "Turco"
    ],
    [
     "Michele",
     "Gubian"
    ]
   ],
   "title": "L1 prosodic transfer and priming effects: a quantitative study on semispontaneous dialogues",
   "original": "sp12_386",
   "page_count": 4,
   "order": 99,
   "p1": "386",
   "pn": "389",
   "abstract": [
    "This paper represents a pilot investigation of accentuation patterns produced by advanced Dutch speakers of Italian as a second language (L2). Contrastive accent patterns within phrases were elicited in a semi-spontaneous dialogue entertained with a confederate native speaker of Italian. The aim of the analysis was to compare learners' contrastive accentual configurations induced by the confederate speaker's prime against those produced by Italian and Dutch natives in the same testing conditions. F0 and speech rate data were analysed by applying powerful data-driven techniques available in the Functional Data Analysis statistical framework. Results reveal different accentual configurations in L1 and L2 Italian in response to the confederate's prime. We conclude that learner's accentual patterns mirror those ones produced by their L1 control group (prosodic-transfer hypothesis), although the hypothesis of a transient priming effect on learners' choice of contrastive patterns cannot be completely ruled out.\n",
    "Index Terms: prosodic transfer, (semi)spontaneous speech, priming, Function Data Analysis, Principal Component Analysis\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-98"
  },
  "yang12_speechprosody": {
   "authors": [
    [
     "Bei",
     "Yang"
    ]
   ],
   "title": "How do pauses reveal linguistic plans by L2 learners of Chinese?",
   "original": "sp12_390",
   "page_count": 4,
   "order": 100,
   "p1": "390",
   "pn": "393",
   "abstract": [
    "This study explores L2 learners' linguistic plans through silent and filled pauses, such as “uh”. Seven native speakers and seven American learners of Chinese participated in this study. They produced speech naturally on pre-provided topics. One minute and fifteen seconds of speech on a single topic produced by each participant was used for analysis in the present research. First, the distribution of pauses was calculated. Then a qualitative analysis of the L2 learners' speech data was conducted. The results indicate that most chunks that native speakers plan ahead of time are larger than those that L2 learners do. The combinations of silent and filled pauses, and combinations of pauses and other prosodic features provide additional time for L2 learners to plan their speech and to make their speech more natural. During the first-time planning or self-monitoring, L2 learners spend much more time on planning chunks that only involve a single linguistic entry.\n",
    "Index Terms: L2 acquisition, production, psycholinguistics\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-99"
  },
  "na12b_speechprosody": {
   "authors": [
    [
     "Hu",
     "Na"
    ],
    [
     "Jia",
     "Yuan"
    ],
    [
     "Liu",
     "Bin"
    ]
   ],
   "title": "Phonetic and phonological realization of narrow focus in English declarative sentences by Zhenjiang EFL learners",
   "original": "sp12_394",
   "page_count": 4,
   "order": 101,
   "p1": "394",
   "pn": "397",
   "abstract": [
    "Focus is of communication function in discourse. How it is realized by native speakers has long been in vigorous discussion. However, studies on focus concerning language learners are few, with the ones taking dialects into account even fewer. This study takes eight Zhenjiang dialect speakers as the subjects and investigates if their phonetic and phonological realization of narrow focus in English declarative sentences is distinct from native English speakers'. Detailed F0 inspection reveals that Zhenjiang EFL learners' pitch range of the unstressed syllable(s) in the focused word is suppressed more greatly than the native speakers'. Besides, their F0 contours may not always peak on the on-focus stressed syllable as native English speakers'. Moreover, the scope of post-focus suppression seems to include only the unstressed syllables in the focused words, but not all post-focus words.\n",
    "Index Terms: prosody, focus, Zhenjiang EFL learners\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-100"
  },
  "nesterenko12_speechprosody": {
   "authors": [
    [
     "Irina",
     "Nesterenko"
    ]
   ],
   "title": "Prosody perception in L1 and L2",
   "original": "sp12_398",
   "page_count": 4,
   "order": 102,
   "p1": "398",
   "pn": "401",
   "abstract": [
    "The present work deals with the perception of prosodic structure in conversational speech by naïve listeners in L1 and L2. Native speakers of Russian and French-speaking subjects with high proficiency in Russian took part in a prosody transcription experiment. After evaluating inter-transcriber agreement, we analyse the interplays between the distributions of perceived prosodic prominences and boundaries and discuss the influences of prosodic patterns specific to listeners' native language.\n",
    "Index Terms: Prosody perception, Prosody transcription, Spontaneous Speech, L2.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-101"
  },
  "hackman12_speechprosody": {
   "authors": [
    [
     "Dorothea J.",
     "Hackman"
    ]
   ],
   "title": "Perception of focus prosody in the English speech of Bangou speakers",
   "original": "sp12_402",
   "page_count": 4,
   "order": 103,
   "p1": "402",
   "pn": "405",
   "abstract": [
    "Southern Standard British English (SSBE) listeners of four conditions of focus in the English, Pidgin and Bamileke Bangou speech of multilinguals from Cameroon living in London. The aim is to examine the influence of the first language (L1) systems on the acquisition of English focus prosody. While the SSBE listeners could identify the focus conditions intended by the SSBE speakers, they could not do so for the Cameroon speakers.   The investigation utilised recordings from a set of materials using football team names, developed to maintain lexical consistency across languages, as part of a wider examination of acoustic cues used by Cameroon speakers for focus signaling in their English, Pidgin and Bangou speech. This contributes to the discussion of how acquisition of prosodic features in a second language (L2) relates to the role of the feature in the L1.\n",
    "Index Terms: focus prosody, language contact, cross linguistic perception, feature hypothesis.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-102"
  },
  "obin12b_speechprosody": {
   "authors": [
    [
     "Nicolas",
     "Obin"
    ],
    [
     "Mathieu",
     "Avanzi"
    ],
    [
     "Guri",
     "Bordal"
    ],
    [
     "Alice",
     "Bardiaux"
    ]
   ],
   "title": "Regional variations of speech rhythm in French: in search of lost times",
   "original": "sp12_406",
   "page_count": 4,
   "order": 104,
   "p1": "406",
   "pn": "409",
   "abstract": [
    "This paper addresses the relevance of speech rhythm acoustic measures for the description of some standard, regional and contact varieties of French. First, the limitation of conventional speech rhythm measures (e.g. %V, ƒ¢C or PVI) for the description of French regional variations is pointed out. Then, alternative acoustic measures of speech rhythm, based on supra-segmental characteristics associated with timing (regularity of accentual phrases) and tempo (articulation rate, speech rate) are introduced and discussed. A comparison with the conventional measures proves that long-term measures provide a classification which is more consistent with the expected classification, either in terms of continuous similarities or typological differences.\n",
    "Index Terms: speech rhythm, rhythm metric, regional French, in-contact French, accentual phrase, articulation rate, speech rate.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-103"
  },
  "chen12c_speechprosody": {
   "authors": [
    [
     "Ying",
     "Chen"
    ],
    [
     "Susan",
     "Guion-Anderson"
    ],
    [
     "Yi",
     "Xu"
    ]
   ],
   "title": "Post-focus compression in second language Mandarin",
   "original": "sp12_410",
   "page_count": 4,
   "order": 105,
   "p1": "410",
   "pn": "413",
   "abstract": [
    "Post-focus compression (PFC) of F0 and intensity is found in Beijing Mandarin and has been claimed not to easily transfer in language contact. Two experiments were conducted to investigate the presence of PFC in second language (L2) Mandarin as a function of learners' language experience. Five groups of L2 Mandarin learners were investigated: older, midage and younger Quanzhou Southern Min learners, and American Chinese-heritage and non-Chinese-heritage learners. Findings were that older speakers of Quanzhou Southern Min did not show PFC in their Mandarin, but younger speakers did perhaps because of more extensive Mandarin use. Non- Chinese-heritage American learners did not produce PFC in their Mandarin, but Chinese-heritage learners did, perhaps because they had been exposed to Mandarin at an earlier age.\n",
    "Index Terms: prosodic focus, post-focus compression, L2 Mandarin, language experience\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-104"
  },
  "sichelbazin12_speechprosody": {
   "authors": [
    [
     "Rafèu",
     "Sichel-Bazin"
    ],
    [
     "Carolin",
     "Buthke"
    ],
    [
     "Trudel",
     "Meisenburg"
    ]
   ],
   "title": "Language contact and prosodic interference: nuclear configurations in Occitan and French statements of the obvious",
   "original": "sp12_414",
   "page_count": 4,
   "order": 106,
   "p1": "414",
   "pn": "417",
   "abstract": [
    "This paper examines the intonation of statements of the obvious in two varieties in narrow contact, Occitan and Southern French. They are contrasted with Northern French that has developed independently. As a consequence of intense contact, conservative Southern French speakers use the same rising-falling nuclear configuration as in Occitan, whereas Northern French speakers display a rising pattern that ends in a short high plateau. Less conservative Southern French speakers, who show a tendency towards standard French, also tend to adopt the Northern French pattern but may maintain the rising-falling accent of the Occitan/Southern French contour.\n",
    "Index Terms: intonation, language contact, prosodic interference, Occitan, French, obviousness\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-105"
  },
  "boulademareuil12_speechprosody": {
   "authors": [
    [
     "Philippe",
     "Boula de Mareüil"
    ],
    [
     "Albert",
     "Rilliard"
    ],
    [
     "Paolo",
     "Mairano"
    ],
    [
     "Jean-Pierre",
     "Lai"
    ]
   ],
   "title": "Corsican French questions: is there a prosodic transfer from Corsican to French and how to highlight it?",
   "original": "sp12_418",
   "page_count": 4,
   "order": 107,
   "p1": "418",
   "pn": "421",
   "abstract": [
    "This study investigates whether a prosodic transfer can be highlighted from Corsican (an Italo-Romance language) to French spoken in Corsica, where French is now the dominant language. A corpus of transparent sentences such as la touriste trouve la caserne (French) or a turista trova a caserna (Corsican) was designed and the productions of bilingual speakers, recorded in Corsica, were compared with the French counterparts of Parisian reference speakers. The melody of yes/no questions turns out to contrast Corsican and Corsican French (both with high tones followed by final pitch falls) and standard French (with utterance-final high tones). The former pattern can be interpreted as a prosodic transfer from Corsican to French. Various methods are considered to validate this hypothesis and an experimental paradigm is proposed.\n",
    "Index Terms: prosody in contact, questions, Corsican accent in French, endangered languages\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-106"
  },
  "shin12_speechprosody": {
   "authors": [
    [
     "Jeonghwa",
     "Shin"
    ],
    [
     "Shari R.",
     "Speer"
    ]
   ],
   "title": "English lexical stress and spoken word recognition in Korean learners of English",
   "original": "sp12_422",
   "page_count": 4,
   "order": 108,
   "p1": "422",
   "pn": "425",
   "abstract": [
    "Two experiments explore how Korean-speaking L2 learners of English process English lexical stress during spoken word recognition. Korean doesn't employ lexical-level prosodic distinctions like English lexical stress, but it has phrase-level prosodic structure ((T) HLH), with the initial tone determined by the phonation type of phrase-initial sound. Results from eye-tracking and gating experiments showed slower processing times and lower accuracy for Korean learners' processing of English lexical stress information during word recognition compared to native English speakers. Processing difficulty was greater for iambic than for trochaic words, and time-course data indicate that processing difficulty increased between initial contact with the target word and the completion of word recognition. Post-hoc analyses of the eye tracking data also revealed that Korean L2 learners' word recognition was facilitated when the stress pattern matched the Korean tonal pattern induced by the word-initial phonation type contrast. Taken results together, the study implies that Korean L2 learners' processing of English lexical stress is modulated by both the processing strategy and constraints from perceptual experience with L1 phrase-level prosody.\n",
    "Index Terms: lexical stress, phrase-level prosody, L1 transfer\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-107"
  },
  "bartkova12b_speechprosody": {
   "authors": [
    [
     "Katarina",
     "Bartkova"
    ],
    [
     "Anne",
     "Bonneau"
    ],
    [
     "Vincent",
     "Colotte"
    ],
    [
     "Mathilde",
     "Dargnat"
    ]
   ],
   "title": "Productions of continuation \"contours\" by French speakers in L1 (French) and L2 (English)",
   "original": "sp12_426",
   "page_count": 4,
   "order": 109,
   "p1": "426",
   "pn": "429",
   "abstract": [
    "The goal of the present paper is to study interference between French and English prosody. In order to study the influence of the prosody on the second language pronunciation, F0 slopes and vowel durations of the last syllables of prosodic groups were measured and analyzed in the pronunciation of French native speakers speaking French and English, and of English native speakers speaking English. Significant differences appear in our data between the use of F0 slopes by French speakers speaking English and the use of F0 slopes by English native speakers: most of the time, nonnative English production of F0 slopes is closer to French prosody than to English native prosody. For non-native (French speakers) vowel duration values are generally different from vowel durations in French data. However, they are somehow closer to values produced by English native speakers.\n",
    "Index Terms: prosodic interference of L1 and L2, continuation F0 slopes, vowel duration.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-108"
  },
  "german12_speechprosody": {
   "authors": [
    [
     "James Sneed",
     "German"
    ]
   ],
   "title": "Dialect adaptation and two dimensions of tune",
   "original": "sp12_430",
   "page_count": 4,
   "order": 110,
   "p1": "430",
   "pn": "433",
   "abstract": [
    "Adaptation to an unfamiliar dialect of one's native language presents a special case for prosodic learning, since most other aspects of the grammar are held constant. This study explores the representation of two dimensions of tune through a series of experimental tasks in which speakers of American English attempt to directly imitate and then generalize the dialectal features of a native speaker of Glasgow English. The results show that speakers are able to modify both f0 peak timing and f0 excursion in order to approximate the target dialect, and that they do so both during direct imitation and when generalizing to new sentences. The findings suggest that peak timing and excursion are not only represented differently, but that learning progresses differently for the two dimensions in going from direct imitation to generalization.\n",
    "Index Terms: dialect learning, intonation, peak alignment\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-109"
  },
  "martin12d_speechprosody": {
   "authors": [
    [
     "Philippe",
     "Martin"
    ]
   ],
   "title": "Prosodic similarities in French spoken in the Mascareignes",
   "original": "sp12_434",
   "page_count": 4,
   "order": 111,
   "p1": "434",
   "pn": "437",
   "abstract": [
    "Sentence intonation of spontaneous French spoken in Mauritius and Reunion Island presents intriguing similarities. In both varieties, the realization of the so-called continuation majeure present sharp melodic rises with glissando values exceeding 70 semitones/s, whereas values below 40 semitones/s are generally found in most other varieties of French. This similarity exists despite the fact that both Mauritius and Reunion Island are separated by some 250 km of sea, and that both islands have known different languages of administration, English and French, which preludes a language in contact effect.   This paper presents and discusses various hypotheses to explain the origin of this prosodic peculiarity maintained in both islands: was it an heritage of first French settlers in the XVIIIth century, the effect of a common substrate of African languages spoken by slaves, or a melodic variation spontaneously created as part of creole? The validation of one of these hypotheses is not straightforward, given that varieties of French spoken in other regions presenting similar historical characteristics may apparently present the same remarkable melodic feature.\n",
    "Index Terms: sentence prosody, continuation majeure, intonation, Mauritius, Reunion Island.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-110"
  },
  "benet12_speechprosody": {
   "authors": [
    [
     "Ariadna",
     "Benet"
    ],
    [
     "Christoph",
     "Gabriel"
    ],
    [
     "Elena",
     "Kireva"
    ],
    [
     "Andrea",
     "Pešková"
    ]
   ],
   "title": "Prosodic transfer from Italian to Spanish: rhythmic properties of L2 speech and Argentinean Porteño",
   "original": "sp12_438",
   "page_count": 4,
   "order": 112,
   "p1": "438",
   "pn": "441",
   "abstract": [
    "This paper investigates the speech rhythm of Porteño (Buenos Aires) Spanish (PORTE), which is strongly influenced by Italian due to migration-induced contact, and L2 Peninsular Spanish, produced by Italian natives (SPA L2). It is hypothesized that Italian learners transfer the rhythmic values of their L1 to the target language Spanish and that the data produced by speakers of both the contact variety PORTE and the learner variety SPA L2 exhibit rhythmic values that pattern with Italian rather than with Peninsular Spanish. Speakers of L1 Peninsular Spanish (SPA L1) and L1 Italian (ITA), respectively, serve as control groups. Based on measurements of %V, Varcoƒ¢V, VnPVI, and CnPVI ([1], [2], [3], [4]), performed on recordings of scripted and semispontaneous speech, it is shown that Porteno Spanish displays almost the same values as L1 Italian and L2 Spanish produced by Italian natives. This suggests that Italian speech rhythm was transferred from the immigrants'f L1 to the target language Spanish.\n",
    "Index Terms: speech rhythm, Porteño Spanish, Peninsular Spanish, Italian, language contact, L2, transfer.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-111"
  },
  "bordal12_speechprosody": {
   "authors": [
    [
     "Guri",
     "Bordal"
    ],
    [
     "Mathieu",
     "Avanzi"
    ],
    [
     "Nicolas",
     "Obin"
    ],
    [
     "Alice",
     "Bardiaux"
    ]
   ],
   "title": "Variations in the realization of the French accentual phrase in the light of language contact",
   "original": "sp12_442",
   "page_count": 4,
   "order": 113,
   "p1": "442",
   "pn": "445",
   "abstract": [
    "In this paper we discuss French prosody in the light of language contact. Data of three contact varieties of French are compared with two varieties spoken in monolingual contexts. The data are semi-automatically processed, and three prosodic features are analyzed: metrical weight of the Accentual Phrases (AP), respect of AP formation constraints, and realizations of sandhi phenomena. Rhythmic constraints and speech rate measurements are also considered. Our findings suggest that the contact varieties share several features with word prosodic systems.\n",
    "Index Terms: French Prosody, Accentual Phrase, Language contact, Lexical Prosody, Prominence, Tones\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-112"
  },
  "zerbian12_speechprosody": {
   "authors": [
    [
     "Sabine",
     "Zerbian"
    ]
   ],
   "title": "Markedness in the prosody of contact varieties of South African English",
   "original": "sp12_446",
   "page_count": 4,
   "order": 114,
   "p1": "446",
   "pn": "449",
   "abstract": [
    "It has been widely observed in the literature that not only learner varieties but also contact varieties differ in their prosody from the standard variety. The article aims at providing a unified account to the linguistic variation in prosodic focus marking found across learner and contact varieties of the same language, South African English. The notion of markedness allows singling out prosodic focus marking as a likely target of linguistic change given its crosslinguistic complexity in sentence accent systems.\n",
    "Index Terms: sentence accent, markedness, focus, givenness\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-113"
  },
  "lin12b_speechprosody": {
   "authors": [
    [
     "Hsin-Yi",
     "Lin"
    ],
    [
     "Janice",
     "Fon"
    ]
   ],
   "title": "Prosodic and acoustic features of emotional speech in taiwan Mandarin",
   "original": "sp12_450",
   "page_count": 4,
   "order": 115,
   "p1": "450",
   "pn": "453",
   "abstract": [
    "The present study investigated pitch and durational cues of emotional speech in Taiwan Mandarin. Acted connected speech in anger, joy, sorrow, fear and neutral emotions were recorded. Results showed that F0 height and speech rate were more correlated with the arousal dimension, which differentiate emotions of high arousal, such as anger and joy, from low arousal ones. On the other hand, final lengthening was shown to distinguish emotions of different valences. Negative emotions, such as anger and sorrow, had longer lengthening than positive ones. In addition, instead of using the size code, speakers of Taiwan Mandarin mainly utilize arousal cues in cueing anger, which was shown through raised pitch register and earlier peak alignment.\n",
    "Index Terms: prosodic cues, pitch, duration, emotional speech, Taiwan Mandarin\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-114"
  },
  "lee12b_speechprosody": {
   "authors": [
    [
     "Sungbok",
     "Lee"
    ],
    [
     "Shrikanth",
     "Narayanan"
    ]
   ],
   "title": "Effects of emotion on the lower lip movements at phrase boundaries",
   "original": "sp12_454",
   "page_count": 4,
   "order": 116,
   "p1": "454",
   "pn": "457",
   "abstract": [
    "In this preliminary report we investigate the effects of emotion on the lower lip movements during the production of a monosyllabic word in two different prosodic contexts: phrase initial and phrase final. The purpose is to examine the rigidity of the phrase boundary effects under emotional perturbation of the normal, or neutral, speech production. It is found that the effect of emotion is ubiquitous in that it affects all kinematic and dynamic parameters of the lower lip movements considered in this study. The effects of emotion are not arbitrary, however, and some common characteristics of emotional speech articulation can be identified. Firstly, speakers maintain the phrase boundary effects on the duration and movement amplitude of the lower lip gesture under emotional variations. Secondly, when considering all emotion types together in a given speaker, an approximately linear relationship holds between movement amplitudes and maximum lip opening velocities when emotion varies. Therefore, the stiffness of the lower lip opening gestures seems almost invariant under emotional variations, implying that the lower lip gesture is regulated by a simple harmonicoscillator like system with a constant stiffness. These and other findings support the hypothesis that speech production constraints imposed by the phrase boundary condition are maintained against emotional perturbations of speech articulations. In addition, the findings in the study may point to a general emotional speech production mechanism that the effects of emotion on the kinematics and dynamics of the oral speech articulators are manifested mainly in the arousal dimension of emotion.\n",
    "Index Terms: emotion, lip movement, stiffness, phrase boundary\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-115"
  },
  "rottger12_speechprosody": {
   "authors": [
    [
     "Timo B.",
     "Röttger"
    ],
    [
     "Rachid",
     "Ridouane"
    ],
    [
     "Martine",
     "Grice"
    ]
   ],
   "title": "Sonority and syllable weight determine tonal association in Tashlhiyt Berber",
   "original": "sp12_458",
   "page_count": 4,
   "order": 117,
   "p1": "458",
   "pn": "461",
   "abstract": [
    "We investigated the alignment of F0 peaks in disyllabic target words in polar questions and contrastive statements in Tashlhiyt Berber, concentrating on cases where both syllables contained a sonorant nucleus. Peak location, interpreted as H tone association, is not only determined by the communicative function of the utterance, but also by sonority and syllable weight, with a preference for more sonorous segments and heavy syllables. This work confirms earlier findings on Intonation Phrase medial tones in this language, and sheds further light on the interaction of sonority and weight as determining factors in tonal association.\n",
    "Index Terms: Tashlhiyt Berber, intonation, polar questions, sonority, syllable weight\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-116"
  },
  "mok12_speechprosody": {
   "authors": [
    [
     "Peggy",
     "Mok"
    ],
    [
     "Donghui",
     "Zuo"
    ]
   ],
   "title": "Effects of tone merging and musical training on Cantonese tone perception",
   "original": "sp12_462",
   "page_count": 4,
   "order": 118,
   "p1": "462",
   "pn": "465",
   "abstract": [
    "This study investigates whether musical training can facilitate lexical tone perception of native speakers of a tone language. Some Cantonese tone pairs, T2/T5 (rising), T3/T6 (level), T4/T6 (falling vs level) are merging in recent years. The merging subjects have poorer general tone perception than the control subjects. Previous studies showed that musical training facilitates lexical tone perception of non-tone language speakers. However, it is unclear if musical training can also influence tone perception of native speakers of tone-languages who are merging tones. Three groups of listeners (normal Cantonese, merging Cantonese, foreign) with and without advanced musical training participated in AX discrimination tasks of Cantonese tones and pure tones. Both accuracy and reaction time data show that while musical training can enhance lexical tone perception of foreign listeners, it has little influence on merging Cantonese listeners. The results indicate that different perceptual mechanisms may be involved in linguistic and musical tone perception, and that the linguistic use of tones is more fundamental and more robust than musical training.\n",
    "Index Terms: music training, tone perception, tone merging, Cantonese\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-117"
  },
  "he12b_speechprosody": {
   "authors": [
    [
     "Lei",
     "He"
    ]
   ],
   "title": "Syllabic intensity variations as quantification of speech rhythm: evidence from both L1 and L2",
   "original": "sp12_466",
   "page_count": 4,
   "order": 119,
   "p1": "466",
   "pn": "469",
   "abstract": [
    "In this study, three intensity metrics (ΔS.dB, VarcoS.dB and nPVI.dB) devised on the basis of the well-known durational metrics were tested on both L1 (English and Mandarin) and L2 (L2 English). The results suggested that they were effective in distinguishing “stress-timed” English from perceptually “syllable-timed” Mandarin and L2 English (by Mandarin speakers). These metrics break the impasse that although the L1 and L2 varieties of English were similar on durational measurements, they were perceptually different in rhythmicity. Therefore, it is advised that intensity metrics be applied in future rhythm research.\n",
    "Index Terms: rhythm, intensity, English, Mandarin, L1, L2\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-118"
  },
  "govind12b_speechprosody": {
   "authors": [
    [
     "D.",
     "Govind"
    ],
    [
     "S. R. Mahadeva",
     "Prasanna"
    ],
    [
     "B.",
     "Yegnanarayana"
    ]
   ],
   "title": "Significance of glottal activity detection for duration modification",
   "original": "sp12_470",
   "page_count": 4,
   "order": 120,
   "p1": "470",
   "pn": "473",
   "abstract": [
    "The objective of the present work is to demonstrate the signif- icance of glottal activity (GA) detection for duration modifica- tion. The accurate GA regions of the speech are derived using zero frequency filtered signal (ZFFS) obtained from zero fre- quency filtering (ZFF) of speech. The duration of the speech is modified according to the desired scaling factors from the epochs estimated using ZFF method. Initially, the duration modified speech is synthesized using the existing epoch based fast duration modification method by processing all the epochs present in the original speech. The final duration modified speech is derived by retaining the duration modified speech samples of the GA regions and original speech samples in the non-GA regions. The improved perceptual quality of the dura- tion modified speech is confirmed from the waveforms, spectro- grams and subjective evaluations.\n",
    "Index Terms: Duration modification, epochs, zero frequency filtering, glottal activity detection\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-119"
  },
  "meireles12_speechprosody": {
   "authors": [
    [
     "Alexsandro Rodrigues",
     "Meireles"
    ],
    [
     "Viviany de Paula",
     "Gambarini"
    ]
   ],
   "title": "Rhythm typology of Brazilian Portuguese dialects",
   "original": "sp12_474",
   "page_count": 4,
   "order": 121,
   "p1": "474",
   "pn": "477",
   "abstract": [
    "This paper analyzes the speech rhythm of three Brazilian Portuguese dialects under the light of a coupled oscillator approach to rhythm typology. The data showed a scale from a less stress-timed to a more stressed-timed dialect as follows: Minas Gerais state (coupling strength = 1.83, speech rate = 6.3) > São Paulo state (1.66, 6.6) > Bahia state (1.26, 5.9) > Espírito Santo state (0.95, 4.8). Also, the results show that stress-timing seems to be associated to faster rates. Finally, the theoretical background used here, Barbosa's speech rhythm model, is capable of being sensible to linguistic variations such as speaking styles, speech rates, syntactic structures, and text knowledge.\n",
    "Index Terms: speech rhythm, speech rate, rhythm typology, stress and syllable timing.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-120"
  },
  "wu12c_speechprosody": {
   "authors": [
    [
     "Qian",
     "Wu"
    ],
    [
     "Bei",
     "Wang"
    ],
    [
     "Xiaxia",
     "Zhang"
    ]
   ],
   "title": "Effect of topic structure and sentence length on pause in Mandarin Chinese: comparing female with male speakers",
   "original": "sp12_478",
   "page_count": 4,
   "order": 122,
   "p1": "478",
   "pn": "481",
   "abstract": [
    "This paper studied effects of topic structure and sentence length on acoustic parameters at intonational phrases boundaries, comparing female and male speakers. Twenty native speakers of Mandarin Chinese read 12 short discourses Cwhich contained two sentences. The second sentence was either short or long. And, the transition between the two sentences was either topic continuation, topic elaboration or topic shift, by varying the second sentence. Extensive acoustic analysis showed that [1] for the female speakers, both topic structure and sentence length had significant effects on pause duration and pitch reset, but not on final lengthening, whereas for the male speakers, only sentence length had such an effect. [2] A negative correlation between pause duration and pre-boundary lengthening was found for both the female and the male speakers. However, a positive correlation between pause duration and pitch reset was found only for the females, but not for the males. In general, the female speakers used combined acoustic cues for marking topic structure, whereas the male speakers did not mark topic structure systematically. Effect of sentence length on pause duration is robust while all the other conditions are controlled.\n",
    "Index Terms: topic structure, sentence length, pause, pitch reset, final lengthening\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-121"
  },
  "mairano12_speechprosody": {
   "authors": [
    [
     "Paolo",
     "Mairano"
    ],
    [
     "Antonio",
     "Romano"
    ]
   ],
   "title": "Testing the perception of speech rhythm on natural and artificial stimuli",
   "original": "sp12_482",
   "page_count": 4,
   "order": 123,
   "p1": "482",
   "pn": "485",
   "abstract": [
    "It has long been assumed that the stress-timed vs. syllabletimed dichotomy is based on perceptual impressions of speech rhythm. However, experimental tests are rare in the literature and not all of them have successfully found perceptual evidence for speech rhythm categorization. Experimental protocols have been very different, sometimes testing naïve vs. non-naïve listeners, sometimes using natural speech stimuli, sometimes preferring synthetic stimuli, sometimes using filters to hide lexical information from speech. In this paper we describe the results of a perceptive test that has been carried out on 43 Italian listeners, who were asked to categorize both natural and artificial stimuli. Results are highly controversial: listeners do not seem to be able to categorize artificial stimuli reproducing prosodic cues of different languages. Yet, there is a mild tendency on the part of speakers to categorize natural speech stimuli of unknown languages in a way that seems to reflect rhythm classes.\n",
    "Index Terms: speech prosody, speech rhythm, perceptive test, natural stimuli, artificial stimuli.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-122"
  },
  "yoon12_speechprosody": {
   "authors": [
    [
     "Tae-Jin",
     "Yoon"
    ],
    [
     "Karin",
     "Humphreys"
    ]
   ],
   "title": "Speech rhythm and timing of a speech-impaired speaker",
   "original": "sp12_486",
   "page_count": 4,
   "order": 124,
   "p1": "486",
   "pn": "489",
   "abstract": [
    "We made quantitative rhythmic and timing measurements on speech samples obtained a 61 year-old monolingual female English speaker who is reported to have required a rare but possible case of Foreign Accent Syndrome (FAS). The phonetic characteristics of speech produced by individuals with FAS affects both suprasegmental and segmental properties. We used a large scale of speech samples to overcome difficulties of comparison due to the lack of speech samples before the accident. The results showed that the speaker has greater variability than control speakers, and that speech rate is slower, but that the rhythmic patterns were more to the stress timed. The results imply that the greater variability of the rhythmic and timing patterns in the speech-impaired speaker can be used as a means of identifying areas of speech production in the speech-impaired speaker.\n",
    "Index Terms: disordered speech, Foreign Accent Syndrome (FAS), speech rhythm, tempo, rhythm metrics, speech rate\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-123"
  },
  "hamzah12_speechprosody": {
   "authors": [
    [
     "Hilmi",
     "Hamzah"
    ],
    [
     "John",
     "Hajek"
    ],
    [
     "Janet",
     "Fletcher"
    ]
   ],
   "title": "A taste of prosody: possible effects of the word-initial singleton-geminate contrast on post-consonantal vowel duration in Kelantan Malay",
   "original": "sp12_490",
   "page_count": 4,
   "order": 125,
   "p1": "490",
   "pn": "493",
   "abstract": [
    "The present study examines possible temporal effects of the word-initial geminate consonant contrast in Kelantan Malay (KM) beyond the duration of the target consonant itself. We are interested in identifying any duration interactions with following vowels that could potentially enhance the acoustic salience of geminate consonants, in particular word-initial voiceless geminate stops. Results indicate that postconsonantal vowel duration can vary as a function of preceding consonant length and according to prosodic context. This is especially the case for post-consonantal low central vowels in utterance-medial position in which vowel duration is significantly shorter following geminate stops. Although the effect was not consistent across all speakers, the results agree with findings from other languages in that durational effects of geminate timing extend to adjacent segments as well as to much larger stretches of utterance.\n",
    "Index Terms: geminate, duration, vowel quantity, Malay\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-124"
  },
  "govind12c_speechprosody": {
   "authors": [
    [
     "D.",
     "Govind"
    ],
    [
     "S.",
     "Mahanta"
    ],
    [
     "S. R. Mahadeva",
     "Prasanna"
    ]
   ],
   "title": "Significance of duration in the prosodic analysis of Assamese",
   "original": "sp12_494",
   "page_count": 4,
   "order": 126,
   "p1": "494",
   "pn": "497",
   "abstract": [
    "The objective of the present work is to demonstrate the significance of duration in the context of phonological Focus of Assamese. Focus refers to that part of sentence which expresses assertion, putting more emphasis on that part of the sentence which introduces new information. The present work considers subject object verb (SOV) type declarative sentences in wide, object and subject focus cases for the study. Speech data was collected from native Assamese speakers in all the three types of focus. Manual duration analysis was carried for all the speech data. It was observed that compared to wide focus, the duration reduces in the object and subject focus cases. Even though the overall duration reduction in object and subject focuses is nearly same, the amount of reduction is different for subject (S), object (O) and verb (V) parts. The duration modification of wide focus speech according to the duration modification factors of either object or subject focus confirms that duration indeed influences the realization of focus.\n",
    "Index Terms: Focus, duration modification, SOV, wide focus, object focus and subject focus\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-125"
  },
  "lee12c_speechprosody": {
   "authors": [
    [
     "Wai-Sum",
     "Lee"
    ]
   ],
   "title": "Temporal organization of syllable production in the speech of Cantonese-speaking children",
   "original": "sp12_498",
   "page_count": 4,
   "order": 127,
   "p1": "498",
   "pn": "501",
   "abstract": [
    "The paper investigates the temporal structures of three types of syllables, CV:, CVN, and CVV (C = [p ph ts tsph s], V: = [a.], VN = [an], VV = [ai]), in Cantonese. Results of a temporal analysis of the speech samples from two 9- to 10-year-old Cantonese-speaking children are as follows. First, the durations of the syllable-initial consonants and the following rime are not negatively correlated, as there is no temporal compensation involved within the sequence of the initial consonant and rime. It is assumed that the initial consonant and rime within a syllable are not programmed as a single articulatory unit (Lehiste [1]). The rime however has a tendency to be slightly shorter after the aspirated [pph] and [tsph] than after the unaspirated counterparts [p] and [ts]. Second, the duration of the vowel [a] of [an] and [ai] is about one half of the duration of the vowel [a:] of CV: syllables, suggesting the occurrence of compensatory shortening of the vowel duration when [a:] occurs in other syllable types. This in turn suggests that the rime [an] and the diphthong [ai] are programmed as a single articulatory unit. Third, the temporal data in this study support Lehiste's contention ([1]) that there is a closer connection between a vowel and a following consonant than between an initial consonant and a following vowel. Lastly, the patterns of temporal organization of syllable production for children are similar to those for adults, indicating that children of middle childhood at 9 to 10 years of age have acquired the adult-like temporal patterns.\n",
    "Index Terms: temporal organization, syllable production, Cantonese, children of middle childhood\n",
    "s Lehiste, I., “Temporal organization of spoken language”, in L.L. Hammerich, et al. [Ed.], Form & Substance: Phonetic and Linguistic Papers Presented to Eli Fischer-Jørgensen, 159-169. Copenhagen: Akademisk Forlag, 1971.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-126"
  },
  "benus12_speechprosody": {
   "authors": [
    [
     "Štefan",
     "Beňuš"
    ],
    [
     "Juraj",
     "Šimko"
    ]
   ],
   "title": "Rhythm and tempo in Slovak",
   "original": "sp12_502",
   "page_count": 4,
   "order": 128,
   "p1": "502",
   "pn": "505",
   "abstract": [
    "We present the first quantitative analysis of rhythm in Slovak, using two speech corpora designed to exhibit rich prosodic variability including extreme variation in speaking rate and articulatory precision. Several standard consonant and vocalic interval measures show a close similarity of Slovak rhythmic structure with languages traditionally considered syllabletimed, but suggest counter-intuitive dissimilarities with closely related Czech. Additionally, our data highlight strong dependency of these measures on speech material, speaker and tempo. Overall, our results shed further doubt on the usefulness of CV interval measures in speech rhythm research.\n",
    "Index Terms: speech tempo, rhythm, Slovak\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-127"
  },
  "hubler12_speechprosody": {
   "authors": [
    [
     "Stephan",
     "Hübler"
    ],
    [
     "Rüdiger",
     "Hoffmann"
    ]
   ],
   "title": "A study on the metrical structure of music with similarity experiments",
   "original": "sp12_506",
   "page_count": 4,
   "order": 129,
   "p1": "506",
   "pn": "509",
   "abstract": [
    "This study explains the metrical hierarchical structure of music that deals with onsets of musical events and the distances between them. The metrical structure is essential for the temporal organization of notes and the perception of rhythm. The paper shows the suitability of inter onset interval histograms to cover major metrical characteristics such as dominant metrical levels, regularity and onset density of a musical piece. Furthermore, experiments on automatic music similarity retrieval demonstrate the usefulness of the inter onset interval histogram for real world applications. The user chooses one song of a music collection for which he wants to get similar songs. The retrieval system sorts all other songs of the music collection according to the similarity of metrical properties to the given song. The results support the suitability of the histogram feature to retrieve similar songs within a rhythmic music collection.\n",
    "Index Terms: music, rhythm, metrical structure, inter onset interval histogram, music similarity retrieval\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-128"
  },
  "dorn12_speechprosody": {
   "authors": [
    [
     "Amelie",
     "Dorn"
    ],
    [
     "Maria",
     "O'Reilly"
    ],
    [
     "Ailbhe",
     "Ní Chasaide"
    ]
   ],
   "title": "A preliminary analysis of speech rhythm in three varieties of Irish (gaelic)",
   "original": "sp12_510",
   "page_count": 4,
   "order": 130,
   "p1": "510",
   "pn": "513",
   "abstract": [
    "This paper gives a preliminary account of speech rhythm characteristics for the three main dialects of Irish (Donegal, Connemara and Kerry Irish). The analysis is based on a short read passage. The segmental level Pairwise Variability Index metrics (rCPVI, nVPVI) indicate that Irish groups with stresstimed languages. At the level of the syllable and the foot, results suggest that Irish has irregular syllable structure, but more regular foot size. Only minor differences emerged among the dialects.\n",
    "Index Terms: rhythm, intonation, Irish (Gaelic)\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-129"
  },
  "schellenberg12_speechprosody": {
   "authors": [
    [
     "Murray",
     "Schellenberg"
    ]
   ],
   "title": "The neutralization of tone-related duration differences in sung Cantonese",
   "original": "sp12_514",
   "page_count": 2,
   "order": 131,
   "p1": "514",
   "pn": "515",
   "abstract": [
    "Cantonese compositional processes reflect register information about lexical tone and Cantonese singers add in contour information about tome while singing. This paper examines whether the singers also carry over durational differences associated with tone into sung Cantonese. 11 native speakers were recorded singing a specially composed song in Cantonese which included a six way minimal set by tone on the syllable [si]. Analysis of the mean durations of these tokens suggest that the durational differences of various tones found in spoken Cantonese are neutralized in sung Cantonese.\n",
    "Index Terms: Cantonese, singing, tone, duration\n",
    ""
   ]
  },
  "benus12b_speechprosody": {
   "authors": [
    [
     "Štefan",
     "Beňuš"
    ],
    [
     "Katalin",
     "Mády"
    ]
   ],
   "title": "Stress and phonemic length in the perception of Slovak vowels",
   "original": "sp12_516",
   "page_count": 4,
   "order": 132,
   "p1": "516",
   "pn": "519",
   "abstract": [
    "We investigate the perception of phonemic vowel quantity contrast and its relation to word stress and vowel quality in Slovak, and fill the gap of missing experimental perception data for this language. We observe that both prosodicallydriven undershoot of unstressed vowels and the functional load affect the perception of quantity contrast. Vowel quality plays some role in quantity identification for high vowels (/u/ and unstressed /i/) but Slovak seems to retain a robust quantity contrast for all examined vowel qualities.\n",
    "Index Terms: vowel duration, Slovak, perception, word stress\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-130"
  },
  "bertinetto12_speechprosody": {
   "authors": [
    [
     "Pier Marco",
     "Bertinetto"
    ],
    [
     "Chiara",
     "Bertini"
    ],
    [
     "Na",
     "Zhi"
    ]
   ],
   "title": "Rhythm in Mandarin Chinese and Italian: the role of sentence accents",
   "original": "sp12_520",
   "page_count": 4,
   "order": 133,
   "p1": "520",
   "pn": "523",
   "abstract": [
    "Two perception experiments were run with Mandarin Chinese and Italian speakers. The aim was to comparatively examine the rhythmical role played by sentence accents. This study pursued previous work on the rhythmic features of Chinese and Italian as analyzed by means of the Control/Compensation model, according to which rhythm produces effects at two levels: level-I (phonotactical) and level-II (sentential). While previous work addressed the situation at level-I, the present study dealt with level-II, to check the respective strength of the accentual and syllabic oscillators.\n",
    "Index Terms: rhythm, Control/Compensation model, sentence accent.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-131"
  },
  "gilbert12_speechprosody": {
   "authors": [
    [
     "Annie C.",
     "Gilbert"
    ],
    [
     "Victor J.",
     "Boucher"
    ],
    [
     "Boutheina",
     "Jemel"
    ]
   ],
   "title": "Effects of temporal chunking on speech recall",
   "original": "sp12_524",
   "page_count": 4,
   "order": 134,
   "p1": "524",
   "pn": "527",
   "abstract": [
    "It is established that temporal grouping or “chunking” arises in serial recall as it does in speech. For instance, chunking appears in common tasks like remembering series such as phone numbers. In the present study, we examine how detected chunks in meaningless strings of syllables and meaningful utterances influence memory. We use a Sternberg task where listeners identify whether a heard item was part of a presented context. Such tasks serve to explore if working memory operates in terms of chunks and is influenced by meaning. Observations using evoked potentials ensured that chunks in the heard stimuli were detected by the 20 listeners. The results showed that, for meaningless series, chunk size and position significantly affected listeners' recall and their response times. However, there were no such effects for meaningful utterances. This suggests that memory of novel series operates by chunks. But in dealing with sequences of items that are already in long-term store, chunks may not have a dominant influence on working memory.\n",
    "Index Terms: speech segmentation, temporal grouping, chunking, working memory, short-term memory.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-132"
  },
  "wiener12_speechprosody": {
   "authors": [
    [
     "Seth",
     "Wiener"
    ],
    [
     "Shari R.",
     "Speer"
    ],
    [
     "Claire",
     "Shank"
    ]
   ],
   "title": "Effects of frequency, repetition and prosodic location on ambiguous Mandarin word production",
   "original": "sp12_528",
   "page_count": 4,
   "order": 135,
   "p1": "528",
   "pn": "531",
   "abstract": [
    "Recent findings from large corpus studies of spontaneous English speech show that the predictability of a word is negatively correlated with the duration of its pronunciation. This predictability effect extends to word repetition in discourse, where words shorten as they are re-used, to word frequency, with shorter pronunciations for high frequency than low frequency words, and to homophones, where the higher frequency meaning has a shorter duration than its lower frequency counterpart. Standard Mandarin, due to its relatively unmarked phonology and morphology, presents the potential for a large degree of homophony and resulting lexical ambiguity. We test whether predictability factors such as word frequency, repetition, and prosodic phrasal position influence the duration of Mandarin homophones in simple sentence reading. Native monolingual Mandarin speakers read phonologically identical sentence pairs, which differed only in semantics and orthographic representation. Each pair member contained either an ambiguous high or low frequency word; these ambiguous pairs were placed in one of four different prosodic locations throughout the stimuli. Sentences were read multiple times with durations measured for each ambiguous token. The results corroborate previous findings from corpus analyses showing duration reduction with repeated mention and effects of relative meaning frequency on homophone durations. In addition, we found differences in duration due to prosodic phrasal position, but no interaction of prosodic position with other forms of word predictability. Our findings indicate that speakers produce subtle durational cues to indicate a range of information about the words they use. Such information may be useful to listeners who may use this subtle information to minimize ambiguities.\n",
    "Index Terms: speech prosody, word frequency, Mandarin Chinese, lexical ambiguity, word duration\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-133"
  },
  "yuan12_speechprosody": {
   "authors": [
    [
     "Jiahong",
     "Yuan"
    ]
   ],
   "title": "The effects of speaking rate and intonation on the duration of tones in Mandarin Chinese",
   "original": "sp12_532",
   "page_count": 3,
   "order": 136,
   "p1": "532",
   "pn": "534",
   "abstract": [
    "This study investigates the effects of speaking rate and intonation on the duration of tones in Mandarin Chinese. My previous study found that the effect of intonation on the duration of tones is tone-dependent, i.e., the final falling tone is longer in question intonation than in statement intonation, whereas the final rising tone has similar duration for the two intonation types. In this study, the effects of intonation on the duration of sentence-final tones with different speaking rates (normal, fast, and slow) are examined. The results show that tonal targets and tone-bearing units have orthogonal or independent effects on the duration of tones. The results also suggest that the effect of changing tonal targets on the duration of tones is not speaker-controlled, i.e., the process of changing tonal targets is blind to its effect on tonal duration.\n",
    "Index Terms: tone, intonation, duration, Mandarin Chinese\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-134"
  },
  "jun12_speechprosody": {
   "authors": [
    [
     "Sun-Ah",
     "Jun"
    ]
   ],
   "title": "Prosodic typology revisited: adding macro-rhythm",
   "original": "sp12_535",
   "page_count": 4,
   "order": 137,
   "p1": "535",
   "pn": "538",
   "abstract": [
    "This paper introduces a new model of prosodic typology by adding a parameter called macro-rhythm to the two known prosodic parameters: type of prominence marking (head, edge, or head/edge) and word prosody (stress, tone, or lexical pitch accent). Macro-rhythm is a tonal rhythm (a sequence of H/L alternation) formed within an Intonation Phrase. It captures similarities and differences across languages in terms of pitch contours whether the contour is composed of a head tone (pitch accent, lexical tone), an edge tone (phrasal/boundary tone), or both. Various criteria defining the degree of macrorhythm are suggested.\n",
    "Index Terms: prosodic typology, macro-rhythm, headprominence, head/edge-prominence, edge-prominence\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-135"
  },
  "dellwo12_speechprosody": {
   "authors": [
    [
     "Volker",
     "Dellwo"
    ],
    [
     "Daniel",
     "Friedrichs"
    ]
   ],
   "title": "Variability of speech rhythm in synchronous speech",
   "original": "sp12_539",
   "page_count": 4,
   "order": 138,
   "p1": "539",
   "pn": "542",
   "abstract": [
    "Speakers are able to speak in synchrony to another speaker or to a recording of another speaker. The present research studied whether and, if yes, speakers change their speech rhythm when synchronizing to another speaker. We developed a measure (SRratio) which monitors on a scale between 0 and 1 whether the durational characteristics of a speaker's synchronous speech are closer to his/her own read speech or closer to the characteristics of the speech of the speaker he/she is synchronizing to. Four speakers (synchronization speakers) synchronizing to twelve recorded sentences produced by four other speakers (target speakers) were studied. The durational characteristics we analyzed were %V and nPVI-v. Results for SRratio suggest that complex processes are going on with main effects for synchronization speakers and target speakers and interaction of the two factors.\n",
    "Index Terms: speech prosody, rhythm, synchronous speech\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-136"
  },
  "yang12b_speechprosody": {
   "authors": [
    [
     "Xiaohong",
     "Yang"
    ],
    [
     "Yufang",
     "Yang"
    ]
   ],
   "title": "Effects of topic structure and syntax on boundary pitch variations in standard Chinese",
   "original": "sp12_543",
   "page_count": 4,
   "order": 139,
   "p1": "543",
   "pn": "546",
   "abstract": [
    "This paper reported an acoustic experiment examining the effect of topic structure and syntax on boundary pitch parameters. Simple discourses containing three sentences in Standard Chinese were constructed and the boundary between the first sentence and the second sentence of each discourse varied along the following parameters: (a) topic internal, clause, (b) topic shift, clause, (c) topic internal, sentence, (d) topic shift, sentence. The results showed that relative to topic internal condition, topic shift condition induced higher pitch register following the boundary. Syntactic structure as index by clause or sentence had no effect on boundary pitch parameters.\n",
    "Index Terms: speech prosody, rhythm, melody, intonation\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-137"
  },
  "chen12d_speechprosody": {
   "authors": [
    [
     "Alvin C.-H.",
     "Chen"
    ],
    [
     "Shu-Chuan",
     "Tseng"
    ]
   ],
   "title": "Conceptual planning in conversational Mandarin: pitch variation in prosodic phrasing",
   "original": "sp12_547",
   "page_count": 4,
   "order": 140,
   "p1": "547",
   "pn": "550",
   "abstract": [
    "The present study addresses the question of whether the grammatical configuration of prosodic units (i.e., their alignment with the clause unit) may contribute to systematic prosodic patterns. Specifically, we focus on the pitch variation on prosodic boundaries in conversational Mandarin. Results demonstrate that the grammatical configuration of the prosodic phrasing correlates with systematic pitch variation, on which implications for incremental production are drawn. The cross-boundary pitch variation signals not only whether speakers are going to finish their proposition by the end of the prosodic phrasing, but also how much information they have planned to package in the prosodic unit. A clause-based conceptual planning in conversational speech is empirically supported by our observation of the pitch variation on prosodic boundaries. Prosodic phrasing is found to emerge from the stream of conversational speech with a high degree of satisfying consistency reflecting our clause-based conceptualization in interaction.\n",
    "Index Terms: pitch variation, prosodic phrasing, incremental production, conceptual planning\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-138"
  },
  "abolhasanizadeh12_speechprosody": {
   "authors": [
    [
     "Vahideh",
     "Abolhasanizadeh"
    ]
   ],
   "title": "F0 as the dominant cue to accent location in Persian",
   "original": "sp12_551",
   "page_count": 4,
   "order": 141,
   "p1": "551",
   "pn": "554",
   "abstract": [
    "Two categorical perception studies were conducted in order to test the hypothesis that f0 is dominantly responsible for signaling the position of the accent, earlier known as 'stress', of Persian. We used disyllabic minimal pairs in which the accent was either on the second syllable, the word condition, or on the first, the word-plus-clitic condition. In both experiments, participants were presented with randomized stimuli in which the f0 had been manipulated and were asked to judge whether they heard a word or word-plus-clitic combination. In both cases, we found that the f0 manipulation switched judgement by 100%. Key words: pitch accent, clitic group, phonological word, categorical perception.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-139"
  },
  "zhang12_speechprosody": {
   "authors": [
    [
     "Jinsong",
     "Zhang"
    ],
    [
     "Wei",
     "Li"
    ],
    [
     "Yanlu",
     "Xie"
    ],
    [
     "Wen",
     "Cao"
    ]
   ],
   "title": "A quantitative study on information contribution of prosody phrase boundaries in Chinese speech",
   "original": "sp12_555",
   "page_count": 4,
   "order": 142,
   "p1": "555",
   "pn": "558",
   "abstract": [
    "In speech, acoustic cues are used to manifest a number of linguistic events including segmental phonemes and supra-segmental ones such as tones, prosodic phrasing structure, intonation, etc. It has been an interesting topic to quantitatively compare the importance of different linguistic events. However, previous studies have been mainly confined to segmental or segment-like units. No studies could be found to show quantitatively the importance of supra-segmental events of prosody boundaries. From the view of information transmission, both segmental and supra-segmental events make indispensable contributions to natural human speech communication. This paper presents a novel way to quantitatively estimate the information contribution of prosody boundaries, taking the same way to estimate those of segmental phonetic contrasts and syllable tones. Experiments were done using a Chinese newspaper text corpus and a conversation speech corpus. Preliminary results show that prosody boundaries carry much more information than phonetic segments. Hence, they are much more important than segments for human speech communication.\n",
    "Index Terms: functional load, prosody boundary, mutual information, information contribution\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-140"
  },
  "yoon12b_speechprosody": {
   "authors": [
    [
     "Tae-Jin",
     "Yoon"
    ],
    [
     "Yoonjung",
     "Kang"
    ]
   ],
   "title": "A forced-alignment-based study of declarative sentence-ending \"ta\" in Korean",
   "original": "sp12_559",
   "page_count": 4,
   "order": 143,
   "p1": "559",
   "pn": "562",
   "abstract": [
    "The phonetic characteristics of declarative sentence-ending 'ta' was examined based on the speech of one male Korean speaker in his 20s drawn from a large-scale speech corpus. An analysis using a Unicode-based phone alignment system was compared to an analysis based on manually corrected alignment and the two methods produced largely comparable results. The declarative-ending 'da,' which coincides with prosodic intonational boundaries in Korean, was marked by higher F1 as well as longer duration and lower F0 than medial 'ta', but the effect of utterance boundary on voice quality is inconclusive. The study implies that more accurate duration modeling to the baseline alignment system will enable us to investigate phonetic and prosodic substances of spoken Korean in the large-scale corpus.\n",
    "Index Terms: Forced alignment, declarative-ending, F0, F1, F2, H1-H2, vowel duration, voice quality.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-141"
  },
  "portes12_speechprosody": {
   "authors": [
    [
     "Cristel",
     "Portes"
    ],
    [
     "Mariapaola",
     "D'Imperio"
    ],
    [
     "Leonardo",
     "Lancia"
    ]
   ],
   "title": "Positional constraints on the initial rise in French",
   "original": "sp12_563",
   "page_count": 4,
   "order": 144,
   "p1": "563",
   "pn": "566",
   "abstract": [
    "A basic constituent of French intonation is the Accentual Phrase (AP), which includes two distinct tonal events: a final LH* accentual rise and an initial LHi rise. A previous study had shown a difference between the rising movements according to the the position of the AP within the intonational phrase (IP): prenuclear (P, IP-initial) versus nuclear (N, IPfinal). The present paper explains this difference through the occurrence of a LHi in P position which does not occur in N position. Specifically, we tested whether LHi can occur adjacent to LH* within the AP and whether the occurrence of LHi triggers initial strengthening of the onset consonant independent of its status (as a liaison consonant or not). Four native speakers of French read target words varying as to their distribution within the intonation phrase as well as to the segmental nature of the target syllable onset (/k/ onset versus /z/ liaison). Results confirm that LHi can be immediately adjacent to LH* within the AP, but only in P position and that the height of its H target is influenced by onset consonant type. The results are discuss relative to the phonological status of the initial rise and the phonological structure of the nuclear pitch accent in our data.\n",
    "Index Terms: speech prosody, melody, intonation, initial rise, French.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-142"
  },
  "shuai12_speechprosody": {
   "authors": [
    [
     "Lan",
     "Shuai"
    ],
    [
     "Bin",
     "Li"
    ],
    [
     "Tao",
     "Gong"
    ]
   ],
   "title": "Priming effects of tones and segments in lexical processing in Mandarin",
   "original": "sp12_567",
   "page_count": 4,
   "order": 145,
   "p1": "567",
   "pn": "570",
   "abstract": [
    "In tone languages, pitch variation is one of the primary cues to distinguish lexical meanings. Similar to consonants and vowels, lexical tones play a role in accessing to lexical information, but these segmental and suprasegmental features may have different roles in this process. In this study, we examine the priming effects of tones, consonants, and vowels in an auditory task of lexical decision in Mandarin, and compare such phonological priming effects with the direct and semantic priming effects. We find that consonants and vowels play a major role at the stage of lexical access, whereas tones facilitate lexical processing afterwards. In addition, partially conflicting segments, not tones, interfere with lexical selection. We discuss and compare these results with the previous findings to shed some lights on the follow-up research.\n",
    "Index Terms: lexical tone, lexical decision, priming, Mandarin\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-143"
  },
  "mixdorff12b_speechprosody": {
   "authors": [
    [
     "Hansjörg",
     "Mixdorff"
    ],
    [
     "Jennifer",
     "Cole"
    ],
    [
     "Stefanie",
     "Shattuck-Hufnagel"
    ]
   ],
   "title": "Prosodic similarity – evidence from an imitation study",
   "original": "sp12_571",
   "page_count": 4,
   "order": 146,
   "p1": "571",
   "pn": "574",
   "abstract": [
    "Unlike audio recording devices, a human speaker imitating a heard utterance or reading a sentence aloud must formulate a cognitive representation of the linguistic object to guide the phonology and phonetics of the spoken output. The current study used two different production tasks to explore the prosodic aspect of these representations: an imitation experiment in which speakers heard and then imitated spontaneous utterances from a Maptask corpus, and a read enactment task in which speakers read the same sentences aloud from a video display. For each task, the resulting utterances were compared for similarity a) to the original Maptask utterance and b) to each other. Similarity measures included perceptual accent and boundary labels and syllable durations, as well as Fujisaki model-based F0 parameters. The imitations showed strong agreement with the stimulus utterances both in their phonological structure (perceptually labeled accents and boundaries), and in several phonetic cues to prosody from measures of duration and F0. Furthermore, agreement between imitated utterances and the original spoken stimulus was higher than between different imitations. Finally, read and enacted utterances were substantially different from the original spoken stimulus, in terms of their phonology and F0 characteristics, though duration patterns were less variable. Overall, these results are consistent with the view that listeners extract the prosodic form of an utterance in terms of both phonological features and phonetic cues, and that the syntactic and semantic content of the text is not sufficient to determine a reliable prosodic outcome across subjects.\n",
    "Index Terms: prosody, spontaneous speech, spoken imitation, phonetics and phonology, Fujisaki model\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-144"
  },
  "sang12_speechprosody": {
   "authors": [
    [
     "Yumei",
     "Sang"
    ],
    [
     "Philippe",
     "Martin"
    ]
   ],
   "title": "The role of F0 in mongolian stress",
   "original": "sp12_575",
   "page_count": 4,
   "order": 147,
   "p1": "575",
   "pn": "578",
   "abstract": [
    "This paper deals with vowel duration and Fo correlates of word stress in HalhMongolian, the main dialect spoken in Mongolia. The position of word stress is predictable. The fundamental frequency (Fo) of stressed vowels shows a regular pattern compared to the Fo of unstressed vowels. Maximal and minimal values of Fo in the word are both used to indicate syllable prominence, as does longer vowel duration.\n",
    "Index Terms: Fundamental frequency, Mongolian, Stress\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-145"
  },
  "hu12_speechprosody": {
   "authors": [
    [
     "Chen",
     "Hu"
    ]
   ],
   "title": "Contour patterns of Chinese intonational phrases",
   "original": "sp12_579",
   "page_count": 4,
   "order": 148,
   "p1": "579",
   "pn": "582",
   "abstract": [
    "Intonational phrases with 2, 3, and 4 intermediate phrases constitute the majority of all Chinese IPs. The contour patterns of Chinese IPs indicate that the near-bottom Dmin value of the last intermediate phrase serves as the primary indicator of the statement intonation in Chinese, while the falling trend of the last part of the top-line can serve as a compensatory auxiliary indicator when the primary indicator is not typical.\n",
    "Index Terms: contour patterns, Chinese intonational phrase, the AM approach\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-146"
  },
  "gac12_speechprosody": {
   "authors": [
    [
     "David Le",
     "Gac"
    ],
    [
     "Hiyon",
     "Yoo"
    ],
    [
     "Katarina",
     "Bartkova"
    ]
   ],
   "title": "Pitch level variation in French: categorical or gradient",
   "original": "sp12_583",
   "page_count": 4,
   "order": 149,
   "p1": "583",
   "pn": "586",
   "abstract": [
    "This paper reports the results of an experiment on the question of whether the realizations of f0 variations at the end of the final IP are categorical or gradient. We conducted an imitation task with resynthesized stimuli where the final pitch height was varied in steps of one semi-tone. Results are ambivalent, since both strategies are possible. However, we argue that there is enough evidence for establishing the existence of at least three pitch categories in French.\n",
    "Index Terms: intonation, imitation task, French, categorical, continuous, pitch level, pitch range\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-147"
  },
  "phelan12_speechprosody": {
   "authors": [
    [
     "Michael",
     "Phelan"
    ]
   ],
   "title": "The prosody of algebra and the algebra of prosody: prosodic disambiguation of read mathematical formulae",
   "original": "sp12_587",
   "page_count": 4,
   "order": 150,
   "p1": "587",
   "pn": "590",
   "abstract": [
    "Read mathematical formulae (MF) provide an ideal and littlestudied window into speakers' ability to prosodically disambiguate complex NPs. An experiment investigating whether and how speakers of different mathematical skill levels prosodically mark English utterances containing ambiguities caused by the application of unary and binary mathematical operators found that speakers consistently mark intended syntactic parses with cooperating prosody, whereby placement of relatively weaker prosodic breaks indicated tighter syntactic grouping and stronger breaks indicated looser syntactic grouping. When prosodic breaks were of equal strength, absolute break strength often indicated the desired parse. Use of cooperating prosody correlated significantly with correctly evaluating MF, and increased mathematical ability correlated with decreased use of conflicting (noncooperating) prosodic contours.\n",
    "Index Terms: speech prosody, relative boundary hypothesis, break strength, prosody of mathematics\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-148"
  },
  "li12c_speechprosody": {
   "authors": [
    [
     "Aijun",
     "Li"
    ],
    [
     "Qiang",
     "Fang"
    ],
    [
     "Jianwu",
     "Dang"
    ]
   ],
   "title": "Emotional expressiveness of successive addition boundary tone in Mandarin Chinese",
   "original": "sp12_591",
   "page_count": 4,
   "order": 151,
   "p1": "591",
   "pn": "594",
   "abstract": [
    "The aim of the present study is to explore the relationship between the form of Chinese 'successive addition boundary tone' [1,2] and its expressive function, and whether 'SUccessive Addition Boundary Tones' (SUABT) can uniquely encode pragmatic information. To this end, a perceptual experiment was conducted by attaching a successive falling tone to the F0 curve of the neutrally expressed utterance, which varies in both length and final tone categories. The slope and duration of the successive falling tones are varied and synthesized to produce 425 stimuli. And the emotional expression of stimuli was evaluated by 20 subjects. Through GLM (General Linear Model) analysis, it is found that (1) Slope and duration of successive falling tone, length of sentence, and final tone category affect emotional expressiveness significantly, but their contribution varies across emotions. (2) When the slope (absolute value) and duration of the successive falling tone increased, the perceptual score of neutral emotion decreases, whilst the perceptual score of other 6 basic emotions increases (significantly for 'disgust, angry and fear'). It indicates that there is not a unique mapping between the form of the successive addition boundary tone and its pragmatic function, rather a 1-to-many mapping. The results also demonstrated that the SUABT alone is not enough to encode emotional information. (3) The perceptual score is affected by the length of the utterance, the longer the sentence, the smaller the effect, which further revealed that the SUABT alone is not enough to express emotions, as suggested by Xu'PANTA model[3], other components such as focus, voice quality, speech rate, energy, all could be used to encode express pragmatic information.\n",
    "Index Terms: successive addition boundary tone, emotion, expression, Chinese intonation\n",
    "s Chao, Y., “A Preliminary Study of English Intonation (with American Variations) and Its Chinese Equivalents”, BIHP, The Ts'ai Yuan Pei Anniversary Volume, 105-156, 1932. Li,A., Fang,Q. and Dang J., “Emotional Intonation in a Tone Language: Experimental Evidence From Chinese”, ICPhS XVII, Hong Kong, 17-21, August 2011. Xu, Y., “Speech Melody as Articulatorily Implemented Communicative Functions”, Speech Communication, 46: 220-251, 2005\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-149"
  },
  "qin12c_speechprosody": {
   "authors": [
    [
     "Zuxuan",
     "Qin"
    ]
   ],
   "title": "Prosodic boundaries and prosodic word in Chengdu dialect: a durational perspective",
   "original": "sp12_595",
   "page_count": 4,
   "order": 152,
   "p1": "595",
   "pn": "598",
   "abstract": [
    "This paper will present a study on the prosodic structure of Chengdu Dialect (CD) spoken in Chengdu, capital city of southwest China's Sichuan province. First, we will distinguish different levels of prosodic boundary of CD through perception. Second, we will examine the acoustic manifestation of these boundaries and Prosodic Word from the durational perspective. Finally, we discuss the role of duration in marking prosodic boundaries and determining tone sandhi patterns in CD. Our analysis suggests that listeners might be able to distinguish different levels of prosodic boundaries by attending to the duration of pause and syllables adjacent to them, and that the duration pattern of PW is closely related to tone sandhi patterns in CD.\n",
    "Index Terms: Chengdu dialect, prosodic word, prosodic boundaries\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-150"
  },
  "wang12f_speechprosody": {
   "authors": [
    [
     "Sheng-Fu",
     "Wang"
    ],
    [
     "Janice",
     "Fon"
    ]
   ],
   "title": "Durational cues at discourse boundaries in taiwan Southern Min",
   "original": "sp12_599",
   "page_count": 4,
   "order": 153,
   "p1": "599",
   "pn": "602",
   "abstract": [
    "This study examined durational cues at discourse boundaries in spontaneous speech in Taiwan Southern Min (TSM) using a two-hour monologue corpus contributed by four elderly female speakers from the same dialectal region. Discourse labeling was done following the method of Fon et al. (2011). Two durational cues were examined: syllable duration and post-syllable pause duration. Results showed that the lengthening of final and penultimate syllable was a very robust cue for discourse boundaries. It was also found that the postboundary syllables underwent shortening. As for boundary strength, the duration of pauses at discourse boundaries was found to be a strong indicator for boundary hierarchy.\n",
    "Index Terms: boundary cues, hierarchical structure, spontaneous speech, Taiwan Southern Min\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-151"
  },
  "avanzi12b_speechprosody": {
   "authors": [
    [
     "Mathieu",
     "Avanzi"
    ],
    [
     "Nicolas",
     "Obin"
    ],
    [
     "Alice",
     "Bardiaux"
    ],
    [
     "Guri",
     "Bordal"
    ]
   ],
   "title": "Speech prosody of French regional varieties",
   "original": "sp12_603",
   "page_count": 4,
   "order": 154,
   "p1": "603",
   "pn": "606",
   "abstract": [
    "This paper compares the prosody of 6 varieties of French spoken in three different areas: France (Paris and Lyon), Belgium (Tournai and Liège), and Switzerland (Geneva and Neuchâtel). The objective is to adress whether some regional varieties, namely those of Geneva and Tournai, are closer to standard French (i.e. the varieties spoken in France, represented here by Paris and Lyon) than others (Neuchâtel and Liège). The recordings of the same text read by 4 speakers representing each variety were semi-automatically processed in order to study accentuation, speech rate and rhythm, and 8 prosodic measures that can possibly discriminate the 6 varieties were compared. A top-down clustering supported evidence for the expected classification with regard to the “standard” varieties, while a bottom-up clustering pointed out a more contrasted configuration.\n",
    "Index Terms: Prosody, regional French, standard French, Accentual Phrase, articulation rate, speech rate.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-152"
  },
  "leemann12_speechprosody": {
   "authors": [
    [
     "Adrian",
     "Leemann"
    ],
    [
     "Volker",
     "Dellwo"
    ],
    [
     "Marie-José",
     "Kolly"
    ],
    [
     "Stephan",
     "Schmid"
    ]
   ],
   "title": "Rhythmic variability in Swiss German dialects",
   "original": "sp12_607",
   "page_count": 4,
   "order": 155,
   "p1": "607",
   "pn": "610",
   "abstract": [
    "Speech rhythm can be measured acoustically in terms of durational characteristics of consonantal and vocalic intervals. The present paper investigated how acoustically measurable rhythm varies across dialects of Swiss German. Rhythmic measurements (%V, ƒ¢C, ƒ¢V, varcoC, varcoV, rPVI-C, nPVIC, nPVI-V) were carried out on four sentences of six speakers from eight Swiss dialects. Results indicate that there are significant differences across the dialects in some rhythm measures but not in others and that dialects can be grouped according to rhythmic characteristics.\n",
    "Index Terms: Speech rhythm, rhythm metrics, Swiss German, dialectology\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-153"
  },
  "wodarczak12_speechprosody": {
   "authors": [
    [
     "Marcin",
     "Włodarczak"
    ],
    [
     "Juraj",
     "Šimko"
    ],
    [
     "Petra",
     "Wagner"
    ]
   ],
   "title": "Syllable boundary effect: temporal entrainment in overlapped speech",
   "original": "sp12_611",
   "page_count": 4,
   "order": 156,
   "p1": "611",
   "pn": "614",
   "abstract": [
    "In this paper we investigate one aspect of temporal entrainment in dialogue, namely how onsets of overlapped speech are timed with respect to syllable boundaries of the current speaker. Overlap initiation were found to be more frequent around syllable boundaries than at other locations within the syllable. Some evidence that the turn onset timing is also influenced by the regularity of the preceding syllables and by changes in speech tempo is also presented.\n",
    "Index Terms: dialogue rhythm, temporal entrainment, overlapped speech, turn-taking\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-154"
  },
  "looze12b_speechprosody": {
   "authors": [
    [
     "Céline De",
     "Looze"
    ],
    [
     "Na",
     "Zhi"
    ],
    [
     "Cyril",
     "Auran"
    ],
    [
     "Hyong-Sil",
     "Cho"
    ],
    [
     "Sophie",
     "Herment"
    ],
    [
     "Irina",
     "Nesterenko"
    ]
   ],
   "title": "Providing linguists with better tools: Daniel Hirst's contribution to prosodic annotation",
   "original": "sp12_615",
   "page_count": 6,
   "order": 157,
   "p1": "615",
   "pn": "620",
   "abstract": [
    "Among Daniel Hirst's contributions to speech prosody, this article addresses those concerned with the development of automatic tools for prosodic annotation. One of Daniel's concerns has been to facilitate the task of phoneticians and linguists involved in developing efficient rules for the analysis and synthesis of speech prosody. This presentation describes some of his innovative and fruitful contributions for the analysis of the prosody of natural languages.\n",
    "Index Terms: prosodic annotation, tools, form~function, analysis by synthesis, MOMEL-INTSINT, IF, ProZed.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-155"
  },
  "mixdorff12c_speechprosody": {
   "authors": [
    [
     "Hansjörg",
     "Mixdorff"
    ]
   ],
   "title": "Form versus function – prosodic annotation and modeling go hand in hand",
   "original": "sp12_621",
   "page_count": 3,
   "order": 158,
   "p1": "621",
   "pn": "623",
   "abstract": [
    "This paper argues that prosodic annotation and modeling should be combined for facilitating analyses of prosodic functions that invariably require perceptual judgments. It compares perceptual prosodic annotations of prominent syllables and phrase boundaries with labels yielded by the combination of linguistic information from a TTS-front end, model-based prosodic features, as well as a model of perceived syllabic prominence from an earlier study. As can be expected this annotation of prosodic landmarks yields better results on reading style speech than on spontaneous speech data. Of the perceptual annotations, on average 89% of perceptually prominent syllables were identified correctly, as well as a similar percentage of prosodic boundaries. Hence a basic annotation of prosodic features is yielded which can later on be enhanced by additional information for which perceptual judgments are indispensable.\n",
    "Index Terms: Prosodic annotation, prosodic modeling, Fujisaki model, perceptual prominence\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-156"
  },
  "zhou12_speechprosody": {
   "authors": [
    [
     "Yining V.",
     "Zhou"
    ],
    [
     "Brett A.",
     "Martin"
    ]
   ],
   "title": "The role of amplitude envelope in Cantonese lexical tone perception: implications for cochlear implants",
   "original": "sp12_629",
   "page_count": 4,
   "order": 159,
   "p1": "629",
   "pn": "632",
   "abstract": [
    "Amplitude envelope co-varies with F0 in Mandarin lexical tones. It can cue lexical tone perception in a tone language such as Mandarin which uses different pitch contours for phonemic contrasts. The current study investigated whether amplitude envelope could also aid the perception of lexical tones in a language such as Cantonese which uses both pitch contour and relative pitch height for phonemic contrasts. Stimuli containing only the amplitude envelope of Cantonese lexical tones were used, and native speakers of Cantonese identified the lexical tones contained in the stimuli with above-chance accuracy. Thus, amplitude envelope could cue pitch contour and pitch height for lexical tone perception. Amplitude envelope was found to co-vary with F0 in Cantonese lexical tones, and the degree of their covariability was a fair predictor of Cantonese lexical tone perception using amplitude envelope alone. Clinical implications of these findings for cochlear implants were discussed.\n",
    "Index Terms: lexical tone perception, amplitude envelope, F0, Cantonese, cochlear implant\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-157"
  },
  "kohler12_speechprosody": {
   "authors": [
    [
     "Klaus J.",
     "Kohler"
    ]
   ],
   "title": "Segment duration and vowel quality in German lexical stress perception",
   "original": "sp12_633",
   "page_count": 4,
   "order": 160,
   "p1": "633",
   "pn": "636",
   "abstract": [
    "A perception experiment based on systematic variation of disyllabic vowel duration and vowel quality, and of intervocalic fricative duration in the German minimal lexical stress pair 'Kaffee “coffee” vs. Ca'fé (locality) in a low f0 tail or a high f0 plateau shows highly significant effects of the 3 variables as cues to lexical stress. The combined vowel quality and fricative variables outweigh vowel duration. The effect of the prosodic frame is marginal. It is concluded that acoustic stress variables do not form a generally valid cue hierarchy.\n",
    "Index Terms: lexical stress, accent, perceptual hierarchy\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-158"
  },
  "huang12_speechprosody": {
   "authors": [
    [
     "Yi-Hsuan",
     "Huang"
    ],
    [
     "E-Chin",
     "Wu"
    ],
    [
     "Janice",
     "Fon"
    ]
   ],
   "title": "The effect of Min proficiency on production and perception of tones in taiwan Mandarin",
   "original": "sp12_637",
   "page_count": 4,
   "order": 161,
   "p1": "637",
   "pn": "640",
   "abstract": [
    "This paper aimed to investigate how Min proficiency affects tonal production and perception in Taiwan Mandarin. Experiment 1 recruited two groups of Mandarin-Min bilinguals, with Min proficiency varied. Results showed that high Min proficiency speakers produced a lower tonal register and a narrower tonal range in Mandarin compared to low Min proficiency speakers. The tonal variations also interacted with tonal target types. Experiment 2 further investigated whether different levels of pitch heights led to any difference in listeners' interpretation of talkers' language backgrounds. Results showed that the lower the tonal register was, the more likely the listeners regarded the talker as a “Min-speaking” person, mirroring the results on tonal production.\n",
    "Index Terms: tonal variation, Taiwan Mandarin, Southern Min, indexical properties, bilingualism\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-159"
  },
  "hwang12_speechprosody": {
   "authors": [
    [
     "Hyun Kyung",
     "Hwang"
    ]
   ],
   "title": "Asymmetries between production, perception and comprehension of focus types in Japanese",
   "original": "sp12_641",
   "page_count": 4,
   "order": 162,
   "p1": "641",
   "pn": "644",
   "abstract": [
    "Distinct types of focus in Tokyo Japanese are investigated, with special attention given to their acoustic and perceptual characteristics. The results of production, prominence rating, and context retrieval tests demonstrate that prosodic differences between Informational Focus (IF) and Contrastive/Corrective Focus (CF) are subtle, but perceptible to listeners: CF involving a slightly greater F0 fall and longer duration is perceived more prominent than IF. However, it is also revealed that the perceived differences of prominence do not guide listeners to identify the focus types, implying that the prosodic differences between IF and CF in the speech signal alone do not play a functional role in terms of communication.\n",
    "Index Terms: Prosody, Informational Focus, Contrastive Focus, Prominence Rating, Context Retrieval\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-160"
  },
  "garrido12_speechprosody": {
   "authors": [
    [
     "Juan-María",
     "Garrido"
    ],
    [
     "Yesika",
     "Laplaza"
    ],
    [
     "Montserrat",
     "Marquina"
    ]
   ],
   "title": "On the use of melodic patterns as prosodic correlates of emotion in Spanish",
   "original": "sp12_645",
   "page_count": 4,
   "order": 163,
   "p1": "645",
   "pn": "648",
   "abstract": [
    "This paper presents an acoustic and perceptual analysis of the use of melodic patterns as prosodic correlates of the expression of emotional states in Spanish. The data of the acoustic analysis of a corpus of neutral and emotional declarative sentences in Spanish are presented first, showing that emotional utterances are frequently closed by a 'rise-fall' pattern that is not used in neutral speech. However, the results of the perceptual experiment carried out to test the perceptual relevance of this pattern for the identification of emotions in speech seem to indicate that, although it does contribute to recognize a utterance as emotional, its use is not a sufficient cue by itself.\n",
    "Index Terms: melody, intonation, emotion, perception, Spanish\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-161"
  },
  "menezes12_speechprosody": {
   "authors": [
    [
     "Caroline",
     "Menezes"
    ],
    [
     "Donna",
     "Erickson"
    ],
    [
     "Jonghye",
     "Han"
    ]
   ],
   "title": "Cross-linguistic cross-modality perception of English sad and happy speech",
   "original": "sp12_649",
   "page_count": 4,
   "order": 164,
   "p1": "649",
   "pn": "652",
   "abstract": [
    "This paper is a cross-cultural perception study of speech emotions of English utterances by American, Japanese and Korean listeners. The perception of sad and happy speech conveyed through linguistic modality (semantic) and affective modality (prosody) is tested to understand how native and non-native listeners comprehend the speaker's emotion. It is expected that native subjects would be better than non-natives at perceiving emotion expressed in both modalities because of their competence in accessing the semantic information as well as emotional prosodic information. Results reveal that in general, Americans perceive emotion in English better than Japanese and Koreans. However, native listeners and nonnative Japanese listeners are more successful in discriminating emotion in affective and neutral utterances. Korean speakers are better at perceiving emotions in linguistic utterances. This could be due to English being taught as a second language in many countries. Our findings also indicate that listener's choice of modality processing is based on emotion types. Happy utterances are better perceived in the affective modality, while sadness is better perceived in the linguistic modality. Results also show that females are better at judging emotion by affective prosody, while males need to heed the semantic coding of emotion. Happy utterances are better perceived by males while sad utterances are better perceived by females. Females in general are better at perceiving emotions than males for all language groups.\n",
    "Index Terms: perception of emotion, affective, semantic, cross-cultural, sad and happy, gender prototypes\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-162"
  },
  "wang12g_speechprosody": {
   "authors": [
    [
     "Ting",
     "Wang"
    ],
    [
     "Hongwei",
     "Ding"
    ],
    [
     "Wentao",
     "Gu"
    ]
   ],
   "title": "Perceptual study for emotional speech of Mandarin Chinese",
   "original": "sp12_653",
   "page_count": 4,
   "order": 165,
   "p1": "653",
   "pn": "656",
   "abstract": [
    "This paper conducts a set of perceptual experiments together with an F0 acoustic analysis on emotional speech of Mandarin Chinese. Sixty utterances spoken by two actors in five basic emotions (i.e. happiness, fear, anger, sadness, and boredom) as well as in the neutral style served as stimuli. The perceptual experiments showed the following results: (1) For Mandarin Chinese, the rates of identification for five basic emotions differ significantly, ranking in Sadness > Happiness > Anger > Fear > Boredom. (2) Perceptual confusion occurs mainly between fear and sadness, and between boredom and anger. There is a perceptual boundary within each pair. The similarity coefficient is 0.16 for fear and sadness, and 0.22 for boredom and anger. (3) The accuracy in the perception of emotions varies with the linguistic background of the listener; non-native subjects show a degraded perception. Moreover, acoustic analysis implies that F0 feature is not the only cue for the perception of emotions in Mandarin Chinese.\n",
    "Index Terms: Mandarin emotional speech, Perceptual boundary, Cross-linguistic perception\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-163"
  },
  "gangamohan12_speechprosody": {
   "authors": [
    [
     "P.",
     "Gangamohan"
    ],
    [
     "V. K.",
     "Mittal"
    ],
    [
     "B.",
     "Yegnanarayana"
    ]
   ],
   "title": "Relative importance of different components of speech contributing to perception of emotion",
   "original": "sp12_657",
   "page_count": 4,
   "order": 166,
   "p1": "657",
   "pn": "660",
   "abstract": [
    "The objective of this study is to understand the relative importance of different components of speech that contribute to perception of emotion in speech. The four components considered in this study relate to the vocal tract system, excitation source and suprasegmental (pitch and duration) information. For this study, data collected from an artist, producing speech with different emotions is used. A flexible analysis-synthesis tool is used to modify the parameters of speech in a desired manner. Results of subjective studies show that all the four components are important in perceiving emotion in an utterance in comparison to the corresponding neutral utterance. Individually, the pitch contour seems to be the dominant component, and the duration seems to play less a significant role. It is also interesting to note that the importance of these components vary in perception for different types of emotions.\n",
    "Index Terms: speech prosody, speech analysis, speech synthesis, emotion conversion, dynamic time warping.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-164"
  },
  "steidl12_speechprosody": {
   "authors": [
    [
     "Stefan",
     "Steidl"
    ],
    [
     "Tim",
     "Polzehl"
    ],
    [
     "H. Timothy",
     "Bunnell"
    ],
    [
     "Ying",
     "Dou"
    ],
    [
     "Prasanna Kumar",
     "Muthukumar"
    ],
    [
     "Daniel",
     "Perry"
    ],
    [
     "Kishore",
     "Prahallad"
    ],
    [
     "Callie",
     "Vaughn"
    ],
    [
     "Alan W.",
     "Black"
    ],
    [
     "Florian",
     "Metze"
    ]
   ],
   "title": "Emotion identification for evaluation of synthesized emotional speech",
   "original": "sp12_661",
   "page_count": 4,
   "order": 167,
   "p1": "661",
   "pn": "664",
   "abstract": [
    "In this paper, we propose to evaluate the quality of emotional speech synthesis by means of an automatic emotion identification system. We test this approach using five different parametric speech synthesis systems, ranging from plain non-emotional synthesis to full re-synthesis of pre-recorded speech. We compare the results achieved with the automatic system to those of human perception tests. While preliminary, our results indicate that automatic emotion identification can be used to assess the quality of emotional speech synthesis, potentially replacing time consuming and expensive human perception tests.\n",
    "Index Terms: emotion, speech synthesis, automatic quality assessment, human perception\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-165"
  },
  "pell12_speechprosody": {
   "authors": [
    [
     "Marc D.",
     "Pell"
    ],
    [
     "Jessica",
     "Robin"
    ],
    [
     "Silke",
     "Paulmann"
    ]
   ],
   "title": "How quickly do listeners recognize emotional prosody in their native versus a foreign language?",
   "original": "sp12_665",
   "page_count": 4,
   "order": 168,
   "p1": "665",
   "pn": "668",
   "abstract": [
    "This study investigated whether the recognition of emotions from speech prosody occurs in a similar manner and has a similar time course when adults listen to their native language versus a foreign language. Native English listeners were presented emotionally-inflected pseudo-utterances produced in English or Hindi which had been gated to different time durations (200, 400, 500, 600, 700 ms). Results looked at how accurate the participants were to recognize emotions in each language condition and explored whether particular emotions could be identified from shorter time segments, and whether this was influenced by language experience. Results demonstrated that listeners recognized emotions reliably in both their native and in a foreign language; however, they demonstrated an advantage in accuracy and speed to detect some, but not all emotions, in the native language condition.\n",
    "Index Terms: speech prosody, emotions, culture\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-166"
  },
  "chen12e_speechprosody": {
   "authors": [
    [
     "Xuhai",
     "Chen"
    ],
    [
     "Yufang",
     "Yang"
    ]
   ],
   "title": "When brain differentiates happy from neutral in prosody?",
   "original": "sp12_669",
   "page_count": 4,
   "order": 169,
   "p1": "669",
   "pn": "672",
   "abstract": [
    "The effect of different intensities of vocal emotion on event related potentials has yet not been studied. We therefore investigated 16 healthy participants with emotion and sound decision on neutral and happy voice which varied continuously in intensity. The result found that neutral and happy voice can be differentiated on P2 component under both explicit and implicit condition. Moreover, the P2 parameters were linear correlated with the rate of happiness, suggesting a graded processing of vocal emotion in early stage. However, the brain distinguished neutral from happy in P3 interval when performing explicit task but exhibit a categorical feature.\n",
    "Index Terms: emotional prosody, ERP, recognition\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-167"
  },
  "nemoto12_speechprosody": {
   "authors": [
    [
     "Rena",
     "Nemoto"
    ],
    [
     "Martine",
     "Adda-Decker"
    ],
    [
     "Jacques",
     "Durand"
    ]
   ],
   "title": "The influence of speaking style on lexical F0 profiles in French",
   "original": "sp12_673",
   "page_count": 4,
   "order": 170,
   "p1": "673",
   "pn": "676",
   "abstract": [
    "This study presents a comparison of French lexical fundamental frequency (f0) profiles for different speaking styles using phonemic, syllabic and lexical transcriptions as well as partof- speech annotations. Three speaking styles (broadcast news, broadcast conferences and conversations) with over 20 hours of speech were used. Syllabic word length and POS were considered as influential factors. Results confirm word final syllable accentuation as common tendency in French. The study highlights noun word-initial accentuation after determiner for BN style speech. Journalistic prepared speech features lexical words with more dynamic f0 profiles on average versus more stable flat profiles for our spontaneous data. Future works include localization of named-entity and/or focus of speech within the framework of discriminative classifiers.\n",
    "Index Terms: fundamental frequency, lexical f0 profiles, French, word-final accentuation, POS annotation, corpus-based study, automatic processing.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-168"
  },
  "rilliard12_speechprosody": {
   "authors": [
    [
     "Albert",
     "Rilliard"
    ],
    [
     "João Antônio de",
     "Moraes"
    ],
    [
     "Donna",
     "Erickson"
    ],
    [
     "Takaaki",
     "Shochi"
    ]
   ],
   "title": "Prosodic analysis of Brazilian Portuguese attitudes",
   "original": "sp12_677",
   "page_count": 4,
   "order": 171,
   "p1": "677",
   "pn": "680",
   "abstract": [
    "This paper presents the prosodic analysis of a corpus of Brazilian Portuguese attitudes. Attitudes are separated between the social and propositional categories, and performed either with an assertive or an interrogative modality. Previous studies show the particular relevance of prosodic cues for propositional attitudes, while visual cues are more relevant for social ones. This paper shows that this greater relevance of prosody for propositional attitudes is also observed on the prosodic parameters' variations – and enhance particularly the clearly different and prototypical F0 contours that distinguished such expressions. The importance of lexical stress on the contour is emphasized, strengthening the global coherence of the speaker's prosodic strategies.\n",
    "Index Terms: prosodic attitudes, Brazilian Portuguese\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-169"
  },
  "ishi12_speechprosody": {
   "authors": [
    [
     "Carlos Toshinori",
     "Ishi"
    ],
    [
     "Hiroaki",
     "Hatano"
    ],
    [
     "Norihiro",
     "Hagita"
    ]
   ],
   "title": "Extraction of paralinguistic information carried by mono-syllabic interjections in Japanese",
   "original": "sp12_681",
   "page_count": 4,
   "order": 172,
   "p1": "681",
   "pn": "684",
   "abstract": [
    "Mono-syllabic interjections are often used to express a reaction in conversational speech. It is known that there is relationship between the speaking style, given by intonation and voice quality-related prosodic features, and the paralinguistic information carried by an interjection. However, it is also known that this relationship is dependent on the interjection type. In the present work, we analyzed the relationship between speaking style and the conveyed paralinguistic information item for several mono-syllabic interjection types in Japanese. Evaluation results show that acoustic parameters related to intonation and voice quality features in conjunction with the identity of the interjection are effective for disambiguating 71% of the paralinguistic information items.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-170"
  },
  "lu12_speechprosody": {
   "authors": [
    [
     "Yan",
     "Lu"
    ],
    [
     "Véronique",
     "Aubergé"
    ],
    [
     "Albert",
     "Rilliard"
    ]
   ],
   "title": "Do you hear my attitude? prosodic perception of social affects in Mandarin",
   "original": "sp12_685",
   "page_count": 4,
   "order": 173,
   "p1": "685",
   "pn": "688",
   "abstract": [
    "Social affects are, on the contrary to emotions, some voluntary controls expressed within the prosody, and contribute to build the meaning in the speech acts. The present work was set up to examine the perception of Chinese social affects by native subjects, but in the long term aims for the method of attitudinal prosody teaching. A speech corpus was designed with the variation of length, tone location and syntactic structures of utterances, and has been incorporated with 19 social affects. The perceptual experiment reveals that the social affects were globally well recognized; “declaration” and “disappointment” were the best recognized; “confidence” and “irony” were the less recognized. All social affects listed were clustered into seven groups, coherently in terms of cognitive/mental processing.\n",
    "Index Terms: prosodic perception, attitudes, social affects discrimination, Mandarin Chinese\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-171"
  },
  "globerson12_speechprosody": {
   "authors": [
    [
     "Eitan",
     "Globerson"
    ],
    [
     "Noam",
     "Amir"
    ],
    [
     "Michal",
     "Lavidor"
    ],
    [
     "Liat",
     "Kishon-Rabin"
    ],
    [
     "Ofer",
     "Golan"
    ]
   ],
   "title": "Psychoacoustic abilities as predictors of vocal emotion recognition in autism",
   "original": "sp12_689",
   "page_count": 4,
   "order": 174,
   "p1": "689",
   "pn": "692",
   "abstract": [
    "Individuals with Autism Spectrum Disorders (ASD) show deficiencies in prosodic abilities, both pragmatic and affective. Their deficiencies in affective prosody have been mostly related to cognitive difficulties in emotion recognition. The current study tested an alternative hypothesis, linking vocal emotion recognition difficulties in ASD to lower level auditory perceptual deficiencies. Twenty one high functioning male adults with ASD and 32 male adults from the general population, matched on age and verbal abilities, and screened for normal hearing thresholds, undertook a battery of auditory tasks. Results demonstrated that individuals with ASD scored significantly lower than controls on vocal emotion recognition. Psychoacoustic abilities were strong predictors of vocal emotion recognition in both the ASD and control groups. Psychoacoustic abilities explained 48.1% of the variance of vocal emotion recognition scores in the ASD group, and 28.0% of the variance in the general population group. These results highlight the importance of lower level psychoacoustic factors in the perception of prosody in autism.\n",
    "Index Terms: prosody, autism, psychoacoustic abilities\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-172"
  },
  "tahon12_speechprosody": {
   "authors": [
    [
     "Marie",
     "Tahon"
    ],
    [
     "Gilles",
     "Degottex"
    ],
    [
     "Laurence",
     "Devillers"
    ]
   ],
   "title": "Usual voice quality features and glottal features for emotional valence detection",
   "original": "sp12_693",
   "page_count": 4,
   "order": 175,
   "p1": "693",
   "pn": "696",
   "abstract": [
    "We focus in this paper on the detection of emotions collected in real-life context. In order to improve our emotional valence detection system, we have tested new voice quality features that are mainly used for speech synthesis or voice transformation: the relaxation coefficient (Rd) and the functions of phase distortion (FPD); but also usual voice quality features. Distributions of voice quality features across speakers, gender, age and emotions are shown over the IDVHR ecological corpus. Our results conclude that glottal and usual voice quality features are of interest for emotional valence detection even facing diverse kind of voices in ecological situations.\n",
    "Index Terms: voice quality features, emotional valence detection, shape parameter, real-life data.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-173"
  },
  "menezes12b_speechprosody": {
   "authors": [
    [
     "Caroline",
     "Menezes"
    ]
   ],
   "title": "Acoustic and phonetic differences in laughter of male children and adults",
   "original": "sp12_697",
   "page_count": 94,
   "order": 176,
   "p1": "697",
   "pn": "700",
   "abstract": [
    "This paper compares the acoustic differences in spontaneous recordings of child and adult laughter. Results indicate that, mean pitch and intensity of laughter are significantly different in adults and children but they follow expected speech patterns. Children also have higher vocal tract resonant frequencies when compared to adults. However, both groups were similar in differentiating the non-phonated consonantal segment in laughter from the phonated vocalic segment through supralaryngeal dynamics. Consonants were produced with a lower jaw and forward tongue position with the jaw and tongue moving upwards and back respectively for the vowel. Finally, in this study laughter vowels fell within the Peteson and Barney speech vowel data but the spread was large not indicative of a reduced vowel status for laughter vowels.\n",
    "Index Terms: child laughter, adult laughter, acoustic analysis\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-174"
  },
  "yang12c_speechprosody": {
   "authors": [
    [
     "Xinlu",
     "Yang"
    ],
    [
     "Jie",
     "Liang"
    ]
   ],
   "title": "Declarative and interrogative intonations by brain-damaged speakers of Uygur and Mandarin Chinese",
   "original": "sp12_701",
   "page_count": 4,
   "order": 177,
   "p1": "701",
   "pn": "704",
   "abstract": [
    "In this study we investigated the declarative and interrogative intonations of Uygur and Mandarin Chinese by right hemisphere brain-damaged (RHD) speakers. We found the two RHD speakers employed the falling tone for both declarative and interrogative sentences. The pitch range of the RHD speakers was more than 1.5 times narrower than that of the healthy speakers. The global F0 curves of questions did not display the higher level than those of statements. Not a single final rise occurred in the interrogative intonations by the RHD speaker of Uygur, but slight pitch raising of the final syllable occurred in declarative question and wh-question intonations by the RHD speaker of Mandarin Chinese. The utterance onsets were lower in the questions than in the statement by the RHD speaker of Mandarin Chinese, which was manifested in a higher level above the declarative intonation by the RHD speaker of Uygur. Moreover, the raised F0 minima from the statements to questions did not occur in the intonations of RHD speakers. Finally, the fixed stress pattern in Uygur preserved intact when the speaker of Uygur suffered from intonation damage. The results are in support of the finding that intonation is processed in the right hemisphere.\n",
    "Index Terms: intonation, brain-damaged, Uygur, Mandarin Chinese\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-175"
  },
  "oliveirajr12_speechprosody": {
   "authors": [
    [
     "Miguel",
     "Oliveira Jr"
    ],
    [
     "Regina",
     "Cruz"
    ],
    [
     "Ebson Wilkerson",
     "Silva"
    ]
   ],
   "title": "Perception of spontaneous narrative structure",
   "original": "sp12_705",
   "page_count": 4,
   "order": 178,
   "p1": "705",
   "pn": "708",
   "abstract": [
    "The present paper reports the results of a perceptual experiment that was conducted in order to find out to what extent naïve, untrained labelers can benefit from prosodic information present in spontaneous narratives so as to derive an underlying structure associated with them. Results from inter-rater agreements suggest that even when the lexical, syntactic, and semantic information of a narrative is blocked, labelers can still identify its underlying structure, which clearly indicates that listeners make substantial use of prosodic information in the task of identifying the structure of spontaneous narratives.\n",
    "Index Terms: spontaneous narrative, structure, prosody, perception\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-176"
  },
  "li12d_speechprosody": {
   "authors": [
    [
     "Ya",
     "Li"
    ]
   ],
   "title": "A phase-based account of Mandarin third tone sandhi domains",
   "original": "sp12_709",
   "page_count": 4,
   "order": 179,
   "p1": "709",
   "pn": "712",
   "abstract": [
    "The present paper argues for an account of Mandarin Third Tone Sandhi (T3S) domains in terms of phase-based syntaxphonology mapping. Given the phase-based architecture of the grammar, a T3S domain is assumed to include everything inside a phase (XP), excluding material at the phase edge (the head X and Specifier). Unlike previous prosody based accounts of T3S domains, the phase based account does not require domain formation to satisfy two conditions, the immediate constituency and the syllable count, because they are automatically satisfied as each phase is built up and spelt out before T3S can apply. In order for the phase based analysis of T3S domains to work, however, the minimalist understanding of Mandarin syntactic structures is required. In other words, direct syntax-phonology mapping in T3S domain formation is possible only within the minimalist framework.\n",
    "Index Terms: syntax-phonology mapping, phase, minimalist, tone sandhi, Mandarin\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-177"
  },
  "herment12_speechprosody": {
   "authors": [
    [
     "Sophie",
     "Herment"
    ],
    [
     "Laetitia",
     "Leonarduzzi"
    ]
   ],
   "title": "The pragmatic functions of prosody in English cleft sentences",
   "original": "sp12_713",
   "page_count": 4,
   "order": 180,
   "p1": "713",
   "pn": "716",
   "abstract": [
    "The prosodic and pragmatic analysis of some 450 examples of clefts, taken in corpora of spontaneous and natural speech, sheds light on the different functions that prosody can take on in discourse. The prosodic analysis is mainly based on the number of tone units, the place of the nuclear syllable and the pitch movement. The context is also taken into account. We show that clefts display a variety of prosodic patterns, which can have several pragmatic functions. The role of prosody can be to indicate the information structure of the cleft sentence (a falling tone for informative elements), to annihilate focalisation on the so-called “focus” (the focused element is deaccented) or reinforce it (with a marked tone), or to mark contrast or emphasis on the presupposed element (marked tone or tonicity).\n",
    "Index Terms: prosody; discourse; pragmatic functions; syntax; prosody/discourse interface; information structure; itclefts; wh-clefts; reverse wh-clefts; focalisation; emphasis; contrast.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-178"
  },
  "fezza12_speechprosody": {
   "authors": [
    [
     "Nassima",
     "Fezza"
    ],
    [
     "Cyril",
     "Auran"
    ]
   ],
   "title": "Prosody and discourse structure in French: a multilayer multi-parametric analysis of comic strip narrations",
   "original": "sp12_717",
   "page_count": 4,
   "order": 181,
   "p1": "717",
   "pn": "720",
   "abstract": [
    "This paper fits into a tradition of prosodic analyses of discourse in French, but it proposes among the first multilayer multi-parametric descriptions. The study presented here is based on the analysis of a corpus of narrations from the comic strip Titeuf by six French natives. Discourse annotation was carried out, and pitch, intensity, duration and spectral parameters were automatically extracted from the recordings at different levels of the linguistic structure. Our results confirm and further illustrate previous studies on the prosodic marking of discourse structure in general, particularly concerning pitch reset at the beginning of new topics; but we also provide new elements regarding the discursive roles of intensity and speech rate, which somewhat challenge previous work in the field, and favour less strictly hierarchical models of discourse structure.\n",
    "Index Terms: discourse prosody, discourse structure, French\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-179"
  },
  "oertel12_speechprosody": {
   "authors": [
    [
     "Catharine",
     "Oertel"
    ],
    [
     "Marcin",
     "Włodarczak"
    ],
    [
     "Alexey",
     "Tarasov"
    ],
    [
     "Nick",
     "Campbell"
    ],
    [
     "Petra",
     "Wagner"
    ]
   ],
   "title": "Context cues for classification of competitive and collaborative overlaps",
   "original": "sp12_721",
   "page_count": 4,
   "order": 182,
   "p1": "721",
   "pn": "724",
   "abstract": [
    "Being able to respond appropriately to users' overlaps should be seen as one of the core competencies of incremental dialogue systems. At the same time identifying whether an interlocutor wants to support or grab the turn is a task which comes naturally to humans, but has not yet been implemented in such systems. Motivated by this we first investigate whether prosodic characteristics of speech in the vicinity of overlaps are significantly different from prosodic characteristics in the vicinity of non-overlapping speech. We then test the suitability of different context sizes, both preceding and following but excluding features of the overlap, for the automatic classification of collaborative and competitive overlaps. We also test whether the fusion of preceding and succeeding contexts improves the classification. Preliminary results indicate that the optimal context for classification of overlap lies at 0.2 seconds preceding the overlap and up to 0.3 seconds following it. We demonstrate that we are able to classify collaborative and competitive overlap with a median accuracy of 63%.\n",
    "Index Terms: overlapping speech, dialogue prosody, cooperative overlaps, competitive overlaps\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-180"
  },
  "cao12_speechprosody": {
   "authors": [
    [
     "Jianfen",
     "Cao"
    ]
   ],
   "title": "Prosodic prominence and phrasing in spoken Mandarin: the case in the 3rd tone",
   "original": "sp12_725",
   "page_count": 4,
   "order": 183,
   "p1": "725",
   "pn": "728",
   "abstract": [
    "Prosodic prominence and phrasing has some general principle commonly existed in the world languages, but their execution is language-specific, especially in tone languages like Chinese. The kernel of the issue is that how the pitch manifestation of individual tones accommodate to achieve prominence and phrasing within certain prosodic domain. This paper tries to explore the peculiarity on pitch alignment of the 3rd tone in Mandarin Chinese by examining its F0 movements in different accent status. The primary result leads to a consideration that, the pattern of pitch manifestation for prominence and phrasing may greatly depend on the register distinction among the tones, even without regard to other context environments.\n",
    "Index Terms: prominence, phrasing, pitch manifestation, 3rd tone, Mandarin Chinese\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-181"
  },
  "weijer12_speechprosody": {
   "authors": [
    [
     "Joost van de",
     "Weijer"
    ],
    [
     "Jeroen van de",
     "Weijer"
    ],
    [
     "Yan",
     "Beili"
    ]
   ],
   "title": "Proper-name identification",
   "original": "sp12_729",
   "page_count": 4,
   "order": 184,
   "p1": "729",
   "pn": "732",
   "abstract": [
    "In a series of three experiments, we investigated whether proper names (like John, Anna, Henry) are more easily identifiable in spoken language than common nouns. In the first two experiments, participants listened to utterances in an unfamiliar language, and had to guess which of two words was a name. In the third experiment, listeners had to select whether a missing word in a spoken sentence was a name or a noun. Together, the results of the three experiments indicated that 1) names may be distinct acoustically from nouns; 2) this distinction interacts with the word's position in the sentence; and 3) the information is probably not in the word's context, but in the word itself.\n",
    "Index Terms: proper nouns, names, common nouns\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-182"
  },
  "lai12_speechprosody": {
   "authors": [
    [
     "Catherine",
     "Lai"
    ]
   ],
   "title": "Response types and the prosody of declaratives",
   "original": "sp12_733",
   "page_count": 4,
   "order": 185,
   "p1": "733",
   "pn": "736",
   "abstract": [
    "This paper presents a production study of declarative responses in varying dialogue contexts. The goal was to determine what sort of dialogue conditions produce systematic variations in prosody, and what these variations mean for discourse interpretation. After controlling for information structural factors, we found that distinct prosodic forms were predictably and consistently elicited by varying the response type of the utterance. In particular, we found that indirect agreements/contradictions were produced with a distinct intonational form compared to to direct responses. We quantify the prosodic separability of these response types via classification experiments, comparing the usefulness of both aggregate features, e.g. mean and variance, and features derived from function decomposition techniques. We find that the latter approach allows us for a more succinct description of category differences in terms of tilt and convexity.\n",
    "Index Terms: Prosody, Production, Pragmatics, Dialogue acts, Information structure, F0 modelling.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-183"
  },
  "edlund12_speechprosody": {
   "authors": [
    [
     "Jens",
     "Edlund"
    ],
    [
     "David",
     "House"
    ],
    [
     "Sofia",
     "Strömbergsson"
    ]
   ],
   "title": "Question types and some prosodic correlates in 600 questions in the Spontal database of Swedish dialogues",
   "original": "sp12_737",
   "page_count": 4,
   "order": 186,
   "p1": "737",
   "pn": "740",
   "abstract": [
    "Studies of questions present strong evidence that there is no one-to-one relationship between intonation and interrogative mode. We present initial steps of a larger project investigating and describing intonational variation in the Spontal database of 120 half-hour spontaneous dialogues in Swedish, and testing the hypothesis that the concept of a standard question intonation such as a final pitch rise contrasting a final low declarative intonation is not consistent with the pragmatic use of intonation in dialogue. We report on the extraction of 600 questions from the Spontal corpus, coding and annotation of question typology, and preliminary results concerning some prosodic correlates related to question type.\n",
    "Index Terms: speech prosody, spontaneous speech, question intonation, interrogative intonation, question typology\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-184"
  },
  "ji12_speechprosody": {
   "authors": [
    [
     "Xiaoli",
     "Ji"
    ],
    [
     "Xia",
     "Wang"
    ],
    [
     "Yuan",
     "Jia"
    ],
    [
     "Ajun",
     "Li"
    ]
   ],
   "title": "Intonation patterns of wh-questions from Chinese EFL learners",
   "original": "sp12_741",
   "page_count": 4,
   "order": 187,
   "p1": "741",
   "pn": "744",
   "abstract": [
    "The present study investigates Chinese EFL (English as a foreign language) learner's intonation pattern of wh-questions on the basis of AM theory. When the nuclear accent is at the end of the sentence, the American speakers tend to apply a falling tone (H*L) with either a low or high boundary tone. The Chinese learners usually apply the same falling tone (H*L) or a rising-falling tone (L*HL) on nuclear accent. However, the Chinese learners always produce a pre-nuclear accent on the word 'what'. Sometimes, the Chinese learners adopt a rising tone (L*H) on nuclear accent with a high boundary tone. When the nuclear accent is in the middle of the sentence, both the American and Chinese speakers use a falling tone (H*L) or a rising-falling tone (L*HL) on the nuclear accent. However, the Chinese learners emphasize some word after the nuclear accent without any prosodic boundaries between them This phenomenon indicates that the Chinese learners might put a post-nuclear accent on the words after the nuclear accent.\n",
    "Index Terms: Chinese EFL learner, pitch patterns, whquestions\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2012-185"
  }
 },
 "sessions": [
  {
   "title": "Keynote Papers",
   "papers": [
    "hoffmann12_speechprosody",
    "sagisaka12_speechprosody",
    "tao12_speechprosody",
    "gandour12_speechprosody",
    "ma12_speechprosody"
   ]
  },
  {
   "title": "Speech Processing and Tools; Description and Cross-Linguistic Studies",
   "papers": [
    "karkhedkar12_speechprosody",
    "wen12_speechprosody",
    "hirst12_speechprosody",
    "bigi12_speechprosody",
    "na12_speechprosody",
    "ng12_speechprosody",
    "wittenberg12_speechprosody",
    "kagomiya12_speechprosody",
    "govind12_speechprosody",
    "martin12_speechprosody",
    "martin12b_speechprosody",
    "pessoa12_speechprosody",
    "bartkova12_speechprosody",
    "abouzleikha12_speechprosody",
    "reichel12_speechprosody",
    "ogbureke12_speechprosody",
    "looze12_speechprosody",
    "goldman12_speechprosody"
   ]
  },
  {
   "title": "Descriptive and Cross-Linguistic Studies",
   "papers": [
    "wollermann12_speechprosody",
    "mixdorff12_speechprosody",
    "yeh12_speechprosody",
    "graetzer12_speechprosody",
    "wang12_speechprosody",
    "xu12_speechprosody",
    "qin12_speechprosody",
    "huff12_speechprosody",
    "wu12_speechprosody",
    "camargo12_speechprosody",
    "caelenhaumont12_speechprosody",
    "karlsson12_speechprosody",
    "audrit12_speechprosody",
    "martin12c_speechprosody",
    "asante12_speechprosody"
   ]
  },
  {
   "title": "Prosody and Speech Processing",
   "papers": [
    "chiu12_speechprosody",
    "kane12_speechprosody",
    "michelas12_speechprosody",
    "brugos12_speechprosody",
    "cunningham12_speechprosody",
    "hasegawajohnson12_speechprosody"
   ]
  },
  {
   "title": "Control of Prosodic Features for Expressive Speech Synthesis with Less Speech Corpus (Special Session)",
   "papers": [
    "wang12b_speechprosody",
    "li12_speechprosody",
    "hirose12_speechprosody",
    "yoshizato12_speechprosody",
    "obin12_speechprosody",
    "demenko12_speechprosody"
   ]
  },
  {
   "title": "Prosody and First and Second Language Acquisition",
   "papers": [
    "vosoughi12_speechprosody",
    "kato12_speechprosody",
    "wang12c_speechprosody",
    "li12b_speechprosody"
   ]
  },
  {
   "title": "Language Interaction and Acquisition",
   "papers": [
    "liao12_speechprosody",
    "rongna12_speechprosody",
    "ma12b_speechprosody",
    "mac12_speechprosody",
    "zou12_speechprosody",
    "chen12_speechprosody",
    "wu12b_speechprosody",
    "white12_speechprosody",
    "todd12_speechprosody",
    "wang12d_speechprosody",
    "barqueroarmesto12_speechprosody",
    "rude12_speechprosody"
   ]
  },
  {
   "title": "Prominence, Focus and Emphasis",
   "papers": [
    "niebuhr12_speechprosody",
    "gors12_speechprosody",
    "schwab12_speechprosody",
    "avanzi12_speechprosody",
    "lee12_speechprosody",
    "rosenberg12_speechprosody",
    "ning12_speechprosody",
    "wang12e_speechprosody",
    "kaland12_speechprosody",
    "tseng12_speechprosody",
    "sorianello12_speechprosody",
    "chang12_speechprosody",
    "kleber12_speechprosody",
    "mady12_speechprosody",
    "sappok12_speechprosody",
    "you12_speechprosody",
    "mahrt12_speechprosody",
    "ardali12_speechprosody",
    "schwab12b_speechprosody"
   ]
  },
  {
   "title": "Prosody in Language Acquisition (Special Session)",
   "papers": [
    "lin12_speechprosody",
    "vargas12_speechprosody",
    "yeh12b_speechprosody",
    "liu12_speechprosody"
   ]
  },
  {
   "title": "Prosody in Language Acquisition and Language Contact",
   "papers": [
    "schwab12c_speechprosody",
    "qiu12_speechprosody",
    "he12_speechprosody",
    "do12_speechprosody",
    "qin12b_speechprosody",
    "chen12b_speechprosody",
    "ding12_speechprosody",
    "ding12b_speechprosody",
    "crocco12_speechprosody",
    "turco12_speechprosody",
    "yang12_speechprosody",
    "na12b_speechprosody",
    "nesterenko12_speechprosody",
    "hackman12_speechprosody",
    "obin12b_speechprosody",
    "chen12c_speechprosody",
    "sichelbazin12_speechprosody",
    "boulademareuil12_speechprosody",
    "shin12_speechprosody",
    "bartkova12b_speechprosody",
    "german12_speechprosody",
    "martin12d_speechprosody"
   ]
  },
  {
   "title": "Prosody in Language Contact (Special Session)",
   "papers": [
    "benet12_speechprosody",
    "bordal12_speechprosody",
    "zerbian12_speechprosody"
   ]
  },
  {
   "title": "Prosody and Emotion; Tonal Aspects of Prosody",
   "papers": [
    "lin12b_speechprosody",
    "lee12b_speechprosody",
    "rottger12_speechprosody",
    "mok12_speechprosody"
   ]
  },
  {
   "title": "Duration and Rhythm",
   "papers": [
    "he12b_speechprosody",
    "govind12b_speechprosody",
    "meireles12_speechprosody",
    "wu12c_speechprosody",
    "mairano12_speechprosody",
    "yoon12_speechprosody",
    "hamzah12_speechprosody",
    "govind12c_speechprosody",
    "lee12c_speechprosody",
    "benus12_speechprosody",
    "hubler12_speechprosody",
    "dorn12_speechprosody",
    "schellenberg12_speechprosody",
    "benus12b_speechprosody",
    "bertinetto12_speechprosody",
    "gilbert12_speechprosody",
    "wiener12_speechprosody",
    "yuan12_speechprosody",
    "jun12_speechprosody",
    "dellwo12_speechprosody"
   ]
  },
  {
   "title": "Pitch and Boundaries",
   "papers": [
    "yang12b_speechprosody",
    "chen12d_speechprosody",
    "abolhasanizadeh12_speechprosody",
    "zhang12_speechprosody",
    "yoon12b_speechprosody",
    "portes12_speechprosody",
    "shuai12_speechprosody",
    "mixdorff12b_speechprosody",
    "sang12_speechprosody",
    "hu12_speechprosody",
    "gac12_speechprosody",
    "phelan12_speechprosody",
    "li12c_speechprosody",
    "qin12c_speechprosody"
   ]
  },
  {
   "title": "Prosody and Regional Dialects",
   "papers": [
    "wang12f_speechprosody",
    "avanzi12b_speechprosody",
    "leemann12_speechprosody",
    "wodarczak12_speechprosody"
   ]
  },
  {
   "title": "Prosodic Annotation: Past, Present, and Future",
   "papers": [
    "looze12b_speechprosody",
    "mixdorff12c_speechprosody"
   ]
  },
  {
   "title": "Prosody and Perception",
   "papers": [
    "zhou12_speechprosody",
    "kohler12_speechprosody",
    "huang12_speechprosody",
    "hwang12_speechprosody"
   ]
  },
  {
   "title": "Style, Attitude and Emotion",
   "papers": [
    "garrido12_speechprosody",
    "menezes12_speechprosody",
    "wang12g_speechprosody",
    "gangamohan12_speechprosody",
    "steidl12_speechprosody",
    "pell12_speechprosody",
    "chen12e_speechprosody",
    "nemoto12_speechprosody",
    "rilliard12_speechprosody",
    "ishi12_speechprosody",
    "lu12_speechprosody",
    "globerson12_speechprosody",
    "tahon12_speechprosody",
    "menezes12b_speechprosody"
   ]
  },
  {
   "title": "Syntax, Narrative, Speech Act and Discourse",
   "papers": [
    "yang12c_speechprosody",
    "oliveirajr12_speechprosody",
    "li12d_speechprosody",
    "herment12_speechprosody",
    "fezza12_speechprosody",
    "oertel12_speechprosody",
    "cao12_speechprosody",
    "weijer12_speechprosody",
    "lai12_speechprosody",
    "edlund12_speechprosody",
    "ji12_speechprosody"
   ]
  }
 ],
 "doi": "10.21437/SpeechProsody.2012"
}