{
 "title": "Speech Prosody 2008",
 "location": "Campinas, Brazil",
 "startDate": "6/5/2008",
 "endDate": "9/5/2008",
 "conf": "SpeechProsody",
 "year": "2008",
 "name": "speechprosody_2008",
 "series": "SpeechProsody",
 "SIG": "SProSIG",
 "title1": "Speech Prosody 2008",
 "date": "6-9 May 2008",
 "papers": {
  "port08_speechprosody": {
   "authors": [
    [
     "Robert F.",
     "Port"
    ]
   ],
   "title": "All is prosody: phones and phonemes are the ghosts of letters",
   "original": "sp08_007",
   "page_count": 7,
   "order": 1,
   "p1": "7",
   "pn": "13",
   "abstract": [
    "The standard way to represent language within linguistics is using letter-like units, i.e., with consonant and vowel phones and phonemes. But this representation, despite its powerful intuitive appeal is not supported by any experimental data. There are 4 straightforward predictions implied by this model. All are shown to fail. One of the main problems is the inability of segments to permit representing actual values of time. One realtime property of speech is the periodically produced speech found, e.g., in song and chant. Several audio clips of spontaneously produced rhythmic speech will be analyzed and speaker performance on the related laboratory task of speech cycling will be reviewed. In this phraserepetition task speakers quickly adopt nested periodic timing patterns that are surprisingly rigid in time. Letter-based descriptions of speech make such rhythm invisible and irrelevant to anything `linguistic. This is further evidence that phones and phonemes are only categories of patterns in the speech of a community, and not the psychological symbol tokens employed in the realtime production and perception of speech.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-1"
  },
  "xu08_speechprosody": {
   "authors": [
    [
     "Yi",
     "Xu"
    ]
   ],
   "title": "Multi-dimensional information coding in speech",
   "original": "sp08_017",
   "page_count": 10,
   "order": 2,
   "p1": "17",
   "pn": "26",
   "abstract": [
    "We speak to convey information to the listener, and we listen to decode information carried by the speech signal. How we are able to do so is the ultimate puzzle for speech research. Much of the existing research effort, however, is devoted not directly to this central puzzle, but to various what could be called epiphenomena: speech rhythm, prosodic hie hierarchy, rarchy, intonational structure, naturalness of synthetic speech, etc. In this paper I argue that cracking the central puzzle of speech coding is not only the ultimate call for us as speech scientists, but also the key to understanding various epiphenomena in speech. I will demonstrate that speech involves multi multi- dimensional information coding due to the richness of information to be encoded and the compl complex exity of the ity underlying neuro neuro-physiological and biophysical mechanisms. Understanding this process may l lead to ead better understanding of many of the epiphenomena as well.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-2"
  },
  "saltzman08_speechprosody": {
   "authors": [
    [
     "Elliot",
     "Saltzman"
    ],
    [
     "Hosung",
     "Nam"
    ],
    [
     "Jelena",
     "Krivokapic"
    ],
    [
     "Louis",
     "Goldstein"
    ]
   ],
   "title": "A task-dynamic toolkit for modeling the effects of prosodic structure on articulation",
   "original": "sp08_175",
   "page_count": 10,
   "order": 3,
   "p1": "175",
   "pn": "184",
   "abstract": [
    "The original task-dynamic model of speech production incorporated the theoretical tenets of Articulatory Phonology and provided a dynamics of inter-articulator coordination for single and co-produced constriction gestures, given a gestural score that specifies a time-dependent vector of gestural activations for a given utterance. More recently, the model has been significantly extended to provide a framework for investigating the higher order dynamics of prosodic phrasing, syllable structure, lexical stress, and the prominence (accentual) properties associated with higher level prosodic constituents (e.g., foot, word, phrase, sentence). There are two new components in the model. The first is an ensemble of gestural planning oscillators that defines a dynamics of gestural score formation in that, once the ensemble reaches an entrained steady-state of relative phasing, the waveform of each oscillator is used to specify the activation function of that oscillator's associated constriction gesture and to trigger, thereby, the onset of the gesture. The second component is a set of modulation gestures (ì-gestures) that, rather than activating constriction formation and release gestures in the vocal tract, serve to modulate the temporal and spatial properties of all concurrently active constriction gestures. Modulation gestures are of two types: temporal modulation gestures (ìT-gestures) that alter the rate of utterance timeflow by smoothly changing all frequency parameters of the planning oscillator ensemble; and spatial modulation gestures (ìS -gestures) that spatially strengthen or reduce the motions of constriction gestures by smoothly changing the spatial target parameters of these constriction gestures. Key to the representation of prosodic phrasing has been use of clockslowing temporal modulation gestures (called prosodic gestures [ð-gestures] in previous work) that are locally active in the region of phrasal boundaries, and that slow the rate of utterance timeflow in direct proportion to the strength of the associated boundary. Central to the representation of syllable structure is the use of a coupling graph that defines the existence and strength of coupling in the network of gestural planning oscillators, and shapes the manner in which gestures are coordinated. Concepts from graph theory have been crucial to understanding how hypothesized differences among coupling graphs have correctly predicted empirically demonstrated intra-syllabic differences between onsets and codas in both the mean values and variabilities of C-C, C-V, and V-C timing patterns. In this paper, we describe a set of recent developments to our task-dynamic toolkit (planning oscillator ensemble and temporal modulation gestures) and how they have been used to interpret and simulate experimental data on the interactions of stress and prominence in shaping the \"prosodically driven phonetic detail\" [14] of speech.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-3"
  },
  "moraes08_speechprosody": {
   "authors": [
    [
     "João Antônio de",
     "Moraes"
    ]
   ],
   "title": "The pitch accents in Brazilian portuguese: analysis by synthesis",
   "original": "sp08_389",
   "page_count": 9,
   "order": 4,
   "p1": "389",
   "pn": "397",
   "abstract": [
    "This study offers a phonetic description and phonological analysis of a variety of melodic contours in Brazilian Portuguese. These are commonly referred to as conveying the modal, or illocutionary, functions of intonation, as well as some attitudinal uses. The phonological analysis follows the AM framework and aims at distinguishing what is contrastive and what are merely allophonic variations of a given melodic pattern with the help of a resynthesis technique, in order to propose a more consistent (phonological) representation of the contours examined.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-4"
  },
  "kawahara08_speechprosody": {
   "authors": [
    [
     "Hideki",
     "Kawahara"
    ]
   ],
   "title": "TANDEM-STRAIGHT, a research tool for L2 study enabling flexible manipulations of prosodic information",
   "original": "sp08_619",
   "page_count": 10,
   "order": 5,
   "p1": "619",
   "pn": "628",
   "abstract": [
    "A speech analysis, modification, and resynthesis system called STRAIGHT has been widely used in the speech research community. However, its foundation and implementation were not well established. This lecture introduces recent advances in STRAIGHTs foundation based on a new concept called TANDEM, a simple method for calculating temporally stable power spectra using two F0-adaptive time windows. A new interpretation of Shannons sampling theory also provided a mathematical foundation and guidelines for designing STRAIGHT. A unified approach based on TANDEM and STRAIGHT in F0 extraction (at the same time, revisiting its conceptualization) and aperiodicity information representation provide flexibility in prosodyrelated feature manipulation. An overview on prospective applications of the new TANDEM-STRAIGHT in L2 study will also be presented.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-5"
  },
  "lugger08_speechprosody": {
   "authors": [
    [
     "Marko",
     "Lugger"
    ],
    [
     "Frank",
     "Stimm"
    ],
    [
     "Bin",
     "Yang"
    ]
   ],
   "title": "Extracting voice quality contours using discrete hidden Markov models",
   "original": "sp08_029",
   "page_count": 4,
   "order": 6,
   "p1": "29",
   "pn": "32",
   "abstract": [
    "In this paper we present an approach of extracting voice quality contours from speech utterances. We apply the theory of hidden Markov models to voice quality classification. As in the case of automatic speech recognition, where the states of the model are interpreted as different phonemes, we interpret the states of our voice quality models as different phonation types. Since nonmodal voice quality is only selectively applied in natural speech, the task is to detect those regions within an utterance where these voice qualities were used by the human speech production. We realize that by building so called voice quality contours. Each segment of speech is associated by one discrete voice quality class defined by J. Laver. In this study we distinguish between modal, breathy, creaky, and rough voice.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-6"
  },
  "yoon08_speechprosody": {
   "authors": [
    [
     "Tae-Jin",
     "Yoon"
    ],
    [
     "Jennifer",
     "Cole"
    ],
    [
     "Mark",
     "Hasegawa-Johnson"
    ]
   ],
   "title": "Detecting non-modal phonation in telephone speech",
   "original": "sp08_033",
   "page_count": 4,
   "order": 7,
   "p1": "33",
   "pn": "36",
   "abstract": [
    "Non-modal phonation conveys both linguistic and paralinguistic information, and is distinguished by acoustic source and filter features. Detecting non-modal phonation in speech requires reliable F0 analysis, a problem for telephone-band speech, where F0 analysis frequently fails. We demonstrate an approach to the detection of creaky phonation in telephone speech based on robust F0 and spectral analysis. Our F0 analysis relies on an autocorrelation algorithm applied to the intensity-boosted and inverse-filtered speech signal and succeeds in regions of nonmodal phonation where the non-filtered F0 analysis typically fails. In addition to the extracted F0 values, spectral amplitude is measured at the first two harmonics (H1, H2) and the first three formants (A1, A2, A3). Visual and spectral inspection of the detected creaky phonation confirms the findings reported from laboratory setting. Statistical analysis using oneway ANOVA and classification using Support Vector Machine (SVM) reveals promising results which lead to further improvement for automatic detection of non-modal phonation in telephone speech.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-7"
  },
  "zhuang08_speechprosody": {
   "authors": [
    [
     "Xiaodan",
     "Zhuang"
    ],
    [
     "Mark",
     "Hasegawa-Johnson"
    ]
   ],
   "title": "Towards interpretation of creakiness in switchboard",
   "original": "sp08_037",
   "page_count": 4,
   "order": 8,
   "p1": "37",
   "pn": "40",
   "abstract": [
    "This paper adopts Latent Semantic Analysis (LSA) for longterm analysis of voice quality, in particular creakiness. Each automatically labeled creaky instance (word) is modeled as a document and different prosodic and syntactic cues as terms. This framework attempts to automatically identify the most salient correlates, or latent factors, of creakiness, and further assign each creaky instance (word) to one of the latent factors. The algorithm implemented in this study identifies at least two correlates of creakiness in Switchboard: (1) particles, coordinating conjunctions in repair/repeat locations, and filled pauses; (2) starts of various sentence/clause structures, such as Whadverb phrases, sentences and asides with sentence restarts at repair/repeat locations. Such automatic long-term voice quality analysis could pave the way for better incorporating voice quality in speech recognition, among other speech applications.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-8"
  },
  "cukierblaj08_speechprosody": {
   "authors": [
    [
     "Sabrina",
     "Cukier-Blaj"
    ],
    [
     "Zuleica",
     "Camargo"
    ],
    [
     "Sandra",
     "Madureira"
    ]
   ],
   "title": "Long-term average spectrum loudness variation in speakers with asthma, paradoxical vocal fold motion and without breathing problems",
   "original": "sp08_041",
   "page_count": 4,
   "order": 9,
   "p1": "41",
   "pn": "44",
   "abstract": [
    "Introduction: Vocal loudness variation can influence the reability of acoustics analysis. Therefore an intensity acoustic measure such as the Long Term Average Spectrum (LTAS) should be submitted to standard calibration and analysis procedures for realistic results. Purpose: The purpose of this study is to compare the LTAS intensity measures with and without implementation of intensity averaging procedures (calibration) in three different groups: asthma, paradoxical vocal fold motion disorder and asthma, and control group.\n",
    "Methods: Eighteen women of similar age were divided in 3 groups according to their diagnosis. Six women had asthma, six women had asthma and paradoxical vocal fold motion disorder and 6 women did not have breathing or voice problems. They were recorded according to a systematized procedure in studio conditions. Fifty-six speech samples were obtained. Those speech samples were submitted to averaged intensity procedures and compared to 56 speech samples not submitted to averaged intensity procedures according to a cluster analysis. Statistical analysis was made according to a six cluster division.\n",
    "Results: Clusters distribution was almost the same when comparing samples with and without intensity averaging procedures. However two speech samples were considered different according to the intensity procedure. It shows that the loudness variation has an impact in the LTAS acoustic analysis. The comparison among the three different diagnoses was also analyzed according to cluster analysis considering the calibrated samples. The LTAS analysis among the three groups indicated a tendency to grouping the patients with asthma in specific clusters and to conglomerate PVFM and control subjects in same groups. Conclusions: Once LTAS analysis represents the vocal quality it is suggested that asthma patients have specific vocal quality features that differentiates from PVFM and control individuals. This acoustic method can be a useful approach in the diagnosis of these diseases.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-9"
  },
  "ishi08_speechprosody": {
   "authors": [
    [
     "Carlos Toshinori",
     "Ishi"
    ],
    [
     "Hiroshi",
     "Ishiguro"
    ],
    [
     "Norihiro",
     "Hagita"
    ]
   ],
   "title": "The roles of breathy/whispery voice qualities in dialogue speech",
   "original": "sp08_045",
   "page_count": 4,
   "order": 10,
   "p1": "45",
   "pn": "48",
   "abstract": [
    "Qualitative analyses are conducted in spontaneous dialogue speech of several speakers, to verify the paralinguistic roles of breathy/whispery voice qualities in communication. Analyses show that breathy/whispery voices carry a variety of emotion- or attitude-related paralinguistic information. Breathiness often appeared in emphasized words/phrases, having the effect of calling/catching the listeners attention. It also rhythmically appeared in utterances expressing the speakers excitement. In backchannels, breathiness has the effect of expressing politeness or interest to the listeners talk. When accompanied by a softer voice quality, breathiness is used to call/catch the listeners attention, while expressing gentleness or tenderness. A more whispered and low-powered voice quality appears in confidential talking, embarrassment, or when the speaker is talking to oneself.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-10"
  },
  "salomao08_speechprosody": {
   "authors": [
    [
     "Gláucia Laís",
     "Salomão"
    ]
   ],
   "title": "Relationship between perceived vocal registers and glottal flow parameters",
   "original": "sp08_049",
   "page_count": 4,
   "order": 11,
   "p1": "49",
   "pn": "52",
   "abstract": [
    "The perception of modal and falsetto registers was analyzed in a material consisting of a total of 80 vowel sounds sung by 10 choir singers, 40 sung in modal register and 40 in falsetto register. These vowel sounds were classified by sixteen expert listeners in a force choice test and the number of votes for modal was compared with the voice source parameters (1) Closed Quotient (Qclosed)and (2) level difference between the two lowest source spectrum partials (H1 - H2). Tones with a high value of Qclosed and low values of H1-H2 were typically associated with high number of votes for modal register, and vice versa, Qclosed showing the strongest correlation. Some singer subjects produced tones that could not be classified as either falsetto or modal register, suggesting that category perception of registers is not always feasible.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-11"
  },
  "demenko08_speechprosody": {
   "authors": [
    [
     "Grazyna",
     "Demenko"
    ]
   ],
   "title": "Voice stress extraction",
   "original": "sp08_053",
   "page_count": 4,
   "order": 12,
   "p1": "53",
   "pn": "56",
   "abstract": [
    "The aim of the research was to assess the possibility of voice stress extraction and classification. It was assumed that the studys results could be applied in call centers and could be useful for securi security services. The authentic Poznan police database with the recordings of the 997 emergency phone calls was used for analysis. Out of 60 000 recordings collected in the database, 20 000 were automatically selected, a few hundred of which were eventually chosen for acoustic evaluation, the basis for that selection being a perceptual assessment. The MDVP analysis confirmed statistical significance of such parameters as fundamental frequency, energy and pitch variations for stress categorization. Some segmenta segmental parameters such as tremor and noise parameters were also confirmed to be of some importance. In case of highly stressful conditions a systematic over over-one one- octave shift in pitch was observed. It was concluded that the range of F0 per se does not seem to correlate with stress whereas the shift in F0 register constitutes the primary indicator of stress. Linear Discriminant Analysis based on 12 acoustic features showed it is possible to categorize the following classes: neutral, depressive, stressed, highly stressed speech.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-12"
  },
  "camargo08_speechprosody": {
   "authors": [
    [
     "Zuleica",
     "Camargo"
    ],
    [
     "Sandra",
     "Madureira"
    ]
   ],
   "title": "Voice quality analysis from a phonetic perspective: voice profile analysis scheme (VPAS) profile for brazilian portuguese",
   "original": "sp08_057",
   "page_count": 4,
   "order": 13,
   "p1": "57",
   "pn": "60",
   "abstract": [
    "The present study aimed at presenting the instructional material developed in the Brazilian Portuguese context to apply the Voice Profile Analysis Scheme-VPAS (PB-VPAS) for the perceptual evaluation of voice quality and at reporting preliminary data analyzed from a group of six judges who attended a workshop on VPAS. The adaptation of the VPAS into Brazilian Portuguese was accomplished and the corpus to be used in the training of judges was built up. Furthermore, the voice quality database necessary for the application of the protocol was recorded, evaluated by two expertise subjects and integrated into the instructive material of the PB-VPAS. Preliminary data from six judges (linguists and speech therapists) who attended a PB-VPAS workshop using the material described (in 2 stages: before and after a 20-hour workshop on VPAS) are presented. The relevance of the application of PB-VPAS to the analysis of voice disorders and expressiveness uses of voice quality is pointed out.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-13"
  },
  "bailly08_speechprosody": {
   "authors": [
    [
     "Gérard",
     "Bailly"
    ],
    [
     "Alex",
     "Bartroli"
    ]
   ],
   "title": "Generating Spanish intonation with a trainable prosodic model",
   "original": "sp08_063",
   "page_count": 4,
   "order": 14,
   "p1": "63",
   "pn": "66",
   "abstract": [
    "A trainable prosodic model called SFC (Superposition of Functional Contours), proposed by Holm and Bailly, is here applied to Castillan intonation. Training material has been kindly provided by the Speech Processing Group at UPC. We describe the labeling framework and first evaluation results that compares the original prosody of test sentences of this corpus with their prosodic rendering by the proposed model and state-of-the-art systems available on-line on the web.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-14"
  },
  "krstulovic08_speechprosody": {
   "authors": [
    [
     "Sacha",
     "Krstulovic"
    ],
    [
     "Javier",
     "Latorre"
    ],
    [
     "Sabine",
     "Buchholz"
    ]
   ],
   "title": "Comparing QMT1 and HMMs for the synthesis of american English prosody",
   "original": "sp08_067",
   "page_count": 4,
   "order": 15,
   "p1": "67",
   "pn": "70",
   "abstract": [
    "Three models are compared for the duration and pitch contour of American English in a speech synthesis framework. These models combine duration prediction by Quantification Method Type 1 (QMT1), a Codebook-based method for the F0 contour and a Hidden Markov Model-based method for both durations and F0. Subjective listening tests show that the HMMs are preferred over the Codebook for the F0 contour, but that their duration modelling performances are not significantly different from those of QMT1 in the tested setup. An analysis of naive freeform listener comments supports this fact, and suggests that such comments can give useful hints regarding the performance of each system.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-15"
  },
  "guo08_speechprosody": {
   "authors": [
    [
     "Qing",
     "Guo"
    ],
    [
     "Jie",
     "Zhang"
    ],
    [
     "Nobuyuki",
     "Katae"
    ]
   ],
   "title": "Prosodic word grouping with global probability estimation method",
   "original": "sp08_071",
   "page_count": 4,
   "order": 16,
   "p1": "71",
   "pn": "74",
   "abstract": [
    "In this paper, a global prosodic word grouping probability estimation method is proposed. By using some statistical probabilities of four kinds of lexical word position types, the optimum prosodic word grouping path of a sentence can be obtained with the dynamic programming approach. In addition, some statistical and rule punish or encourage strategies have been used to improve the accuracy of prosodic word grouping. Lastly, experiment results and discussion are presented.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-16"
  },
  "luo08_speechprosody": {
   "authors": [
    [
     "Lidong",
     "Luo"
    ],
    [
     "Xingchi",
     "Xian"
    ]
   ],
   "title": "Integration of intonation in trainable speech synthesis",
   "original": "sp08_075",
   "page_count": 4,
   "order": 17,
   "p1": "75",
   "pn": "78",
   "abstract": [
    "Current developments in artificial speech synthesis place more emphasis on spectral continuities and diverse prosodic effects. The trainable HMM-based speech synthesis method has generated more continuous spectral structure than unit selection method in recent study, but the pitch contour generated by HMM-based method trends to be over-smoothed and lacks syllable variance in Chinese. In this paper, to synthesize speaker dependent speech with specific prosodic style, we model the global intonation in Chinese on the syllable scale with definition of pitch level and use pitch level prediction by statistical method to improve the prosodic effects of speech generated by the HMM-based synthesis method.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-17"
  },
  "kim08_speechprosody": {
   "authors": [
    [
     "Woosung",
     "Kim"
    ]
   ],
   "title": "Using prosody for automatically monitoring human-computer call dialogues",
   "original": "sp08_079",
   "page_count": 4,
   "order": 18,
   "p1": "79",
   "pn": "82",
   "abstract": [
    "In human-computer call dialogues, human callers often get frustrated or angry due to, e.g., the computers mistakes. Detecting such emotions would be beneficial for many purposes; nevertheless, emotion detection so far has been studied primarily as a classification task. Taking a step forward from classifying emotions from a single utterance, this paper investigates whether emotions, detected by prosodic features, can be used practically at the dialogue level, i.e., for monitoring human-computer dialogues to detect BAD calls requiring human agents assistance. We first show emotion detection can be improved by a regression model. In combining emotion detection and dialogue monitoring, we demonstrate decision level fusion is better than feature level fusion. Our experiments also confirm that NEGATIVE emotions may be a sufficient, but not a necessary condition for detecting BAD calls. Finally, we show that BAD calls due to callers NEGATIVE emotions may be identified by other clues.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-18"
  },
  "aguero08_speechprosody": {
   "authors": [
    [
     "Pablo Daniel",
     "Agüero"
    ],
    [
     "Juan Carlos",
     "Tulli"
    ],
    [
     "Antonio",
     "Bonafonte"
    ]
   ],
   "title": "A new clustering approach for JEMA",
   "original": "sp08_083",
   "page_count": 4,
   "order": 19,
   "p1": "83",
   "pn": "86",
   "abstract": [
    "This paper focuses on the training process of intonation models for text-to-speech synthesis. In previous papers we concentrated on two key points of intonation modelling: interpolation of fundamental frequency contour in unvoiced segments and sentence-by-sentence parameter extraction. We proposed an alternative approach for model training named JEMA (Joint Extraction and Modeling Approach) using CART. Here we propose a new alternative to obtain the mapping function that relates the linguistic features available in TTS and the fundamental frequency contour space. A clustering algorithm using a distance measure over a variable feature vector dimension space is used to partition the space of fundamental frequency contours in the training data. In this way we seek for important groups of features with specific values that explain the shape of fundamental frequency contours. The proposed technique shows improvements in the experimental results over CART.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-19"
  },
  "aguero08b_speechprosody": {
   "authors": [
    [
     "Pablo Daniel",
     "Agüero"
    ],
    [
     "Juan Carlos",
     "Tulli"
    ],
    [
     "Antonio",
     "Bonafonte"
    ]
   ],
   "title": "Pause transfer in the speech-to-speech translation domain",
   "original": "sp08_087",
   "page_count": 4,
   "order": 20,
   "p1": "87",
   "pn": "90",
   "abstract": [
    "In the speech-to-speech translation framework automatic speech recognition and spoken language translation components provide additional information about the location of pauses in the source language. This information may be useful to improve the performance of pause prediction algorithms for speech synthesis. In this paper we propose a transfer algorithm based on tuples. The results show a better performance of the proposed approach with respect to a baseline system that does not use source language information.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-20"
  },
  "su08_speechprosody": {
   "authors": [
    [
     "Yi",
     "Su"
    ],
    [
     "Frederick",
     "Jelinek"
    ]
   ],
   "title": "Exploiting prosodic breaks in language modeling with random forests",
   "original": "sp08_091",
   "page_count": 4,
   "order": 21,
   "p1": "91",
   "pn": "94",
   "abstract": [
    "We propose a novel method of exploiting prosodic breaks in language modeling for automatic speech recognition (ASR) based on the random forest language model (RFLM), which is a collection of randomized decision tree language models and can potentially ask any questions about the history in order to predict the future. We demonstrate how questions about prosodic breaks can be easily incorporated into the RFLM and present two language models which treat prosodic breaks as observable and hidden variables, respectively. Meanwhile, we show empirically that a finer grained prosodic break is needed for language modeling. Experimental results showed that given prosodic breaks, we were able to reduce the LM perplexity by a significant margin, suggesting a prosodic N-best rescoring approach for ASR.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-21"
  },
  "sun08_speechprosody": {
   "authors": [
    [
     "Qinghua",
     "Sun"
    ],
    [
     "Keikichi",
     "Hirose"
    ],
    [
     "Nobuaki",
     "Minematsu"
    ]
   ],
   "title": "Improved prediction of tone components for F0 contour generation of Mandarin speech based on the tone nucleus model",
   "original": "sp08_095",
   "page_count": 4,
   "order": 22,
   "p1": "95",
   "pn": "98",
   "abstract": [
    "Improved prediction of tone components was realized in our method for synthesizing sentence fundamental frequency (F0) contours of Mandarin speech. The method is based on representing a sentence logarithmic F0 contour as a superposition of tone components on phrase components as in the case of generation process model (F0 model). The tone components are realized by concatenating their fragments at tone nuclei predicted by a corpus-based method, while the phrase components are generated by rules under the F0 model framework. In the original method, tone components are assumed to have similar shapes as F0 contours at tone nuclei. This is based on the assumption that the phrase components are almost flat throughout an utterance. However, this is not the case especially for phrase component initials. To cope with this problem, parameters representing tone components of tone nuclei are modified. Also, predicted parameters in earlier processes are used for the prediction of following processes. Result of the listening test conducted for synthetic speech with the generated F0 contours by our methods and also by the HMM-based method confirmed the advantage of ours, especially the improved version. 1. Introduction\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-22"
  },
  "gopinath08_speechprosody": {
   "authors": [
    [
     "Deepa P.",
     "Gopinath"
    ],
    [
     "S. G.",
     "Veena"
    ],
    [
     "Achuthsankar S.",
     "Nair"
    ]
   ],
   "title": "Modeling of vowel duration in malayalam speech using probability distribution",
   "original": "sp08_099",
   "page_count": 4,
   "order": 23,
   "p1": "99",
   "pn": "102",
   "abstract": [
    "The first part of the work detailed in this paper, analyzes the probability distribution of vowels in Malayalam, an Indian language. Different probability distributions are fitted to the duration values of each vowel and the best fit is determined using quantile-quantile plot. The probability distribution of duration values, in accordance with the different factors affecting durations are also analyzed. In the second part, based on the results of the distribution fitting, a duration model is developed. It predicts duration as that, which maximizes the conditional probability, for the given set of factors. The model has the advantage that it can be expanded easily to include more factors, without affecting the existing structure. The performance of the model is evaluated using root mean square error (RMSE) and correlation between predicted duration and actual duration. The objective evaluation of the model gave an RMSE of 13.2 ms and a correlation of 0.80.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-23"
  },
  "segal08_speechprosody": {
   "authors": [
    [
     "Natalia",
     "Segal"
    ],
    [
     "Philippe",
     "Martin"
    ],
    [
     "Katarina",
     "Bartkova"
    ]
   ],
   "title": "Prosodic trees for boundary detection in ASR in French",
   "original": "sp08_103",
   "page_count": 4,
   "order": 24,
   "p1": "103",
   "pn": "106",
   "abstract": [
    "Prosodic trees as a hierarchical representation of prosodic organization in French proved to be efficient for automatic processing of continuous speech. We applied this technique to the prosodic boundary detection on the output of a speech recognition application in order to test whether prosodic boundaries of different levels in tree confirm or not recognition hypotheses.\n",
    "Two types of tree construction algorithms were tested: one using lexical information (word hypotheses), and another using only phonemic information (phoneme hypotheses). Both were successively used on the automatic alignment output (\"perfect recognition\" conditions) and on the ASR application output for the same spontaneous speech database so as to compare their applicability.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-24"
  },
  "tran08_speechprosody": {
   "authors": [
    [
     "Viet-Anh",
     "Tran"
    ],
    [
     "Gérard",
     "Bailly"
    ],
    [
     "Hélène",
     "Loevenbruck"
    ],
    [
     "Tomoki",
     "Toda"
    ]
   ],
   "title": "Predicting F0 and voicing from NAM-captured whispered speech",
   "original": "sp08_107",
   "page_count": 4,
   "order": 25,
   "p1": "107",
   "pn": "110",
   "abstract": [
    "The NAM-to-speech conversion proposed by Toda and colleagues which converts Non-Audible Murmur (NAM) to audible speech by statistical mapping trained using aligned corpora is a very promising technique, but its performance is still insufficient, mainly due to the difficulty in estimating F0 of the transformed voice from unvoiced speech. In this paper, we propose a method to improve F0 estimation and voicing decision in a NAM-to-speech conversion system based on Gaussian Mixture Models (GMM) applied to whispered speech. Instead of combining voicing decision and F0 estimation in a single GMM, a simple feed-forward neural network is used to detect voiced segments in the whisper while a GMM estimates a continuous melodic contour based on training voiced segments. The error rate for the voiced/unvoiced decision of the network is 6.8% compared to 9.2% with the original system. Our proposal benefits also to F0 estimation error.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-25"
  },
  "lolive08_speechprosody": {
   "authors": [
    [
     "Damien",
     "Lolive"
    ],
    [
     "Nelly",
     "Barbot"
    ],
    [
     "Olivier",
     "Boeffard"
    ]
   ],
   "title": "Pitch and duration transformation with non-parallel data",
   "original": "sp08_111",
   "page_count": 4,
   "order": 26,
   "p1": "111",
   "pn": "114",
   "abstract": [
    "In a voice transformation context, prosody transformation using parallel corpora is quite unrealistic as such corpora are difficult and also expensive to build. Based on this observation, we propose an approach for transforming prosody using nonparallel corpora thanks to the MLLR adaptation strategy. This methodology is applied to the joint transformation of duration and F0 at the syllable level. The source data are modelled by a GMM which is adapted to the target by applying a linear transformation to the mean vectors of the gaussian mixture. This methodology is applied to the conversion of duration and F0 between two french speakers and is evaluated by cross validation between the models and the test datasets. Taking the target model as reference, the adaptation enables to make 80% of the path between source and target data.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-26"
  },
  "boidin08_speechprosody": {
   "authors": [
    [
     "Cédric",
     "Boidin"
    ],
    [
     "Olivier",
     "Boeffard"
    ]
   ],
   "title": "Modeling intonation variability with HMM for speech synthesis",
   "original": "sp08_115",
   "page_count": 4,
   "order": 27,
   "p1": "115",
   "pn": "118",
   "abstract": [
    "This paper proposes a statistical intonation model designed to deal with intrinsic variability in speech. In combining the advantages of two well-known statistical algorithms, CART and HMM, the proposed model takes advantage of available linguistic information and successfully tackles the issue of missing para-linguistic information. Promising results of the training process are shown and analyzed. 1. Introduction\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-27"
  },
  "avanzi08_speechprosody": {
   "authors": [
    [
     "Mathieu",
     "Avanzi"
    ],
    [
     "Anne",
     "Lacheret-Dujour"
    ],
    [
     "Bernard",
     "Victorri"
    ]
   ],
   "title": "ANALOR - a tool for semi-automatic annotation of French prosodic structure",
   "original": "sp08_119",
   "page_count": 4,
   "order": 28,
   "p1": "119",
   "pn": "122",
   "abstract": [
    "In the area of large speech corpora, there is a definite need for common prosodic notation system based on efficient (semi)- automating tools of prosodic segmentation and labelling. In this context, we present the software program ANALOR, developed in order to process semi-automatically prosodic data. From a text-sound alignment, this computer tool detects major prosodic units, on the basis of global and local melodic variations. That leads to the segmentation of an utterance in prosodic periods. Inside those prosodic periods, prominent syllables are then automatically detected. 1. Introduction\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-28"
  },
  "cho08_speechprosody": {
   "authors": [
    [
     "Hyongsil",
     "Cho"
    ],
    [
     "Stéphane",
     "Rauzy"
    ]
   ],
   "title": "Phonetic pitch movements of accentual phrases in Korean read speech",
   "original": "sp08_123",
   "page_count": 4,
   "order": 29,
   "p1": "123",
   "pn": "126",
   "abstract": [
    "The minor prosodic unit in Korean language, generally called an Accentual Phrase, is usually defined by its syntactic or phonological characteristics. This article looks at the correlation between phonetic pitch movements and accentual phrase boundaries using a technique of pattern extraction and prediction by a probabilistic grammar.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-29"
  },
  "hirst08_speechprosody": {
   "authors": [
    [
     "Daniel",
     "Hirst"
    ],
    [
     "Saandia",
     "Ali"
    ]
   ],
   "title": "Optimizing the automatic functional annotation of English intonation",
   "original": "sp08_127",
   "page_count": 4,
   "order": 30,
   "p1": "127",
   "pn": "130",
   "abstract": [
    "One of the fundamental aims of prosodic analysis is to provide a reliable means of extracting functional information (what prosody contributes to meaning) directly from prosodic form. It has been argued that an explicit model of the mapping from prosodic function to prosodic form could provide an objective way of approaching this task. In this presentation we look specifically at some of the problems of optimizing this mapping in order to extract the functional information automatically from the formal representation, hence ultimately directly from the acoustic data.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-30"
  },
  "albosrodrigues08_speechprosody": {
   "authors": [
    [
     "José",
     "Albos Rodrigues"
    ],
    [
     "Benedito Guimarães",
     "Aguiar Neto"
    ],
    [
     "Maria Auxiliadora",
     "Bezerra"
    ]
   ],
   "title": "Frontema: a unit for the study of word boundaries",
   "original": "sp08_131",
   "page_count": 4,
   "order": 31,
   "p1": "131",
   "pn": "134",
   "abstract": [
    "This work presents the frontema as a unit created to facilitate the study of phenomena regarding co-articulatory effects in word boundaries. Frontema is the orthographic representation of written language as well as of the acoustic unit corresponding to word boundaries that conventionally form a written text. The concept of frontema, as well as its materialization, simplify the process of discovery of coarticulatory rules, thus contributing to facilitate the prosodic modeling of phrases and, so, reducing the complexity of the process of automatic generation of prosody in systems of speech synthesis by concatenating acoustic units previously recorded.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-31"
  },
  "looze08_speechprosody": {
   "authors": [
    [
     "Céline De",
     "Looze"
    ],
    [
     "Daniel",
     "Hirst"
    ]
   ],
   "title": "Detecting changes in key and range for the automatic modelling and coding of intonation",
   "original": "sp08_135",
   "page_count": 4,
   "order": 32,
   "p1": "135",
   "pn": "138",
   "abstract": [
    "The analysis of authentic speech, unlike that of laboratory speech, needs to take into account the fact that the fundamental frequency patterns corresponding to the intonation of utterances can be of two types - local pitch characteristics determined by the surface phonological representation of the intonation and longer term characteristics corresponding to less well understood changes in pitch key and range. In this paper a number of acoustic correlates of changes in pitch key and range are examined and compared to subjective annotations and a preliminary attempt is made to estimate these changes automatically. 1. Introduction\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-32"
  },
  "kim08b_speechprosody": {
   "authors": [
    [
     "Sunhee",
     "Kim"
    ],
    [
     "Daniel",
     "Hirst"
    ],
    [
     "Hyongsil",
     "Cho"
    ],
    [
     "Ho-Young",
     "Lee"
    ],
    [
     "Minhwa",
     "Chung"
    ]
   ],
   "title": "Korean MULTEXT: a Korean prosody corpus",
   "original": "sp08_139",
   "page_count": 4,
   "order": 33,
   "p1": "139",
   "pn": "142",
   "abstract": [
    "This paper describes the contents of the Korean prosody corpus (Korean MULTEXT), which is a Korean version of the speech database Eurom1. The corpus consists of about 2 hours of read speech, transcribed primarily in orthography (in Korean alphabet and in a Romanized transcription), in IPA and in SAMPA. Furthermore, it includes the original F0 values, stylized F0 values extracted using Momel, and hand-corrected F0 values. The prosodic events are annotated in two ways. They are annotated with the automatic annotation algorithm, INTSINT, and also labeled manually into prosodic units with two tones on the hand-corrected pitch targets. It is found that the resulting tone patterns from the proposed Momel-based two tone labeling correspond to those defined in K-ToBI.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-33"
  },
  "liao08_speechprosody": {
   "authors": [
    [
     "Yuan-Fu",
     "Liao"
    ],
    [
     "Wen-Chieh",
     "Chang"
    ],
    [
     "Zong-You",
     "Xie"
    ],
    [
     "Ding-Yun",
     "Zeng"
    ],
    [
     "Yau-Tarng",
     "Juang"
    ]
   ],
   "title": "Joint prosodic and spectral modeling for robust speaker verification",
   "original": "sp08_143",
   "page_count": 4,
   "order": 34,
   "p1": "143",
   "pn": "146",
   "abstract": [
    "In this paper, a joint prosodic and spectral modeling framework is proposed instead of traditional score-domain fusion approaches to alleviate the problem of mismatch channel/handset/ambient noise. The basic idea is to embed the concept of hierarchical structure of speech prosody into an ergodic HMM (EHMM), and model the prosodic status transitions and prosodic/spectral features by EHMMs states, state transition probabilities and state-dependent observation distributions, respectively. Experimental results evaluated on the standard single-speaker detection task of NIST 2001 speaker recognition evaluation (NIST-SRE 2001) showed that the proposed approach not only outperformed the spectral feature-based baseline (8.04% vs. 8.64% in equal error rate, EER) but also worked a little bit better than score-domain fusion ( 8.44%) approach.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-34"
  },
  "martin08_speechprosody": {
   "authors": [
    [
     "Philippe",
     "Martin"
    ]
   ],
   "title": "A fundamental frequency estimator by crosscorrelation of adjacent spectra",
   "original": "sp08_147",
   "page_count": 4,
   "order": 35,
   "p1": "147",
   "pn": "150",
   "abstract": [
    "All fundamental frequency estimators based on spectral analysis rely heavily on a proper harmonic selection of the voice analyzed. Since in practice other spectral peaks pertaining to different sources are present in the signal, various schemes have been design to ensure a satisfactory elimination of non pertinent harmonics.\n",
    "This paper introduces a new harmonic selection algorithm based on harmonic alignment of adjacent frames. This new approach ensures better pitch tracking, and gives satisfactory results even in the presence of another speech source. The algorithm has been implemented and incorporated in the speech analysis program WinPitch, and tested on various examples provided in the Speech Separation Challenge project.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-35"
  },
  "laskowski08_speechprosody": {
   "authors": [
    [
     "Kornel",
     "Laskowski"
    ],
    [
     "Jens",
     "Edlund"
    ],
    [
     "Mattias",
     "Heldner"
    ]
   ],
   "title": "Learning prosodic sequences using the fundamental frequency variation spectrum",
   "original": "sp08_151",
   "page_count": 4,
   "order": 36,
   "p1": "151",
   "pn": "154",
   "abstract": [
    "We investigate a recently introduced vector-valued representation of fundamental frequency variation, whose properties appear to be well-suited for statistical sequence modeling. We show what the representation looks like, and apply hidden Markov models to learn prosodic sequences characteristic of higher-level turn-taking phenomena. Our analysis shows that the models learn exactly those characteristics which have been reported for the phenomena in the literature. Further refinements to the representation lead to a 12-17% relative improvement in speaker change prediction for conversational spoken dialogue systems.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-36"
  },
  "chen08_speechprosody": {
   "authors": [
    [
     "Hua",
     "Chen"
    ],
    [
     "Qiufang",
     "Wen"
    ],
    [
     "Aijun",
     "Li"
    ]
   ],
   "title": "A learner corpus - ESCCL",
   "original": "sp08_155",
   "page_count": 4,
   "order": 37,
   "p1": "155",
   "pn": "158",
   "abstract": [
    "This paper describes the reason, the method and the implication of compiling a learner corpus - ESCCL (English Speech Corpus of Chinese Learners). As for the main reason, the existing spoken corpora of Chinese EFL learners in China are completely text-based, and not suitable for phonetic analysis because of the poor quality of recording. The subjects at 4 different educational backgrounds were asked to fulfill 2 tasks ¨ reading-aloud and topic-based spontaneous dialogue. The recordings were collected from different parts of China and dialectal areas. The annotation system employed in the corpus combines the British system and the American one. The corpus-based research findings have important implications for China's EFL pedagogy, and will be helpful for the improvement of rating rubrics for China's oral English tests.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-37"
  },
  "ananthakrishnan08_speechprosody": {
   "authors": [
    [
     "Sankaranarayanan",
     "Ananthakrishnan"
    ],
    [
     "Shrikanth",
     "Narayanan"
    ]
   ],
   "title": "Data-driven unsupervised adaptation of acoustic-prosodic models",
   "original": "sp08_161",
   "page_count": 4,
   "order": 38,
   "p1": "161",
   "pn": "164",
   "abstract": [
    "Training categorical prosody models for spoken language systems requires a significant amount of speech data annotated with the discrete labels of interest (such as boundary marks or word prominence information). In practice, the difficulty and expense incurred in producing corpora with rich prosodic transcriptions severely limits their integration within applications. In this paper, we explore the possibility of using a large, unlabeled corpus to adapt, in an unsupervised fashion, acousticprosodic models trained from a small, human-annotated seed dataset. Our experiments show that the proposed adaptation scheme improves the ability of the acoustic-prosodic model to distinguish between prosodic categories. On a test set derived from the Boston University Radio News Corpus, the adapted models reduced pitch accent detection error rate by 4.3% relative to the seed acoustic-prosodic models trained from the annotated data.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-38"
  },
  "huang08_speechprosody": {
   "authors": [
    [
     "Jui-Ting",
     "Huang"
    ],
    [
     "Mark",
     "Hasegawa-Johnson"
    ],
    [
     "Chilin",
     "Shih"
    ]
   ],
   "title": "Unsupervised prosodic break detection in Mandarin speech",
   "original": "sp08_165",
   "page_count": 4,
   "order": 39,
   "p1": "165",
   "pn": "168",
   "abstract": [
    "We propose that, in Mandarin speech, an automatic prosodic break detector can be trained without any prosodically labeled training data. We use only lexical and acoustic cues to create a small labeled training set, then use semi-supervised learning to train a prosodic break detector. A generative mixture model is proposed as the learning algorithm that can learn with both labeled and unlabeled data. The experiments in both English and Mandarin corpus verify our algorithm.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-39"
  },
  "minematsu08_speechprosody": {
   "authors": [
    [
     "Nobuaki",
     "Minematsu"
    ],
    [
     "T.",
     "Nishimura"
    ],
    [
     "D.",
     "Saito"
    ],
    [
     "S.",
     "Asakawa"
    ],
    [
     "Y.",
     "Qiao"
    ]
   ],
   "title": "Holistic and prosodic representation of the segmental aspect of speech",
   "original": "sp08_169",
   "page_count": 4,
   "order": 40,
   "p1": "169",
   "pn": "172",
   "abstract": [
    "Speech communication has several steps of encoding, transmission, and decoding. In each step, various acoustic distortions are inevitably induced by non-linguistic factors such as differences of age, gender, microphone, line, room, auditory characteristics of a hearers ears, etc. In spite of this large variability, humans can perform very precise speech processing. Recently, the first author proposed a novel representation of speech [1, 2], which is invariant with these factors at all. Only the dynamic motions in speech are focused on and the static features in speech are completely discarded. The high validity of this new representation for speech recognition was already verified experimentally [3, 4, 5]. In this paper, we show that the new representation of the segmental aspect of speech can be interpreted as a kind of holistic and prosodic feature because the representation captures speech as music, i.e. timbre-based melody.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-40"
  },
  "pozo08_speechprosody": {
   "authors": [
    [
     "Arantza del",
     "Pozo"
    ],
    [
     "Steve",
     "Young"
    ]
   ],
   "title": "Repairing tracheoesophageal speech duration",
   "original": "sp08_187",
   "page_count": 4,
   "order": 41,
   "p1": "187",
   "pn": "190",
   "abstract": [
    "This paper describes an investigation into the repair of the prosodic limitations of tracheoesophageal (TE) speech. The proposed repair algorithm modifies TE phone durations based on the predictions of regression trees built from nonpathological data. Acoustic and language modelling refinements for improved TE phone recognition, studies of feature relevance for duration prediction and a robust duration modification method are also presented. Objective and subjective evaluation of results show that the duration pattern of the repaired sentences is closer to normal and perceptually preferred to the original in terms of overall rhythmic naturalness.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-41"
  },
  "cardoso08_speechprosody": {
   "authors": [
    [
     "Bernadette",
     "Cardoso"
    ],
    [
     "César",
     "Reis"
    ]
   ],
   "title": "Variables for the study of the temporal organization in speech disorders",
   "original": "sp08_191",
   "page_count": 4,
   "order": 42,
   "p1": "191",
   "pn": "194",
   "abstract": [
    "The aim of this study is to examine the fluent speech of people who stutter and adults with developmental apraxia of speech comparing them with individuals with normally developing speech. In a corpus of recorded sentences, an acoustic study proceeded in order to examine their temporal aspects of production. The duration of vocalic and consonantal segments, the syllables and trissylablic word as well as the articulatory rate and the average proportion of vocalic intervals (%V) constitutes indices of how the different individuals organize their verbal production\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-42"
  },
  "normand08_speechprosody": {
   "authors": [
    [
     "Marie-Thérèse Le",
     "Normand"
    ],
    [
     "Sarah",
     "Boushaba"
    ],
    [
     "Anne",
     "Lacheret-Dujour"
    ]
   ],
   "title": "Prosodic disturbances in autistic children speaking French",
   "original": "sp08_195",
   "page_count": 4,
   "order": 43,
   "p1": "195",
   "pn": "198",
   "abstract": [
    "The present study investigated prosody, particularly prominence and prosodic contours in relation to speech acts that carry useful information to maintain and regulate communicative intent and conversational skills. Participants were eight autistic French-speaking children aged from 4 to 6. Spontaneous speech samples were collected in a free play situation. Results revealed important prosodic disturbances in relation to declaratives, exclamations and questions. Such patterns of results, to a certain extent, support the hypothesis that abnormal prosody is identified as a core deficit in individuals with autism.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-43"
  },
  "barzaghi08_speechprosody": {
   "authors": [
    [
     "Luisa",
     "Barzaghi"
    ],
    [
     "Beatriz",
     "Mendes"
    ]
   ],
   "title": "Stressed and unstressed vowel production in hearing-impaired speech",
   "original": "sp08_199",
   "page_count": 4,
   "order": 44,
   "p1": "199",
   "pn": "202",
   "abstract": [
    "The aim of this experimental study is to investigate the production of stressed and unstressed syllables in Brazilian Portuguese (PB) by two hearing-impaired subjects, one with moderate (HI-M) and the other with severe hearing loss (HIS). A normal hearing-subjects (NH) speech production is taken as reference for the sake of spectrographic analysis. The acoustic parameters investigated were the duration of the speech segments and F1 and F2 frequencies of the vowel /a/ in different stress positions in a controlled phonetic context. Results show differences in the acoustic parameters due to degree of hearing loss of these subjects, suggesting, as expected, less control of prosodic and segmental production. Keywords: hearing impairment, vowels, formant frequencies, duration.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-44"
  },
  "paulmann08_speechprosody": {
   "authors": [
    [
     "Silke",
     "Paulmann"
    ],
    [
     "Patricia",
     "Schmidt"
    ],
    [
     "Marc",
     "Pell"
    ],
    [
     "Sonja A.",
     "Kotz"
    ]
   ],
   "title": "Rapid processing of emotional and voice information as evidenced by ERPs",
   "original": "sp08_205",
   "page_count": 5,
   "order": 45,
   "p1": "205",
   "pn": "209",
   "abstract": [
    "Next to linguistic content, the human voice carries speaker identity information (e.g. female/male, young/old) and can also carry emotional information. Although various studies have started to specify the brain regions that underlie the different functions of human voice processing, few studies have aimed to specify the time course underlying these processes. By means of event-related potentials (ERPs) we aimed to determine the time-course of neural responses to emotional speech, speaker identification, and their interplay. While engaged in an implicit voice processing task (probe verification) participants listened to emotional sentences spoken by two female and two male speakers of two different ages (young and middle-aged). For all four speakers rapid emotional decoding was observed as emotional sentences could be differentiated from neutral sentences already within 200 ms after sentence onset (P200). However, results also imply that individual capacity to encode emotional expressions may have an influence on this early emotion detection as the P200 differentiation pattern (neutral vs. emotion) differed for each individual speaker.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-45"
  },
  "schirmer08_speechprosody": {
   "authors": [
    [
     "Annett",
     "Schirmer"
    ],
    [
     "Nicolas",
     "Escoffier"
    ],
    [
     "Angela D.",
     "Friederici"
    ]
   ],
   "title": "Out of the spotlight: neurophysiological mechanisms underlying the processing of unattended vocal expressions",
   "original": "sp08_211",
   "page_count": 5,
   "order": 46,
   "p1": "211",
   "pn": "216",
   "abstract": [
    "The voice is a powerful medium for the communication of emotion. However, in conversation listeners typically attend to the content of a message rather than to the way it is communicated. Moreover, given the serial nature of speech processing, they focus on one talker at a time. Nevertheless, research on vocal processing indicates that listeners tend to be sensitive to emotional expressions from unattended sources. For example, unattended syllable sequences that rarely and unpredictably change in speaker prosody were found to elicit a larger mismatch negativity in the event-related potential (ERP) if syllables suddenly become emotional as compared to neutral. The present functional magnetic resonance imaging (fMRI) study aimed at elucidating the brain structures that mediate this effect. The observed evidence suggests that enhanced responses to unattended emotional as compared to neutral speaker prosody are mediated by activity in the middle frontal gyrus, the posterior superior temporal cortex, the anterior insula and the amygdala. Interestingly, however, listeners differ in their sensitivity to unattended and unexpected changes in speaker tone of voice. These differences appear to be linked to biological (e.g., estrogen) and cultural factors (e.g., social orientation) and affect how these individuals pursue and engage in social interactions.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-46"
  },
  "wildgruber08_speechprosody": {
   "authors": [
    [
     "Dirk",
     "Wildgruber"
    ],
    [
     "Thomas",
     "Ethofer"
    ],
    [
     "Benjamin",
     "Kreifelts"
    ],
    [
     "Didier",
     "Grandjean"
    ]
   ],
   "title": "Cerebral processing of emotional prosody: a network model based on fMRI studies",
   "original": "sp08_217",
   "page_count": 6,
   "order": 47,
   "p1": "217",
   "pn": "222",
   "abstract": [
    "Comprehension of information conveyed by emotional tone of speech is highly important for successful social interactions. Regarding the underlying neurobiological mechanisms, successive steps of cerebral processing involving auditory analysis within the temporal cortex and evaluative judgements within the frontal lobes have been differentiated (Schirmer & Kotz, 2006; Wildgruber et al., 2006). To further disentangle the impact of stimulus properties and appraisal levels a series of fMRI studies has been performed. The results of these studies indicate a strong association of cerebral responses and acoustic properties of the stimuli in some regions (stimulusdriven effects), whereas other areas showed modulation of activation linked to the focussing of attention to specific task components (task-dependent effects). Based on these findings a refined model of prosody processing and cross-modal integration of emotional signals from face and voice is postulated.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-47"
  },
  "grandjean08_speechprosody": {
   "authors": [
    [
     "Didier",
     "Grandjean"
    ],
    [
     "Klaus R.",
     "Scherer"
    ]
   ],
   "title": "Neuronal synchronization during auditory emotional perception",
   "original": "sp08_223",
   "page_count": 4,
   "order": 48,
   "p1": "223",
   "pn": "226",
   "abstract": [
    "The brain regions subserving the processing of emotional prosody have been investigated using functional magnetic resonance imaging (fMRI) and electroencephalography (EEG) but few studies investigated direct electrical neuronal activity using intracranial recordings in humans. Previous studies have shown the involvement of the amygdala and the orbito-frontal cortex (OFC) in the processing of emotional prosody. In this paper we present first evidence of functional neuronal coupling between these two regions in response to different kinds of emotional prosody.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-48"
  },
  "hedberg08_speechprosody": {
   "authors": [
    [
     "Nancy",
     "Hedberg"
    ],
    [
     "Juan M.",
     "Sosa"
    ],
    [
     "Emrah",
     "Görgülü"
    ]
   ],
   "title": "Early and late nuclei in yes-no questions: tails or high rises?",
   "original": "sp08_229",
   "page_count": 4,
   "order": 49,
   "p1": "229",
   "pn": "232",
   "abstract": [
    "In this paper we analyze the placement of the nucleus in yesno questions and its significance in American English. We show that the vast majority of positive yes-no questions are expressed through a low rise, often with at least one word as a tail. High rise is the second most common yes-no question nucleus; and so we are interested in the question of why a high-rise instead of a low rise contour is sometimes selected by the speaker. It can be difficult to tell whether a question should end in a late high rise, or whether an early low-rise should be postulated with a tail that is part of the rise. We bring phonetic criteria to bear on this question, and also show that post-nuclear tails tend to consist of function words or else of information that is in some sense given in the discourse. Finally, we present evidence that the discourse function of high rises overlaps with the function of tails to such an extent that it is economical to consider the high pitch accent of a high rise nuclear tune as simply an accented part of what otherwise could be analyzed as a tail.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-49"
  },
  "post08_speechprosody": {
   "authors": [
    [
     "Margje",
     "Post"
    ]
   ],
   "title": "Post-nuclear prominence patterns in northern Russian question intonation",
   "original": "sp08_233",
   "page_count": 4,
   "order": 50,
   "p1": "233",
   "pn": "236",
   "abstract": [
    "In the intonation of polar questions in the Northern Russian dialect of Varzuga (Kola Peninsula), two different intonation patterns are frequently used: the Standard Russian H*L pitch accent, with a high rise and immediate fall, but also a \"broad hat\" pattern, in which the high rise is followed by a late fall, aligned to the first syllable after the last lexical stress. This contour does not fit into the existing transcription systems developed for Standard Russian. The analysis presented in this paper suggests that the late fall does not present a fullyfledged pitch accent, but is subordinate to the preceding, nuclear accent, similar to phrase accents in the sense of [1].\n",
    "",
    "",
    "Grice, M.; DImperio, M.; Savino, M.; Avesani, C., 2005. Strategies for Intonation Labelling across Varieties of Italian. In Prosodic Typology: The Phonology of Intonation and Phrasing, S.-A. Jun (ed.). Oxford: Oxford University Press, 362-389.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-50"
  },
  "green08_speechprosody": {
   "authors": [
    [
     "Hila",
     "Green"
    ],
    [
     "Yishai",
     "Tobin"
    ]
   ],
   "title": "Intonation in hebrew-speaking children with high-functioning autism: a case study",
   "original": "sp08_237",
   "page_count": 4,
   "order": 51,
   "p1": "237",
   "pn": "240",
   "abstract": [
    "This paper presents a case study which describes, compares and contrasts the prosodic features of the intonation of two children diagnosed with High- Functioning Autism (HFA) with two children without developmental disorders (WDD), matched for age, school grade and academic achievements. They were all male monolingual speakers of Modern Hebrew. Three prominent components of prosody (intonation units, simple pitch accents and edge tones) were examined in two elicitations tasks (spontaneous speech and reading-aloud). The data were transcribed and described using the Autosegmental-Metrical (AM) theory and the results were analyzed and explained according to the theory of Phonology as Human Behavior (PHB).\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-51"
  },
  "lee08_speechprosody": {
   "authors": [
    [
     "Hye-Sook",
     "Lee"
    ]
   ],
   "title": "Non-rising questions in North Kyeongsang Korean",
   "original": "sp08_241",
   "page_count": 4,
   "order": 52,
   "p1": "241",
   "pn": "244",
   "abstract": [
    "This paper investigates interrogative intonation in North Kyeongsang Korean, a pitch accent language making use of final particles. A production study shows that yes/no questions do not have rising intonation, in contrast to impressionistic observations in the literature. Moreover, a perception study shows that the perceptual distinction between yes/no questions and statements is fairly sharp, despite relatively small acoustic differences between them. High pitch is strongly associated with the percept of yes/no questions, which supports the Strong Universalist Hypothesis [1]. Finally, no consistent effect is found between the presence/absence of question particles and intonational realization.\n",
    "",
    "",
    "Ladd, D. R., 1981. On Intonational Universals. In T. Myers et al. (eds.), The Cognitive Representation of Speech. Amsterdam: North Holland Publishing.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-52"
  },
  "mucke08_speechprosody": {
   "authors": [
    [
     "Doris",
     "Mücke"
    ],
    [
     "Martine",
     "Grice"
    ],
    [
     "Anne",
     "Hermes"
    ],
    [
     "Johannes",
     "Becker"
    ]
   ],
   "title": "Prenuclear rises in Northern and Southern German",
   "original": "sp08_245",
   "page_count": 4,
   "order": 53,
   "p1": "245",
   "pn": "248",
   "abstract": [
    "We investigated the effect of dialectal background on tonal alignment in LH rising pitch accents in two varieties of German: those spoken in Düsseldorf and Vienna. We confirm the findings of Atterer & Ladd (2004, [1]) that L and H tones in prenuclear rises are aligned later in Southern than in Northern German varieties, and, more specifically, that both L and H tones in Viennese rises were considerably later than L and H in any of the other varieties. Mean alignment values for both tones in these two varieties can be located on a continuum comprising the values for all four varieties.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-53"
  },
  "sadattehrani08_speechprosody": {
   "authors": [
    [
     "Nima",
     "Sadat-Tehrani"
    ]
   ],
   "title": "The structure of Persian intonation",
   "original": "sp08_249",
   "page_count": 4,
   "order": 54,
   "p1": "249",
   "pn": "252",
   "abstract": [
    "This paper is a detailed investigation of the phonology and phonetics of the intonation of Persian carried out in the framework of the AM theory of intonational phonology ([7], [5]). Based on 2112 utterances read by a total of 8 native speakers, the work, on the one hand, presents a phonological account of the prosodic structure of this language, a structure that consists of the level Accentual Phrase (AP) with the pitch accent (L+)H*, immediately dominated by the level Intonational Phrase (IP), each level being marked by a low or high right boundary tone. This system is less complicated than previous proposals which consider an additional level between IP and AP. On the other hand, this work scrutinizes the phonetic implementation of tones with regard to segments. It is shown that the L of an AP is aligned with the consonant preceding the stressed vowel, and the H with the consonant following this vowel in nuclear APs and with the next vowel in non-nuclear ones. Focused APs have more duration than non-focused ones, and non-nuclear APs show more pitch excursion than nuclear ones.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-54"
  },
  "chen08b_speechprosody": {
   "authors": [
    [
     "Yiya",
     "Chen"
    ]
   ],
   "title": "Revisiting the phonetics and phonology of Shanghai tone sandhi",
   "original": "sp08_253",
   "page_count": 4,
   "order": 55,
   "p1": "253",
   "pn": "256",
   "abstract": [
    "This study revisits the phonetics and phonology of Shanghai tone sandhi by examining the f0 contours of non-initial syllables within sandhi domains which start with different lexical tones. Results show significant f0 variation due to the initial lexical tones; the variation, however, diminishes as the number of non-initial syllables increases, resulting in near convergence of f0 values by the end of the 3rd syllable. This suggests the existence of a low tone target for non-initial syllables, the phonetic implementation of which is weak and remarkably comparable to the neutral tone in Standard Chinese [1]. Shanghai Chinese thus suggests the possible existence of weak-strong tonal contrast, like the neutral vs. lexical tonal contrast in Standard Chinese, which manifests at a prosodic level higher than syllable.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-55"
  },
  "barbosa08_speechprosody": {
   "authors": [
    [
     "Plínio A.",
     "Barbosa"
    ]
   ],
   "title": "Prominence- and boundary-related acoustic correlations in brazilian portuguese read and spontaneous speech",
   "original": "sp08_257",
   "page_count": 4,
   "order": 56,
   "p1": "257",
   "pn": "260",
   "abstract": [
    "This work presents a function-oriented analysis of the interrelations between f0 and syllable-sized duration contours in Brazilian Portuguese read paragraphs and spontaneous speech aiming at: presenting measures of the frequency of prominencemarking and breaking-marking in BP, showing the interdependence between f0 and syllable-sized duration contours, showing the separate contributions of duration and f0 at minor prosodic boundaries, presenting a semi-automatic method for analysing the correlation between f0 and normalised syllablesized duration contours. Contrary to the observations in lab speech for isolated utterances, pitch accents are relatively frequent in BP (from 54 to 73 %of the phonological words). Peaks of syllable-sized duration signal both minor and major prosodic boundaries, having both a phrasal and a sentencial breakingmarking function, as well as a prominent-bearing function.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-56"
  },
  "mixdorff08_speechprosody": {
   "authors": [
    [
     "Hansjörg",
     "Mixdorff"
    ],
    [
     "Yuping",
     "Wang"
    ],
    [
     "Yu",
     "Hu"
    ]
   ],
   "title": "Robustness of tonal and segmental information in noise - auditory and visual contributions",
   "original": "sp08_261",
   "page_count": 4,
   "order": 57,
   "p1": "261",
   "pn": "264",
   "abstract": [
    "This paper examines the robustness of tonal and segmental cues in noise exemplified by Mandarin monosyllables. We investigate how varying levels of noise inhibit the recognition of syllabic tone, onset, vowel nucleus and coda, and which property of the syllable is the most stable in audio only and audio plus video conditions.\n",
    "A corpus of 220 frequent syllables was uttered by a male speaker of Mandarin and video-taped. Multi-talker babble noise was added to the resulting speech recordings at SNRs of 0, -3, -6 and -9 dB. In a perception test subjects were asked to write down the Pinyin plus tone combination of the word they perceived. Results indicate, inter alia, that the tonal information is more robust in noise than the segmental one, and that the nuclear vowel is the most stable part of the syllable. Auditory-visual gain was observed for the segments, but different from results of an earlier study, not for the tones. Tonal recognition rates were also influenced by the type of the nuclear vowel, with front vowels yielding highest and back vowels yielding lowest rates.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-57"
  },
  "silbervarod08_speechprosody": {
   "authors": [
    [
     "Vered",
     "Silber-Varod"
    ],
    [
     "Loïc",
     "Kessous"
    ]
   ],
   "title": "Prosodic boundary patterns in Hebrew: a case study of continuous intonation units in weather forecast",
   "original": "sp08_265",
   "page_count": 4,
   "order": 58,
   "p1": "265",
   "pn": "268",
   "abstract": [
    "In this study, we examine acoustic features around boundaries of Intonation Units that have been perceptually segmented. An account of both sides of a boundary is the concept of analysis, i.e. acoustic features are measured at the end of one IU and at the beginning of the following IU. Since Hebrew is our target language, an account of the stress assignment on the prosodic word level was taken. Results show that duration and pitch characteristics at continuous boundaries are affected by the stress metrical structure.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-58"
  },
  "ambrazaitis08_speechprosody": {
   "authors": [
    [
     "Gilbert",
     "Ambrazaitis"
    ],
    [
     "Oliver",
     "Niebuhr"
    ]
   ],
   "title": "Dip and hat pattern: a phonological contrast of German?",
   "original": "sp08_269",
   "page_count": 4,
   "order": 59,
   "p1": "269",
   "pn": "272",
   "abstract": [
    "Is the high plateau in a hat pattern a phonetic artefact, or does it reflect a phonological feature? Can it contrast with a low plateau, i.e., a dip pattern? The presented perception experiment supports the phonological point of view, since it shows that the dip/hat contrast can disambiguate German oder-constructions, which are interpretable as alternative or yes/no-questions. This specific function may be derived from a more general substance-function relation: While a hat pattern has a bracketing function, a dip signals detachment.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-59"
  },
  "brugos08_speechprosody": {
   "authors": [
    [
     "Alejna",
     "Brugos"
    ],
    [
     "Nanette",
     "Veilleux"
    ],
    [
     "Mara",
     "Breen"
    ],
    [
     "Stefanie",
     "Shattuck-Hufnagel"
    ]
   ],
   "title": "The alternatives (alt) tier for toBI: advantages of capturing prosodic ambiguity",
   "original": "sp08_273",
   "page_count": 4,
   "order": 60,
   "p1": "273",
   "pn": "276",
   "abstract": [
    "Using the alternatives (alt) tier in ToBI transcriptions allows labellers to capture annotation ambiguities explicitly; this labelling innovation allows researchers to address several open research questions concerning prosodic phonology. Furthermore, the standard alt notation allows this data to be shared among researchers and to be machine-readable for the examination of large labelled corpora. Finally, it is anticipated that having an alt tier to record competing labels will facilitate faster and more reliable hand annotation. This paper reports on the use of the alt tier in a large speech sample labelled by 4 expert annotators.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-60"
  },
  "chang08_speechprosody": {
   "authors": [
    [
     "Seung-Eun",
     "Chang"
    ]
   ],
   "title": "Perception of South Kyungsang Korean tones",
   "original": "sp08_277",
   "page_count": 4,
   "order": 61,
   "p1": "277",
   "pn": "280",
   "abstract": [
    "The research provides a perception experiment which tests the claims made in the previous production experiment (Chang 2008). It tests the perception of isolated synthetic stimuli, in which the crucial acoustic parameters (i.e., F0 peak delay, initial F0, and syllable duration) have been systematically manipulated. The results are generally consistent with the acoustic data, by showing that those acoustic cues contribute to the perception of two tone contrasts. The stimuli tend to be identified as the R item if the F0 peak is later in the syllable and the initial F0 is lower while the F0 peak is earlier in the syllable and the initial F0 is higher. However, although all three factors were certainly different between the two tones in the acoustic data, the three factors did not equally contribute to the perception of tone contrast.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-61"
  },
  "lucente08_speechprosody": {
   "authors": [
    [
     "Luciana",
     "Lucente"
    ],
    [
     "Plínio A.",
     "Barbosa"
    ]
   ],
   "title": "Narrow focus in Brazilian portuguese: spatial and temporal constraints",
   "original": "sp08_281",
   "page_count": 4,
   "order": 62,
   "p1": "281",
   "pn": "284",
   "abstract": [
    "This paper presents the Brazilian Portuguese intonational annotation system, the ToBiPI system, for which the use of a set of labels integrates a dynamical annotation with some aspects of intonational phonology research paradigm, namely the intonational workshops. The dynamic annotation is based on a function-oriented analysis that takes into account some spatial and temporal constraints such as alignment and rate of falling and rising.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-62"
  },
  "amir08_speechprosody": {
   "authors": [
    [
     "Noam",
     "Amir"
    ],
    [
     "Bat-Chen",
     "Almogi"
    ],
    [
     "Hansjörg",
     "Mixdorff"
    ]
   ],
   "title": "A systematic framework for studying the contribution of F0 and duration to the perception of accented words in Hebrew",
   "original": "sp08_285",
   "page_count": 4,
   "order": 63,
   "p1": "285",
   "pn": "288",
   "abstract": [
    "In this study we defined a methodology for examining the combined effect of F0 and duration in accenting a syllable, leading to the perception of narrow focus in a short sentence. The F0 and duration variables were manipulated independently in one word in each of three four-word sentences. F0 was manipulated through use of the Fujisaki model of intonation, whereas duration was manipulated using Praat software. Subjects were asked indirectly to determine whether any word was accented. Initial results showed that perception was influenced by changes in F0 more than by changes in duration, with some degree of interplay between the two variables. Identification curves show a categorical perception of accent as a function of F0.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-63"
  },
  "leemann08_speechprosody": {
   "authors": [
    [
     "Adrian",
     "Leemann"
    ],
    [
     "Beat",
     "Siebenhaar"
    ]
   ],
   "title": "Swiss alpine and midland intonation",
   "original": "sp08_289",
   "page_count": 4,
   "order": 64,
   "p1": "289",
   "pn": "292",
   "abstract": [
    "The present paper discusses the intonational features of 3 Swiss German dialects: Valais Swiss German (WS), representing the Alpine variety, and Zurich (ZH) and Berne (BE) Swiss German, representing the Midland dialects. By application of the Fujisaki intonation model, 24 speakers of the mentioned dialects are investigated according to their global as well as local intonational features. The BE and WS show similar intonational features in 4 out of 9 observed variables. Yet the WS group seems to distinguish itself with a high pitch range; the BE, on the other hand, is especially characterized with a late pitch onset in local accents. The ZH speakers, in contrast, stand out in that they show distinct intonational features which are largely unparalleled in the other 2 dialects. The paper ends with an outlook of a practical extension to the Fujisaki model, the integration of a slow-rise component - a component introduced by Mixdorff in writing, yet never implemented into his Fujisaki parameter extraction program.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-64"
  },
  "gilifivela08_speechprosody": {
   "authors": [
    [
     "Barbara",
     "Gili Fivela"
    ]
   ],
   "title": "Broad focus vs contrastive focus: is there categorical perception in Pisa Italian?",
   "original": "sp08_293",
   "page_count": 4,
   "order": 65,
   "p1": "293",
   "pn": "296",
   "abstract": [
    "The paper reports the results of a perception experiment run in order to test whether two pitch accents are categorically perceived. The pitch accents under investigation are found in nuclear position, in Pisa Italian broad focus and contrastive focus phrases.\n",
    "The perception experiment is run within the Categorical Perception paradigm, i.e. by testing both the identification and the discrimination of stimuli that represent a continuum of variation from one pattern to the other. In particular, in order to ensure that the results do not depend on possible limits in the task used for the identification test, the same continuum of stimuli is proposed in three different tasks. The results of both the identification test - three tasks - and the discrimination test are then discussed with reference to the criticism found in the literature on the use of Categorical Perception paradigm for investigating intonation.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-65"
  },
  "gussenhoven08_speechprosody": {
   "authors": [
    [
     "Carlos",
     "Gussenhoven"
    ]
   ],
   "title": "Semantic judgments as evidence for the intonational structure of Dutch",
   "original": "sp08_297",
   "page_count": 4,
   "order": 66,
   "p1": "297",
   "pn": "300",
   "abstract": [
    "A perception task elicited judgments from 20 Dutch listeners involving a choice between a modal and a lexical meaning of three ambiguous words in Dutch. On the basis of descriptions in the literarture, it was hypothesized that the lexical interpretation is favored if (a) there is an intonational boundary between the ambiguous word and the following pitch accent, and (b) if pitch accents on either side of the boundary are identical. The results support this assumption. The data provide semantic evidence for a number of positions in the literature. First, the accentual rise-fall must be a HL contour (i.e. a fall, H*L) rather than a LH contour (i.e. a rise, LH*). Second, the results indicate that the presence of a low target immediately after the H-marked accented syllable signals an intonational boundary if the pitch remains low level until the next pitch accent, but not if the pitch after the post-accent low rises to the next accent. These results favor an analysis as given in the British English literature for English and as provided by ToDI for Dutch, and fail to support the contrary analytical assumptions made for MAE ToBI.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-66"
  },
  "petrone08_speechprosody": {
   "authors": [
    [
     "Caterina",
     "Petrone"
    ],
    [
     "Mariapaola",
     "DImperio"
    ]
   ],
   "title": "Tonal structure and constituency in Neapolitan Italian: evidence for the accentual phrase in statements and questions",
   "original": "sp08_301",
   "page_count": 4,
   "order": 67,
   "p1": "301",
   "pn": "304",
   "abstract": [
    "In this paper, we report on some acoustic data suggesting the existence of the Accentual Phrase (AP) in Neapolitan Italian. In late narrow focus utterances in which intonation modality was varied, there was a difference in the shape and slope of the interaccentual region linking the H target of the prenuclear rise with the L target of the following nuclear rise. We hypothesized that such difference is due to the presence of a tone marking the end of an Accentual Phrase (AP), whose domain roughly correspond to the phonological phrase (ö). It is tentatively proposed that the phrasal tone is L for statements and HL for questions.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-67"
  },
  "jin08_speechprosody": {
   "authors": [
    [
     "Jian",
     "Jin"
    ],
    [
     "Weixiang",
     "Hu"
    ],
    [
     "Xia",
     "Wang"
    ],
    [
     "Ziyu",
     "Xiong"
    ]
   ],
   "title": "A comparative study on tone realization in Cantonese-accented Mandarin and standard Mandarin",
   "original": "sp08_305",
   "page_count": 4,
   "order": 68,
   "p1": "305",
   "pn": "308",
   "abstract": [
    "The paper investigates tone realization in monosyllabic and disyllabic words in Cantonese, Cantonese-spoken Mandarin and Standard Mandarin, focusing on the deviations of tone realization in Cantonese-spoken Mandarin from standard Mandarin in monosyllabic and disyllabic words. The analysis on monosyllabic and disyllabic tone patterns shows that most of the tone deviations in Cantonese-accented Mandarin made by Guangdong Cantonese speakers resulted from negative transfers of their native language, Cantonese.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-68"
  },
  "will08_speechprosody": {
   "authors": [
    [
     "Udo",
     "Will"
    ],
    [
     "Nick",
     "Poss"
    ]
   ],
   "title": "The role of pitch contours in tonal languages processing",
   "original": "sp08_309",
   "page_count": 4,
   "order": 69,
   "p1": "309",
   "pn": "312",
   "abstract": [
    "In the present study we examined the role of pitch contours in constraining lexical activation with three priming experiments in Mandarin. Primes based on pitch contours were found to significantly facilitate vocal responses in naming tasks but did not seem to affect lexical processing. Primes containing segments unrelated to the target, but with a tone that matched the target significantly delay responses and, presumably, lexical selection. The delay was found in a shadowing task as well as a lexical decision task. This is the first report of inhibitory lexical effects of tones when prime and target differ in form; it can be understood as a group activation of candidates with the same tone that increases competition with the representation of the target word.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-69"
  },
  "fujimura08_speechprosody": {
   "authors": [
    [
     "Osamu",
     "Fujimura"
    ]
   ],
   "title": "Pitch accent in Japanese: implementation by the c/d model",
   "original": "sp08_313",
   "page_count": 4,
   "order": 70,
   "p1": "313",
   "pn": "316",
   "abstract": [
    "In Tokyo Japanese, lexical accent is implemented by pitch pattern control, while phrasal stress patterns, along with pitch variation, convey non-lexical information in discourse. The C/D model represents pitch control by the tonal melody and stress control by the skeletal organization of the utterance. Phonetic implementation of pitch contours is exemplified here for different lexical accent patterns, including interphrasal interaction (catathesis). An example of phonetic variability is discussed. The issue of accent-bearing units (syllable vs. mora) is revisited. A principle of nuclear prominence (PNP) is proposed explaining why pitch drops in the middle of an accented long syllable.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-70"
  },
  "caelenhaumont08_speechprosody": {
   "authors": [
    [
     "Geneviève",
     "Caelen-Haumont"
    ]
   ],
   "title": "Structuring F0 prominences (melisms): an analysis of the statistical concordances between four French speakers",
   "original": "sp08_317",
   "page_count": 4,
   "order": 71,
   "p1": "317",
   "pn": "320",
   "abstract": [
    "F0 prominences having the reputation deserved to vary in great proportion, most of the studies until now avoided this problem, restricting their analysis to the use of extrema (minimum / maximum), and/or the F0 range. This work presented here tried to exceed these limits: this paper aims indeed at presenting the statistical results describing the F0 prominences structuration over a corpus of 4 French female speakers.\n",
    "More precisely the first part proposes a new perspective on the inner struture of the F0 prominences, and the second part focusses on the statistical results which are in concordance within the 4 speakers.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-71"
  },
  "ward08_speechprosody": {
   "authors": [
    [
     "Nigel G.",
     "Ward"
    ],
    [
     "S. Kumar",
     "Mamidipally"
    ]
   ],
   "title": "Factors affecting speaking-rate adaptation in task-oriented dialogs",
   "original": "sp08_323",
   "page_count": 4,
   "order": 72,
   "p1": "323",
   "pn": "326",
   "abstract": [
    "Dialog systems should be able to automatically determine an appropriate speaking rate for each utterance. In a small corpus of billing support dialogs we identified factors accounting for 18% of the variation in agent speaking rate. Simple adaptation to the user accounts for little, rather it is the dialog state and dialog acts in the local context which seem to matter more. 1\n",
    "Index Terms: speech rate selection\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-72"
  },
  "meireles08_speechprosody": {
   "authors": [
    [
     "Alexsandro R.",
     "Meireles"
    ],
    [
     "Plínio A.",
     "Barbosa"
    ]
   ],
   "title": "Speech rate effects on speech rhythm",
   "original": "sp08_327",
   "page_count": 4,
   "order": 73,
   "p1": "327",
   "pn": "330",
   "abstract": [
    "This acoustic study investigates speech rhythmic restructurings due to speech rate increase in Brazilian Portuguese. Rhythmic restructuring is considered here as the reorganization of stress groups due to speech rate increase. The Dynamical Speech Rhythm model was used as a theoretical background for the acoustic analyses. Main results have shown that speech rate increase reorganizes speech rhythm and modifies some phonetic parameters in the following way: a) the standard deviation of vowel-to-vowel (VV) duration and stress group duration is smaller at faster rates; b) stress group duration tends to be constant with speech rate increase (rhythmic restructurings make VV units smaller, but with a greater number of VV units per stress group, what results in a statistically constant stress group duration); c) the number of VV units per stress group proportionally increases with speech rate increase due to rhythmic restruturings; and d) speech rate increase exacerbates the mixture character of Brazilian Portuguese rhythm, i.e., tendencies to syllable as to stress-timed rhythm.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-73"
  },
  "niebuhr08_speechprosody": {
   "authors": [
    [
     "Oliver",
     "Niebuhr"
    ]
   ],
   "title": "The effect of global rhythms on local accent perceptions in German",
   "original": "sp08_331",
   "page_count": 4,
   "order": 74,
   "p1": "331",
   "pn": "334",
   "abstract": [
    "Accent perception is only partly due to local phonetic cues. Moreover, global phonetic patterns as well as signal-external top-down knowledge play an important role. The presented experiment continues this line of research and provides evidence for German that the perceived local accent position is affected by a global factor which is central for speech, but which has not been addressed so far: the rhythmic pattern.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-74"
  },
  "nava08_speechprosody": {
   "authors": [
    [
     "Emily",
     "Nava"
    ],
    [
     "Maria Luisa",
     "Zubizarreta"
    ]
   ],
   "title": "Prosodic transfer in L2 speech: evidence from phrasal prominence and rhythm",
   "original": "sp08_335",
   "page_count": 4,
   "order": 75,
   "p1": "335",
   "pn": "338",
   "abstract": [
    "The current study examines focus and Nuclear Pitch Accent in the second language (L2) speech of Spanish speakers of English. We begin with a discussion of the distinct algorithms said to account for Nuclear Stress (NS) at work in Spanish and English. We then match the theoretical claims with experimental data on the placement of Nuclear Accent for various focus constructions from native speakers of English, followed by a contrasting set of data from L2 speakers. However, the L2 speakers are not a homogenous group, and indeed the production behavior across proficiency groups gives rise to the hypothesis that the acquisition of nuclear pitch accent is hierarchical in nature: learners acquire anaphoric deaccenting before nuclear stress. We conclude with a discussion of further data that supports the notion that phrasal prosodic patterns might be related to some fundamental rhythmic difference between the two languages.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-75"
  },
  "ullakonoja08_speechprosody": {
   "authors": [
    [
     "Riikka",
     "Ullakonoja"
    ]
   ],
   "title": "Pausing as an indicator of fluency in the Russian of Finnish learners",
   "original": "sp08_339",
   "page_count": 4,
   "order": 76,
   "p1": "339",
   "pn": "342",
   "abstract": [
    "Previous research shows that pausing and disfluencies are common in non-native speech. The aim of this study was to investigate the relationship between fluency and pausing in Russian read-aloud speech of 12 Finnish university students and examine their fluency development during a 3.5-month study-period in Russia. To assess fluency, 30 Russian teachers rated the students speech samples (on a 1-5 scale). The samples were then analysed perceptually and acoustically for pause frequency, duration and placement. Results show that pausing can be an indicator of foreign language fluency and that most students develop considerably in their Russian readaloud fluency during their stay in Russia. Hence, when teaching students to read aloud in a foreign language, pausing should be emphasized as a way to become a fluent reader.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-76"
  },
  "magalhaes08_speechprosody": {
   "authors": [
    [
     "José Olímpio de",
     "Magalhães"
    ],
    [
     "Maria Dorotéa",
     "Sales Barbosa"
    ],
    [
     "Ceriz Graça Bicalho",
     "Cruz Costa"
    ]
   ],
   "title": "The pace of the delivery of speech in contexts with the preposition ±de² in BH portuguese",
   "original": "sp08_343",
   "page_count": 4,
   "order": 77,
   "p1": "343",
   "pn": "346",
   "abstract": [
    "The aim of this paper is to analyze speech and articulation rates in prosodic realizations in the linguistic context controlled by the preposition \"de\" (\"of\") that links words. The interference of these rates and context on the elision/nonelision of the segments (C) V (C) was analyzed. These data were taken from POBH corpus, standard Brazilian Portuguese from Belo Horizonte (BH).\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-77"
  },
  "giordano08_speechprosody": {
   "authors": [
    [
     "Rosa",
     "Giordano"
    ]
   ],
   "title": "On the phonetics of rhythm of Italian: patterns of duration in pre-planned and spontaneous speech",
   "original": "sp08_347",
   "page_count": 4,
   "order": 78,
   "p1": "347",
   "pn": "350",
   "abstract": [
    "This paper is concerned with the phonetic correlates of main stress in Italian and presents the analysis of the duration of syllabic nuclei in connected speech and in different speaking styles. Spontaneous dialogues are analysed basing on earlier works on pre-planned speech which investigated both [+stress] / [-stress] and stress/accent contrasts in Italian.\n",
    "The aim of this study is to examine the effects of two prosodic factors on the duration pattern of the intonation groups: 1) phonological prominences pertaining to different prosodic tiers (rhythmical and intonational), and 2) their position in the intonation group.\n",
    "Results show that the temporal pattern of the intonation group would actually depend on different factors on both prosodic layers: stress, pertaining to rhythm, and post-lexical factors, pertaining to intonation and to prosodic phrasing.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-78"
  },
  "bartkova08_speechprosody": {
   "authors": [
    [
     "Katarina",
     "Bartkova"
    ]
   ],
   "title": "Rhythmic patterns and their automatic retrieval in spontaneous French",
   "original": "sp08_351",
   "page_count": 4,
   "order": 79,
   "p1": "351",
   "pn": "354",
   "abstract": [
    "An auditory analysis of a speech data base in French highlighted the use of rhythmic patterns by speakers. The rhythmic patterns are built by employing successive prosodic groups of the same length expressed in a number of syllables. These rhythmic patterns were not present to the same extent in the elocution of every speaker, but were speaker dependent. Although the auditory detection of the prosodic units in the speech signal is based on a whole group of acoustic parameters, an attempt is made here to retrieve the auditory detected prosodic units automatically. Therefore, one of the goals of this study is to evaluate and approximate the group of acoustic parameters used during auditory segmentation by three parameters such as the vowel duration, vowel energy and the slope of the F0 (measured on the last vowel of the prosodic unit), as they are easy to calculate and are considered as playing a prominent role in the prosodic demarcation of speech.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-79"
  },
  "odell08_speechprosody": {
   "authors": [
    [
     "Michael L.",
     "ODell"
    ],
    [
     "Mietta",
     "Lennes"
    ],
    [
     "Tommi",
     "Nieminen"
    ]
   ],
   "title": "Hierarchical levels of rhythm in conversational speech",
   "original": "sp08_355",
   "page_count": 4,
   "order": 80,
   "p1": "355",
   "pn": "358",
   "abstract": [
    "This study continues our previous investigation into the rhythms contributing to the temporal structure of speech. The relative significance of different hierarchical levels of rhythm was evaluated using Bayesian inference on a linear regression model based on coupled oscillators. Results strengthen our previous conclusions that stress, mora and possibly foot timing are all simultaneously present as rhythmic factors in Finnish conversational speech.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-80"
  },
  "tortel08_speechprosody": {
   "authors": [
    [
     "Anne",
     "Tortel"
    ],
    [
     "Daniel",
     "Hirst"
    ]
   ],
   "title": "Rhythm and rhythmic variation in british English: subjective and objective evaluation of French and native speakers",
   "original": "sp08_359",
   "page_count": 4,
   "order": 81,
   "p1": "359",
   "pn": "362",
   "abstract": [
    "This paper presents results from an ongoing research on the evaluation of the prosody of British English spoken by French learners and native speakers. This pilot study examines two potential rhythmic criteria: the analysis of the anacrusis/narrow rhythm unit and that of the pairwise variability index (PVI). The method used is a comparative analysis of French and native speakers productions with on the one hand a subjective evaluation of the prosody of the speakers including the natives, and on the other hand an objective evaluation aiming at correlating acoustic parameters with the level of the speakers. This preliminary study showed interesting results: even though the level of significance was not reached the two rhythmic parameters could be considered as relevant prosodic criteria and are in need of further investigation.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-81"
  },
  "white08_speechprosody": {
   "authors": [
    [
     "Laurence",
     "White"
    ],
    [
     "Katalin",
     "Mády"
    ]
   ],
   "title": "The long and the short and the final: phonological vowel length and prosodic timing in Hungarian",
   "original": "sp08_363",
   "page_count": 4,
   "order": 82,
   "p1": "363",
   "pn": "366",
   "abstract": [
    "The phonological vowel and consonant length distinctions in languages such as Hungarian may provide a constraint on the degree to which prosodic structure can influence speech segment duration. Here we show that, like many other languages, Hungarian does mark prosodic structure with durational variation, in particular, utterance- final lengthening. There is an influence of phonological vowel length on the locus of utterance-final lengthening: long and short vowels are lengthened in absolute-final syllables; long vowels are also lengthened in penultimate syllables. Lengthening within pitch- accented words, observed in languages such as English, appears absent, however. Furthermore, we do not find support for the inverse relationship between word length and stressed vowel duration suggested by previous studies.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-82"
  },
  "pasdeloup08_speechprosody": {
   "authors": [
    [
     "Valérie",
     "Pasdeloup"
    ],
    [
     "Robert",
     "Espesser"
    ],
    [
     "David",
     "Piotrowski"
    ],
    [
     "Malika",
     "Faraj"
    ]
   ],
   "title": "Form and substance relationship in rhythmic structuring: a morphodynamic analysis of rate sensitivity at the infra-syllabic level",
   "original": "sp08_367",
   "page_count": 4,
   "order": 83,
   "p1": "367",
   "pn": "370",
   "abstract": [
    "The aim of this work is to determine in French, through an analysis of the rate sensitivity of vowels and consonants, how the speech rate is related to the prosodic structure at the infrasyllabic level. We present an analysis of the phonemic duration of a one thousand word speech corpus produced at three rates by one speaker with two repetitions. Results show that in French consonants as well as vowels are more ratesensitive when stressed than when unstressed. This stronger rate sensitivity bears on all syllabic constituents. Still, consonants are less rate-sensitive than vowels and this is especially true for the stressed phonemes. We will account for the rate sensitivity of phonemes with a morphodynamic conception of phonology: where the acoustic substrate controls the phonemic form. We will see that the perception of speech rate is controlled by the same parameter which controls the features +/- stressed.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-83"
  },
  "teixeira08_speechprosody": {
   "authors": [
    [
     "João Paulo",
     "Teixeira"
    ],
    [
     "Diamantino",
     "Freitas"
    ]
   ],
   "title": "Phoneme dedicated ANN improves segmental duration model",
   "original": "sp08_371",
   "page_count": 4,
   "order": 84,
   "p1": "371",
   "pn": "374",
   "abstract": [
    "The Phoneme Dedicated Artificial Neural Network (PDANN) segmental duration model consists of a set of ANNs trained specifically for each phoneme segment in order to avoid miscellaneous influence of different types of phoneme segments. Therefore, each ANN is dedicated to predict the duration of a specific phoneme segment. Objective and subjective measurements of the performance of the PDANN model were compared with those of a typical ANN model using the same input features and database. The results indicate a slight, but clear, perceptually perceived preference towards the PDANN.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-84"
  },
  "dellwo08_speechprosody": {
   "authors": [
    [
     "Volker",
     "Dellwo"
    ]
   ],
   "title": "The role of speech rate in perceiving speech rhythm",
   "original": "sp08_375",
   "page_count": 4,
   "order": 85,
   "p1": "375",
   "pn": "378",
   "abstract": [
    "Human listeners can distinguish between languages of different rhythmic classes (e.g. stress- and syllable-timed languages). The present study investigated the role of speech rate in this process. Acoustic data suggests (experiment I) that speech rate can distinguishes as reliable between stress- and syllable-timed languages as previously proposed correlates of speech rhythm (%V, VarcoC and nPVI). Behavioral data showed (experiment II) that listeners make use of rate differences when asked to assess rhythmic characteristics of stress- and syllable-timed languages in delexicalized speech. Results imply that speech rate is an important acoustic correlate for cross-language speech rhythm.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-85"
  },
  "gilbert08_speechprosody": {
   "authors": [
    [
     "Annie C.",
     "Gilbert"
    ],
    [
     "Victor J.",
     "Boucher"
    ],
    [
     "Boutheina",
     "Jemel"
    ]
   ],
   "title": "Size of rhythm-groups affects the memory trace of heard words in utterances: results from a pilot study using evoked potentials",
   "original": "sp08_379",
   "page_count": 4,
   "order": 86,
   "p1": "379",
   "pn": "382",
   "abstract": [
    "Since speech involves fleeting acoustic events some portions of heard utterances must be parsed and stored on-line in order to be interpreted. Our previous work has shown that in recalling novel series, rhythmic grouping of up to 4 syllables facilitates memory, and this corresponds to size limits on rhythm groups observed in speech. Such results suggest that prosodic groups can correspond to the natural parsing frameworks of memory processing. The present study further investigates this correspondence by means of an event-related potential technique. It has been established that the quality of memory traces of words is associated with variations in the amplitude of the N400 component. We show that variations in the amplitude of the N400 confirm for one subject that words presented in rhythm groups that do not exceed a 4-syllable limit present a better quality of memory trace than words presented in groups of 5 syllables, which rarely occur in speech and do not facilitate recall. Though the present observations are preliminary, our results converge on the point that prosodic grouping can be linked to mnemonic processes and that restrictions on memory may underlie size limits on prosodic groups.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-86"
  },
  "malisz08_speechprosody": {
   "authors": [
    [
     "Zofia",
     "Malisz"
    ],
    [
     "Katarzyna",
     "Klessa"
    ]
   ],
   "title": "A preliminary study of temporal adaptation in Polish VC groups",
   "original": "sp08_383",
   "page_count": 4,
   "order": 87,
   "p1": "383",
   "pn": "386",
   "abstract": [
    "The study presents experimental data on Polish vowel durations in consonantal contexts gathered to test prosodic hypotheses. An attempt is made to verify the significance of the process of balancing V-to-V durations in a dynamical model of speech rhythm applied to Polish. We report on the results of a controlled experiment followed by a query of a corpus of running Polish speech, both investigating the influence of selected Polish consonants on preceding vowel duration.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-87"
  },
  "gravano08_speechprosody": {
   "authors": [
    [
     "Agustín",
     "Gravano"
    ],
    [
     "Stefan",
     "Benus"
    ],
    [
     "Julia",
     "Hirschberg"
    ],
    [
     "Elisa Sneed",
     "German"
    ],
    [
     "Gregory",
     "Ward"
    ]
   ],
   "title": "The effect of contour type and epistemic modality on the assessment of speaker certainty",
   "original": "sp08_401",
   "page_count": 4,
   "order": 88,
   "p1": "401",
   "pn": "404",
   "abstract": [
    "In an empirical study participants were asked to rate the perceived degree of certainty of utterances that contained either the modal would or main verb be (e.g. That would be me vs. Thats me), and which were also variously produced with one of three intonational contours (downstepped, declarative, and yes-no question). We found that both downstepped contour and epistemic would made a significant and independent contribution to the assessment of speaker certainty. That is, participants rated utterances with the downstepped contour as most certain, followed by those with the declarative contour, while the yes-noquestion contour was perceived as highly uncertain. Similarly, participants rated speakers' responses with epistemic would as significantly more certain than those without it.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-88"
  },
  "tauberer08_speechprosody": {
   "authors": [
    [
     "Joshua",
     "Tauberer"
    ]
   ],
   "title": "Predicting intrasentential pauses: is syntactic structure useful?",
   "original": "sp08_405",
   "page_count": 4,
   "order": 89,
   "p1": "405",
   "pn": "408",
   "abstract": [
    "Syntactic structure plays a role in prosodic phrasing, which in turn guides where speakers may pause during a sentence. To what extent does syntactic structure predict the locations and durations of unfilled, intrasentential pauses in conversational speech? Here we attempt to answer that question by using the word-aligned and syntactically annotated Switchboard corpus. Automated binary classification revealed that while syntactic structure helps above and beyond lexical features such as POS, knowledge of constituent node labels was less useful than knowledge of the starts and ends of constituents. On the other hand, some POS and constituent labels were more predictive than others in predicting word boundary durations. Some labels indicated the presence of a disfluency; others picked out syntactic contexts such as between a noun phrase and a prepositional phrase, which was predictive of a lack of or shorter pause.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-89"
  },
  "dimitrova08_speechprosody": {
   "authors": [
    [
     "Diana",
     "Dimitrova"
    ],
    [
     "Gisela",
     "Redeker"
    ],
    [
     "Markus",
     "Egg"
    ],
    [
     "John",
     "Hoeks"
    ]
   ],
   "title": "Linguistic and extra-linguistic determinants of accentuation in dutch",
   "original": "sp08_409",
   "page_count": 4,
   "order": 90,
   "p1": "409",
   "pn": "412",
   "abstract": [
    "In this paper we discuss the influence of semantically unexpected information on the prosodic realization of contrast. For this purpose, we examine the interplay between unexpectedness and various discourse factors that have been claimed to enhance the accentuation of contrastive information: contrast direction, syntactic status, and discourse distance. We conducted a production experiment in Dutch in which speakers described scenes consisting of moving fruits with unnatural colors. We found that a general cognitive factor such as the unexpectedness of a property has a strong impact on the intonational marking of contrast, over and above the influence of the immediate discourse context.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-90"
  },
  "lai08_speechprosody": {
   "authors": [
    [
     "Catherine",
     "Lai"
    ]
   ],
   "title": "Prosodic cues for backchannels and short questions: really?",
   "original": "sp08_413",
   "page_count": 4,
   "order": 91,
   "p1": "413",
   "pn": "416",
   "abstract": [
    "Short questions can be ambiguous even after considering their preceding contexts. Hence, prosody may be useful for disambiguating different types of questions and their uses. For example, question bias has been linked to the presence of certain pitch accents. This paper presents a corpus study of very short questions and the contribution of prosodic cues to discourse disambiguation. This study focuses on backchannel questions which are by nature highly biased and yet sit between genuine questions and genuine backchannels. The study finds LDA and SVM classifiers do not perform better than random at separating backchannel and question really based on these prosodic cues. This means that, while intonation differs between broad categories of questions, theories that try to integrate prosodic cues with semantics and discourse require more than intonation, the final rise and the other usual prosodic suspects like duration and intensity.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-91"
  },
  "russo08_speechprosody": {
   "authors": [
    [
     "Michela",
     "Russo"
    ],
    [
     "William J.",
     "Barry"
    ]
   ],
   "title": "Isochrony reconsidered. objectifying relations between rhythm measures and speech tempo",
   "original": "sp08_419",
   "page_count": 4,
   "order": 92,
   "p1": "419",
   "pn": "422",
   "abstract": [
    "Recently, new ways of measuring rhythmic differences have been proposed. These are derived from syllable structure and prosodic differences between languages. The measurements are all durational: the variability of vocalic and consonantal intervals is calculated and plotted on two axes. Very small amounts of read material have been analysed. But the structural basis of the measurements implies dependency on the nature of the speech material: representativity problem. Tempo measurements are a function of phone- and syllable duration and must therefore be confounded with rhythm measures. This study presents a comparative rhythm analysis of spontaneous Italian and German. Some of these problems, in particular Speech Tempo, are discussed.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-92"
  },
  "mok08_speechprosody": {
   "authors": [
    [
     "Peggy P. K.",
     "Mok"
    ],
    [
     "Volker",
     "Dellwo"
    ]
   ],
   "title": "Comparing native and non-native speech rhythm using acoustic rhythmic measures: Cantonese, Beijing Mandarin and English",
   "original": "sp08_423",
   "page_count": 4,
   "order": 93,
   "p1": "423",
   "pn": "426",
   "abstract": [
    "This study investigates the speech rhythm of Cantonese, Beijing Mandarin, Cantonese-accented English and Mandarin-accented English using acoustic rhythmic measures. They were compared with four languages in the BonnTempo corpus: German and English (stress-timed) and French and Italian (syllable-timed). Six Cantonese and six Beijing Mandarin native speakers were recorded reading the North Wind and the Sun story with a normal speech rate, telling the story semi-spontaneously and reading the English version of the story. Both raw and normalised rhythmic measures were calculated using vocalic, consonantal and syllabic durations (ÄC, ÄV, ÄS, %V, VarcoC, VarcoV, VarcoS, rPVI_C, rPVI_S, nPVI_V, nPVI_S). Results confirm the syllable-timing impression of Cantonese and Mandarin. Data of the two foreign English accents poses a challenge to the rhythmic measures because the two accents are syllable-timed impressionistically but were classified as stress-timed by some of the rhythmic measures (ÄC, rPVI_C, nPVI_V, ÄS, VarcoS, rPVI_S and nPVI_S). VarcoC and %V give the best classification of speech rhythm in this study.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-93"
  },
  "bertinetto08_speechprosody": {
   "authors": [
    [
     "Pier Marco",
     "Bertinetto"
    ],
    [
     "Chiara",
     "Bertini"
    ]
   ],
   "title": "On modeling the rhythm of natural languages",
   "original": "sp08_427",
   "page_count": 4,
   "order": 94,
   "p1": "427",
   "pn": "430",
   "abstract": [
    "We describe a new model for the formal representation of the rhythmic tendencies of natural languages. The algorithm is a modification of PVI, proposed by Grabe and Low. The model was tested on a fairly substantial corpus of Italian semispontaneous productions, and its outcome compared with that yielded by two well-known algorithms (Ramus and PVI).\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-94"
  },
  "orourke08_speechprosody": {
   "authors": [
    [
     "Erin",
     "ORourke"
    ]
   ],
   "title": "Speech rhythm variation in dialects of Spanish: applying the pairwise variability index and variation coefficients to Peruvian Spanish",
   "original": "sp08_431",
   "page_count": 4,
   "order": 95,
   "p1": "431",
   "pn": "434",
   "abstract": [
    "Spanish rhythm has been traditionally classified as syllabletimed. Recent rhythm metrics have been employed to reconsider this typology in terms of differences in vocalic and consonantal variation. Several cross-dialectal studies have begun to uncover differences in rhythm within a given language. Yet research on differences in Spanish rhythm has not been conducted. In this paper, Peruvian Spanish is examined in order to observe possible differences in Spanish rhythm according to origin (Lima vs. Cuzco) and according to language background (native Spanish speaker vs. native Spanish-Quechua bilingual). Results show that Peruvian Spanish in general has greater vocalic variation and less consonantal variation that previously reported. Differences between Lima and Cuzco Spanish are observed, although both groups of Cuzco speakers appear to be using similar speech rhythms. This research points to the need for further crossdialectal research on rhythm in Spanish.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-95"
  },
  "edmonds08_speechprosody": {
   "authors": [
    [
     "Amanda",
     "Edmonds"
    ],
    [
     "Audrey Liljestrand",
     "Fultz"
    ],
    [
     "Jason",
     "Killam"
    ]
   ],
   "title": "Prosody and the production of ambiguous relative clauses in French",
   "original": "sp08_437",
   "page_count": 4,
   "order": 96,
   "p1": "437",
   "pn": "440",
   "abstract": [
    "When we hear the sentence he respects the butcher of the doctor who gains weight each year, it is not clear whether the appreciated butcher has put on weight or whether it is the doctor who is a bit heavier. Without additional information, the attachment of the relative clause (RC) is ambiguous, a case of structural ambiguity that is found in many languages, including English and French. Although such phrases are usually disambiguated by context, it has been shown that speakers and listeners can disambiguate several structural ambiguities by prosodic means [1]. Yet, this body of literature has concentrated almost exclusively on the ambiguity resolution of a small set of structures in English. The current study examines the prosodic strategies of final lengthening and F0 rise used to disambiguate the attachment of a RC to a complex noun phrase (NP) as employed by three native speakers (NS) of both Hexagonal and Quebecois French. Participants completed two tasks, one in which the intended interpretation of the RC was indicated through context and the other a more explicit minimal pairs task. Almost all participants employ a similar pattern of final lengthening to differentiate between the two interpretations of the RC, whereas results from F0 rise are mixed, with several patterns emerging.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-96"
  },
  "mora08_speechprosody": {
   "authors": [
    [
     "Elsa",
     "Mora"
    ],
    [
     "Hernán",
     "Martínez"
    ]
   ],
   "title": "Prosodic characteristics associated with the clause in Venezuelan Spanish: an acoustic, audio-perceptive analysis",
   "original": "sp08_441",
   "page_count": 4,
   "order": 97,
   "p1": "441",
   "pn": "444",
   "abstract": [
    "This study presents a series of analyses related to the prosodic characteristics of clauses in the Mérida dialect of Venezuelan Spanish. We based this study on two analyses: one acoustic and one audio-perceptive. The parameters we analysed were the distribution and nature of pauses, the variations on fundamental frequency at the beginning and at the end of clauses, the different types of accents in both stressed initial and final syllables and the duration of stress syllables both in initial and final positions. The results suggest that clauses have certain prosodic features that identify them. Our data reveals that prosody leads to the recognition of syntactic-discursive structures in the spoken language.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-97"
  },
  "tenani08_speechprosody": {
   "authors": [
    [
     "Luciani Ester",
     "Tenani"
    ],
    [
     "Flaviane Romani",
     "Fernandes-Svartman"
    ]
   ],
   "title": "Prosodic phrasing and intonation in neutral and subject-narrow-focus sentences of brazilian portuguese",
   "original": "sp08_445",
   "page_count": 4,
   "order": 98,
   "p1": "445",
   "pn": "448",
   "abstract": [
    "This work aims at discussing the relationship between prosodic phrasing and intonation structure associated with neutral and subject-narrow-focus sentences in Brazilian Portuguese (BP). The sentences were analyzed in terms of phonological phrases (fs) and tonal events. It is found when subject-narrow-focus occurs, the tonal events of neutral sentences can be affected. We argue that evidences of the syntactic structure can be determined by the relationship between the prosodic phrasing and intonation. Finally, we point out that ours results provide for a better understanding of the syntax-phonology interface in BP.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-98"
  },
  "li08_speechprosody": {
   "authors": [
    [
     "Aijun",
     "Li"
    ],
    [
     "Yiqing",
     "Zu"
    ]
   ],
   "title": "Speaking rate effects on discourse prosody in standard Chinese",
   "original": "sp08_449",
   "page_count": 4,
   "order": 99,
   "p1": "449",
   "pn": "452",
   "abstract": [
    "What is the prosodic mechanism of faster or slower discourse speech? This paper focuses on observing the effects of speech rate on discourse prosody of Standard Chinese speech with fast, normal and slow speech rates. The investigation in discourse prosody structure demonstrates that the speaking rate effects on discourse prosody are nonlinear and need careful manipulations.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-99"
  },
  "sridhar08_speechprosody": {
   "authors": [
    [
     "Vivek Kumar Rangarajan",
     "Sridhar"
    ],
    [
     "Ani",
     "Nenkova"
    ],
    [
     "Shrikanth",
     "Narayanan"
    ],
    [
     "Dan",
     "Jurafsky"
    ]
   ],
   "title": "Detecting prominence in conversational speech: pitch accent, givenness and focus",
   "original": "sp08_453",
   "page_count": 4,
   "order": 100,
   "p1": "453",
   "pn": "456",
   "abstract": [
    "The variability and reduction that are characteristic of talking in natural interaction make it very difficult to detect prominence in conversational speech. In this paper, we present analytic studies and automatic detection results for pitch accent, as well as on the realization of information structure phenomena like givenness and focus. For pitch accent, our conditional random field model combining acoustic and textual features has an accuracy of 78%, substantially better than chance performance of 58%. For givenness and focus, our analysis demonstrates that even in conversational speech there are measurable differences in acoustic properties and that an automatic detector for these categories can perform significantly above chance.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-100"
  },
  "hermes08_speechprosody": {
   "authors": [
    [
     "Anne",
     "Hermes"
    ],
    [
     "Johannes",
     "Becker"
    ],
    [
     "Doris",
     "Mücke"
    ],
    [
     "Stefan",
     "Baumann"
    ],
    [
     "Martine",
     "Grice"
    ]
   ],
   "title": "Articulatory gestures and focus marking in German",
   "original": "sp08_457",
   "page_count": 4,
   "order": 101,
   "p1": "457",
   "pn": "460",
   "abstract": [
    "This study reports on a production experiment investigating tonal and articulatory means of encoding different focus structures in German. Using an electromagnetic articulograph, we examined the movements of the upper and lower lips (related to sonority expansion) during the production of target words occurring in four different focus conditions. We found systematic differences not only between unaccented vs. accented target words (background vs. contrastive focus), but also within the category accented: the differences in articulatory expression for broad vs. contrastive focus were expressed by greater displacements and lower stiffness of lip aperture (opening and closing movements). Our results suggest that German speakers express discrete linguistic differences, namely differences in focus structure, by gradually but systematically varying sonority expansion in focus exponents across consonants and adjacent vowels, thus enhancing the syntagmatic contrast.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-101"
  },
  "maia08_speechprosody": {
   "authors": [
    [
     "Marcus",
     "Maia"
    ]
   ],
   "title": "Reading and listening to garden-path PP sentences in Brazilian portuguese",
   "original": "sp08_461",
   "page_count": 4,
   "order": 102,
   "p1": "461",
   "pn": "464",
   "abstract": [
    "The present study reports three on-line psycholinguistic experiments investigating syntactic attachment decisions in both silent reading and auditory comprehension of the same set of sentences containing ambiguous adjunct and argument Prepositional Phrases (PP) in Brazilian Portuguese. An eyetracking experiment shows that both adjunct and argument PPs are preferentially attached to the VP during the reading of sentences fully presented on the screen. Sentences are then examined through a self-paced reading experiment and a selfpaced listening experiment, in which speech passages were presented in segments, with participants required to initiate presentation of subsequent segments via a key-press. Equivalent prosodic breaks in auditory presentation and segment boundaries in reading were systematically manipulated in order to assess explicit and implicit prosody effects on attachment decisions. The key results are summarized as follows. Unlike the argument/adjunct condition, which was not immediately accessed by the parser, prosodic breaks and visual segmentations displayed rapid parallel effects on the listening/reading times of critical segments, suggesting that BP subjects treat segment boundaries as signaling prosodic boundaries, as predicted by the Implicit Prosody Hypothesis (Fodor, 1998; 2002), and that both explicit and implicit prosody have markedly significant influences in on-line attachment decisions of both adjunct and argument PPs.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-102"
  },
  "ito08_speechprosody": {
   "authors": [
    [
     "Kiwako",
     "Ito"
    ],
    [
     "Shari R.",
     "Speer"
    ]
   ],
   "title": "Use of l+h* for immediate contrast resolution",
   "original": "sp08_465",
   "page_count": 4,
   "order": 103,
   "p1": "465",
   "pn": "468",
   "abstract": [
    "Previous eye tracking studies demonstrated that a prominent L+H* accent in English instructions evoked a contrastive relationship between discourse referents, immediately guiding listeners eye movements to contrastive candidates in the visual scene. However, the visual layout in the previous study conflated looks to contrastive candidates with those to previously fixated object groups, thus calling into question the cause of the very early fixations to contrastive targets. In order to eliminate the possibility that L+H* evokes contrast only when the visual layout allows easy detection of the target, the current experiment used layouts where contrastive candidates had separate visual domains. The results confirm the immediate effect of L+H*, demonstrating a faster increase in fixations to contrastive targets than with H*. In addition, results show an intonational garden-path effect due to the immediate integration of L+H* as contrast marking accent.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-103"
  },
  "jun08_speechprosody": {
   "authors": [
    [
     "Sun-Ah",
     "Jun"
    ],
    [
     "Molly",
     "Shilman"
    ]
   ],
   "title": "Default phrasing in English relative clause attachment data",
   "original": "sp08_469",
   "page_count": 4,
   "order": 104,
   "p1": "469",
   "pn": "472",
   "abstract": [
    "This study investigates the validity of the Implicit Prosody Hypothesis (IPH) by examining the default phrasing of English sentences where a complex noun phrase is the head of a relative clause (RC) (e.g., the servant of the actress who was on the balcony). The prosodic phrasing data collected from 36 speakers were transcribed by three labelers. Results show that, counter to the prediction of the IPH, the most common prosodic phrasing was (NP1 NP2) // (RC), the same pattern found in Japanese and Korean, which are known to be high attachment preference languages. The results also showed that the default phrasing was influenced by the length of the RC but not the bias of the RC. The results are discussed in relation to factors affecting default phrasing.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-104"
  },
  "shen08_speechprosody": {
   "authors": [
    [
     "Wen-chi",
     "Shen"
    ]
   ],
   "title": "Phonological representation of connective words - a toBI study in Gouyu and Taiwan Min",
   "original": "sp08_473",
   "page_count": 4,
   "order": 105,
   "p1": "473",
   "pn": "476",
   "abstract": [
    "This paper aims at analyzing phonological representation of connective words frequently used in Gouyu and Taiwan Min1. Based on 180-mintue spontaneous speech in Gouyu and Taiwan Min, it is found that speakers tend to use connective words quite often to link phrases or sentences either consciously or unconsciously. Thus, following the labeling of the ToBI system, this study will focuses on phonological representation of these connectives in terms of syntactic or pragmatic behaviors of the clauses. In addition, I would like to see if there is any innovative proposal for labeling in M-ToBI and Taiwan Min ToBI since both systems are still at initial stages.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-105"
  },
  "braun08_speechprosody": {
   "authors": [
    [
     "Bettina",
     "Braun"
    ],
    [
     "Aoju",
     "Chen"
    ]
   ],
   "title": "Now move x to cell y: intonation of ±now² in on-line reference resolution",
   "original": "sp08_477",
   "page_count": 4,
   "order": 106,
   "p1": "477",
   "pn": "480",
   "abstract": [
    "Prior work has shown that listeners efficiently exploit prosodic information both in the discourse referent and in the preceding modifier to identify the referent. This study investigated whether listeners make use of prosodic information prior to the ENTIRE referential expression, i.e. the intonational realization of the adverb 'now', to identify the upcoming referent. The adverb now can be used to draw attention to contrasting information in the sentence. (e.g., put the book on the bookshelf. Now put the pen on the bookshelf.). It has been shown for Dutch that nu ('now') is realized prosodically differently in different information structural contexts though certain realizations occur across information structural contexts.\n",
    "In an eye-tracking experiment we tested two hypotheses regarding the role of the intonation of nu in online reference resolution in Dutch: the \"irrelevant intonation\" hypothesis, whereby listeners make no use of the intonation of nu, vs. the \"linguistic intonation\" hypothesis, whereby listeners are sensitive to the conditional probabilities between different intonational realizations of nu and the referent. Our findings show that listeners employ the intonation of nu to identify the upcoming referent. They are mislead by an accented nu but correctly interpret an unaccented nu as referring to a new, unmentioned entity. 1.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-106"
  },
  "knoll08_speechprosody": {
   "authors": [
    [
     "Monja",
     "Knoll"
    ],
    [
     "Lisa",
     "Scharrer"
    ]
   ],
   "title": "How similar are pitch contours derived from ±imaginary² student interactions to those derived from real interactions?",
   "original": "sp08_481",
   "page_count": 4,
   "order": 107,
   "p1": "481",
   "pn": "484",
   "abstract": [
    "This study evaluated the use of imagined interactions in speech research, by comparing speech addressed to imaginary speech partners with natural speech addressed to genuine interaction partners. The shape of pitch contours derived from target words of samples of imaginary infant (IDS), foreigner (FDS) and British adult (ADS) directed speech produced by ten female students was compared to that derived from an existing data set of natural IDS, FDS and ADS. For the pitch contour shape analysis we used a standard qualitative approach and a previously evaluated novel algorithmic method. We found no significant difference in pitch contour shape between IDS, ADS and FDS in the imaginary interactions. Unlike our previous findings for natural speech where IDS had been characterised by exaggerated contours compared to both adult conditions, all three speech types had a similar distribution of pitch contour shape. This contrast between the present findings and the interactions with genuine speech partners, suggests that speech obtained from imaginary interactions should be used with caution.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-107"
  },
  "oliveirajr08_speechprosody": {
   "authors": [
    [
     "Miguel",
     "Oliveira Jr"
    ],
    [
     "Tiago",
     "Freitas"
    ]
   ],
   "title": "Intonation as a cue to turn management in telephone and face-to-face interactions",
   "original": "sp08_485",
   "page_count": 4,
   "order": 108,
   "p1": "485",
   "pn": "488",
   "abstract": [
    "Melodic properties of turn boundaries in face-to-face and nonface- to-face interactions are analyzed from a production and a perception viewpoint. Results show that although listeners seem to be able to predict turn management in telephone speech when some conditions are met, melodic information by itself is for the most part insufficient to indicate turn transition to conversationalists.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-108"
  },
  "armstrong08_speechprosody": {
   "authors": [
    [
     "Meghan",
     "Armstrong"
    ],
    [
     "Anouschka",
     "Bergmann"
    ],
    [
     "Terrin",
     "Tamati"
    ]
   ],
   "title": "The prosody of negation in brazilian portuguese",
   "original": "sp08_489",
   "page_count": 4,
   "order": 109,
   "p1": "489",
   "pn": "492",
   "abstract": [
    "Sentential negation in spoken Brazilian Portuguese (BP) has three possible structures: containing a negative particle only preverbally (NEG1), pre and post verbally (NEG2) or only post-verbally (NEG3). The choice of structure depends on sociolinguistic and pragmatic factors. This study investigates whether these structures also differ in prosodic patterns. NEG3 is of particular interest: since the negative particle occurs after the verb, a NEG3 sentence is initially segmentally indistinguishable from a similar sentence not containing a negative particle (NoNEG). However, prosodic cues may tell the listener whether a given utterance has a NEG3 or NoNEG structure before the post-verbal region is encountered. A production study elicited NEG1, NEG2, NEG3 and NoNEG utterances and found prosodic differences among the utterance types which may enable listeners to anticipate the presence or absence of a post-verbal negative particle.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-109"
  },
  "metusalem08_speechprosody": {
   "authors": [
    [
     "Ross",
     "Metusalem"
    ],
    [
     "Kiwako",
     "Ito"
    ]
   ],
   "title": "The role of l+h* pitch accent in discourse construction",
   "original": "sp08_493",
   "page_count": 4,
   "order": 110,
   "p1": "493",
   "pn": "496",
   "abstract": [
    "L+H* is claimed to evoke contrast between discourse entities in English. To test whether this prominent accent projects a contrastive relation for the discourse foreground, spontaneous continuations of short stories were examined. For both subject and object positions, participants mentioned contrastive alternatives more often when the corresponding discourse entity was introduced with L+H* in the context. Also, the presence of L+H* on a discourse marker (e.g., And NEXT) that preceded the continuation facilitated the mention of the contrastive subject/object. These results do not merely confirm the function of L+H* on arguments in projecting contrastive relations, but also uncovers the facilitative mediation of the contrastive relation by L+H* on a discourse marker.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-110"
  },
  "gilifivela08b_speechprosody": {
   "authors": [
    [
     "Barbara",
     "Gili Fivela"
    ]
   ],
   "title": "Discourse structure and phrase level phenomena: the phonetics of continuation contours in topic-internal position",
   "original": "sp08_497",
   "page_count": 4,
   "order": 111,
   "p1": "497",
   "pn": "500",
   "abstract": [
    "This paper investigates the structuring of information in task-oriented dialogues, focussing on sequences of phrases produced with final-rising contours conveying continuation. Fragments extracted form dialogues are described with the aim of both showing some unexpected phonetic correlates of such contours and discussing the characteristics of the contexts where these correlates are observed.\n",
    "A closer look at the phonetic implementation of continuation contours led to the observation that speakers may implement phrases with progressively expanded pitch ranges and with increasing fundamental frequency values for their boundary tones. The trend appears to be produced in well-planned sections of the dialogues, where it seems to be a quite robust phenomenon: the pattern was observed on not adjacent phrases, across quite complex stretches of dialogues. However, it is interesting to notice that the number of phrases showing this quite precise phonetic control was always three, four at the most - this find recalls other observations in the literature on phonetic long distance relations. Nevertheless, even when a sequence of phrases is characterized by rising contours, the topic-initial and topic-final phrases - usually characterized by falling edge tones - are usually realized with pitch range variations in line with those described in the literature. Therefore, the topic-internal increasing of frequency values at the boundaries, and of phrase pitch ranges, does not conflict because of the different phonological choices made by the speakers.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-111"
  },
  "buder08_speechprosody": {
   "authors": [
    [
     "Eugene H.",
     "Buder"
    ],
    [
     "Jamie L.",
     "Edrington"
    ]
   ],
   "title": "Conversational prosodic interactivity when one partner has aphasia",
   "original": "sp08_501",
   "page_count": 4,
   "order": 112,
   "p1": "501",
   "pn": "504",
   "abstract": [
    "The purpose of this study is to document prosodic interactivity, and its preservation in a woman with non-fluent aphasia. Fundamental frequency and sound pressure level records are examined for sinusoidal models. In-phase and anti-phase partner relationships in these models may represent synchrony. These measurements demonstrate that prosodic management of conversational rhythms is robust even when expressive language is disturbed.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-112"
  },
  "bergmann08_speechprosody": {
   "authors": [
    [
     "Anouschka",
     "Bergmann"
    ],
    [
     "Meghan",
     "Armstrong"
    ],
    [
     "Kristine",
     "Maday"
    ]
   ],
   "title": "Relative clause attachment in English and Spanish: a production study",
   "original": "sp08_505",
   "page_count": 4,
   "order": 113,
   "p1": "505",
   "pn": "508",
   "abstract": [
    "The Implicit Prosody Hypothesis assumes that differences in individual languages attachment preferences for syntactically ambiguous sentences are due to the languages different prosodic systems. For example, when a relative clause modifies a complex noun phrase (NP1 NP2 RC), a prosodic break after NP1 is said to trigger a low attachment interpretation, while a break after NP2 triggers high attachment. English and Spanish participants read aloud sentences of this type, but showed no correlation between prosodic phrasing pattern and attachment choice. Both English and Spanish readers pronounced the majority of sentences with the strongest prosodic break following NP2. However, responses to comprehension questions immediately following each production showed that Spanish speakers preferred a high attachment interpretation, while English speakers preferred low attachment. Our findings provide evidence against a prosodic account of overall attachment preferences for this construction and provide insights into the mechanisms of reading aloud.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-113"
  },
  "hara08_speechprosody": {
   "authors": [
    [
     "Yurie",
     "Hara"
    ],
    [
     "Shigeto",
     "Kawahara"
    ]
   ],
   "title": "Deaccenting, MAXIMIZE PRESUPPOSITION and evidential scale",
   "original": "sp08_509",
   "page_count": 4,
   "order": 114,
   "p1": "509",
   "pn": "512",
   "abstract": [
    "Some studies have assumed that prosodic patterns of sentences are exclusively determined by the rules of accented expressions, with deaccenting of non-focused elements playing little or no role [1, 2]. However,many researchers have also recognized the importance of deaccenting rules [3, 4, 5, 6, 7]. This paper documents two intonational patterns of Japanese biased questions, \"Rise with Accents\" and \"Rise with Deaccentuation\", used by young speakers of the Tokyo dialect for Japanese biased questions. We argue that Japanese data furthers the deaccenting-as-rule view. Specifically, deaccentuation in biased questions has recently gained a grammaticalized status, and now gives rise to a Givenness presupposition. Moreover, the presuppositions of Bias and Givenness form a scale, i.e., Given vs. Bias, which interacts with MAXIMIZE PRESUPPOSITION [8]. Our proposal also naturally extends to the evidential hierarchy proposed in the literature.\n",
    "s Rooth, M.: Association with Focus. PhD thesis, University of Massachusetts at Amherst (1985) Rooth, M.: Indefinites, adverbs of quantification and focus semantics. In Carlson, G.N., Pelletier, F.J., eds.: The Generic Book. Chicago University Press, Chicago (1995) Ladd, R.D.: The structure of intonational meaning: Evidence from English. Indiana University Press, Bloomington (1980) Brown, G.: Prosodic structure and the given/new distinction. In Cutler, Ladd, eds.: Prosody: Models and Measurements. Springer Verlag (1983) Selkirk, E.O.: Sentence prosody: Intonation, stress, and phrasing. In Goldsmith, J.A., ed.: The Handbook of Phonology. Blackwell, London (1995) Terken, J., Hirschberg, J.: Deaccentuation of words representing given information: Effects of persistence of grammatical role and surface position. Language and Speech 37 (1994) 125-145 Schwarzschild, R.: GIVENness, AVOIDF and other constraints on the placement of accent. Natural Language Semantics 7 (1999) 141-177 Heim, I.: Artikel und definitheit. In von Stechow, A., Wunderlich, D., eds.: Semantik. de Gruyter, Berlin (1991) 487-536\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-114"
  },
  "chen08c_speechprosody": {
   "authors": [
    [
     "Aoju",
     "Chen"
    ],
    [
     "Ineke",
     "Mennen"
    ]
   ],
   "title": "Encoding interrogativity intonationally in a second language",
   "original": "sp08_513",
   "page_count": 4,
   "order": 115,
   "p1": "513",
   "pn": "516",
   "abstract": [
    "This study investigated how untutored learners encode interrogativity intonationaly in a second language. Questions produced in free conversation were selected from longitudinal data of four untutored Italian learners of English. The questions were mostly wh-questions (WQs) and declarative questions (DQs). We examined the use of three cross-linguistically attested question cues: final rise, high peak and late peak. It was found that across learners the final rise occurred more frequently in DQs than in WQs. This is in line with the Functional Hypothesis whereby less syntactically-marked questions are more intonationally marked. However, the use of peak height and alignment is less consistent. The peak of the nuclear pitch accent was not necessarily higher and later in DQs than in WQs. The difference in learners exploitation of these cues can be explained by the relative importance of a question cue in the target language.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-115"
  },
  "jian08_speechprosody": {
   "authors": [
    [
     "Hua-Li",
     "Jian"
    ],
    [
     "Vincent",
     "Chang"
    ]
   ],
   "title": "A preliminary study of lexical stress in taiwan English homographs",
   "original": "sp08_519",
   "page_count": 4,
   "order": 116,
   "p1": "519",
   "pn": "522",
   "abstract": [
    "In this study lexical stress of homographs uttered by speakers with three different levels of English, namely native Americans, Taiwanese students specializing in English and students with basic knowledge of English, is investigated. The acoustic properties of duration, fundamental frequency and intensity are studied. A new measure is proposed based on the ratio of successive vowels that is insensitive to speaker and speed variations. The results show that the degree to which duration and fundamental frequencies are varied in successive vowels is related to the English level of the speaker. Intensity was not found to be a significant cue.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-116"
  },
  "lacheretdujour08_speechprosody": {
   "authors": [
    [
     "Anne",
     "Lacheret-Dujour"
    ],
    [
     "Chantal",
     "Lyche"
    ]
   ],
   "title": "Looking at French schwa in initial position through the glasses of prosody",
   "original": "sp08_523",
   "page_count": 4,
   "order": 117,
   "p1": "523",
   "pn": "526",
   "abstract": [
    "In the vast body of literature related to French schwa behavior, prosodic factors are sometimes mentioned, but never systematically studied. This paper proposes to investigate how the topological organization of a sequence influences schwa behavior. The empirical base for this study is extracted from the PFC (Phonologie du Français Contemporain) corpus where 20 speakers have been systematically coded for prosodic elements. In addition to obvious geographical differences, we show a clear distinction between so-called optional schwas in monosyllables and in polysyllables. This contrast will impact on the phonological analysis, favoring two distinct underlying representations.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-117"
  },
  "mennen08_speechprosody": {
   "authors": [
    [
     "Ineke",
     "Mennen"
    ],
    [
     "Felix",
     "Schaeffler"
    ],
    [
     "Gerard",
     "Docherty"
    ]
   ],
   "title": "A methodological study into the linguistic dimensions of pitch range differences between German and English",
   "original": "sp08_527",
   "page_count": 4,
   "order": 118,
   "p1": "527",
   "pn": "530",
   "abstract": [
    "The aim of this paper is to develop the methodology that would allow us to investigate the nature of variability in pitch range across speakers of different languages. In particular, we wanted to investigate whether by using linguistically based pitch range measures, such as those proposed by [1-3], we are able to characterise differences in pitch range across languages. We investigated Southern Standard British English (SSBE) and Northern Standard German (NSG), as it is often assumed that speakers of SSBE have a wider pitch range than speakers of NSG [4]. Using the linguistic measures suggested by [3], we found no such differences between NSG and SSBE, although a difference in the predicted direction was found with another linguistically based measure. Our study highlights the difficulty of using the previously suggested linguistic measures for cross-language comparisons, as some tonal structures are not equally distributed across the two languages. We therefore suggest that more suitable linguistic measures of pitch range may need to take the tonal distribution in the different languages into account.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-118"
  },
  "boulademareuil08_speechprosody": {
   "authors": [
    [
     "Philippe",
     "Boula de Mareüil"
    ],
    [
     "Albert",
     "Rilliard"
    ],
    [
     "Alexandre",
     "Allauzen"
    ]
   ],
   "title": "A diachronic study of prosody through French audio archives",
   "original": "sp08_531",
   "page_count": 4,
   "order": 119,
   "p1": "531",
   "pn": "534",
   "abstract": [
    "This study makes use of advances in automatic speech processing to analyse French audiovisual archives. A 10-hour corpus covering five decades of broadcast news is investigated from the angle of prosody evolution. Two prosodic features are explored: word-initial stress (especially in the case of proper names) and penultimate vowel lengthening (especially penultimate nasal vowels before a pause), which may give an impression of emphatic style. Our measurements suggest that the following features as well as mean pitch have decreased since the forties: pitch rise and vowel duration associated with initial stress, and prepausal penultimate lengthening. In the meantime, the onsets of supposedly stressed initial syllables have become longer while speech rate has not changed. This puzzling outcome rises interesting questions for research on French prosody.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-119"
  },
  "bouchhioua08_speechprosody": {
   "authors": [
    [
     "Nadia",
     "Bouchhioua"
    ]
   ],
   "title": "Duration as a cue to stress and accent in tunisian Arabic, native English, and L2 English",
   "original": "sp08_535",
   "page_count": 4,
   "order": 120,
   "p1": "535",
   "pn": "538",
   "abstract": [
    "This paper investigates the role of duration in signaling stress and accent in Southern British English (SBE), Tunisian Arabic (TA), and English as produced by Tunisian speakers (L2 English). Results show that unlike English, where duration is a robust correlate of both stress and accent, Tunisian Arabic has shown a lack of durational involvement in lexical stress. Duration, in this language, was found to be a cue to accent only. This fact did not affect the production of English lexical stress by Tunisian speakers who produced significant durational contrasts between stressed and unstressed constituents. In addition, these speakers seem to have internalized the positive interaction existing between syllable position and focus related lengthening in English and successfully mimicked it. Their production of English segments and words were, however, consistently longer than native production, which may reveal their non-nativeness.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-120"
  },
  "bouchhioua08b_speechprosody": {
   "authors": [
    [
     "Nadia",
     "Bouchhioua"
    ]
   ],
   "title": "The role of vowel quality in cuing stress and accent in tunisian Arabic, native English, and L2 English",
   "original": "sp08_539",
   "page_count": 4,
   "order": 121,
   "p1": "539",
   "pn": "542",
   "abstract": [
    "This study is an attempt to investigate the role of vowel quality in signaling stress and accent in Southern British English (SBE), Tunisian Arabic (TA), and English as produced by Tunisian speakers (L2 English). Results show that while both formant values are affected by lexical stress in SBE, only gradient F1 lowering can be used to predict lexical stress in TA. L2 speakers seem to have transferred this latter fact from their mother tongue as in their productions of English vowels, only F1 was affected by stress. Vowel reduction due to stress in TA and SBE was dissimilar, which affected L2 speakers productions. Vowel quality had no significant role in cuing accent in any of the languages explored.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-121"
  },
  "chow08_speechprosody": {
   "authors": [
    [
     "Ivan",
     "Chow"
    ]
   ],
   "title": "Quantitative analysis of preboundary lengthening in Cantonese",
   "original": "sp08_543",
   "page_count": 4,
   "order": 122,
   "p1": "543",
   "pn": "546",
   "abstract": [
    "In a corpus study using eight pairs of syntactically ambiguous sentences, we conducted acoustic and quantitative analyses of the prosodic patterns used by seven native speakers of the Hong Kong variety of Cantonese to divide these sentences into prosodic words - a phenomenon referred to as \"prosodic chunking\". Although pauses, pitch reset and preboundary lengthening were analyzed, in this article we concentrate on presenting results from the analysis of preboundary lengthening. Using test sentence pairs consisting of identical series of words with two possible prosodic subdivisions, we measure the preboundary syllables within the sentence, and compare it to the same syllables in the non-boundary position of the corresponding sentence. Results indicate that the presence/absence of a following prosodic boundary is highly significant in the measure of lengthening, thus confirming preboundary lengthening as a prominent device in marking prosodic word boundaries in Cantonese. Moreover, the presence of a pause at the prosodic word boundary also triggers a more prominent preboundary lengthening. Finally, our statistical results indicate that there seems to be a trade-off relation between pitch reset and preboundary lengthening. Since this result seems to contradict with recent research, which indicates that pitch range increases with syllabic duration [1], and that pitch contours are also subject to contextual tonal effects (both carry-over and anticipatory) [2] as well as perturbations brought about by focus [3]. As a result, more research is needed before we can confirm/disconfirm the validity of this trade-off relation.\n",
    "s House, A.S. & Fairbank, G. 1953. \"The influence of consonant environment upon the secondary acoustical characteristics of vowels\", Journal of the Acoustical Society of America, 25, 105-113. Gu, W.T. & Lee, T. 2007. \"Effects of tonal context and focus on Cantonese F0\", Proceedings of 16th International Congress of Phonetic Sciences (ICPhS XVI), 1033-1036. Wong, Y.W. 2006. \"Contextual tonal variations and pitch targets in Cantonese\", Proceedings: Speech Prosody 2006 (SP2006). Dresden, Germany. 317-320.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-122"
  },
  "jia08_speechprosody": {
   "authors": [
    [
     "Huibin",
     "Jia"
    ],
    [
     "Jianhua",
     "Tao"
    ],
    [
     "Xia",
     "Wang"
    ]
   ],
   "title": "Prosody variation: application to automatic prosody evaluation of Mandarin speech",
   "original": "sp08_547",
   "page_count": 4,
   "order": 123,
   "p1": "547",
   "pn": "550",
   "abstract": [
    "Prosody evaluation is an essential part of computer-aided language learning system. In the paper, prosodic variability among inter-speakers is investigated based on a database containing eight repetitions of 200 sentences. For Mandarin of reading style, its variability can be analyzed from rhythm, intonation and tone. Experimental results show that the mean correlation of tone between inter-speakers is 0.70, intonation and rhythm are 0.81. Based on these analyses, the prosodic similarity between the tested and standard utterances is calculated to automatically evaluate prosody quality. The standard utterances were recorded by multiple speakers, so they can cover different prosody patterns for the same utterance. The prosodic similarities are calculated from three aspects: tone, intonation and rhythm. Based on these similarities, the prosody quality can be graded. The method evaluated on the collected database has achieved good performance, and the correlation of human-machine scores is close to that of human-human scores.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-123"
  },
  "cunha08_speechprosody": {
   "authors": [
    [
     "Claudia",
     "Cunha"
    ],
    [
     "Glaucia",
     "Felismino"
    ],
    [
     "Leticia",
     "Rebollo"
    ],
    [
     "Maristela",
     "Silva"
    ]
   ],
   "title": "Focus and intonational marking in boundaries dialects: brazilian portuguese and Uruguayan Spanish in yes/no questions",
   "original": "sp08_551",
   "page_count": 4,
   "order": 124,
   "p1": "551",
   "pn": "554",
   "abstract": [
    "This paper describes the distinct tonal configurations of absolute questions in Brazilian Portuguese and in Uruguayan Spanish. Two sub varieties of Brazilian Portuguese (BP) and two sub varieties of Uruguayan Spanish (US) are considered. In doing so, this experimental study argues for the existence of prosodic variation between melodic contours of yes/no questions, comparing the realisations from Rio de Janeiro (RJ) and Santana do Livramento (SL), on the Brazilian side, and those from Rivera (R) e Montevideo (M), on the Uruguayan side.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-124"
  },
  "velazquezpatino08_speechprosody": {
   "authors": [
    [
     "Eduardo Patricio",
     "Velázquez Patiño"
    ]
   ],
   "title": "Prosodic comparative study of Mexico City and Madrid Spanish",
   "original": "sp08_555",
   "page_count": 4,
   "order": 125,
   "p1": "555",
   "pn": "558",
   "abstract": [
    "Intuitively, speakers of the same language, depending on their familiarity with other varieties of their language, perceive dialectal, sociolectal, stylistic and idiosyncratic similarities and differences in speed (syllabic duration and tempo), volume (intensity), register (frequency range), melodic patterns (intonation), or rhythm. In the study which originated this article, an attempt is made to identify the acoustic factors that allow this identification, as well as to provide the necessary tools for a systematic analysis like, in this case, a comparative study of the Spanish varieties of Mexico City and Madrid.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-125"
  },
  "arantes08_speechprosody": {
   "authors": [
    [
     "Pablo",
     "Arantes"
    ],
    [
     "Plinio A.",
     "Barbosa"
    ]
   ],
   "title": "F1 and spectral correlates of secondary stress in brazilian portuguese",
   "original": "sp08_559",
   "page_count": 4,
   "order": 126,
   "p1": "559",
   "pn": "562",
   "abstract": [
    "Vowel opening and spectral emphasis are investigated as possible acoustic correlates of secondary stress in Brazilian Portuguese. F1 and energy difference between frequency bands were measured for vowel /a/ in five- and six-syllable stress groups. Results for F1 indicate greater opening for vowels in initial and stressed positions. As for the spectral feature, relative emphasis in bands B2 (0.5 to 1 kHz) and B4 (2 to 4 kHz) has some relevance to phrase stress signaling, but not to secondary stress if it is to be equated to binary alternations.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-126"
  },
  "escuderomancebo08_speechprosody": {
   "authors": [
    [
     "David",
     "Escudero-Mancebo"
    ],
    [
     "Valentin",
     "Cardenoso-Payo"
    ],
    [
     "Antonio",
     "Bonafonte"
    ]
   ],
   "title": "On the comparison of catalan-Spanish intonation systems using statistical corpus modeling and objective metrics",
   "original": "sp08_563",
   "page_count": 4,
   "order": 127,
   "p1": "563",
   "pn": "566",
   "abstract": [
    "This communication presents an ongoing research on the definition of amethodology to compare the intonation of two different corpora. The two corpora that we compare here, try to be representative of the Spanish and Catalan intonation respectively. As a consequence, the comparison reported here, projects the most relevant differences between the Catalan and Spanish intonation systems. First we model the intonation of the corpora using the MEMOInt methodology and we confront the models obtained by confronting the F0 patterns that share its prosodic function. An objective metric guides the identification of the most distant F0 patterns. The differences can be visualized and listened in perceptual tests. Finally we discuss about the weakness of this ongoing research and about future applications.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-127"
  },
  "nakata08_speechprosody": {
   "authors": [
    [
     "Shunsuke",
     "Nakata"
    ],
    [
     "Yohann",
     "Meynadier"
    ]
   ],
   "title": "Final accent and lengthening in French",
   "original": "sp08_567",
   "page_count": 4,
   "order": 128,
   "p1": "567",
   "pn": "570",
   "abstract": [
    "An experiment was carried out to examine the possibility of word-final F0 rise without lengthening in French. The results show that, although a variability is observed depending on speaker, syllable structure and syllable number, the final rise can be unaccompanied by vowel lengthening in the phrasemedian final syllable of a noun, in difference to the phrasefinal syllable which is lengthened to signal the prosodic boundary. The duration of infra-syllabic components is also investigated.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-128"
  },
  "bruce08_speechprosody": {
   "authors": [
    [
     "Gösta",
     "Bruce"
    ],
    [
     "Susanne",
     "Schötz"
    ],
    [
     "Björn",
     "Granström"
    ],
    [
     "Laura",
     "Enflo"
    ]
   ],
   "title": "Modelling intonation in varieties of Swedish",
   "original": "sp08_571",
   "page_count": 4,
   "order": 129,
   "p1": "571",
   "pn": "574",
   "abstract": [
    "The research project Simulating intonational varieties of Swedish (SIMULEKT) aims to gain more precise and thorough knowledge about some major regional varieties of Swedish: South, G¨ota, Svea, Gotland, Dala, North, and Finland Swedish. In this research effort, the Swedish prosody model and different forms of speech synthesis play a prominent role. The two speech databases SweDia 2000 and SpeechDat constitute our main material for analysis. As a first test case for our prosody model, we compared Svea and North Swedish intonation in a pilot production-oriented perception test. Na¨ýve Swedish listeners were asked to identify the most Svea and North sounding stimuli. Results showed that listeners can differentiate between the two varieties from intonation only. They also provided information on how intonational parameters affect listeners impression of Swedish varieties. All this indicates that our experimental method can be used to test perception of different regional varieties of Swedish.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-129"
  },
  "ulbrich08_speechprosody": {
   "authors": [
    [
     "Christiane",
     "Ulbrich"
    ]
   ],
   "title": "Acquisition of regional pitch patterns in L2",
   "original": "sp08_575",
   "page_count": 4,
   "order": 130,
   "p1": "575",
   "pn": "578",
   "abstract": [
    "Most speakers in todays societies are bilingual or multilingual and linguistic research has shown that the grammatical systems of two or more languages interact in speech production and perception. The confrontation of two or more competing phonological systems and their phonetic realization leads to what we generally understand as a \"foreign accent\". The interference appears on the segmental and the prosodic level. Research in second language acquisition has previously focused on segmental features while research on prosody and its important role in language learning is rather scare. This present paper examines the intonation of Belfast English produced by native speakers and two groups of German second language learners of English. Acoustic prosodic characteristics responsible for the perception of a foreign accent are identified as deviations in the nuclear pitch patterns. Using production data the study aims to examine the occurrence of regional marked intonation patterns in different speaking styles. The study provides (1) evidence that specific regional intonation patterns are acquired in a naturalistic setting, (2) that these patterns are transferred into different speaking styles in second language production whereas regionally marked intonation patterns vary according to the formality of the speaking style in native language production.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-130"
  },
  "biadsy08_speechprosody": {
   "authors": [
    [
     "Fadi",
     "Biadsy"
    ],
    [
     "Andrew",
     "Rosenberg"
    ],
    [
     "Rolf",
     "Carlson"
    ],
    [
     "Julia",
     "Hirschberg"
    ],
    [
     "Eva",
     "Strangert"
    ]
   ],
   "title": "A cross-cultural comparison of american, Palestinian, and Swedish perception of charismatic speech",
   "original": "sp08_579",
   "page_count": 4,
   "order": 131,
   "p1": "579",
   "pn": "582",
   "abstract": [
    "Perception of charisma, the ability to influence others by virtue of ones personal qualities, appears to be influenced to some extent by cultural factors. We compare results of five studies of charisma speech in which American, Palestinian, and Swedish subjects rated Standard American English political speech and Americans and Palestinians rated Palestinian Arabic speech. We identify acoustic-prosodic and lexical features correlated with charisma ratings of both languages for native and non-native speakers and find that 1) some acoustic-prosodic features correlated with charisma ratings appear similar across all five experiments; 2) other acoustic-prosodic and lexical features correlated with charisma appear specific to the language rated, whatever the native language of the rater; and 3) still other acoustic-prosodic cues appear specific to both rater native language and to language rated. We also find that, while the absolute ratings non-native raters assign tend to be lower than those of native speakers, the ratings themselves are strongly correlated.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-131"
  },
  "kleber08_speechprosody": {
   "authors": [
    [
     "Felicitas",
     "Kleber"
    ],
    [
     "Tamara",
     "Rathcke"
    ]
   ],
   "title": "More on the \"segmental anchoring\" of prenuclear rises: evidence from East Middle German",
   "original": "sp08_583",
   "page_count": 4,
   "order": 132,
   "p1": "583",
   "pn": "586",
   "abstract": [
    "The paper presents results from a production study on the alignment of prenuclear rising accents in East Middle German in which we focus on two research questions: (1) to what extent can an intermediate variety be integrated in the phonetic alignment continuum from south to north as postulated in [2], and (2) to what extent do time pressure factors from the lefthand context influence the stability of tonal alignment. We rearranged the test material used in [2] with respect to unstressed syllables preceding the accented syllable. Our results show that L is aligned earlier in East Middle German than in Northern and Southern German and that left-sided time pressure effects the alignment of L, but not of H.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-132"
  },
  "cantoni08_speechprosody": {
   "authors": [
    [
     "Maria",
     "Cantoni"
    ],
    [
     "Thaïs Cristófaro",
     "Silva"
    ]
   ],
   "title": "Verbal stress assignment in brazilian portuguese and the prosodic interpretation of segmental sequences",
   "original": "sp08_587",
   "page_count": 4,
   "order": 133,
   "p1": "587",
   "pn": "590",
   "abstract": [
    "This paper offers a contribution towards the prosodic interpretation of segmental sequences. Focus will be given to consonantal sequences where epenthesis may optionally occur in Brazilian Portuguese, as in o[bs]truir or o[bis]truir \"to obstruct\". We will show that some consonantal sequences have distinct representations from others, being that the difference in representation has an impact on innovative stress pattern attested in verbal forms. Considering the underlined epenthetic vowels in [a'dapitU] and [ada'pitU] adapto \"(I) adapt\" the former example is the traditional form and the later is the innovative form. We will show that sequences of stops - as [pt] for example - represent a sequence of consonantal positions, whereas [ks] sequences represent a single consonantal position associated to two segments. This later case corresponds to a complex consonant and behaves like other complex consonants in the language, such as [kw, gw]. An experiment was run in order to investigate the innovative stress pattern in verbal forms in BP. We found that whereas most verbal forms with a sequence of stops display the innovative stress pattern all analyzed verbal forms with a [ks] sequence do not present the innovative stress pattern. We account for this distinct behavior regarding stress by offering support towards the different representation of segmental sequences. Our results contribute towards a better understanding of stress assignment in Brazilian Portuguese, we provide additional information about complex consonants and we also offer support to the claim that epenthetic vowels are present in lexical representations.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-133"
  },
  "kugler08_speechprosody": {
   "authors": [
    [
     "Frank",
     "Kügler"
    ]
   ],
   "title": "The role of duration as a phonetic correlate of focus",
   "original": "sp08_591",
   "page_count": 4,
   "order": 134,
   "p1": "591",
   "pn": "594",
   "abstract": [
    "The aim of the present paper is to collect quantitative data on durational patterns of target words in different information structure conditions. The acoustic data will be the basis for the manipulation of stimuli to conduct perception tests that will deal with the role of duration as a correlate of focus prominence. For that purpose, a production study is presented that investigates the effects of information structure (wide, narrow, and contrastive focus, prefocal and postfocal givenness), sentence length and position in a sentence on duration of a target constituent in German. Duration of target constituents was measured in 400 utterances produced by 10 speakers. The predictions that focus increases target word duration has been confirmed, while the expected decrease in duration due to givenness has only been confirmed for prefocal given constituents. Postfocally, duration is equivalent to wide focus duration. The effects of sentence length and position have only partly been confirmed; a constituent seems to be shorter in longer sentences than in short ones, and target words occurring early in a sentence appear to be longer than late occurring ones.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-134"
  },
  "cardillo08_speechprosody": {
   "authors": [
    [
     "Gina C.",
     "Cardillo"
    ]
   ],
   "title": "Relationships among prosodic sensitivity, musical processing, and phonological awareness in pre-readers",
   "original": "sp08_595",
   "page_count": 4,
   "order": 135,
   "p1": "595",
   "pn": "598",
   "abstract": [
    "This study investigates how childrens sensitivity to prosodic characteristics in speech is related to their processing of musical melody and rhythm, and how these are related to phonological awareness (PA), in a sample of 23 5-year-old pre-readers. Measures included non-word prosodic imitation, melody and rhythm discrimination, a battery of phonological awareness tasks, and general expressive and receptive vocabulary tests. Main findings were that 1) prosodic sensitivity predicted PA skills beyond what was predicted by general language ability alone, 2) musical processing also predicted PA skills after general language ability was accounted for, but was not as strong a predictor as prosodic sensitivity, and 3) pitch and rhythm sensitivity in music did not differentially predict PA, contrary to hypotheses postulated in recent literature. Findings support the notion that a childs sensitivity to suprasegmental characteristics of both speech and music may be a feasible way to predict their later PA skills, given the similar auditory processing mechanisms underlying their development.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-135"
  },
  "mokhtari08_speechprosody": {
   "authors": [
    [
     "Akiko",
     "Mokhtari"
    ],
    [
     "Nick",
     "Campbell"
    ]
   ],
   "title": "Speaking style variation and speaker personality",
   "original": "sp08_601",
   "page_count": 4,
   "order": 136,
   "p1": "601",
   "pn": "604",
   "abstract": [
    "This paper describes two experiments that were carried out to determine the relationships between speaking style (so-called `tone-of-voice') and perceived speaker characteristics such as age and personality. We found that listeners can consistently distinguish different tones of voice from one speaker and that they showed a high degree of consistency in associating these tones with different speaker personality characteristics.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-136"
  },
  "huang08b_speechprosody": {
   "authors": [
    [
     "Yi-Hsuan",
     "Huang"
    ],
    [
     "Janice",
     "Fon"
    ]
   ],
   "title": "Dialectal variations in tonal register and declination pattern of taiwan Mandarin",
   "original": "sp08_605",
   "page_count": 4,
   "order": 137,
   "p1": "605",
   "pn": "608",
   "abstract": [
    "This paper investigated how dialectal variations can influence the realization of tonal register and declination pattern in Taiwan Mandarin. Twelve speakers, six from the Northern dialect (standard) and six from the Central dialect (nonstandard), were recruited for a reading task. Target syllables of Tone 1 (T1) were embedded in a carrier sentence in three different sentential positions, initial, medial, and final. The dependent measure was the F0 maximum of the target syllables. Results showed that the Northern dialect had higher T1 register than the Central dialect, with the effect being more prominent in males than females. The magnitude of declination was also a function of gender and dialect. Central male speakers produced milder declination slopes than their Northern counterparts while Central female speakers tended to have steeper slopes instead by raising the initial starting pitch, indicating that in the Central dialect, female speakers were more aware of their vernacular speech status compared to male speakers and tended to hypercorrect their nonstandard accent by using a larger pitch range.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-137"
  },
  "hanssen08_speechprosody": {
   "authors": [
    [
     "Judith",
     "Hanssen"
    ],
    [
     "Jörg",
     "Peters"
    ],
    [
     "Carlos",
     "Gussenhoven"
    ]
   ],
   "title": "Prosodic effects of focus in Dutch declaratives",
   "original": "sp08_609",
   "page_count": 4,
   "order": 138,
   "p1": "609",
   "pn": "612",
   "abstract": [
    "Seventeen speakers of Standard Dutch participated in a production experiment that investigated the effects of focus condition (broad, narrow, corrective focus) on the prosodic realization of nuclear accented words in declarative sentences. It was found that focus has an effect on the duration of onset and coda of the nuclear accented syllable as well as on the timing, scaling, and slope of f0 targets and movements. A significant effect exists mainly between broad focus accents on the one hand, and narrow and corrective focus accents on the other. The results are interpreted in terms of phonetic variation, but such that phonetic differences between these two conditions are to a large extent conventionalized.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-138"
  },
  "koreman08_speechprosody": {
   "authors": [
    [
     "Jacques",
     "Koreman"
    ],
    [
     "Bistra",
     "Andreeva"
    ],
    [
     "William J.",
     "Barry"
    ]
   ],
   "title": "Accentuation cues in French and German",
   "original": "sp08_613",
   "page_count": 4,
   "order": 139,
   "p1": "613",
   "pn": "616",
   "abstract": [
    "The use of acoustic properties by French and German speakers in accentuating and de-accentuating words in accordance with changes in information weighting is examined. In particular, the role of duration is shown to differ for the two languages, confirming earlier findings. In addition, a difference in the relative contribution of F0, intensity and spectral balance is found for the prediction of accentuation in the two languages. The link with phonological differences between the languages and questions of analysis methodology are discussed.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-139"
  },
  "cummins08_speechprosody": {
   "authors": [
    [
     "Fred",
     "Cummins"
    ]
   ],
   "title": "Auditory event structure and speech",
   "original": "sp08_631",
   "page_count": 4,
   "order": 140,
   "p1": "631",
   "pn": "634",
   "abstract": [
    "Auditory events structure much of the perceived world. Sometimes, two or more sounds are perceived as related, and pertaining to a single event. No well-worked out taxonomy yet exists for auditory events. We consider two-part sounds, perceived as cause and effect (loosely interpreted). Many such sounds occur in ambient environments, and of those, many have suggestively right- or left-headed types of structure. We illustrate these event types, and suggest that familiarity with this type of event structure may motivate their phonologization into familiar structures such as unmarked CV syllable structure. An innate tendency to parse the auditory world into \"events\" may also facilitate the bootstrapping process of the child language learner. This work is an initial attempt to move the discussion of speech prosody towards a grounding in auditory ecology.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-140"
  },
  "wang08_speechprosody": {
   "authors": [
    [
     "Qian",
     "Wang"
    ]
   ],
   "title": "L2 stress perception: the reliance on different acoustic cues",
   "original": "sp08_635",
   "page_count": 4,
   "order": 141,
   "p1": "635",
   "pn": "638",
   "abstract": [
    "Second language learners of English often experience difficulties in English lexical stress perception because of prosodic transfer of their first language (L1). It has thus been hypothesized that the problem of Chinese learners with English stress arises from tonal transfer. However, little research has been devoted to the investigation of the phonetic details of second language (L2) stress perception. The present research focused on Chinese L2 learners of English. Their reliance on the three acoustic cues, F0, intensity and duration, is compared against a baseline of native English speakers, in terms of English stress perception of manipulated nonsense tokens. The results show that while all three cues have significant effects on stress perception for native English speakers, only F0 has a decisive effect on Chinese learners stress judgments. This study suggests that there is transfer of reliance on F0 in the acquisition of L2 English stress, rather than transfer of tone at the phonological level.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-141"
  },
  "bissiri08_speechprosody": {
   "authors": [
    [
     "Maria Paola",
     "Bissiri"
    ],
    [
     "Hartmut R.",
     "Pfitzinger"
    ],
    [
     "Hans G.",
     "Tillmann"
    ]
   ],
   "title": "Lexical stress perception of German morphologically complex words by Italian speakers",
   "original": "sp08_639",
   "page_count": 4,
   "order": 142,
   "p1": "639",
   "pn": "642",
   "abstract": [
    "Previous research has shown that Italian speakers have difficulties in learning the correct lexical stress of German morphologically complex words. To test if this difficulty is of perceptual origin, we employed the method by Dupoux et. al 2001 [7], consisting in a short-term memory sequence repetition task. We tested the participants with a stress contrast, a phoneme contrast, which constituted the baseline, and a stress+quantity contrast, which should correspond to an Italian stress pattern, in which duration plays a role. We also tested a control group of German subjects. As expected, the Italian subjects performed worse on stress contrast than on phoneme or stress+quantity contrasts. The German subjects performed equally well on all contrasts, except for the stress contrast of words with long penultimate syllable, in which their error rate was comparable to that of Italian subjects.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-142"
  },
  "chen08d_speechprosody": {
   "authors": [
    [
     "Sally",
     "Chen"
    ],
    [
     "Janice",
     "Fon"
    ]
   ],
   "title": "The peak alignment of prenuclear and nuclear accents among advanced L2 English learners",
   "original": "sp08_643",
   "page_count": 4,
   "order": 143,
   "p1": "643",
   "pn": "646",
   "abstract": [
    "Previous studies have shown that even advanced L2 speakers align pitch accents differently from native speakers, and the only possibility for full attainment of L2 is through immersion. This study investigated two groups of five advanced L2 English speakers who first exposed to English through early immersion. Their alignment of prenuclear and nuclear accents was compared with that of the native English speakers. Results showed that these advanced L2 learners aligned nuclear accents in a similar way to the native speakers; however, difference was found on the alignment of prenuclear accents between their production and the native speakers.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-143"
  },
  "brandt08_speechprosody": {
   "authors": [
    [
     "Per Aage",
     "Brandt"
    ]
   ],
   "title": "Thinking and language. a view from cognitive semio-linguistics",
   "original": "sp08_649",
   "page_count": 6,
   "order": 144,
   "p1": "649",
   "pn": "654",
   "abstract": [
    "Cognitive semio-linguistics studies the relations between signs and language, between semiological and linguistic structures, as expressions of, and as causes of, the cognitive activities involved in thinking, here called epistemic activities. This short essay displays a leveled analysis of the relations holding between semio-linguistic and epistemic structures active in the human mind.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-144"
  },
  "bonaventura08_speechprosody": {
   "authors": [
    [
     "Patrizia",
     "Bonaventura"
    ],
    [
     "Per Aage",
     "Brandt"
    ]
   ],
   "title": "Sentence modes and prosodic phrasing",
   "original": "sp08_655",
   "page_count": 6,
   "order": 145,
   "p1": "655",
   "pn": "660",
   "abstract": [
    "The goal of the present study was to test the hypothesis that specific prosodic features are systematically associated with modes of enunciation, and that such prosodic features are independent from the semio-syntactic structure of the sentence. Modes of enunciation correspond generally to sentence types: Assertive, Imperative, Interrogative and Affective (Brandt, 1971; 2008). Semio-syntactic structures are defined as elementary grammatical structures composed minimally of a head and one of the core complements, Subject, Predicative, Object, Dative and Agent. Modes of enunciation are associated with semio-syntactic structure at the level of linearization of meaning, when words and morphemes are selected to communicate the semantic content. Intonation contours associated with different modes of enunciation, were categorized based on the Tilt labeling system. Two groups of 3 sentences with two different semio-syntactic structures, were realized with the four different sentence modes. All sentences were read once by 4 professional actors.\n",
    "Preliminary results seem to show a systematic expression of the sentence mode at the prosodic level, across speakers, for Assertive, Imperative and Affective mode (Anger) only. Recurrent intonation contours appeared not to be exclusively related to the mode of enunciation, but to be typical to the semio-syntactic structure, supporting the hypothesis that prosody connects phonetics to semantics, or semantics to phonetics, through grammar.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-145"
  },
  "syrdal08_speechprosody": {
   "authors": [
    [
     "Ann K.",
     "Syrdal"
    ],
    [
     "Yeon-Jun",
     "Kim"
    ]
   ],
   "title": "Dialog speech acts and prosody: considerations for TTS",
   "original": "sp08_661",
   "page_count": 5,
   "order": 146,
   "p1": "661",
   "pn": "665",
   "abstract": [
    "As natural language dialog systems involving both speech recognition and text-to-speech (TTS) synthesis become more sophisticated, the limitations of general-purpose TTS for human-computer dialogs have become more apparent. Much subtlety and complexity of meaning in natural language dialogs is conveyed by prosody; how something is said is often as important as what words are spoken. At the same time, advances such as unit selection synthesis have greatly improved the naturalness of synthetic speech because much less signal processing is required, resulting in less distortion. However, the improved naturalness provided by unit selection synthesis has been achieved at the cost of the more precise prosodic control provided by earlier, more robotic sounding synthesizers.\n",
    "With the goal of providing more prosodic and expressive control over unit selection TTS for dialog applications, while retaining naturalness, we have focused on speech acts, the communicative function of an utterance. The current working set of speech acts being used includes:\n",
    "Imperative: directive, request, wait, repeat, warning Interrogative: question-wh, question-yes/no, question-multiple choice Assertive: informative-general, informative-detail Affective: apology, exclamation-positive, exclamationnegative, greeting, good-bye, thanks Others: confirmation, disconfirmation, back-channel, cue phrase\n",
    "",
    "",
    "Our work is practically focused, but also involves some observations of more general interest. We use a relatively small set of speech acts both to classify utterances in a speech corpus according to their communicative function, and then to preferentially select speech act-appropriate units to match the desired speech act of the utterance to be synthesized. The corpus is composed of speech read (primarily from interactive dialogs of various kinds) by a female US English speaker (a voice talent used to build one of our TTS voices). We examine prosodic differences of a more .global. nature (mean f0, f0 range, speaking rate, energy level) for the entire set of speech acts. A portion of the database has also been ToBI labeled and analyzed for systematic differences. There are several significant prosodic differences among the various speech acts.\n",
    "In our current TTS implementation, speech acts are being used as another feature to select speech units for concatenation, but results from analyzing prosodic features of the various speech acts will also be used to better predict the prosodic features desired. Results thus far are promising and examples will be demonstrated.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-146"
  },
  "shahid08_speechprosody": {
   "authors": [
    [
     "Suleman",
     "Shahid"
    ],
    [
     "Emiel",
     "Krahmer"
    ],
    [
     "Marc",
     "Swerts"
    ]
   ],
   "title": "Real vs. acted emotional speech: comparing South-asian and Caucasian speakers and observers",
   "original": "sp08_669",
   "page_count": 4,
   "order": 147,
   "p1": "669",
   "pn": "672",
   "abstract": [
    "Both acted and real emotional audiovisual speech was collected from 50 Caucasian speakers (from The Netherlands) and 45 South-Asian speakers (from Pakistan), using a novel adaptation of the Velten technique, in which some participants are asked to act as if they are in some emotional state, while these emotions are really induced in other participants. Generally, the acted conditions did not lead to systematic non-neutral emotions, while the non-acted conditions lead to the intended emotions being induced in both the Dutch and the Pakistani speakers (where the latter seemed to feel the emotions more strongly). Next we performed a series of perception experiments, in which Dutch and Pakistani observers were asked to judge the emotional state of Dutch and Pakistani speakers. It was found that acted emotions of speakers from both cultures were perceived as stronger than their non-acted counterparts by both Dutch and Pakistani observers. Interestingly, for Dutch speakers the negative emotions were perceived as relatively strong, whereas for the Pakistani speakers the positive emotions stood out perceptually.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-147"
  },
  "wang08b_speechprosody": {
   "authors": [
    [
     "Xia",
     "Wang"
    ],
    [
     "Aijun",
     "Li"
    ],
    [
     "Chu",
     "Yuan"
    ]
   ],
   "title": "A preliminary study on silent pauses in Mandarin expressive speech",
   "original": "sp08_673",
   "page_count": 4,
   "order": 148,
   "p1": "673",
   "pn": "676",
   "abstract": [
    "Pause is not only one of the cues of prosodic structure for running speech, but also one of the strategies used by speakers to express their emotions. In this paper, we investigated the silent pauses in read and spontaneous speech, neutral and expressive speech, as well as synthesized speech, trying to find the difference of silent pause patterns in different speech styles. It was observed that all silent pauses in synthesized speech were regular, 2.5% pauses in neutral read speech were irregular, 10% in expressive read speech were irregular and 28% pauses in spontaneous expressive speech were irregular. A comparative study was carried out for the duration and frequency of occurrence of irregular silent pauses in different speech styles, as well as the valence and activation features of their acoustic contexts. A perceptual experiment showed that the removing of irregular silent pauses from spontaneous speech resulted in an obvious decrease of expressiveness, while inserting irregular silent pauses into synthesized speech improves substantially the expressiveness of such synthesized speech.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-148"
  },
  "erickson08_speechprosody": {
   "authors": [
    [
     "Donna",
     "Erickson"
    ],
    [
     "Takaaki",
     "Shochi"
    ],
    [
     "Caroline",
     "Menezes"
    ],
    [
     "Hideki",
     "Kawahara"
    ],
    [
     "Ken-Ichi",
     "Sakakibara"
    ]
   ],
   "title": "Some non-F0 cues to emotional speech: an experiment with morphing",
   "original": "sp08_677",
   "page_count": 4,
   "order": 149,
   "p1": "677",
   "pn": "680",
   "abstract": [
    "This paper investigates some non-F0 cues to emotional speech. Two speech samples were collected from spontaneous speech: the word \"leave\" - one sample spoken with emotion (sad) and the other, as not-emotional. Using the morphing algorithm of STRAIGHT [1], we morphed a series of 12 utterances, starting from the non-emotional \"leave\" to the emotional \"leave\", keeping F0 at 300 Hz. Perception test results show that the morphed speech sounds could be identified as sad, with stimulus 12 being heard as most emotional. The results of a simple correlation, together with a PCA analysis of listeners perceptual behavior, suggest that formant frequencies, specifically, lowering F2, F3, and F4 are important cues for perception of emotional (sad) speech.\n",
    "",
    "",
    "Kawahara, H.; Matsui, H., 2003. Auditory morphing based on an elastic perceptual distance metric in an interference-free time-frequency representation. Proc. IEEE ICASSP, 2003.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-149"
  },
  "beller08_speechprosody": {
   "authors": [
    [
     "Grégory",
     "Beller"
    ],
    [
     "Nicolas",
     "Obin"
    ],
    [
     "Xavier",
     "Rodet"
    ]
   ],
   "title": "Articulation degree as a prosodic dimension of expressive speech",
   "original": "sp08_681",
   "page_count": 4,
   "order": 150,
   "p1": "681",
   "pn": "684",
   "abstract": [
    "In this paper, we present a study on the influence of the expressivity on the articulation degree. It is part of a project that aims to transform the expressivity of an utterance for artistic purposes, such as cinema, theater and contemporary music. An algorithm for formant frequency estimation is presented. Then a measurement of the articulation degree is proposed involving a joint statistical analysis of the vocalic triangle area and of the speech rate. The application of this measurement to an expressive French database, shows that the articulation degree depends on expressivity. Using Lindbloms theoretical framework, we have tried to relate this articulation degree to the activation degree of a dimensional representation of emotions. Finally, speech processing is used to modify the articulation degree of a spoken or synthesized neutral utterance in order to apply a given expressivity to it.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-150"
  },
  "rilliard08_speechprosody": {
   "authors": [
    [
     "Albert",
     "Rilliard"
    ],
    [
     "Jean-Claude",
     "Martin"
    ],
    [
     "Véronique",
     "Aubergé"
    ],
    [
     "Takaaki",
     "Shochi"
    ]
   ],
   "title": "Perception of French audio-visual prosodic attitudes",
   "original": "sp08_685",
   "page_count": 4,
   "order": 151,
   "p1": "685",
   "pn": "688",
   "abstract": [
    "Experimental studies are required to understand the contribution of audio and visual modalities during affective communication. This paper presents a perception study of the audio-visual expression of six French attitudes. The relative importance of each modality in the decoding of these expressions is analysed, as a first step toward a deeper comprehension of their influence on social affects expression. Two speakers are evaluated, in order to test the influence of speakers performances on listeners perception.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-151"
  },
  "shochi08_speechprosody": {
   "authors": [
    [
     "Takaaki",
     "Shochi"
    ],
    [
     "Donna",
     "Erickson"
    ],
    [
     "Albert",
     "Rilliard"
    ],
    [
     "Véronique",
     "Aubergé"
    ],
    [
     "Jean-Claude",
     "Martin"
    ]
   ],
   "title": "Recognition of Japanese attitudes in audio-visual speech",
   "original": "sp08_689",
   "page_count": 4,
   "order": 152,
   "p1": "689",
   "pn": "692",
   "abstract": [
    "The aim of the present work is to investigate how Japanese listeners recognize 12 audio-visual prosodic attitudes of Japanese. Significant influences of the two speakers and three modalities were observed. Generally the audio-visual condition showed the best recognition score, and interesting behavior for audio and visual modality was observed. Attitudes were regrouped into 3 higher-level perceptual categories for the first speaker: polite expressions, the attitudes of \"query\", and the expressions of imposition of ones own opinion. The attitude of kyoshuku and surprise are particularly well recognized by visual information.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-152"
  },
  "audibert08_speechprosody": {
   "authors": [
    [
     "Nicolas",
     "Audibert"
    ],
    [
     "Véronique",
     "Aubergé"
    ],
    [
     "Albert",
     "Rilliard"
    ]
   ],
   "title": "How we are not equally competent for discriminating acted from spontaneous expressive speech",
   "original": "sp08_693",
   "page_count": 4,
   "order": 153,
   "p1": "693",
   "pn": "696",
   "abstract": [
    "This paper reports how acted vs. spontaneous expressive speech can be discriminated by human listeners, with various performances depending on the listener (in line with preliminary results for amusement by [3]). The perceptive material was taken from the Sound Teacher/E-Wiz corpus [1], for 4 French-speaking actors trapped in spontaneous expressive monoword utterances, and then acting immediately after, in an acting protocol supposed to be a very convenient for them. Pairs of acted vs. spontaneous stimuli, expressing affective states related to anxiety, irritation and satisfaction, were rated by 33 native French listeners in audio-only, visualonly and audiovisual conditions. In visual-only condition, 70% of listeners were able to identify acted vs. spontaneous pairs over chance level, for 78% in audio-only condition and up to 85% in audio-visual condition. Globally, a highly significant subject effect confirms the hypothesis of a varied affective competence for separating involuntary vs. simulated affects [2]. One feature used by listeners in the acoustic task of discrimination can be the perceived emotional intensity, in accordance with the measurement of this intensity level for the same stimuli from a previous perception experiment by Laukka and al. [4].\n",
    "sAubergé, V.; Audibert, N.; Rilliard, A., 2004. E-Wiz: A Trapper Protocol for Hunting the Expressive Speech Corpora in Lab. 4th LREC, Lisbon, Portugal, 179-182. Aubergé V. 2002. A Gestalt morphology of prosody directed by functions: the example of a step by step model developed at ICP. 1st Speech Prosody, Aix-en- Provence, France, 151-155. Aubergé, V.; Cathiard, M., 2003. Can we hear the prosody of smile? Speech Communication 40, Special issue on Emotional Speech, 87-97. Laukka, P.; Audibert, N.; Aubergé, V., 2007. Graded structure in vocal expression of emotion: What is meant by \"prototypical expressions\"? WS Paralinguistic Speech - between models and data, Saarbrücken, Germany, 1-4.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-153"
  },
  "madureira08_speechprosody": {
   "authors": [
    [
     "Sandra",
     "Madureira"
    ]
   ],
   "title": "Reciting a sonnet: production strategies and perceptual effects",
   "original": "sp08_697",
   "page_count": 4,
   "order": 154,
   "p1": "697",
   "pn": "700",
   "abstract": [
    "This paper examines, from a dynamically-oriented approach, speaking strategies used by two professional speakers in reciting a sonnet.\n",
    "Spectrographic and perceptual analysis of prosodic and segmental elements are carried out. Uses of speaking strategies and their effects are contrasted to discuss relations between sound and sense.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-154"
  },
  "goldman08_speechprosody": {
   "authors": [
    [
     "J.-Ph.",
     "Goldman"
    ],
    [
     "A.",
     "Auchlin"
    ],
    [
     "M.",
     "Avanzi"
    ],
    [
     "A. C.",
     "Simon"
    ]
   ],
   "title": "prosoreport: an automatic tool for prosodic description: application to a radio style",
   "original": "sp08_701",
   "page_count": 4,
   "order": 155,
   "p1": "701",
   "pn": "704",
   "abstract": [
    "The paper has two goals: to present a toolbox for prosodic and phonostylistic description, and to use it for studying a specific radio style. This tool is quasi-automatic and modular. It consists of a set of Praat-based scripts like phonetic segmentation, melodic stylisation and prominence detection. It produces a phonostylistic report - called ProsoReport - on the basis of an audio file and optionally an orthographic transcript. The tool is used here to identify phonostylistic properties of French public radio France Info features (hence FIF; chroniques radiophoniques): three two-minute-long recordings are compared with a plain neutral reading of the same texts. Results confirm our initial hypotheses about FIF phonostylistic distinctive characteristics - leaving questions open to further study.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-155"
  },
  "tooher08_speechprosody": {
   "authors": [
    [
     "Michelle",
     "Tooher"
    ],
    [
     "Irena",
     "Yanushevskaya"
    ],
    [
     "Christer",
     "Gobl"
    ]
   ],
   "title": "Transformation of LF parameters for speech synthesis of emotion: regression trees",
   "original": "sp08_705",
   "page_count": 4,
   "order": 156,
   "p1": "705",
   "pn": "708",
   "abstract": [
    "This paper outlines an approach to modelling the dynamics of voice source parameters as observed in the analysis of emotional portrayals, by a male speaker of Hiberno-English. The emotions portrayed were happy, angry, sad, bored, and surprised, as well as neutral. The voice source parameters extracted from emotionally coloured repetitions of a short utterance - by means of inverse filtering followed by source model matching - were modelled using classification and regression trees. Regression trees were built using the voice source parameters of the neutral repetition of the same short utterance, in order to transform the voice source parameters from neutral to one of the five emotions. Re-synthesis of emotion-portraying utterances using transformed voice source parameter dynamics resulted in synthesised utterances which were confirmed by listening tests to represent the targeted emotion categories. The results suggest that the addition of dynamic voice source information in parametric synthesis of emotion will improve the quality of emotion synthesis.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-156"
  },
  "yanushevskaya08_speechprosody": {
   "authors": [
    [
     "Irena",
     "Yanushevskaya"
    ],
    [
     "Christer",
     "Gobl"
    ],
    [
     "Ailbhe",
     "Ní Chasaide"
    ]
   ],
   "title": "Voice quality and loudness in affect perception",
   "original": "sp08_709",
   "page_count": 4,
   "order": 157,
   "p1": "709",
   "pn": "712",
   "abstract": [
    "Different voice qualities tend to vary in terms of their intrinsic loudness. Perceptual experiments have shown that voice quality variation can be strongly associated with the affective colouring of an utterance. The question addressed in this paper concerns the role that the intrinsic loudness variation might play in this voice quality-to-affect mapping. To test the hypothesis that the intrinsic loudness variation is not a major determinant of the perceived affective colouring, listeners rated the affective colouring of two series of stimuli: one series varied in voice quality and contained intrinsic loudness variation; the other series were of a constant voice quality, but matched loudness variations of the first series. The results overall support the hypothesis that loudness contributes relatively little to the perceived affective colouring of specific voice qualities. But variation in loudness (in the absence of voice quality variation) is not entirely irrelevant: some contribution of loudness to certain high activation affects was also found.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-157"
  },
  "abelin08_speechprosody": {
   "authors": [
    [
     "Åsa",
     "Abelin"
    ]
   ],
   "title": "Seeing glee but hearing fear? emotional Mcgurk effect in Swedish",
   "original": "sp08_713",
   "page_count": 4,
   "order": 158,
   "p1": "713",
   "pn": "716",
   "abstract": [
    "Video and audio recordings of emotional expressions of a male speaker were used to construct conflicting stimuli in order to perform a McGurk experiment. The results are compared to an almost identical experiment with a female speaker, described in Abelin (2007) in order to see if the earlier results were reproduced. The results from both experiments show that in the McGurk condition the visual channel was in general more reliable than audio at conveying emotions, i. e. the results from Abelin (2007) were reproduced. Most frequently the listeners interpreted in accordance with the visual stimuli, or they heard an emotion which was not present in either video or audio. The emotions happiness and anger showed a dominance for visual perception, and the emotions fear, and to some extent surprise showed a preference for auditive perception, in the McGurk condition. No emotional dimension, i.e. the evaluative (positive-negative) was connected specifically to the visual or the auditive modality.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-158"
  },
  "colamarco08_speechprosody": {
   "authors": [
    [
     "Manuela",
     "Colamarco"
    ],
    [
     "João Antônio de",
     "Moraes"
    ]
   ],
   "title": "Emotion expression in speech acts in brazilian portuguese: production and perception",
   "original": "sp08_717",
   "page_count": 4,
   "order": 159,
   "p1": "717",
   "pn": "720",
   "abstract": [
    "This work investigates the relation between linguistic and paralinguistic categories in terms of intonation, in order to observe how the manifestation of three primary emotions affect pitch contours which are typical of four speech acts in Brazilian Portuguese (BP).\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-159"
  },
  "viola08_speechprosody": {
   "authors": [
    [
     "Izabel Cristina",
     "Viola"
    ],
    [
     "Sandra",
     "Madureira"
    ]
   ],
   "title": "The roles of pause in speech expression",
   "original": "sp08_721",
   "page_count": 4,
   "order": 160,
   "p1": "721",
   "pn": "724",
   "abstract": [
    "To study the behavior of the pause within the temporal structure of the speech, the combination of perceptual and acousticphonetic analysis is used for the delineation and measurement of the interruption of the audible flow of a theatrical interpretation performed by a single actor. Pauses were classified according to structural, functional, distributional and temporal criteria. The relevance of pause in structuring the oral discourse and in expressing emotions and attitudes is discussed.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-160"
  },
  "dubeda08_speechprosody": {
   "authors": [
    [
     "Tomás",
     "Dubeda"
    ]
   ],
   "title": "Global and local evaluation of prosody: discrete target and just noticeable differences",
   "original": "sp08_727",
   "page_count": 4,
   "order": 161,
   "p1": "727",
   "pn": "730",
   "abstract": [
    "Abstract We describe an experiment based on introspective assessment of inter-syllabic prosodic changes in two different conditions (global - continuous sentences, and local - two-syllable portions of speech), by means of discrete targets (Higher, Same and Lower). The results show that global evaluation is very problematic for the listeners and that f0 is the best assessed parameter, followed by intensity and duration. They also provide a realistic, continuous-speech-based view of just noticeable differences, at least for f0 and intensity.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-161"
  },
  "peter08_speechprosody": {
   "authors": [
    [
     "Beate",
     "Peter"
    ],
    [
     "Carol",
     "Stoel-Gammon"
    ],
    [
     "Daniella",
     "Kim"
    ]
   ],
   "title": "Octave equivalence as an aspect of stimulus-response similarity during nonword and sentence imitations in young children",
   "original": "sp08_731",
   "page_count": 4,
   "order": 162,
   "p1": "731",
   "pn": "734",
   "abstract": [
    "The ability to perceive similarities between musical notes one octave apart has been documented in all ages including infants. Whether the octave relationship as an aspect of similarity in speech stimuli is as robust in speech tokens is unknown. The purpose of this study was to examine whether children demonstrate an awareness of this octave relationship in the production of speech stimuli during speech imitation tasks. Eleven children, age 4;7 to 6;9, imitated nonwords and sentences presented by male adult voices, at pitch levels below young childrens vocal ranges. Results show that the participants imitated the stimulus pitches one octave higher. The evidence was particularly robust in the nonword imitation task, where the low pitch levels in the stimulus required the children to adjust their conversational pitch levels downward to produce pitches at an octave above the stimulus. We conclude that young children are capable of perceiving the octave relationship as a salient aspect of similarity in speech, and that they utilize this aspect of similarity when imitating low-pitched speech stimuli below their vocal ranges to achieve a more authentic sounding reproduction of the stimulus.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-162"
  },
  "mo08_speechprosody": {
   "authors": [
    [
     "Yoonsook",
     "Mo"
    ],
    [
     "Jennifer",
     "Cole"
    ],
    [
     "Eun-Kyung",
     "Lee"
    ]
   ],
   "title": "Na\u000fve listeners² prominence and boundary perception",
   "original": "sp08_735",
   "page_count": 4,
   "order": 163,
   "p1": "735",
   "pn": "738",
   "abstract": [
    "This paper examines how ordinary listeners, naïve with respect to the phonetics and phonology of prosody, perceive the location of prosodic boundaries that demarcate speech \"chunks\" and prominences that serve a \"highlighting\" function, in spontaneous speech (Buckeye corpus). Over 70 naïve listeners marked the locations of prominences and boundaries in a real-time transcription task. Fleiss multitranscribers reliability tests show that naïve transcribers are consistent in their perception of prosodic boundaries and prominences. Specifically, we observe higher multi-transcriber agreement scores for boundary marking than for prominence marking. Variation between transcriptions of the same speech excerpt produced by different listeners reveals individual differences in the perception of prominences and boundaries. Variation in Fleiss multi-transcribers agreement scores for excerpts from different speakers suggests that speakers vary in how they structure an utterance prosodically and/or in how effectively they cue prosodic structure. We also find that nuclear prominences are more consistently perceived by naïve listeners than prenuclear prominences. The finding that naïve listeners agree well above chance on the location of prosodic events indicates that naïve transcription is a valid method for prosody analysis which can augment analysis based solely on expert labeling.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-163"
  },
  "mo08b_speechprosody": {
   "authors": [
    [
     "Yoonsook",
     "Mo"
    ]
   ],
   "title": "Duration and intensity as perceptual cues for na\u000fve listeners² prominence and boundary perception",
   "original": "sp08_739",
   "page_count": 4,
   "order": 164,
   "p1": "739",
   "pn": "742",
   "abstract": [
    "I investigate the acoustic correlates of prosodic prominence and boundary, as they are perceived by naïve listeners, in spontaneous speech from American English (Buckeye corpus). Prosodic prominence and phrasing serve different functions in speech communication: prosodic phrase boundaries demarcate speech chunks that typically cohere semantically, while prominences encode focus and possibly also rhythmic structure. The acoustic correlates of prominence and phrase boundary are examined through measures of vowel duration and overall intensity of stressed vowels, to see how those measures correlate, individually or in combination, with naïve listeners perception of prominence and boundary. The results show that most stressed vowels are lengthened in preboundary words (i.e., those final in the prosodic phrase). Prosodic prominence is also cued by increased duration, but in combination with higher overall intensity for some vowels. These acoustic differences associated with perceived prominence and boundary suggest different mechanisms underlying their production. This claim finds support from consideration of the different functions that prominence and boundary play in encoding information structure, and in speech production planning.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-164"
  },
  "pape08_speechprosody": {
   "authors": [
    [
     "Daniel",
     "Pape"
    ]
   ],
   "title": "The native language influence on perceptual intrinsic pitch: crosslinguistic data from German, Italian, portuguese, and Spanish",
   "original": "sp08_743",
   "page_count": 4,
   "order": 165,
   "p1": "743",
   "pn": "746",
   "abstract": [
    "It is generally acknowledged that Intrinsic Pitch differences are found for Germanic languages. In a previous study we could give evidence for a strong cross-linguistic difference when examining Intrinsic pitch for the Romance language Italian. To examine the possibility of a stable crosslinguistic difference, a perception experiment was designed to examine the existence of Intrinsic pitch in Romance languages in comparison to Germanic languages. Since Intrinsic pitch values were found with respect to differing musical education, the experiment was conducted separately for professional musicians on the one hand and non-musicians on the other hand.\n",
    "Different response patterns were found when comparing the Germanic and the Romance languages: Nearly 50 % of the Spanish and Portuguese listener showed an insensitivity for the Intrinsic pitch task, i.e. they judged the pitch of the vowels mainly on the voice quality difference but not on the F0 difference. This insensitivity clearly classifies Intrinsic pitch as a language-specific phenomenon.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-165"
  },
  "roll08_speechprosody": {
   "authors": [
    [
     "Mikael",
     "Roll"
    ],
    [
     "Merle",
     "Horne"
    ],
    [
     "Magnus",
     "Lindgren"
    ]
   ],
   "title": "Neurophysiology of a left-edge boundary tone using natural and edited F0",
   "original": "sp08_747",
   "page_count": 4,
   "order": 166,
   "p1": "747",
   "pn": "750",
   "abstract": [
    "The ERP effects of left-edge, sentence-medial boundary tones in East Swedish were examined using synthesized and nonsynthesized F0. The perception of the boundary tone gave rise to an N100 effect, reflecting automated processing of the acoustic features of the stimuli, a broadly distributed P200 effect, similar to what has earlier been seen for sentence-initial pitch accents, and an expectancy negativity, previously observed in response to sentence-medial, expected pitch accents. The N100 effect was clear only for the synthesized stimuli, possibly due to their relatively greater salience. The P200 was only seen in the combined results. The expectancy negativity was present in the combined results as well as for the non-edited stimuli. The F0 synthesis in the environment of voiceless obstruents produced a difference in the F0 level before the disambiguation point of the H boundary tone, which led to an anterior negativity starting around 50 ms before the H.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-166"
  },
  "shuai08_speechprosody": {
   "authors": [
    [
     "Lan",
     "Shuai"
    ],
    [
     "William S.-Y.",
     "Wang"
    ]
   ],
   "title": "Tone lateralization under noisy conditions",
   "original": "sp08_751",
   "page_count": 4,
   "order": 167,
   "p1": "751",
   "pn": "754",
   "abstract": [
    "This paper presents a dichotic listening experiment on the perception of Mandarin tones under clean and noisy conditions. We examine the enhancing role of noise on the lateralization patterns of tones. We discover that the lateralization patterns of different tones are inconsistent: the perception of tone 1 exhibits a left ear advantage, while that of tone 2 or tone 4 has a right ear advantage. These different lateralization patterns may result from different tone features and the fast or slow change of the tone pitch. Moreover, a gender difference in tone perception is detected in our experimental results.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-167"
  },
  "romportl08_speechprosody": {
   "authors": [
    [
     "Jan",
     "Romportl"
    ]
   ],
   "title": "Statistical evaluation of prosodic phrases in the Czech language",
   "original": "sp08_755",
   "page_count": 4,
   "order": 168,
   "p1": "755",
   "pn": "758",
   "abstract": [
    "The present paper understands prosodic phrases as units which take part in constituting the rhythmical structure of speech. Due to very subjective and inconsistent criteria for the prosodic phrase perception there must be an objectively underlain method for prosodic phrase assignment. This has been achieved by extensive listening tests (103 participants) and statistical evaluation of the acquired data (e.g. maximum likelihood model).\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-168"
  },
  "athanassia08_speechprosody": {
   "authors": [
    [
     "Dimou",
     "Athanassia"
    ],
    [
     "Lida",
     "Aimilios"
    ],
    [
     "Chalamandaris",
     "Aimilios"
    ]
   ],
   "title": "Is idiom identification possible from prosodic information? an experimental approach for the Greek language",
   "original": "sp08_759",
   "page_count": 4,
   "order": 169,
   "p1": "759",
   "pn": "762",
   "abstract": [
    "The purpose of this paper is to investigate whether the identification of ones idiom is feasible through only prosodic information. As an experimental approach of this theory, we attempt to study whether native Greek adults can identify their mother idiom from synthesized stimuli which contain only prosodic - melodic and rhythmic - information. In the first section we present the main idea behind our work, in the second section we present the procedure we followed in order to complete this pilot study, while at the two final sections one can find the results and the conclusions of our experiments.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-169"
  },
  "grawunder08_speechprosody": {
   "authors": [
    [
     "Sven",
     "Grawunder"
    ],
    [
     "Ines",
     "Bose"
    ]
   ],
   "title": "Average speaking pitch vs. average speaker fundamental frequency - reliability, homogeneity, and self report of listener groups",
   "original": "sp08_763",
   "page_count": 4,
   "order": 170,
   "p1": "763",
   "pn": "766",
   "abstract": [
    "Speaker fundamental frequency often stands as equivalent to the auditory measurement of average speaking (vocal) pitch. Previously found effects regarding higher estimations of average speaking pitch vs. average F0 for female voices have been fully replicated in an identification experiment involving 13 subjects. For female voices the average value of a given group of experts measuring average speaking pitch would be 2-3 semitones higher than the acoustically measured speaker fundamental frequency. Self reports of listeners certainty of their judgements seem not to correspond at all with any given variance in the estimations and ratings. In a complementary discrimination experiment (16 subjects) this interval seems to indicate a threshold of the same size of 2 -3 semitones for pitch discrimination in speech.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-170"
  },
  "komatsu08_speechprosody": {
   "authors": [
    [
     "Masahiko",
     "Komatsu"
    ],
    [
     "Fátima Tiemi",
     "Kimoto"
    ]
   ],
   "title": "Foreign accent of brazilian portuguese and Japanese - perceptual evaluation of modified and unmodified speech",
   "original": "sp08_767",
   "page_count": 4,
   "order": 171,
   "p1": "767",
   "pn": "770",
   "abstract": [
    "This paper examines the foreign accent in Brazilian Portuguese and Japanese. In the first experiment, Japanese speech samples of Japanese-descent Brazilians were compared to those of native Japanese speakers, as evaluated by Japanese, and in the second experiment, Portuguese speech samples of native Japanese speakers were compared to those of Japanesedescent Brazilians, as evaluated by Brazilians. In both experiments, detection of a foreign accent was more difficult in the stimulus with its spectral properties removed (representing prosodic features) than in the stimulus with its F0 flattened (representing segmental features), and was easiest in unmodified speech. Correlation between perception scores for modified and unmodified speech was found. Acoustic analysis suggested that speakers may bring their F0 characteristics of L1 into L2 speech, and showed that speaking rate was correlated with the perception scores. It concludes that foreign accents in both languages share some properties but also have some differences, possibly due to language differences, speakers proficiencies, and listeners backgrounds.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2008-171"
  }
 },
 "sessions": [
  {
   "title": "Keynote Papers",
   "papers": [
    "port08_speechprosody",
    "xu08_speechprosody",
    "saltzman08_speechprosody",
    "moraes08_speechprosody",
    "kawahara08_speechprosody"
   ]
  },
  {
   "title": "Voice Quality in Prosody Research",
   "papers": [
    "lugger08_speechprosody",
    "yoon08_speechprosody",
    "zhuang08_speechprosody",
    "cukierblaj08_speechprosody",
    "ishi08_speechprosody",
    "salomao08_speechprosody",
    "demenko08_speechprosody",
    "camargo08_speechprosody"
   ]
  },
  {
   "title": "Prosody in Speech Technology",
   "papers": [
    "bailly08_speechprosody",
    "krstulovic08_speechprosody",
    "guo08_speechprosody",
    "luo08_speechprosody",
    "kim08_speechprosody",
    "aguero08_speechprosody",
    "aguero08b_speechprosody",
    "su08_speechprosody",
    "sun08_speechprosody",
    "gopinath08_speechprosody",
    "segal08_speechprosody",
    "tran08_speechprosody",
    "lolive08_speechprosody",
    "boidin08_speechprosody",
    "avanzi08_speechprosody",
    "cho08_speechprosody",
    "hirst08_speechprosody",
    "albosrodrigues08_speechprosody",
    "looze08_speechprosody",
    "kim08b_speechprosody",
    "liao08_speechprosody",
    "martin08_speechprosody",
    "laskowski08_speechprosody",
    "chen08_speechprosody"
   ]
  },
  {
   "title": "Prosody in Speech Recognition and Understanding",
   "papers": [
    "ananthakrishnan08_speechprosody",
    "huang08_speechprosody",
    "minematsu08_speechprosody"
   ]
  },
  {
   "title": "Speech Pathology",
   "papers": [
    "pozo08_speechprosody",
    "cardoso08_speechprosody",
    "normand08_speechprosody",
    "barzaghi08_speechprosody"
   ]
  },
  {
   "title": "Human Voices and Emotion, Functional Brain Imaging Insights (Special Session 1)",
   "papers": [
    "paulmann08_speechprosody",
    "schirmer08_speechprosody",
    "wildgruber08_speechprosody",
    "grandjean08_speechprosody"
   ]
  },
  {
   "title": "Tone, Accent and Intonation",
   "papers": [
    "hedberg08_speechprosody",
    "post08_speechprosody",
    "green08_speechprosody",
    "lee08_speechprosody",
    "mucke08_speechprosody",
    "sadattehrani08_speechprosody",
    "chen08b_speechprosody",
    "barbosa08_speechprosody",
    "mixdorff08_speechprosody",
    "silbervarod08_speechprosody",
    "ambrazaitis08_speechprosody",
    "brugos08_speechprosody",
    "chang08_speechprosody",
    "lucente08_speechprosody",
    "amir08_speechprosody",
    "leemann08_speechprosody",
    "gilifivela08_speechprosody",
    "gussenhoven08_speechprosody",
    "petrone08_speechprosody",
    "jin08_speechprosody",
    "will08_speechprosody",
    "fujimura08_speechprosody",
    "caelenhaumont08_speechprosody"
   ]
  },
  {
   "title": "Rhythm and Tempo",
   "papers": [
    "ward08_speechprosody",
    "meireles08_speechprosody",
    "niebuhr08_speechprosody",
    "nava08_speechprosody",
    "ullakonoja08_speechprosody",
    "magalhaes08_speechprosody",
    "giordano08_speechprosody",
    "bartkova08_speechprosody",
    "odell08_speechprosody",
    "tortel08_speechprosody",
    "white08_speechprosody",
    "pasdeloup08_speechprosody",
    "teixeira08_speechprosody",
    "dellwo08_speechprosody",
    "gilbert08_speechprosody",
    "malisz08_speechprosody"
   ]
  },
  {
   "title": "Syntax, Semantics, Pragmatics and Prosody",
   "papers": [
    "gravano08_speechprosody",
    "tauberer08_speechprosody",
    "dimitrova08_speechprosody",
    "lai08_speechprosody"
   ]
  },
  {
   "title": "Speech Rhythm and its Measures",
   "papers": [
    "russo08_speechprosody",
    "mok08_speechprosody",
    "bertinetto08_speechprosody",
    "orourke08_speechprosody"
   ]
  },
  {
   "title": "Prosody and Higher Linguistic Domains",
   "papers": [
    "edmonds08_speechprosody",
    "mora08_speechprosody",
    "tenani08_speechprosody",
    "li08_speechprosody",
    "sridhar08_speechprosody",
    "hermes08_speechprosody",
    "maia08_speechprosody",
    "ito08_speechprosody",
    "jun08_speechprosody",
    "shen08_speechprosody",
    "braun08_speechprosody",
    "knoll08_speechprosody",
    "oliveirajr08_speechprosody",
    "armstrong08_speechprosody",
    "metusalem08_speechprosody",
    "gilifivela08b_speechprosody",
    "buder08_speechprosody",
    "bergmann08_speechprosody",
    "hara08_speechprosody",
    "chen08c_speechprosody"
   ]
  },
  {
   "title": "Phonology and Phonetics of Prosody, and Prosodic Variability",
   "papers": [
    "jian08_speechprosody",
    "lacheretdujour08_speechprosody",
    "mennen08_speechprosody",
    "boulademareuil08_speechprosody",
    "bouchhioua08_speechprosody",
    "bouchhioua08b_speechprosody",
    "chow08_speechprosody",
    "jia08_speechprosody",
    "cunha08_speechprosody",
    "velazquezpatino08_speechprosody",
    "arantes08_speechprosody",
    "escuderomancebo08_speechprosody",
    "nakata08_speechprosody",
    "bruce08_speechprosody",
    "ulbrich08_speechprosody",
    "biadsy08_speechprosody",
    "kleber08_speechprosody",
    "cantoni08_speechprosody",
    "kugler08_speechprosody",
    "cardillo08_speechprosody"
   ]
  },
  {
   "title": "Prosodic Variability",
   "papers": [
    "mokhtari08_speechprosody",
    "huang08b_speechprosody",
    "hanssen08_speechprosody",
    "koreman08_speechprosody"
   ]
  },
  {
   "title": "L1 and L2 Learning",
   "papers": [
    "cummins08_speechprosody",
    "wang08_speechprosody",
    "bissiri08_speechprosody",
    "chen08d_speechprosody"
   ]
  },
  {
   "title": "Modes of Enunciation and Prosody (Special Session)",
   "papers": [
    "brandt08_speechprosody",
    "bonaventura08_speechprosody",
    "syrdal08_speechprosody"
   ]
  },
  {
   "title": "Prosody of Expressive Speech",
   "papers": [
    "shahid08_speechprosody",
    "wang08b_speechprosody",
    "erickson08_speechprosody",
    "beller08_speechprosody",
    "rilliard08_speechprosody",
    "shochi08_speechprosody",
    "audibert08_speechprosody",
    "madureira08_speechprosody",
    "goldman08_speechprosody",
    "tooher08_speechprosody",
    "yanushevskaya08_speechprosody",
    "abelin08_speechprosody",
    "colamarco08_speechprosody",
    "viola08_speechprosody"
   ]
  },
  {
   "title": "Perception of Prosody",
   "papers": [
    "dubeda08_speechprosody",
    "peter08_speechprosody",
    "mo08_speechprosody",
    "mo08b_speechprosody",
    "pape08_speechprosody",
    "roll08_speechprosody",
    "shuai08_speechprosody",
    "romportl08_speechprosody",
    "athanassia08_speechprosody",
    "grawunder08_speechprosody",
    "komatsu08_speechprosody"
   ]
  }
 ],
 "doi": "10.21437/SpeechProsody.2008"
}