{
 "title": "Speech Prosody 2002",
 "location": "Aix-en-Provence, France",
 "startDate": "11/4/2002",
 "endDate": "13/4/2002",
 "conf": "SpeechProsody",
 "year": "2002",
 "name": "speechprosody_2002",
 "series": "SpeechProsody",
 "SIG": "SProSIG",
 "title1": "Speech Prosody 2002",
 "date": "11-13 April 2002",
 "papers": {
  "mozziconacci02_speechprosody": {
   "authors": [
    [
     "Sylvie",
     "Mozziconacci"
    ]
   ],
   "title": "Prosody and emotions",
   "original": "sp02_001",
   "page_count": 9,
   "order": 1,
   "p1": "1",
   "pn": "9",
   "abstract": [
    "The investigation of emotional speech constitutes quite a multidisciplinary research field. In order to benefit from the mutual enrichment that might result from this interdisciplinarity, it seems important to clarify what the specific contribution of a particular field can be. In this paper, an attempt is made to shed light on the type of contribution proposed by the tradition of studies of prosody to studies of expression of emotion in speech. Methodological issues that might contribute to the fruitfulness of studies of expressive speech are discussed.\n",
    "It is argued that the way intonation conveys emotion and attitude in speech is best studied when pitch variation is represented in the theoretical framework of a model of intonation. Using such a model structures and reduces the data, formalizes the description, facilitates control of parameters and generalization of results. The use of such a model has proven useful in the field of prosody, independently of its type. Moreover, such a context constitutes an opportunity to test the model’s adequacy for dealing with extreme variations such as those occurring in emotional speech. Another point is that complementary studies of production and perception are felt to be a necessary prerequisite for establishing the communicative significance of the investigated speech parameters. The need of a reference baseline in each experiment is also reminded. Furthermore, the need for drawing a distinction between the description of the global shape of the F0 curve, i.e., the type of pith contour, and the description of how this contour is concretely implemented in terms of pitch events is also discussed. Both the abstract phonological information on the type of contour, and the concrete phonetic information on the concrete pitch implementation of the F0 curve are pertinent. The investigation of type of pitch contour and detailed pitch implementation seems particularly promising when the experimental design is such as to allow the independent study of each effect, as well as their combined effect. This may lead us to make use of an orthogonal experimental design in the investigation of prosodic parameters. Finally, by considering how well existing assumptions about intonation account for its expressive functions, some light can be shed on the functionality of intonation for conveying meaningful information in speech communication.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-1"
  },
  "wichmann02_speechprosody": {
   "authors": [
    [
     "Anne",
     "Wichmann"
    ]
   ],
   "title": "Attitudinal intonation and the inferential process",
   "original": "sp02_011",
   "page_count": 6,
   "order": 2,
   "p1": "11",
   "pn": "16",
   "abstract": [
    "The role of prosody in conveying affective meaning is complex. The complexity is reflected to some extent in the many labels used to describe ‘ways of speaking’ that could generally be described as affectively coloured. The search for prosodic correlates of emotional speech, however, is more successful for some labels than for others. I argue that some labels refer not to the affective prosody itself, but to the meanings implied by or inferred from utterances in a given interactional context. These meanings, particularly those suggestive of attitude or interpersonal stance, may, of course, arise in part from a perceived affective colouring of the voice such as sadness or anger. Some, on the other hand, may be generated by the strategic use of prosodic patterns that are not inherently ‘attitudinal’, but are in some way incongruent with the text or context, and set in train the process of interpretation of speaker meaning. The notion of incongruence, however, presupposes the notion of congruence, and I argue that if we are to fully understand the contribution of prosody to speaker meaning, the search for emotion in the voice should be complemented by the study of ‘normative’ use of prosody in interaction.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-2"
  },
  "zeipollermann02_speechprosody": {
   "authors": [
    [
     "Branka",
     "Zei Pollermann"
    ]
   ],
   "title": "A place for prosody in a unified model of cognition and emotion",
   "original": "sp02_017",
   "page_count": 6,
   "order": 3,
   "p1": "17",
   "pn": "22",
   "abstract": [
    "The relationship between cognition and emotion has been one of major stumbling blocks in defining the concept of emotion. We argue that a unified model of cognition and emotion based on interactionist epistemology would allow to unambiguously define emotion and thus facilitate research in affective aspects of speech communication. The main tenet of the model is that cognition itself includes three dimensions of affective space: valence, arousal and coping power. The semiological status of prosody is discussed and two examples of our own research are given.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-3"
  },
  "wightman02_speechprosody": {
   "authors": [
    [
     "Colin W.",
     "Wightman"
    ]
   ],
   "title": "ToBI or not toBI?",
   "original": "sp02_025",
   "page_count": 5,
   "order": 4,
   "p1": "25",
   "pn": "29",
   "abstract": [
    "In the decade that has passed since the introduction of the ToBI system for the transcription of prosody, speech technology has moved out of the laboratory and into commercial applications on several fronts. However, virtually none of the commercial products have made large-scale use of prosody. Nevertheless, researchers in both recognition and synthesis continue to agree that better utilization of prosody is essential to improving the performance and acceptability of commercial systems. In this paper, we review the current state of prosody in commercial systems, and examine how the ongoing discussions related to what and how to transcribe with respect to prosody have simultaneously advanced and inhibited the field. In particular, we argue that, in hindsight, the ToBI system contains several flaws that have limited its acceptance and application.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-4"
  },
  "mixdorff02_speechprosody": {
   "authors": [
    [
     "Hansjörg",
     "Mixdorff"
    ]
   ],
   "title": "Speech technology, toBI, and making sense of prosody",
   "original": "sp02_031",
   "page_count": 7,
   "order": 5,
   "p1": "31",
   "pn": "37",
   "abstract": [
    "The current paper critically examines why prosodic knowledge has not yet found its way into commercial applications of speech technology. As a key issue of potential improvements to speech recognition and synthesis we identify the capability of understanding and expressing meaning by means of prosodic features of speech. We suggest that even a complete and ‘correct’ ToBI transcription will always remain some kind of intermediate and possibly incomplete stage of representation between the intended meaning of a message and the resulting speech signal. Examining the correspondences between a version of G-ToBI and the quantitative syllable-based integrated model developed by the author which uses the Fujisaki model for parametrizing F0 contours we conclude that ToBI accent labels can be derived from Fujisaki parameters. Finally we show that perceived prominence which can be thought of as the result of perceptual integration of various prosodic cues with respect to the information structure of an utterance can be reliably predicted from accent command amplitudes and normalized syllabic durations.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-5"
  },
  "li02_speechprosody": {
   "authors": [
    [
     "Aijun",
     "Li"
    ]
   ],
   "title": "Chinese prosody and prosodic labeling of spontaneous speech",
   "original": "sp02_039",
   "page_count": 6,
   "order": 6,
   "p1": "39",
   "pn": "46",
   "abstract": [
    "In this paper some prosodic research on read and spontaneous speech is introduced first, then the difference between read and spontaneous speech will be depicted, and finally the prosodic labeling system C-ToBI will be described.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-6"
  },
  "gussenhoven02_speechprosody": {
   "authors": [
    [
     "Carlos",
     "Gussenhoven"
    ]
   ],
   "title": "Intonation and interpretation: phonetics and phonology",
   "original": "sp02_047",
   "page_count": 11,
   "order": 7,
   "p1": "47",
   "pn": "57",
   "abstract": [
    "Intonational meaning is located in two components of language, the phonetic implementation and the intonational grammar. The phonetic implementation is widely used for the expression of universal meanings that derive from ‘biological codes’, meaning dimensions based on aspects of the production process of pitch variation. Three codes are identified, Ohala’s Frequency Code, the Effort Code and the Production Code. In each case, ‘informational’ meanings (which relate to the message) are identified, while for the first two codes also ‘affective’ meanings (relating to the state of the speaker) are discussed. Speech communities will vary in the extent to which they employ those meanings, and in the choices they make when they conflict. What they will never do, however, is change the natural form-function relations that they embody. By contrast, grammaticalised meanings often mimic the natural meanings, but linguistic change may create quite arbitrary form-meaning relations when forms are phonologised, and the semantics is systematised. English grammaticalised intonational meaning concerns information status.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-7"
  },
  "fretheim02_speechprosody": {
   "authors": [
    [
     "Thorstein",
     "Fretheim"
    ]
   ],
   "title": "Intonation as a constraint on inferential processing",
   "original": "sp02_059",
   "page_count": 6,
   "order": 8,
   "p1": "59",
   "pn": "64",
   "abstract": [
    "The proper role of intonation in utterance interpretation should be assessed in terms of the way that intonation interacts with other linguistic phenomena, notably with syntactic form and with grammatically encoded meaning, whether conceptual meaning of a compositional nature or procedural meaning that constrains the way in which an addressee will perform deductive inferences over conceptual representations in a bid to recover the contextual effects that make the utterance relevant to her or him. The intonation of a given utterance facilitates the addressee’s selection of the context (= set of activated assumptions) that constrains the relevance of the utterance in a way intended by the communicator. Direct coding of conventional meaning by means of intonation plays a rather marginal role in processes of utterance interpretation. This is particularly true of a prosodic system like that of Norwegian, the language providing the data to be discussed in this paper, because in Norwegian the speakers’ intonational choices are severely restricted by the presence of a word-accent system.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-8"
  },
  "hirschberg02_speechprosody": {
   "authors": [
    [
     "Julia",
     "Hirschberg"
    ]
   ],
   "title": "The pragmatics of intonational meaning",
   "original": "sp02_065",
   "page_count": 4,
   "order": 9,
   "p1": "65",
   "pn": "68",
   "abstract": [
    "Starting from Carlos Gussenhoven’s proposal that intonational meaning be understood in terms of three biological codes, this paper suggests an augmentation of that proposal to connect human experience of these biological phenomena to the process of spoken communication. Under this scenario, the codes give rise to a set of Conversational Implicatures, similar to those defined by H. Paul Grice Grice75 in his description of Cooperative Conversation. Certain additions to Grice’s Maxims of Cooperative Conversation are suggested, to capture the communicative effect of features of Gussenhoven’s Frequency, Effort, and Production Codes.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-9"
  },
  "toepel02_speechprosody": {
   "authors": [
    [
     "Ulrike",
     "Toepel"
    ],
    [
     "Kai",
     "Alter"
    ]
   ],
   "title": "Cerebral strategies in the segmentation and interpretation of speech",
   "original": "sp02_071",
   "page_count": 6,
   "order": 10,
   "p1": "71",
   "pn": "76",
   "abstract": [
    "The segmentation of the acoustic speech signal is a fundamental for the processing of spoken language. The paper at hand provides a survey of studies conducted in our lab concerning the detection of segmentation cues in the speech signal and associated perception of prosodic boundaries.\n",
    "The first two studies presented here employ the methodology of Event-Related Potentials (ERP) to study online electrophysiological responses to acoustic stimuli varying in syntactic and prosodic constituency, as well as in segmental content. By the first study an ERP shift was identified correlated with the perception of major intonational boundaries which was termed the Closure Positive Shift (CPS).\n",
    "The second study was especially concerned with listener‘s abilities in speech segmentation, given the exclusive presence of prosodic cues.\n",
    "A third experiment reviewed here employs functional Magnetic Resonance Imaging (fMRI), an investigation method based on hemodynamic brain responses.\n",
    "ERP and fMRI are complementary methodologies: while ERPs provide an accurate measure of temporal aspects of processing, fMRI methodology is particularly well suited to localize such processes in the brain.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-10"
  },
  "pell02_speechprosody": {
   "authors": [
    [
     "Marc D.",
     "Pell"
    ]
   ],
   "title": "Surveying emotional prosody in the brain",
   "original": "sp02_077",
   "page_count": 6,
   "order": 11,
   "p1": "77",
   "pn": "82",
   "abstract": [
    "Research has long supported a pivotal right hemisphere contribution to the decoding of emotional prosody, although a broader network of cortical and subcortical structures is now thought to support different components of this functional system during input processing. This paper highlights important work implicating the basal ganglia in emotional prosody decoding, especially in reinforcing key affective stimulus properties necessary for higher-order interpretative processes. The role of the right hemisphere in elaborating emotional-prosodic stimuli is then considered in reference to presumed ‘functional’ and ‘auditory-perceptual’ capacities of constituent regions. A broader description of the right hemisphere’s jurisdiction in social-emotive behaviour is advocated to advance future work in this area, and a new paradigm to tap on-line comprehension of emotional prosody in clinical populations is described.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-11"
  },
  "fodor02_speechprosody": {
   "authors": [
    [
     "Janet Dean",
     "Fodor"
    ]
   ],
   "title": "Psycholinguistics cannot escape prosody",
   "original": "sp02_083",
   "page_count": 6,
   "order": 12,
   "p1": "83",
   "pn": "90",
   "abstract": [
    "Once, sentence processing research set aside prosody in order to focus on syntactic and semantic processing. Experimental sentences were mostly presented visually, often without prosodic markers such as commas. Now that we have made some progress by this ‘divide and conquer’ approach, and now that the technology for working on speech has improved, it may be time to integrate prosody into processing models. I argue here that we have no choice but to do so, because current evidence shows that even in silent reading, prosody is projected onto written sentences, and can influence the course of syntactic processing.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-12"
  },
  "xu02_speechprosody": {
   "authors": [
    [
     "Yi",
     "Xu"
    ]
   ],
   "title": "Articulatory constraints and tonal alignment",
   "original": "sp02_091",
   "page_count": 10,
   "order": 13,
   "p1": "91",
   "pn": "100",
   "abstract": [
    "There has been accumulating evidence in recent years that certain F0 events are consistently aligned with segmental events such as the syllable boundary. The mechanisms for the observed alignment patterns, however, are still being closely investigated. In this paper I argue that to understand the observed tonal alignment patterns, it is imperative to first understand the role of articulatory constraints in shaping the F0 contours in speech. In particular, the maximum speed of pitch change limits how fast F0 movements can be produced; and the coordination of laryngeal and supralaryngeal movements limits how syllables and tones can be aligned to each other. From a different perspective, these constraints mean that the degrees of freedom speakers have are probably less than previously thought. This may actually make our understanding of the speech signal somewhat easier than before. I will demonstrate this with a theoretical model of F0 production that is based on the new understanding of the articulatory constraints. Though conceptually simple, the model seems to be able to account for a number of phonetic patterns that have been observed in speech. Finally, I will briefly discuss the implications of the new insights on our understanding of tonal perception in speech.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-13"
  },
  "dimperio02_speechprosody": {
   "authors": [
    [
     "Mariapaola",
     "D’Imperio"
    ]
   ],
   "title": "Language-specific and universal constraints on tonal alignment: the nature of targets and \"anchors\"",
   "original": "sp02_101",
   "page_count": 6,
   "order": 14,
   "p1": "101",
   "pn": "106",
   "abstract": [
    "Much recent work on tonal alignment, including its modeling, implies the existence of well-defined \"targets\" as well as \"segmental\" anchors to which the tones would be aligned. But researchers in this area are saddled with a paradox. In search for universal principles of alignment, they need to compare acoustic measurements for many languages, and actively search for effects that are specific to a single language, though a model which is itself specific to a single language is not desirable for a strong \"universalist\" view. However, most of the recent alignment work has been performed within the realm of acoustics, while perception and articulatory measures have been considerably neglected. After reviewing some acoustic studies, perception studies are presented which suggest that tonal targets might have a perceptual basis and might be guided by both psychoacoustic (i.e. universal) and language-specific constraints. Also, very recent articulatory data are presented which only partially support the strong hypothesis of universal articulatory constraints being the main driving force for alignment regularities.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-14"
  },
  "santen02_speechprosody": {
   "authors": [
    [
     "Jan P. H. van",
     "Santen"
    ]
   ],
   "title": "Quantitative modeling of pitch accent alignment",
   "original": "sp02_107",
   "page_count": 6,
   "order": 15,
   "p1": "107",
   "pn": "112",
   "abstract": [
    "This paper poses two interrelated questions. (i) What aspects of pitch movement and the segmental stream are aligned? (ii) What does it mean for these aspects to be aligned? Our basic claim is that these aspects are unlikely to be found at the acoustic surface level, and that alignment itself involves an abstract relationship rather than, for example, the simple coincidence of certain discrete pitch events (e.g. peaks) with discrete segmental events (e.g., syllable boundaries.) This abstract relationship consists of a mathematical mapping between intonational and segmental trajectories that is invariant within a given phonological category and \"speech state.\" We present a conceptual framework that makes this claim more precise, and illustrate the framework by discussing in detail a specific model, the Linear Alignment Model (A Model of Fundamental Frequency Contour Alignment\", in A. Botinis, Ed., Intonation: Analysis, Modeling and Technology.)\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-15"
  },
  "ramus02_speechprosody": {
   "authors": [
    [
     "Franck",
     "Ramus"
    ]
   ],
   "title": "Acoustic correlates of linguistic rhythm: perspectives",
   "original": "sp02_115",
   "page_count": 6,
   "order": 16,
   "p1": "115",
   "pn": "120",
   "abstract": [
    "The empirical grounding of a typology of languages’ rhythm is again a hot issue. The currently popular approach is based on the durations of vocalic and intervocalic intervals and their variability. Despite some successes, many questions remain. The main findings still need to be generalised to much larger corpora including many more languages. But a straightforward continuation of the current work faces many difficulties. Perspectives are outlined for future work, including proposals for the cross-linguistic control of speech rate, improvements on the statistical analyses, and prospects raised by automatic speech processing.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-16"
  },
  "cummins02_speechprosody": {
   "authors": [
    [
     "Fred",
     "Cummins"
    ]
   ],
   "title": "Speech rhythm and rhythmic taxonomy",
   "original": "sp02_121",
   "page_count": 6,
   "order": 17,
   "p1": "121",
   "pn": "124",
   "abstract": [
    "Of all prosodic variables used to classify languages, rhythm has proved most problematic. Recent attempts to classify languages based on the relative proportion of vowels or obstruents have had some success, but these seem only indirectly related to perceived rhythm. Coupling between nested prosodic units is identified as an additional source of rhythmic patterning in speech, and this coupling is claimed to be gradient and highly variable, dependent on speaker characteristics and text properties. Experimental results which illustrate several degrees of coupling between different prosodic levels are presented, both from previous work within the Speech Cycling paradigm, and from new data. A satisfactory account of speech rhythm will have to take both language-specific phonological properties and utterance-specific coupling among nested production units into account.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-17"
  },
  "grabe02_speechprosody": {
   "authors": [
    [
     "Esther",
     "Grabe"
    ]
   ],
   "title": "Variation adds to prosodic typology",
   "original": "sp02_127",
   "page_count": 6,
   "order": 18,
   "p1": "127",
   "pn": "132",
   "abstract": [
    "Variation has not been a major concern of prosodic typologists. Frequently, it is treated as noise in the data and held to conceal what is really important about the prosodic structure of the language. Consequently, most investigations are restricted to a single standard variety and cross-speaker variation is ignored or masked by statistical processing. The results are often assumed to be representative of the language as a whole. Recent research challenges this approach. Acoustic correlates of rhythm class, for instance, show that dialects of one language can differ as much in their rhythmic structures as two different languages. One dialect can be classified as ‘stress-timed’ and the other as ‘syllable-timed’. Furthermore, considerable cross-speaker variation occurs within dialects. In this paper, I review a selection of data on prosodic variation across dialects and speakers. Then I present data on intonational variation. Examination of cross-speaker and cross-dialect variation in these data leads to new results on dialect-specific characteristics of intonation as well as to cross-dialect and cross-language generalisations.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-18"
  },
  "arnold02_speechprosody": {
   "authors": [
    [
     "Karen M.",
     "Arnold"
    ],
    [
     "Peter W.",
     "Jusczyk"
    ]
   ],
   "title": "Text-to-tune alignment in speech and song",
   "original": "sp02_135",
   "page_count": 4,
   "order": 19,
   "p1": "135",
   "pn": "138",
   "abstract": [
    "Musical and linguistic systems are similar in many aspects, including a common timecourse of acquisition and the use of many of the same cues to express structure. Any direct parallels between the systems would be beneficial to infants, who are learning both simultaneously. Using ToBI (Tones and Breaks Indices) analyses of spoken renditions of nursery rhymes and modified ToBI analyses (coding only for locations of high and low targets) of sung versions of the same texts, a strong correspondence was found between melodic and intonational contours of the same materials. These results bear on questions of learnability and bootstrapping in both realms.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-19"
  },
  "astesano02_speechprosody": {
   "authors": [
    [
     "Corine",
     "Astésano"
    ],
    [
     "Ellen Gurman",
     "Bard"
    ],
    [
     "Alice",
     "Turk"
    ]
   ],
   "title": "Functions of the French initial accent: a preliminary study",
   "original": "sp02_139",
   "page_count": 4,
   "order": 20,
   "p1": "139",
   "pn": "142",
   "abstract": [
    "Previous studies have proposed that the French phonological system includes an Initial Accent on lexical words, which has rhythmic functions. Descriptions of English prosody propose that phonological phrases may have an early accent as a boundary marker. We report results from a preliminary production experiment, which tested the structural and rhythmic functions of the F0 of initial syllables. Our results showed that the F0 is used in French as a (left) phrase boundary marker, and that its value appeared to be correlated to prosodic constituent length.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-20"
  },
  "asu02_speechprosody": {
   "authors": [
    [
     "Eva Liina",
     "Asu"
    ]
   ],
   "title": "Downtrends in different types of question in Estonian",
   "original": "sp02_143",
   "page_count": 4,
   "order": 21,
   "p1": "143",
   "pn": "146",
   "abstract": [
    "The present paper investigates the issue of downtrends in different types of yes/no question in Estonian. The types that are compared comprise those beginning with an interrogative particle kas (whether), tag questions ending with the particle või (or), and morphosyntactically unmarked questions. It appears that these differ with respect to the slope of the fall in prenuclear accents and the step between the final prenuclear and nuclear accent. Tag and unmarked questions show a similar prenuclear slope but differ in the step; kas-questions have a significantly different slope from the other two types. A further comparison is made with statements, revealing that the question type most similar to statements is the kas-question. It is suggested that this is because the questioning particle in the beginning of an utterance signals a question immediately, and thus less intonational marking is needed. The other two types of question are either not marked morphosyntactically at all, or have marking only at the very end, and consequently a larger degree of intonational marking is used for conveying interrogativity.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-21"
  },
  "atterer02_speechprosody": {
   "authors": [
    [
     "Michaela",
     "Atterer"
    ]
   ],
   "title": "Assigning prosodic structure for speech synthesis: a rule-based approach",
   "original": "sp02_147",
   "page_count": 4,
   "order": 22,
   "p1": "147",
   "pn": "150",
   "abstract": [
    "This paper presents a model that assigns prosodic structure to unrestricted text. The model is linguistically motivated and also uses constraints on phrase length. For the implementation an XML-pipeline is used as a data-architecture. The output can be processed by a text-to-speech synthesiser for determining the locations of phrase breaks. The model outperforms another rule-based approach, and achieves either comparable results as a statistical model or comes close to those results, while being psychologically more plausible.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-22"
  },
  "auberge02_speechprosody": {
   "authors": [
    [
     "Véronique",
     "Aubergé"
    ]
   ],
   "title": "A Gestalt morphology of prosody directed by functions: the example of a step by step model developed at ICP",
   "original": "sp02_151",
   "page_count": 4,
   "order": 23,
   "p1": "151",
   "pn": "154",
   "abstract": [
    "This paper proposes a point of view consisting in showing prosody as an emergent form perceived via Gestalt processing. Contours carry some function values at different levels through the superposition of independent contours. In this view, tonal phonology can be interpreted as a bottom-up sub-processing approach, and global form modelling as supported by a top-down approach. The model can integrate a large scale of functions from the linguistic domain to the expression of emotion. The founding principles of the model are explained and the most significant steps developed at ICP are recalled to illustrate this theoretical background.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-23"
  },
  "aufterbeck02_speechprosody": {
   "authors": [
    [
     "Margit",
     "Aufterbeck"
    ]
   ],
   "title": "Aspects of prehead and onset: the onset onglide phenomenon",
   "original": "sp02_155",
   "page_count": 4,
   "order": 24,
   "p1": "155",
   "pn": "158",
   "abstract": [
    "High pitch accents are often accompanied by a small upwardly gliding pitch slope towards the high tone target. In intonation phrase (IP) initial position, particularly when no unstressed syllables precede the accented one, it can be very hard to determine the status of this onglide: it may be connected to a low boundary tone, it may be a leading L tone associated with the onset H*, or it may be a matter of the phonetic implementation of H*. An experiment was devised that focuses on the relation between the prehead, the stretch of unstressed syllables introducing an IP, and the onset, the first accented syllable of an IP. The aim was to display the left-hand environment of the onset by systematically increasing the number of prehead syllables from none to three and observe whether the prehead pitch behavior revealed the nature of the onset onglide. Twenty speakers were asked to read aloud a passage containing twelve test sentences. Results suggest that the onglide movement is associated directly with the H* onset tone and does not spread into the preaccentual environment. Prehead pitch contours appear to be flat and do not interpolate towards the upcoming high pitch accent of the onset. Furthermore, a correlation was shown between the pitch height of the prehead and the one of the onset syllable.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-24"
  },
  "bagou02_speechprosody": {
   "authors": [
    [
     "Odile",
     "Bagou"
    ],
    [
     "Cécile",
     "Fougeron"
    ],
    [
     "Uli H.",
     "Frauenfelder"
    ]
   ],
   "title": "Contribution of prosody to the segmentation and storage of \"words\" in the acquisition of a new mini-language",
   "original": "sp02_159",
   "page_count": 4,
   "order": 25,
   "p1": "159",
   "pn": "162",
   "abstract": [
    "This paper evaluates the relative contribution of two prosodic cues, lengthening and F0 contour, in the processes of speech segmentation and storage of new words. More precisely, we investigate the role of prosodic information in the acquisition by French learners of a mini-language constructed for the experiment. The results show that presence of prosodic information facilitates the speech segmentation and therefore, the acquisition of the new language. Indeed, lengthening or F0 rise on the word final syllable is used by listeners to infer the presence of a boundary. However, the presence of the two cues manipulated does not improve performance; and when only one cue is present, F0 induces slightly more accurate segmentation than lengthening. Finally, the storage of the \"stressable\" property of the word-final syllables in French is discussed.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-25"
  },
  "barbosa02_speechprosody": {
   "authors": [
    [
     "Plinio A.",
     "Barbosa"
    ]
   ],
   "title": "Explaining cross-linguistic rhythmic variability via a coupled-oscillator model of rhythm production",
   "original": "sp02_163",
   "page_count": 4,
   "order": 26,
   "p1": "163",
   "pn": "166",
   "abstract": [
    "A recent work by Ramus and colleagues has renewed the interest in rhythm typology connected to the evaluation of speech production data. They proposed that differences in rhythm type could be accounted for by a segmental set of variables derived from the acoustic duration of consonants and vowels. However, rhythm typology can be more interestingly characterized and understood by modeling speech rhythm production. The purpose of our study is then threefold: (a) showing why a deeper understanding of languages¡¯ rhythmic types can only be achieved by modeling their underlying rhythmic systems; (b) presenting the results of the implementation of a coupled-oscillator rhythmic system which simulates language-specific continuous patterns of syllable-sized durations; (c) suggesting that only a rhythmic system integrated to a gestural framework can account for the complexity of rhythm phenomena.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-26"
  },
  "batusek02_speechprosody": {
   "authors": [
    [
     "Robert",
     "Batúsek"
    ]
   ],
   "title": "A duration model for Czech text-to-speech synthesis",
   "original": "sp02_167",
   "page_count": 4,
   "order": 27,
   "p1": "167",
   "pn": "170",
   "abstract": [
    "Duration model is a standard part of current speech synthesizers. Many types of models have been used recently, e.g. multiplicative models, sum-of-products models or decision tree-based models. This paper follows a decision tree approach. It describes several versions of the duration model for Czech speech synthesis. The model presented here will be implemented in the Czech TTS system Demosthenes.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-27"
  },
  "bertrand02_speechprosody": {
   "authors": [
    [
     "Roxane",
     "Bertrand"
    ],
    [
     "R.",
     "Espesser"
    ]
   ],
   "title": "Voice diversity in conversation: a case study",
   "original": "sp02_171",
   "page_count": 4,
   "order": 28,
   "p1": "171",
   "pn": "174",
   "abstract": [
    "This paper’s aim is to present prosody as a polyphonic marker through the analysis of Direct Reported Speech excerpts pronounced by a female speaker in everyday conversation. Our results reveal the existence of global melodic differences between the three types of discourse analysed, eg Direct Speech, Direct Reported Speech which contains selfquotations and Direct Reported Speech containing other virtual enunciators than the source speaker.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-28"
  },
  "birch02_speechprosody": {
   "authors": [
    [
     "Bruce",
     "Birch"
    ]
   ],
   "title": "The IP as the domain of syllabification",
   "original": "sp02_175",
   "page_count": 4,
   "order": 29,
   "p1": "175",
   "pn": "178",
   "abstract": [
    "Evidence suggests that in Iwaija, a non-Pama-Nyungan language of northern Australia, the Intonation Phrase (IP) is an integrated entity, one which is typical of a cursus language (Pulgram,1970) like French, in which words in connected speech give up some of the properties they exhibit in isolation. A salient feature of the prosody of this language is syllabification across content word boundaries. The paper examines the way in which this phenomenon relates to two influential versions of the prosodic hierarchy, both of which suggest that syllabification is subsumed, one way or another, within the boundaries of word-sized units. On the basis of acoustic analysis, the paper suggests that the IP, rather than the Phonological or Prosodic Word may form the domain for syllabification in Iwaija.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-29"
  },
  "bishop02_speechprosody": {
   "authors": [
    [
     "Judith",
     "Bishop"
    ]
   ],
   "title": "‘stress accent² without phonetic stress: accent type and distribution in Bininj Gun-wok",
   "original": "sp02_179",
   "page_count": 4,
   "order": 30,
   "p1": "179",
   "pn": "182",
   "abstract": [
    "Intonational typology has recently begun to scrutinize the typology of accent beyond the common binary distinction of ‘stress accent’ and ‘pitch accent’ (or ‘non-stress’ accent). Contributing to this research, this study considers the phonetic correlates of accent and its patterns of distribution in the Kuninjku dialect of Bininj Gun-wok (BGW), a polysynthetic language spoken in Northern Australia. In BGW, postlexical accents (H*, L+H*) are attracted to metrically strong syllables, a defining feature of ‘stress accent’ languages. However, contrary to many stress accent languages described in the literature, pitch is the single consistent correlate of accent. In BGW, increased syllable duration is a weakly significant correlate of accent only on the penultimate syllable of an intonational phrase and intensity is not a consistent correlate. BGW accent type may be more accurately described as ‘metrical accent’, a term which captures the attraction of accent to metrical strength without the correlative assumption of phonetic stress. Accent in BGW has a clear metricalprominence- enhancing function, but it may also perform a delimitative function at the level of the phonological word. While more than one accent can associate to a phonological word, in the Kuninjku dialect, a single accent will almost invariably align with the leftmost metrical head in the word.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-30"
  },
  "botinis02_speechprosody": {
   "authors": [
    [
     "Antonis",
     "Botinis"
    ],
    [
     "Robert",
     "Bannert"
    ],
    [
     "Marios",
     "Fourakis"
    ],
    [
     "Stamatia",
     "Pagoni-Tetlow"
    ]
   ],
   "title": "Crosslinguistic segmental durations and prosodic typology",
   "original": "sp02_183",
   "page_count": 4,
   "order": 31,
   "p1": "183",
   "pn": "186",
   "abstract": [
    "The present study is an experimental investigation of the effects of syllable position, stress, focus and tempo on segmental durations in American English, British English, Greek and Swedish. Nonsense disyllabic CVCV words were produced in a carrier sentence under different conditions of stress, focus and tempo. The results indicate that stress and tempo have a major effect on both consonant and vowel across all four languages, whereas the effects of syllable position and focus are hardly evident. Significant interactions were mostly found between syllable position and stress for the vowel.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-31"
  },
  "boulademareuil02_speechprosody": {
   "authors": [
    [
     "Philippe",
     "Boula de Mareüil"
    ],
    [
     "Philippe",
     "Célérier"
    ],
    [
     "Jacques",
     "Toen"
    ]
   ],
   "title": "Generation of emotions by a morphing technique in English, French and Spanish",
   "original": "sp02_187",
   "page_count": 4,
   "order": 32,
   "p1": "187",
   "pn": "190",
   "abstract": [
    "Generating variants becomes a priority for text-to-speech (TTS) synthesis. In particular, additional mark-ups inserted within the text may be used to communicate emotions. Within the framework of a European project linked to the MPEG4 standard (INTERFACE),our purpose is the synthesis of six emotions (anger, disgust, fear, joy, surprise and sadness): this was performed by applying a morphing technique, from the sequence of phonemes and their corresponding prosodic characteristics, for a \"neutral\" style, generated by a multilingual TTS system. We dispose of corpora declined under these six emotions by professional actors in English, French and Spanish: some trends may be drawn, as the inversion of fundamental frequency slopes for disgust and the pruning of melodic movements for sadness. We tend to think that the perceptual identification of the different emotions will be facilitated, within the framework of MPEG4, by the addition of a visual component: a talking head.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-32"
  },
  "bouzon02_speechprosody": {
   "authors": [
    [
     "Caroline",
     "Bouzon"
    ],
    [
     "Daniel",
     "Hirst"
    ]
   ],
   "title": "The influence of prosodic factors on the duration of words in British English",
   "original": "sp02_191",
   "page_count": 4,
   "order": 33,
   "p1": "191",
   "pn": "194",
   "abstract": [
    "English, like all languages, typically involves a great variability in the duration of the structural units taken into account in the observation (phonemes, syllables, feet, words, etc.). In this paper some prosodic factors likely to influence the duration were tested for their influence in two analyses. In the first analysis, the predominant factor turned out to be the final position in the intonation unit. The second analysis takes a closer look at the influence of stress and accent and of the position in the intonation unit on the relative and absolute duration of each word.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-33"
  },
  "caelenhaumont02_speechprosody": {
   "authors": [
    [
     "Geneviève",
     "Caelen-Haumont"
    ]
   ],
   "title": "Perlocutory values and functions of melisms in spontaneous dialogue",
   "original": "sp02_195",
   "page_count": 4,
   "order": 34,
   "p1": "195",
   "pn": "198",
   "abstract": [
    "Following earlier work [1,2,3], this study, based on a corpus of spontaneous dialogue, aims to define melisms as opposed to intonation and to specify not only their forms, but also their meanings and functions. Melisms appear to be directly related to the domain of beliefs, of subjective values and hence of their perlocutory effects. The study shows in particular how melisms, beliefs and motivations are organised in the discourse of speakers.\n",
    "s\n",
    "Caelen-Haumont, G., 2002. Towards Naturalness or the Challenge of Subjectivity. In Keller, E., Bailly, G., Monaghan, A., Terken, J., Huckvale, M. (eds.), Improvements in Speech Synthesis. London.: John Wiley. Caelen-Haumont, G.; Bel, B., 2000. Le caractere spontane dans la parole et le chant improvises: de la structure intonative au melisme. Revue Parole, 15/16, 250-301. Caelen-Haumont, G.; Bel B., 2001. Subjectivite et emotion dans la prosodie de parole et du chant: espace, coordonnees et parametres. Actes du Colloque International Emotions, Interactions et Developpement, Grenoble, 141-147.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-34"
  },
  "campione02_speechprosody": {
   "authors": [
    [
     "Estelle",
     "Campione"
    ],
    [
     "Jean",
     "Véronis"
    ]
   ],
   "title": "A large-scale multilingual study of silent pause duration",
   "original": "sp02_199",
   "page_count": 4,
   "order": 35,
   "p1": "199",
   "pn": "202",
   "abstract": [
    "This paper presents a large-scale study of silent pause duration, based on the analysis of ca. 6000 pauses in 5 ½ hours of read and spontaneous speech in five languages. The distribution of pauses appears as trimodal, suggesting a categorization in brief (< 200 ms), medium (200-1000 ms) and long (> 1000 ms) pauses, the latter occurring only in spontaneous speech. The study reveals possible methodological flaws in previous research in which statistical tests that rely on normality assumption (such as the ANOVA) are routinely applied on non-transformed data, although distributions are far from normal. It also emphasizes the dangerous effect of thresholds, which are very commonly applied in the literature for practical reasons, but can lead to totally false conclusions when comparing speech styles, languages or speakers.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-35"
  },
  "cao02_speechprosody": {
   "authors": [
    [
     "Jianfen",
     "Cao"
    ],
    [
     "Weibin",
     "Zhu"
    ]
   ],
   "title": "Syntactic and lexical constraint in prosodic segmentation and grouping",
   "original": "sp02_203",
   "page_count": 6,
   "order": 36,
   "p1": "203",
   "pn": "206",
   "abstract": [
    "This paper tries to discuss the interrelation between prosody and syntax by clarifying some syntactic constraints in Chinese prosodic segmentation and grouping. The main attention will be paid to search for (1) possible correlation between prosodic breaks and syntactic construction; (2) possible correlation between prosodic breaks and POS; and (3) the role of syntactic and lexical information in prosodic word chunking. Accordingly, an algorisim for the prediction of prosodic structure based on these information could be formed later on.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-36"
  },
  "cardenosopayo02_speechprosody": {
   "authors": [
    [
     "V.",
     "Cardenoso-Payo"
    ],
    [
     "D.",
     "Escudero-Mancebo"
    ]
   ],
   "title": "Statistical modelling of stress groups in Spanish",
   "original": "sp02_207",
   "page_count": 4,
   "order": 37,
   "p1": "207",
   "pn": "210",
   "abstract": [
    "A statistical corpus-based synthesis strategy has been developed for fundamental frequency contours (F0) of Spanish sentences. Input text is assumed to be made of a sequence of intonation groups, each one containing one or more stress groups. The stress group is taken as the basic prosodic unit at acoustic level. For every kind of acoustic unit, we get a set of statistical distributions for the parameters of a Bézier function that generates the F0 contour of the unit. This distributions are obtained directly from the corpus and two different models are annalyzed. In one of them, linguistic knowledge forces the grouping of stress groups, while in the other an unsupervised clustering is carried out. Comparison of the results of both methods show the relative importance of different prosodic features found in real data.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-37"
  },
  "chen02_speechprosody": {
   "authors": [
    [
     "Yiya",
     "Chen"
    ]
   ],
   "title": "Accentual lengthening of monosyllabic-constituents in Beijing Mandarin",
   "original": "sp02_211",
   "page_count": 4,
   "order": 38,
   "p1": "211",
   "pn": "214",
   "abstract": [
    "In stress-accent languages such as English and Dutch, pitch accent is used as the primary cue for contrastive focus, a mechanism to indicate correction or emphasis in discourse. A well-known fact about Chinese is that pitch change is used to indicate tones for lexical contrasts. This study examines how an alternative acoustic cue - duration - is used to signal contrastive focus in Beijing Mandarin. In particular, attention is paid to the interaction of accentual lengthening with other known factors that govern segment duration, namely vowel intrinsic duration and a segment’s position in the prosodic hierarchy. Results from onesyllable constituents will be presented to show their conjoint influence.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-38"
  },
  "chen02b_speechprosody": {
   "authors": [
    [
     "Aoju",
     "Chen"
    ],
    [
     "Carlos",
     "Gussenhoven"
    ],
    [
     "Toni",
     "Rietveld"
    ]
   ],
   "title": "Language-specific uses of the effort code",
   "original": "sp02_215",
   "page_count": 4,
   "order": 39,
   "p1": "215",
   "pn": "218",
   "abstract": [
    "Two groups of listeners with Dutch and British English language backgrounds judged Dutch and British English utterances, respectively, which varied in the intonation contour on the scales EMPHATIC vs. NOT EMPHATIC and SURPRISED vs. NOT SURPRISED, two meanings derived from the Effort Code. The stimuli, which differed in sentence mode but were otherwise lexically equivalent, were varied in peak height, peak alignment, end pitch, and overall register. In both languages, there are positive correlations between peak height and degree of emphasis, between peak height and degree of surprise, between peak alignment and degree of surprise, and between pitch register and degree of surprise. However, in all these cases, Dutch stimuli lead to larger perceived meaning differences than the British English stimuli. This difference in the extent to which increased pitch height triggers increases in perceived emphasis and surprise is argued to be due to the difference in the standard pitch ranges between Dutch and British English. In addition, we found a positive correlation between pitch register and the degree of emphasis in Dutch, but a negative correlation in British English. This is an unexpected difference, which illustrates a case of ambiguity in the meaning of pitch.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-39"
  },
  "chung02_speechprosody": {
   "authors": [
    [
     "Hyunsong",
     "Chung"
    ]
   ],
   "title": "Duration models and the perceptual evaluation of spoken Korean",
   "original": "sp02_219",
   "page_count": 4,
   "order": 40,
   "p1": "219",
   "pn": "222",
   "abstract": [
    "This paper builds predictive models of segment duration in context based on the CART models and \"additive-multiplicative\" models for Korean text-to-speech. It uses a corpus of 670 read sentences collected from one speaker of standard Korean. The best performance was obtained from a CART decision tree model, which shows that the correlation between the observed and the predicted durations is 0.77 and the mean squared error of prediction is 25.11 ms. Linguistic implications of these models are also discussed. The perceptual evaluations of these models are carried out using a Korean language diphone database based on the MBROLA synthesis system in order to investigate the clarity and the listener preference for durations.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-40"
  },
  "claen02_speechprosody": {
   "authors": [
    [
     "Kathrin",
     "Claßen"
    ]
   ],
   "title": "Realisations of nuclear pitch accents in Swabian dialect and Parkinson²s dysarthria: a preliminary report",
   "original": "sp02_223",
   "page_count": 4,
   "order": 41,
   "p1": "223",
   "pn": "226",
   "abstract": [
    "The phonetic realisation of pitch accents associated with little sonorant material varies between languages and dialects. For speakers of Northern Standard German it has been shown that nuclear falling accents are truncated while rising accents are compressed. In order to further investigate effects of the German Swabian dialect native Swabian speakers were investigated with regard to truncation and compression. In addition, two Swabian speakers suffering from Parkinson’s disease were examined, because basal ganglia dysfunction - a typical morphological trait of parkinsonian subjects - is frequently accompanied by dysarthophonia. Results of the present study indicate that there is no dialect-specific effect between Northern Standard German and Swabian. In contrast, Swabian parkinsonian subjects show compression both in rising and falling nuclear pitch accents. Further investigations of the timing concept (alignment) of the H* peak in monosyllabic test items with nuclear falling accents (H*L) reveal different timing concepts of Parkinsonian subjects as compared to healthy control subjects.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-41"
  },
  "contini02_speechprosody": {
   "authors": [
    [
     "Michel",
     "Contini"
    ],
    [
     "Jean-Pierre",
     "Lai"
    ],
    [
     "Antonio",
     "Romano"
    ],
    [
     "Stefania",
     "Roullet"
    ],
    [
     "Lurdes de Castro",
     "Moutinho"
    ],
    [
     "Rosa Lídia",
     "Coimbra"
    ],
    [
     "Urbana Pereira",
     "Bendiha"
    ],
    [
     "Suzana Secca",
     "Ruivo"
    ]
   ],
   "title": "Un projet d’atlas multimédia prosodique de l’espace roman",
   "original": "sp02_227",
   "page_count": 4,
   "order": 42,
   "p1": "227",
   "pn": "230",
   "abstract": [
    "This paper is about a starting project, which involves already more than 10 laboratories from Latin European countries. Here are summarized some basic points of our methodology as a guideline for the organization and normalization of research to come. In this Conference we would like to present some beta results obtained by the research teams of the Universities of Grenoble and Aveiro of some of the Romance Varieties already taken into account.\n",
    "Remark: The full paper is written in French.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-42"
  },
  "cutugno02_speechprosody": {
   "authors": [
    [
     "Francesco",
     "Cutugno"
    ],
    [
     "L.",
     "D’Anna"
    ],
    [
     "M.",
     "Petrillo"
    ],
    [
     "E.",
     "Zovato"
    ]
   ],
   "title": "APA: towards an automatic tool for prosodic analysis",
   "original": "sp02_231",
   "page_count": 4,
   "order": 43,
   "p1": "231",
   "pn": "234",
   "abstract": [
    "In this paper a tool for the speech signal prosodic analysis is described. The system APA (Automatic Prosodic Analysis) is based on a tool for speech segmentation into syllabic units and on their description in terms of pitch, energy and duration. A particular linear stylization of the fundamental frequency function is proposed, which helps in describing efficiently intonation movements at phrase level. Finally the energy information, together with the F0 information, are used to find intonation boundary markers in order to segment speech into tone units. A general description of the tool is provided and recent results are reported. Future works in this field are also announced.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-43"
  },
  "dainora02_speechprosody": {
   "authors": [
    [
     "Audra",
     "Dainora"
    ]
   ],
   "title": "Does intonational meaning come from tones or tunes? evidence against a compositional approach",
   "original": "sp02_235",
   "page_count": 4,
   "order": 44,
   "p1": "235",
   "pn": "238",
   "abstract": [
    "The interaction between tones in a corpus is analyzed using conditional probability and mutual information, and a probabilistic model of intonation in American English is presented. The last pitch accent in the final intermediate phrase is found to be a strong predictor of boundary tone; this is modeled as a second order Markov process. The implications of these results for the compositional theory of intonational meaning of Pierrehumbert and Hirschberg (1990) are discussed. The conclusion is reached that the tones in a tune are interrelated in a way that a model that assigns separate meaning to each tone cannot capture.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-44"
  },
  "delaisroussarie02_speechprosody": {
   "authors": [
    [
     "Elisabeth",
     "Delais-Roussarie"
    ],
    [
     "A.",
     "Rialland"
    ],
    [
     "Jenny",
     "Doetjes"
    ],
    [
     "J. M.",
     "Marandin"
    ]
   ],
   "title": "The prosody of post-focus sequences in French",
   "original": "sp02_239",
   "page_count": 4,
   "order": 45,
   "p1": "239",
   "pn": "242",
   "abstract": [
    "In French, the prosody associated with post-focus sequences is usually described a steadily flat, the suppression of any tonal variation being explained by the semantic and pragmatic content of these sequences. This paper aims to show that postfocus sequences may be realized in different ways. An experimental analysis of various post-focus sequences has shown that three distinct prosodic realizations may be distinguished, each realization being constraint along two dimensions: the length of the post-focus sequences, i.e. its metrical organization; the information conveyed by the sequence, and more specifically its relation to the discourse topic organization and the discourse status of the discourse referent the sequence contains.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-45"
  },
  "delmonte02_speechprosody": {
   "authors": [
    [
     "Rodolfo",
     "Delmonte"
    ]
   ],
   "title": "A prosodic module for self-learning activities",
   "original": "sp02_243",
   "page_count": 4,
   "order": 46,
   "p1": "243",
   "pn": "246",
   "abstract": [
    "We created an application specialized in prosodic tutoring, called the Prosodic Module(PM). The PM is composed of two different sets of Learning Activities, the first one dealing with prosodic problems at word syllabic level, the second one dealing with prosodic problems at phonological phrase and utterance level. The PM is able to detect significant deviations from a master's word/ phrase/ utterance and offers visual aids and a written diagnosis of the problem as well as indications on how to overcome and correct the error. This is achieved by means of a comparison between the two signals, the master and the student one; elements of comparison are constituted by the acoustic correlates of well-known prosodic elements such as intonational contour, sentence accent and word stress, duration at syllable, word and sentence level. We argue that the use of Automatic Speech Recognition as Teaching Aid should be targeted to narrowly focussed spoken exercises, for intermediate or higher level students, disallowing open-ended dialogues, in order to ensure consistency of evaluation. In addition, we support the conjoined use of ASR technology and prosodic tools to gauge Goodness of Pronunciation for linguistically consistent feedback.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-46"
  },
  "doetjes02_speechprosody": {
   "authors": [
    [
     "Jenny",
     "Doetjes"
    ],
    [
     "Elisabeth",
     "Delais-Roussarie"
    ],
    [
     "Petra",
     "Sleeman"
    ]
   ],
   "title": "The prosody of left detached constituents in French",
   "original": "sp02_247",
   "page_count": 4,
   "order": 47,
   "p1": "247",
   "pn": "250",
   "abstract": [
    "It is widely accepted that the prosodic realization of an utterance is sensitive to syntactic and pragmatic information. A one to one mapping between intonational patterns and the syntactic and pragmatic dimensions may be more questionable. In this paper, we investigate the intonation patterns associated with nonfocal left detached constituents in French in order to determine the weight of syntax and discourse information in selecting the intonation of these constituents.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-47"
  },
  "dohalskazichova02_speechprosody": {
   "authors": [
    [
     "Marie",
     "Dohalská-Zichová"
    ]
   ],
   "title": "Rythme - le \"barrage\" pour la perception des noms propres",
   "original": "sp02_251",
   "page_count": 4,
   "order": 48,
   "p1": "251",
   "pn": "254",
   "abstract": [
    "The need for effective perception of pronounced proper names in many situations of professional contact was the inspiration for this research, which focuses on perception/misperception of French names by Czech students of Translatology. The cardinal problem does not lie on segmental level, but in prosody, namely in the domain of rhythm, which shows considerable differences in the two languages. The present-day life exposes us to a large range of different situations where both a correct realization and a successful perception of foreign proper names is an absolute necessity.\n",
    "Remark: The full paper is written in French.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-48"
  },
  "durand02_speechprosody": {
   "authors": [
    [
     "P.",
     "Durand"
    ],
    [
     "A.",
     "Durand-Deska"
    ],
    [
     "Ryszard",
     "Gubrynowicz"
    ],
    [
     "B.",
     "Marek"
    ]
   ],
   "title": "Polish: prosodic aspects of \"czy\" questions",
   "original": "sp02_255",
   "page_count": 4,
   "order": 49,
   "p1": "255",
   "pn": "258",
   "abstract": [
    "The paper addresses the problem of the intonation of interrogative sentences with the \"yes-no\" question word \"czy..\". The final aim of the analysis is to modify a diphone synthesis program for man-machine dialogue in Polish, which is to be applied in vocal servers. Thus the task requires determining all of the prosodic cues accompanying this kind of sentences and selecting those which allow such dialogue to be successful..\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-49"
  },
  "ehrette02_speechprosody": {
   "authors": [
    [
     "T.",
     "Ehrette"
    ],
    [
     "N.",
     "Chateau"
    ],
    [
     "Christophe",
     "d’Alessandro"
    ],
    [
     "V.",
     "Maffiolo"
    ]
   ],
   "title": "Prosodic parameters of perceived emotions in vocal server voices",
   "original": "sp02_259",
   "page_count": 4,
   "order": 50,
   "p1": "259",
   "pn": "262",
   "abstract": [
    "This paper investigates the relationship between perceptive and acoustic spaces describing a group of voices. The aim is to study possible correlations between prosodic parameters and the perceived quality of voices. Experiments are based on a set of 100 sentences recorded by 20 professional female speakers. A perceptual experiment aims at defining a set of relevant adjectives (or \"attributes\") for voice quality description (20 attributes are retained). Acoustic prosodic analysis is performed on the same corpus (23 parameters are used; mainly based on pitch, durations and energy). Then correlations between acoustic parameters and perceived attributes are computed. The results show that for some attributes, one can find a strong correlation with prosodic acoustic parameters (for about 13 attributes out of 20). However, for some attributes, these correlations are rather low, and more detailed investigations seem necessary in order to characterize perceived attributes in terms of acoustic parameters.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-50"
  },
  "romera02_speechprosody": {
   "authors": [
    [
     "Gorka Elordieta (1). Magdalena",
     "Romera"
    ]
   ],
   "title": "Prosody and meaning in interaction: the case of the Spanish discourse functional unit entonces 'then'",
   "original": "sp02_263",
   "page_count": 4,
   "order": 51,
   "p1": "263",
   "pn": "266",
   "abstract": [
    "It is widely accepted in the literature that Discourse Functional Units (a.k.a. discourse markers, connectors, pragmatic particles) often show prosodic properties of separate intonation units and are also phonologically reduced. In this paper we investigate these hypotheses in the use of entonces ‘then’ in spoken Castilian Spanish. Acoustic measurements show that entonces is not an independent prosodic unit in the sense established by [10] and that it appears to be more closely linked to the following proposition than to the preceding one. The F0 contour of entonces is conditioned by the type of argument expressed in the proposition following it. The results also indicate that there is no significant phonological reduction in the use of entonces in the majority of cases.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-51"
  },
  "erdem02_speechprosody": {
   "authors": [
    [
     "Caglayan",
     "Erdem"
    ],
    [
     "Hans Georg",
     "Zimmermann"
    ]
   ],
   "title": "Soft input feature selection within neural prosody generation",
   "original": "sp02_267",
   "page_count": 4,
   "order": 52,
   "p1": "267",
   "pn": "270",
   "abstract": [
    "The analysis and selection of input features within machine learning techniques is an important problem if a new system has to be established or the system has to be trained for a new task. Within a Text-to-Speech (TTS) application this task has to be handled while adapting a system to a new language or a new speaker. In this paper a parameterized data-driven weight decay [1] is presented and applied in order to systematically analyze phonetic and linguistic input features of a neural network (NN). The NN models an acoustic prosody generation module of our TTS system Papageno. The original NN is enhanced by an additional preprocessing unit. The input features are propagated by a diagonal matrix to a preprocessing cluster. This diagonal matrix is the only one which utilizes the weight decay technique. So the elements of this matrix describe a weighing of the input features. The application resulted in an evaluation of input parameters and a strong reduction of input features without performance loss. Within our F0-contour generation module the squared error of the NN is remarkably reduced by 13%.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-52"
  },
  "erdem02b_speechprosody": {
   "authors": [
    [
     "Caglayan",
     "Erdem"
    ],
    [
     "Hans Georg",
     "Zimmermann"
    ]
   ],
   "title": "Duration control by asymmetric causal retro-causal neural networks",
   "original": "sp02_271",
   "page_count": 4,
   "order": 53,
   "p1": "271",
   "pn": "274",
   "abstract": [
    "The generation of pleasant prosody parameters is very important for speech synthesis. A prosody generation unit can be seen as a dynamical system.\n",
    "In this paper sophisticated time-delay recurrent neural network (NN) topologies are presented which can be used for the modeling of dynamical systems. Within the prosody prediction task left and right context information is known to influence the prediction of prosody control parameters. This can be modeled by causal retro-causal information flows. Since information being available during training is partially unavailable during application, there is a structural switching from training to application. This structural change of the information flow is handled by two asymmetric architectures.\n",
    "These proposed new architectures allow the integration of further a priori knowledge. By this we are able to improve the performance of our duration control unit within our textto- speech (TTS) system Papageno.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-53"
  },
  "eriksson02_speechprosody": {
   "authors": [
    [
     "Anders",
     "Eriksson"
    ],
    [
     "Esther",
     "Grabe"
    ],
    [
     "Hartmut",
     "Traunmüller"
    ]
   ],
   "title": "Perception of syllable prominence by listeners with and without competence in the tested language",
   "original": "sp02_275",
   "page_count": 4,
   "order": 54,
   "p1": "275",
   "pn": "278",
   "abstract": [
    "In an experiment reported previously, subjects rated perceived syllable prominence in a Swedish utterance produced by ten speakers at various levels of vocal effort. The analysis showed that about half of the variance could be accounted for by acoustic factors. Slightly more than half could be accounted for by linguistic factors. Here, we report two additional experiments. In the first, we attempted to eliminate the linguistic factors by repeating the Swedish listening experiment with English listeners who had no knowledge of Swedish. In the second, we investigated the prominence pattern Swedish subjects expect by presenting the utterance only in written form. The results from these subjects and from the Swedish listeners were very similar but for two of the syllables where the prominence pattern did not coincide with the expectations of the readers. Swedish and English listeners perceived the prominence of the syllables to be almost identical in most cases, but where there was a conflict between expected and produced prominence, the Swedish listeners appeared to be influenced by their expectations. There was also a difference in the weights the Swedish and English listeners attached to different acoustic cues in the listening experiments.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-54"
  },
  "fagyal02_speechprosody": {
   "authors": [
    [
     "Zsuzsanna",
     "Fagyal"
    ]
   ],
   "title": "Tonal template for background information: the scaling of pitch in utterance-medial parentheticals in French",
   "original": "sp02_279",
   "page_count": 4,
   "order": 55,
   "p1": "279",
   "pn": "282",
   "abstract": [
    "This paper shows that utterance-medial parentheticals elicited in controlled conditions in French have a typical tonal template, in which pitch is scaled down to some extent in non-intonational phrase-final syllables. Downscaling is implemented primarily as pitch register lowering, while pitch range compression seems speaker-dependent. Results also show remarkable inter-speaker consistency in lowering pitch in edge syllables of minor prosodic units. It is suggested that parentheticals represent a case of ‘extreme’ backgrounding of information, which leads to a more uniform treatment of otherwise gradient pitch range variations.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-55"
  },
  "fant02_speechprosody": {
   "authors": [
    [
     "Gunnar",
     "Fant"
    ],
    [
     "Anita",
     "Kruckenberg"
    ],
    [
     "Kjell",
     "Gustafson"
    ],
    [
     "Johan",
     "Liljencrants"
    ]
   ],
   "title": "A new approach to intonation analysis and synthesis of Swedish",
   "original": "sp02_283",
   "page_count": 4,
   "order": 56,
   "p1": "283",
   "pn": "286",
   "abstract": [
    "The main body of our study derives from the processing of 5 subjects’ reading of a corpus from a Swedish novel. Two of the subjects were females. Intonation contours on a log frequency scale have been sampled and normalised to eliminate differences in mean tonal level and duration. As a result, intonation patterns across speakers are brought out revealing individual performances as well as group average data. A second part of our study has been to develop rules for predicting intonation contours and associated acoustic parameters from a superposition model. Syntactically determined prosodic sentence and phrase contours with associated juncture specifications are selected as a basic frame. Local word accent 1 and accent 2 modulations are added. These as well as phoneme durations are quantified with respect to a continuously scaled and lexically determined prominence parameter, Rs, and with respect to context and position within an utterance.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-56"
  },
  "faraco02_speechprosody": {
   "authors": [
    [
     "Martine",
     "Faraco"
    ],
    [
     "Tsuyoshi",
     "Kida"
    ],
    [
     "Marie-Laure",
     "Barbier"
    ],
    [
     "Annie",
     "Piolat"
    ]
   ],
   "title": "Didactic prosody and notetaking in L1 and L2",
   "original": "sp02_287",
   "page_count": 4,
   "order": 57,
   "p1": "287",
   "pn": "290",
   "abstract": [
    "Students' notetaking in first (L1) and second languages (L2) are observed, comparing them with the lecturer’s speech prosody. This exploratory analysis displays a complex link between the information noted, the notetaker’s linguistic competence and the didactic prosody.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-57"
  },
  "fernandez02_speechprosody": {
   "authors": [
    [
     "Raul",
     "Fernandez"
    ],
    [
     "Rosalind W.",
     "Picard"
    ]
   ],
   "title": "Dialog act classification from prosodic features using support vector machines",
   "original": "sp02_291",
   "page_count": 4,
   "order": 58,
   "p1": "291",
   "pn": "294",
   "abstract": [
    "In this work we investigate the use of support vector machines (SVMs) and discriminative learning techniques on the task of automatic classification of dialogue acts (DAs) from prosodic cues. We implement and test these classifiers on solving an 8- DA classification task on the Spanish CallHome database and report preliminary recognition rates of 47.3% with respect to a 20.4% chance-level rate, which represents an improvement over previously reported work using decision trees and neural network classifiers. Although prosodic cues alone may not suf- fice for robust classification of DAs, we report results that suggest that SVMs offer an interesting alternative to previously explored models, and should be further explored to improve the contribution of prosodic models to the classification task.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-58"
  },
  "fletcher02_speechprosody": {
   "authors": [
    [
     "Janet",
     "Fletcher"
    ],
    [
     "Nicholas",
     "Evans"
    ],
    [
     "Erich",
     "Round"
    ]
   ],
   "title": "Left-edge tonal events in Kayardild (australian) - a typological perspective",
   "original": "sp02_295",
   "page_count": 4,
   "order": 59,
   "p1": "295",
   "pn": "298",
   "abstract": [
    "To date, most intonational typologies have been formulated on the basis of an analysis of a handful of the world s languages. In this study, intonational patterns were examined in an indigenous Australian language, Kayardild. This language appears to differ from other languages of the region in that intonation is not solely delimitative, and a wider variety of phrasal melodies are also observed, particularly at the left edge of intonational units. Moreover, the placement of certain intonational events gives rise to certain pragmatic or semantic nuances, suggesting that the intonational typology of the language is quite different from its geographical near-neighbours.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-59"
  },
  "fletcher02b_speechprosody": {
   "authors": [
    [
     "Janet",
     "Fletcher"
    ],
    [
     "Roger",
     "Wales"
    ],
    [
     "Lesley",
     "Stirling"
    ],
    [
     "Ilana",
     "Mushin"
    ]
   ],
   "title": "A dialogue act analysis of rises in australian English map task dialogues",
   "original": "sp02_299",
   "page_count": 4,
   "order": 60,
   "p1": "299",
   "pn": "302",
   "abstract": [
    "Uptalk or rising intonation is a distinctive feature of Australian English. The distribution and discourse functions of simple and complex rising tunes were examined in a corpus of Australian English map task dialogues. Dialogue acts (classified using DAMSL) corresponding to information requests were consistently realized as high-onset high rises whereas low-onset high rises corresponded to a wider range of forward-looking communicative functions, such as statements and action directives, but were rarely associated with information requests. Two kinds of fall-rise tunes were also observed: low-range and high-range fall-rise. The high-range fallrises shared similar dialogue functions with statement high rises and were almost never associated with yes/no questions. Low-range fall-rises were associated with the same kinds of functions as simple low rises, such as acknowledgements and answers, i.e. backward-looking dialogue acts. The Australian English statement high rise (usually realized as a L* H-H% tune) is clearly not the same tune as a yes-no question rise in this variety, and is used, along with the high-range fall-rise, as a co-operative device in the map task.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-60"
  },
  "francusik02_speechprosody": {
   "authors": [
    [
     "Katarzyna",
     "Francusik"
    ],
    [
     "Maciei",
     "Karpinkski"
    ],
    [
     "Janusz",
     "Klesta"
    ]
   ],
   "title": "A preliminary study of the intonational phrase, nuclear melody and pauses in Polish semi-spontaneous narration",
   "original": "sp02_303",
   "page_count": 4,
   "order": 61,
   "p1": "303",
   "pn": "306",
   "abstract": [
    "This paper contains preliminary observations concerning the properties of the intonational phrase, the nuclear melody, and pauses in semi-spontaneous texts of short narratives in Polish.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-61"
  },
  "fretheim02b_speechprosody": {
   "authors": [
    [
     "Thorstein",
     "Fretheim"
    ],
    [
     "Wim A. van",
     "Dommelen"
    ]
   ],
   "title": "Norwegian intonation and the resolution of concessive anaphora",
   "original": "sp02_307",
   "page_count": 4,
   "order": 62,
   "p1": "307",
   "pn": "310",
   "abstract": [
    "The present paper reports on a listening comprehension test in which the subjects’ task was to decide whether they felt there was an intended causal relation or an intended concessive relation between the conditional clause proposition and the main clause proposition expressed in a set of Norwegian spoken conditionals. In order to do that they had to select a context that would enable them to resolve the reference of the Norwegian concessive anaphor likevel (‘nevertheless’ or ‘after all’) which occurred in the main clause of each stimulus. We wanted to test the strength of various phonologically discrete prosodic cues relative to the importance of differences in the linear order of syntactic constituents or the occurrence of certain function words in the utterance. The prosodic features proved to be remarkably robust cues to the activation of a specific context. Not only did we find that stimuli which differed only in their prosodic form displayed consistent differences in the test subjects’ response patterns but we even found that prosodic features at the utterance level can neutralize the effect of function words that would otherwise help the hearer activate a contrasting context for utterance interpretation (paragraphs 3.1. and 3.3.).\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-62"
  },
  "friedrich02_speechprosody": {
   "authors": [
    [
     "Claudia K.",
     "Friedrich"
    ],
    [
     "Sonja A.",
     "Kotz"
    ],
    [
     "Angela D.",
     "Friederici"
    ],
    [
     "Kai",
     "Alter"
    ]
   ],
   "title": "Pitch contour guides spoken word recognition",
   "original": "sp02_311",
   "page_count": 4,
   "order": 63,
   "p1": "311",
   "pn": "314",
   "abstract": [
    "Three experiments investigated the processing of pitch contour during spoken word recognition. In Experi- ment 1 event-related brain potentials (ERPs) were recorded while subjects made decisions to artificially pitch manipulated bisyllabic words. ERPs revealed that pitch contours are discriminated already within the first syllable of a word. In Experiment 2 subjects heard spoken word-initial syllables with re- synthesized pitch contours and were asked to name a word starting with that syllable. They answered more likely with an initially stressed word if the syllable carried a stressed pitch contour. However, if the same syllable carried an unstressed pitch contour, subjects more frequently responded with an initially unstressed word. In a cross-modal priming paradigm we pre- sented pitch modulated initial syllables as auditory primes followed by visual targets (Experiment 3). Reaction times as well as ERPs were found to be sen- sitive to pitch information. Taken together the results indicate that pitch is automatically extracted during spoken word recognition and that this prosodic pa- rameter guides lexical access.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-63"
  },
  "frota02_speechprosody": {
   "authors": [
    [
     "Sónia",
     "Frota"
    ]
   ],
   "title": "The prosody of focus: a case-study with cross-linguistic implications",
   "original": "sp02_315",
   "page_count": 4,
   "order": 64,
   "p1": "315",
   "pn": "318",
   "abstract": [
    "It is well-known that focus may have a prosodic reflection in various languages, affecting prosodic phrasing, prominence and/or intonation. However, the issue whether there is any relationship among the different kinds of prosodic marking remains unclear. This paper presents a detailed examination of the prosody of focus in European Portuguese. It is shown that there are no phrasing effects of focus; by contrast, phrasal stress and tonal events play a crucial role in the expression of focus. Implications of these findings for a cross-linguistic understanding of focus prosody are explored, namely it is argued that the prosodic reflexes are not universal, or arbitrary.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-64"
  },
  "frota02b_speechprosody": {
   "authors": [
    [
     "Sónia",
     "Frota"
    ],
    [
     "Marina",
     "Vigário"
    ],
    [
     "Fernando",
     "Martins"
    ]
   ],
   "title": "Language discrimination and rhythm classes: evidence from Portuguese",
   "original": "sp02_319",
   "page_count": 4,
   "order": 65,
   "p1": "319",
   "pn": "322",
   "abstract": [
    "This paper reports on two discrimination experiments involving Portuguese data. The findings support the prosodic contrast between EP and BP and stress the role played by intonation in this contrast. They also show that the perceptual distance between EP and BP is smaller than that between EP and Dutch. The robust distinction between EP and Dutch provides evidence for different perceptual weights of acoustic parameters, and points to the syllable-timed nature of EP.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-65"
  },
  "galves02_speechprosody": {
   "authors": [
    [
     "Antonio",
     "Galves"
    ],
    [
     "Jesus",
     "Garcia"
    ],
    [
     "Denise",
     "Duarte"
    ],
    [
     "Charlotte",
     "Galves"
    ]
   ],
   "title": "Sonority as a basis for rhythmic class discrimination",
   "original": "sp02_323",
   "page_count": 4,
   "order": 66,
   "p1": "323",
   "pn": "326",
   "abstract": [
    "Recently, several papers, starting with Ramus, Nespor and Mehler (1999), gave evidence that simple statistics of the speech signal could discriminate between different rhythmic classes.In the present paper, we propose a new approach to the problem of finding acoustic correlates of the rhythmic classes. Its main ingredient is a rough measure of sonority defined directly from the spectrogram of the signal. This approach has the major advantage that it can be implemented in an entirely automatic way, with no need of previous hand-labelling of the acoustic signal. Applied to the same linguistic samples considered in RNM, it produces the same clusters corresponding to the three conjectured rhythmic classes.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-66"
  },
  "garcia02_speechprosody": {
   "authors": [
    [
     "Jesus",
     "Garcia"
    ],
    [
     "Ulrike",
     "Gut"
    ],
    [
     "Antonio",
     "Galves"
    ]
   ],
   "title": "Vocale - a semi-automatic annotation tool for prosodic research",
   "original": "sp02_327",
   "page_count": 4,
   "order": 67,
   "p1": "327",
   "pn": "330",
   "abstract": [
    "Large annotated speech corpora are a critical component of research in prosody. The classification of languages according to their speech rhythm, for example, requires a great number of annotated sentences by different speakers in different languages. We have developed Vocale, a tool for the semiautomatic annotation of vocalic and consonantal parts of speech because in recent models these units have been identified as reliable acoustic correlates of speech rhythm. Vocale is based on relative entropy and uses various additional classifiers such as energy and length for the annotation of vowels and consonants. It runs using Praat speech analysis facilities and gives a Praat label file as an output. Vocale is open source software and is available to the scientific community under http://www.ime.usp.br/~tycho/tipal/prosody/vocale/.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-67"
  },
  "ghazali02_speechprosody": {
   "authors": [
    [
     "Salem",
     "Ghazali"
    ],
    [
     "Rym",
     "Hamdi"
    ],
    [
     "Melissa",
     "Barkat"
    ]
   ],
   "title": "Speech rhythm variation in Arabic dialects",
   "original": "sp02_331",
   "page_count": 4,
   "order": 68,
   "p1": "331",
   "pn": "334",
   "abstract": [
    "Speech rhythm in the different Arabic dialects investigated has been consistently described as stress-timed. At the same time, there is preliminary evidence from perceptual experiments that listeners use speech rhythm cues to distinguish speakers from North Africa from those of the Middle East. In an attempt to elucidate the apparent contradiction, an acoustic investigation of the proportion of vocalic intervals and the standard deviation of consonantal intervals in six dialects (Morocco, Algeria, Tunisia, Egypt, Syria and Jordan) was carried out using procedures put forth by Ramus & al [1]. The results show that complex syllable and reduced vowels in the Western dialects , and longer vowels in the Eastern dialects seem to be the main factors responsible for differences in rhythmic structures. The paper also raises questions about the discrete or continuous natures of rhythm types.\n",
    "",
    "",
    "Ramus, F.; Nespor, M.; Mehler, J., 1999. Correlates of linguistic rhythm in the speech signal. (Available from URL: http://www.ehess.fr/lscp/persons/ramus/pub.htm.)\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-68"
  },
  "gibbon02_speechprosody": {
   "authors": [
    [
     "Dafydd",
     "Gibbon"
    ]
   ],
   "title": "Prosodic information in an integrated lexicon",
   "original": "sp02_335",
   "page_count": 4,
   "order": 69,
   "p1": "335",
   "pn": "338",
   "abstract": [
    "A Integrated Lexicon framework is proposed for combining insights from current separate prosodic research paradigms (language resource creation, experimental psycholinguistics, rules for speech synthesis, sentence search space restriction in speech recognition, prosody in discourse, emotional prosody) in the medium term into work in general and computational linguistics. Three principles for integrating autonomous prosodic information into the lexicon are proposed (the Compositionality Principle, the Semiotic Principle, and the Metalocutionary Principle), and used as a framework for developing hierarcical attribute-value (AV) lexical representations for nuclear contours and the prosody of discourse particles.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-69"
  },
  "gilifivela02_speechprosody": {
   "authors": [
    [
     "Barbara",
     "Gili Fivela"
    ]
   ],
   "title": "Tonal alignment in two pisa Italian peak accents",
   "original": "sp02_339",
   "page_count": 4,
   "order": 70,
   "p1": "339",
   "pn": "342",
   "abstract": [
    "A read speech corpus was collected in order to study the tonal targets alignment of two Pisa Italian peak accents. The production of the two accents was forced by inducing a broad and a contrastive interpretation of the target words inserted in small paragraphs. Results of latency and F0 measurements reveal that the contrastive accent has a low target at a 'fixed' distance after the peak whereas the broad focus accent has a target which is influenced by the postaccentual context. Moreover, both broad and contrastive accents are preceded by a low target at a 'fixed' difference from the peak. The interpretation of this target remains provisional and the resulting analysis is [L+]H* for the broad focus accent and [L+]H*+L for the contrastive accent, both followed by a low edge tone.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-70"
  },
  "grabe02b_speechprosody": {
   "authors": [
    [
     "Esther",
     "Grabe"
    ],
    [
     "Brechtje",
     "Post"
    ]
   ],
   "title": "Intonational variation in the british isles",
   "original": "sp02_343",
   "page_count": 4,
   "order": 71,
   "p1": "343",
   "pn": "346",
   "abstract": [
    "Models of intonation are typically based on one dialect and one style and do not account for inter- or intra-speaker variability. Speech data from the IViE corpus, however, demonstrate considerable variation in English intonation that occurs both across and within dialects (IViE = Intonational Variation in English, UK ESRC award R000237145, http://www.phon.ox.ac.k/~esther/ivyweb). In this paper, we introduce the IViE corpus and present a selection of findings. Concentrating on nuclear accents, we provide evidence for (1) variation in the production of nuclear accent types and (2) variation in the phonetic realisation of nuclear accents. We discuss data from seven dialects. The results show that intonational differences between dialects of one language can be greater than intonational differences between dialects of two different languages. They also show that there is considerable intra-dialectal variation.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-71"
  },
  "granstrom02_speechprosody": {
   "authors": [
    [
     "Björn",
     "Granström"
    ],
    [
     "David",
     "House"
    ],
    [
     "Marc",
     "Swerts"
    ]
   ],
   "title": "Multimodal feedback cues in human-machine interactions",
   "original": "sp02_347",
   "page_count": 4,
   "order": 72,
   "p1": "347",
   "pn": "350",
   "abstract": [
    "This paper reports on an experiment, whose goal it was to explore the relevance of both acoustic and visual cues for signaling ‘negative’ or ‘affirmative’ feedback in a conversation. Using the WaveSurfer software developed at CTT, the stimuli were created by orthogonally varying 6 parameters (4 visual and 2 acoustic ones), which always had two settings: one which was hypothesised to lead to affirmative feedback responses, and one which was hypothesised to lead to negative responses. Listeners were told that they were going to see and hear a series of exchanges between a talking head, representing a travel agent, and a human who wants to make a booking with the agent. They had to imagine that they were standing beside the human, and they were witnessing a fragment of a longer dialogue exchange. Their task was to rate this fragment in terms of whether the agent signals that he understands and accepts the human utterance, or whether the agent signals that he is uncertain about the human utterance. Results show that listeners are sensitive to both the visual and acoustic features when judging the utterances in terms of their function as feedback signals. Four of the six parameters had significant influence on the judgements, with Smile and F0 as the most prominent, followed by Eyebrow and Head_movement. Eye_closure and Delay contributed only marginally to the judgements but the tendency was in the expected direction.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-72"
  },
  "greenberg02_speechprosody": {
   "authors": [
    [
     "Steven",
     "Greenberg"
    ],
    [
     "Hannah",
     "Carvey"
    ],
    [
     "Leah",
     "Hitchcock"
    ]
   ],
   "title": "The relation between stress accent and pronunciation variation in spontaneous american English discourse",
   "original": "sp02_351",
   "page_count": 4,
   "order": 73,
   "p1": "351",
   "pn": "354",
   "abstract": [
    "There is a systematic relationship between stress accent and pronunciation variation in spontaneous American English discourse. Although all constituents of the syllable are affected by accent, its impact is particularly manifest in the nucleus and coda. For example, height of the vocalic nucleus is closely associated with accent weight, and deletion of coda and onset segments is far more common in unaccented syllables. Such patterns imply that stress accent and syllabic articulation are inextricably bound together, and this knowledge could be used to improve pronunciation models for speech applications.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-73"
  },
  "grnnum02_speechprosody": {
   "authors": [
    [
     "Nina",
     "Grønnum"
    ],
    [
     "Hans",
     "Basbøll"
    ]
   ],
   "title": "Stød and length: acoustic and cognitive reality?",
   "original": "sp02_355",
   "page_count": 4,
   "order": 74,
   "p1": "355",
   "pn": "358",
   "abstract": [
    "Three questions in the analysis of Danish stød are addressed. (1) We try and establish an acoustic reality behind a proposed phonological analysis of consonants with stød as long (moraic) in opposition to short stødless (non-moraic) consonants and fail. (2) Vowels with stød are phonologically long; they are proposed also to be bi-moraic, with the second mora carrying the stød. We confirm the acoustic reality of length, but a moderate tendency only to acoustic bi-partition. (3) In a perceptual experiment vowels with stød were paired with long stødless vowels by half the subjects, whereas the other half paired syllables with stød, irrespective of vowel length. This is a good point of departure for an experiment to find out whether vowels with stød are cognitively bi-partite.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-74"
  },
  "gubrynowicz02_speechprosody": {
   "authors": [
    [
     "Ryszard",
     "Gubrynowicz"
    ]
   ],
   "title": "A study of speech prosody of subjects with profound hearing loss recorded at child age and 20 years later",
   "original": "sp02_359",
   "page_count": 4,
   "order": 75,
   "p1": "359",
   "pn": "362",
   "abstract": [
    "The aim of the present work was to test the comprehension and production of prosodic events by prelingual deaf children trained in oral communication with reference to several groups of control subjects (hearing-impaired, normal hearing ones). The recorded database children speech contains several lists of sentences of different linguistic form and function. The most developed studies concerned the group of profoundly deaf children after 5 years of regular oral language education by a new experimental method without the use of sign language. This group recorded these lists of sentences at the end of the education and 20 years later at adult age. The analysis was aimed at the tonal level of the speech and its temporal parameters. The main question was whether it is possible to teach deaf children to correctly control the prosodic inflections of F0 and the variations of segmental duration. The results of education were verified at adult age, 20 years later and they indicate that this group of profoundly deaf subject are still able to reproduce correctly the pitch contours as they result from the phonosyntactic models of Polish intonation. The speaking rate at adult age is shorter than it was at child age. This results from 20 years of practice using speech for communication.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-75"
  },
  "gustafsoncapkova02_speechprosody": {
   "authors": [
    [
     "Sofia",
     "Gustafson-Capková"
    ],
    [
     "Beáta",
     "Megyesi"
    ]
   ],
   "title": "Silence and discourse context in read speech and dialogues in Swedish",
   "original": "sp02_363",
   "page_count": 4,
   "order": 76,
   "p1": "363",
   "pn": "366",
   "abstract": [
    "In this study, we investigate the correlation between silent pauses and discourse boundaries in the notion of theme shift. We examine three speaking styles in Swedish: professional and non-professional reading, and elicited spontaneous dialogues. Considerable attention is given to the syntactic and discourse context in which pauses appear, as well as the characteristics of the discourse structure in terms of pauses.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-76"
  },
  "gut02_speechprosody": {
   "authors": [
    [
     "Ulrike",
     "Gut"
    ],
    [
     "Jan-Torsten",
     "Milde"
    ]
   ],
   "title": "The prosody of Nigerian English",
   "original": "sp02_367",
   "page_count": 4,
   "order": 77,
   "p1": "367",
   "pn": "370",
   "abstract": [
    "Nigerian English is a variety of English which has often been suggested to differ significantly from other varieties of English, especially in the area of prosody. This paper analyses the prosody of Nigerian English and compares it to the prosody of British English and three West African tone languagesi. Read and semi-spontaneous speech was analysed acoustically. Significant differences were found in speech rhythm, where Nigerian English groups between the West African languages Anyi, Ega and Ibibio and British English. Furthermore, Nigerian English syllable structure is different from that of British English, and the tonal structure of Nigerian English is more similar to that of a tone language than an intonation language.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-77"
  },
  "hansson02_speechprosody": {
   "authors": [
    [
     "Petra",
     "Hansson"
    ]
   ],
   "title": "Articulation rate variation in south Swedish phrases",
   "original": "sp02_371",
   "page_count": 4,
   "order": 78,
   "p1": "371",
   "pn": "374",
   "abstract": [
    "In this paper, a study on articulation rate variation within the prosodic phrase is presented. The dialect under investigation is south Swedish. South Swedish shares many prosodic properties with Danish, a language claimed to lack phrasefinal lengthening. The results of the present study nevertheless indicate that the articulation rate in south Swedish phrases is significantly lower in phrase-final words than in preceding words, and that the reduction in articulation rate between successive words in the prosodic phrase is not restricted to the final part of the phrase.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-78"
  },
  "hedberg02_speechprosody": {
   "authors": [
    [
     "Nancy",
     "Hedberg"
    ],
    [
     "Juan M.",
     "Sosa"
    ]
   ],
   "title": "The prosody of questions in natural discourse",
   "original": "sp02_375",
   "page_count": 4,
   "order": 79,
   "p1": "375",
   "pn": "378",
   "abstract": [
    "For this paper, we examined a corpus of 73 wh-questions and yes/no questions, both positive and negative, from natural discourse. We found that the locus of interrogation (the initial auxiliary in yes/no questions or the initial wh-word in whquestions) most frequently gets an L+H* pitch accent, especially in wh-questions and negative yes/no questions. Positive yes/no questions are more variable, and included 40% unstressed auxiliaries. Nuclear stress was primarily falling in wh-questions, as expected; but positive yes/no questions were almost twice as often falling or level as rising, contrary to expectation. Finally, the topic of the question turned out to be marked primarily with some version of an H* accent rather than an L+H* accent, and the focus with L+H* rather than some variant of H*, contrary to predictions in the literature.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-79"
  },
  "hermentdujardin02_speechprosody": {
   "authors": [
    [
     "Sophie",
     "Herment-Dujardin"
    ],
    [
     "Daniel",
     "Hirst"
    ]
   ],
   "title": "Emphasis in English: a perceptual study based on modified synthetic speech",
   "original": "sp02_379",
   "page_count": 4,
   "order": 80,
   "p1": "379",
   "pn": "382",
   "abstract": [
    "A number of utterances were extracted from a set of recordings of spontaneous speech after listeners had judged that they contained one or more emphatic words. Synthetic versions of the utterances were created, neutralising the variability of segmental duration, pitch movement, pauses and semantic content (by a process of delexicalisation). These synthetic stimuli were then rated by native speakers allowing a comparative evaluation of the contribution of the different parameters to the perception of emphasis.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-80"
  },
  "herry02_speechprosody": {
   "authors": [
    [
     "Nadine",
     "Herry"
    ],
    [
     "Daniel",
     "Hirst"
    ]
   ],
   "title": "Subjective and objective evaluation of the prosody of English spoken by French speakers: the contribution of computer assisted learning",
   "original": "sp02_383",
   "page_count": 4,
   "order": 81,
   "p1": "383",
   "pn": "386",
   "abstract": [
    "This paper describes preliminary results from an ongoing project on the subjective and objective evaluation of the prosody of English spoken by French speakers making use of a system of computer-assisted learning for prosody. The system was tested for 6 months and data was analysed with two objectives: on the one hand the subjective evaluation of the prosody of English spoken by French speakers in order to determine the system’s efficiency; on the other hand an objective evaluation attempting to establish a correlation between the level of a French speaker and a number of automatically extracted prosodic parameters. Although the critical statistical interactions we sought did not reach the level of significance, a number of effects suggest that both aspects of the project merit further investigation.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-81"
  },
  "hind02_speechprosody": {
   "authors": [
    [
     "Anthony",
     "Hind"
    ]
   ],
   "title": "Metrical patterns and melodicity in English contrasted with French",
   "original": "sp02_387",
   "page_count": 4,
   "order": 82,
   "p1": "387",
   "pn": "390",
   "abstract": [
    "It is often considered that English is Trochaic at the foot level (and this may explain the tendency to leftward-ho! stress shift at the word level), but that at the higher levels a syntactically based Iambic broad-focus pattern dominates.\n",
    "The presence of Trochaic patterns at the higher level has then either to be explained by information structured stress shifts(de-accentuation of back-ground information, contrastive stress, etc.) or by the application of automatic meaning-neutral rhythm based shifts which avoid the stress clashes that would result from the application of the Iambic patterns (automatic pistol /3020 10/ Æ /2030 10/ ).\n",
    "I will suggest that there is in fact variability between this higher level syntactic based Iambic patterning and one in which the rhythmically based structure (typical of eurhythmic realisations) is trochaic all the way up to the highest level, which alone is Iambic; and this would be very close to the Traditional British \"initial-strong Head + final-strong Tonic\" structure.\n",
    "Contrasting English with French, I also argue that it is necessary to distinguish two types of strongly melodic realisation. The first concerns the organisation of tones within a single Tone Group (intra-contour patterning) typical of the \"chant\" or \"the melodic cliché\" Fonagy [1]. The second concerns the rhythmic organisation of contours between themselves possibly across T.G.s(inter-contour patterning) for which the term \"Sing-songy\", or \"Swinging\" realisation, would seem more appropriate.\n",
    "",
    "",
    "Fonagy, I., et al., 1983. Clichés mélodiques. Societas linguistica Europea, 273-303.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-82"
  },
  "hirose02_speechprosody": {
   "authors": [
    [
     "Keikichi",
     "Hirose"
    ],
    [
     "Nobuaki",
     "Minematsu"
    ],
    [
     "Masaya",
     "Eto"
    ]
   ],
   "title": "Data-driven synthesis of fundamental frequency contours for TTS systems based on a generation process model",
   "original": "sp02_391",
   "page_count": 4,
   "order": 83,
   "p1": "391",
   "pn": "394",
   "abstract": [
    "A data-driven method of fundamental frequency (F0) contour synthesis was developed for Japanese text-to-speech (TTS) conversion systems. In the method, synthesis is done using the F0 contour generation process model, and the model parameters for each accent phrase are estimated using statistical methods. Although it was already shown that the synthesized F0 contours sounded highly natural as those using heuristic rules arranged by experts, occasional low quality happened depending on sentences to be synthesized. In the current paper, information on sentence structure, automatically obtainable through the parsing process, is added to input parameters of the statistical methods to obtain a better estimation. The experimental results showed that the new parameter was effective for improving especially phrase component estimation. Furthermore, data-driven estimation of accent phrase boundaries for input text, a necessary step to realize TTS conversion, was also realized in a similar way. The rate of correct estimation reached 90 %.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-83"
  },
  "hirose02b_speechprosody": {
   "authors": [
    [
     "Keikichi",
     "Hirose"
    ],
    [
     "Nobuaki",
     "Minematsu"
    ],
    [
     "Makoto",
     "Terao"
    ]
   ],
   "title": "N-gram language modeling of Japanese using prosodic boundaries",
   "original": "sp02_395",
   "page_count": 4,
   "order": 84,
   "p1": "395",
   "pn": "398",
   "abstract": [
    "A new method was developed to include prosodic boundary information into statistical language modeling. This method is based on counting word transitions separately for the cases crossing accent phrase boundaries and not crossing them. Since direct calculation of the above two types of word transitions requires a large speech corpus which is practically impossible to make, bi-gram counts of part-of-speech (POS) transitions were first calculated for a small speech corpus separately for the two cases instead. Then, word bi-gram counts calculated for a largescale text corpus were divided into the two cases according to the POS transition feature, and finally, two types of word bigram models, one crossing accent phrase boundaries and the other not, were obtained. The method was evaluated through perplexity reduction by the proposed models from the baseline models. When correct boundary position was used, the reduction reached 11%, and when boundaries were extracted using our formerly developed method based on mora-F0 transition modeling, it was 8%. The reduction around 6% was still observed for speech uttered by a speaker different from the one for the corpus used to calculate the POS bi-gram counts.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-84"
  },
  "holm02_speechprosody": {
   "authors": [
    [
     "B.",
     "Holm"
    ],
    [
     "Gérard",
     "Bailly"
    ]
   ],
   "title": "Learning the hidden structure of intonation: implementing various functions of prosody",
   "original": "sp02_399",
   "page_count": 4,
   "order": 85,
   "p1": "399",
   "pn": "402",
   "abstract": [
    "This paper introduces a new model-constrained, data-driven method to generate prosody from metalinguistic information. We refer here to the general ability of intonation to demarcate speech units and convey information about the propositional and interactional functions of these units within the discourse. Our strong hypothesis are that (1) these functions are directly implemented as prototypical prosodic contours that are coextensive to the unit(s) they apply to, (2) the prosody of the message is obtained by superposing and adding all the contributing contours [2]. We describe here an analysis-bysynthesis scheme that consists in both identifying these prototypical contours and separating out their contributions in the prosodic contours of the training data. The scheme is applied to databases designed to evidence various functions of intonation. Experimental results show that the model generates faithful prosodic contours with very few prototypical movements.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-85"
  },
  "hu02_speechprosody": {
   "authors": [
    [
     "Fang",
     "Hu"
    ]
   ],
   "title": "A prosodic analysis of wh-words in standard Chinese",
   "original": "sp02_403",
   "page_count": 4,
   "order": 86,
   "p1": "403",
   "pn": "406",
   "abstract": [
    "This paper is a phonetic study of prosody of wh-words in whquestions, yes/no-questions and echo questions in Standard Chinese. The production data from 4 speakers show that there is a prosodic difference of wh-words and the corresponding VPs between different question types. Wh-words in whquestions are the focus of sentence, whereas in yes/noquestions, VPs are the focus. The focused constituent is pitch accented so that its lexical tonal melody is retained and sometimes reinforced, while the lexical tonal melody of the corresponding unfocused constituent is compressed and sometimes reduced to a level tone. Speakers usually produce echo questions with a raised F0 register and an expanded F0 range of the wh-words to convey a meaning of surprise. However, no consistent data suggest that either duration or amplitude correlates with the focus vs. non-focus distinction.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-86"
  },
  "ishi02_speechprosody": {
   "authors": [
    [
     "Carlos Toshinori",
     "Ishi"
    ],
    [
     "Keikichi",
     "Hirose"
    ],
    [
     "Nobuaki",
     "Minematsu"
    ]
   ],
   "title": "Using perceptually-related f0- and power-based parameters to identify accent types of accentual phrases",
   "original": "sp02_407",
   "page_count": 4,
   "order": 87,
   "p1": "407",
   "pn": "410",
   "abstract": [
    "Based on a represention of F0 in mora units (F0mora), several parameters and methods were introduced in order to identify accent types of accentual phrases: new candidates for F0mora estimation method; the addition of relative F0mora parameters and relative power parameters; and a new accent type identification method. The candidates for F0mora were investigated in order to find the best matching with the perceived pitch values. As for the relative F0mora parameters, new delta-F0mora parameters were proposed, in order to take phrase contextual effects into account, and to supply additional information in segments with missed F0 data (like in devoiced vowels). Relative power parameters were also investigated, because power also seems to influence in the accent type identification. As for the identification method, neural network models were proposed to find a suitable weighting for each parameter, and a transformation of the input parameters were proposed using Gaussian distributions in order to deal with the parameters with missed data.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-87"
  },
  "ito02_speechprosody": {
   "authors": [
    [
     "Kiwako",
     "Ito"
    ]
   ],
   "title": "Ambiguity in broad focus and narrow focus interpretation in Japanese",
   "original": "sp02_411",
   "page_count": 4,
   "order": 88,
   "p1": "411",
   "pn": "414",
   "abstract": [
    "In languages such as English, German, and Dutch, accentuation on an argument is claimed to be obligatory for the expression of broad focus for the entire phrase carrying new information. In Japanese, which has lexical pitch accents, focus is marked by pitch range expansion instead. This paper examines whether prosodic prominence on just the argument leads to a broad focus interpretation in Japanese as well. Listeners response time and conscious evaluation were measured while they listened to short dialogues. The results show interesting resemblance to those in English reported by Birch and Clifton (1995): as the answer to broad focus questions, listeners judged utterances with pitch range expansion for both the object and the verb as more appropriate than those whose pitch range was expanded for only the object or the verb. However, unlike in Birch and Clifton s results, all three prosodic patterns were accepted equally quickly in the discourse comprehension task. These findings suggest that focus may project from one prominent word to the entire verb phrase in Japanese, but the use of intonation to contrast focus may be restricted in Japanese due to the primary function of pitch accents to contrast lexical meanings.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-88"
  },
  "ito02b_speechprosody": {
   "authors": [
    [
     "Mika",
     "Ito"
    ]
   ],
   "title": "Japanese politeness and suprasegmentals - a study based on natural speech materials",
   "original": "sp02_415",
   "page_count": 4,
   "order": 89,
   "p1": "415",
   "pn": "418",
   "abstract": [
    "This paper discusses some of the problems regarding the unnaturalness of speech data currently used in research on oral Japanese politeness and proposes improved techniques. Two experiments were carried out. First, to extract natural unscripted utterances, within a specific vocabulary and context, the experimental design of the Map Task was employed with the population controlled for social status. Second, to elicit a perception of the level of politeness of spoken Japanese, a rating experiment of formality was conducted. Raters scored the degree of formality of lexically similar but non-identical tokens without any manipulation. Magnitude Estimation (ME) was employed to re- flect the perceived formality. Results from the production side showed that raising the fundamental frequency (F0) or changing speech rate are not always correlated with increasing formality. In the perception experiments, listeners did not show good agreement in their judgement of formality for most stimuli, though some trends were observed in stimuli. Although the speakers produced the utterances with appropriate honorifics, neither F0 nor speech rate seem to be dominant factors for judging formality. Therefore there is a need to explore the interaction between lexical cues and acoustic cues for conveying formality.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-89"
  },
  "kang02_speechprosody": {
   "authors": [
    [
     "Soyoung",
     "Kang"
    ],
    [
     "Shari",
     "Speer"
    ]
   ],
   "title": "Prosody and clause boundaries in Korean",
   "original": "sp02_419",
   "page_count": 4,
   "order": 90,
   "p1": "419",
   "pn": "422",
   "abstract": [
    "This study explores the effect of prosody on the interpretation of temporarily and globally ambiguous sentences in Korean. The head-final and pro-drop nature of Korean can generate both temporary and global ambiguity. Two experiments were conducted to investigate the effect of prosody on these ambiguous strings. Results showed that prosody can influence the meaning recovered from ambiguous string, and can also influence the processing difficulty of a particular syntactic analysis.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-90"
  },
  "kehrein02_speechprosody": {
   "authors": [
    [
     "Roland",
     "Kehrein"
    ]
   ],
   "title": "The prosody of authentic emotions",
   "original": "sp02_423",
   "page_count": 4,
   "order": 91,
   "p1": "423",
   "pn": "426",
   "abstract": [
    "Prosodic variation in oral communication can occasion a shift in how a speaker's feelings and emotions are interpreted, a finding that is both commonsense and well established within the scientific community. However, neither psychologists nor researchers in linguistic and communication sciences have yet achieved clarity concerning the exact relations between the two phenomena. This paper outlines the results of a study dealing with the expression of emotions in \"natural\" spoken language. In this study some light could be shed on the fundamental relations between units of prosody and other signalling systems active in the expression of emotions. Results show that emotions are merely perceived as discrete and are in fact semantic composites, constructed out of several elements which each bear individual semantic components.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-91"
  },
  "kida02_speechprosody": {
   "authors": [
    [
     "Tsuyoshi",
     "Kida"
    ]
   ],
   "title": "Prosody - a laughing matter? a crosscultural comparison of a humour phenomenon (rakugo) in france, Tokyo, and Osaka",
   "original": "sp02_427",
   "page_count": 4,
   "order": 92,
   "p1": "427",
   "pn": "430",
   "abstract": [
    "An empirical crosscultural data analysis of a storytelling spectacle in Japan, rakugo, has been conducted to evaluate the role that the prosody plays in humour. It has been found that laughing effects depended on the interaction of prosodic features and dialectal markers as well as the audience’s reaction in storytellers' discourse. That is, the prosodic account to explain the humorous value of performance could be in conjunction with other socio-cultural factors.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-92"
  },
  "kiriyama02_speechprosody": {
   "authors": [
    [
     "Shinya",
     "Kiriyama"
    ],
    [
     "Keikichi",
     "Hirose"
    ],
    [
     "Nobuaki",
     "Minematsu"
    ]
   ],
   "title": "Control of prosodic focuses for reply speech generation in a spoken dialogue system of information retrieval on academic documents",
   "original": "sp02_431",
   "page_count": 4,
   "order": 93,
   "p1": "431",
   "pn": "434",
   "abstract": [
    "We have been developing a spoken dialogue system of information retrieval on academic documents with a special focus on reply speech generation. In order to realize speech reply with its prosodic features properly controlled to express the dialogue focus, we had developed a concept-to-speech conversion scheme where the reply concept was directly converted to a sequence of phone and prosodic symbols. In our original system, however, a priority was given to the automatic processing, and the method for prosodic focus control was rather simplified. Aiming at improving the reply speech quality, new rules were constructed for prosodic focus control. Through the listening experiment, the new rules were evaluated to be revised further. The validity of the revised rules was verified through an evaluation experiment of the system.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-93"
  },
  "kitazawa02_speechprosody": {
   "authors": [
    [
     "Shigeyoshi",
     "Kitazawa"
    ],
    [
     "Tatsuya",
     "Kitamura"
    ],
    [
     "Kazuya",
     "Mochizuki"
    ],
    [
     "Toshihiko",
     "Itoh"
    ]
   ],
   "title": "Periodicity of Japanese accent in continuous speech",
   "original": "sp02_435",
   "page_count": 4,
   "order": 94,
   "p1": "435",
   "pn": "438",
   "abstract": [
    "Japanese is a tonal language, and it is also mora-timed language. In this paper, we investigated the hypothesis that accent kernels appear at regular intervals. If duration of each mora is almost equal, then Japanese accent kernel is a constant time marker of continuous Japanese. The Japanese prosodic corpus we investigated comprises 3 hours and 37 minutes of speech involving six different speakers (3 males and 3 females). The recordings on which the corpus is based are passages translated from the MULTEXT prosodic corpus distributed through the European Language Resource Association (ELRA). The text was translated from five European languages and modified into Japanese, consisting of 40 different passages, with 6523 morae including 1085 accent kernels. Speakers are professional narrators and actors who read the text naturally before recording. During the recording, the standard Japanese accent was kept. Accent kernels are marked by two experienced researchers of Japanese phonology. ANOVA assured the average occurrence of accent kernel is one out of every six morae.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-94"
  },
  "knight02_speechprosody": {
   "authors": [
    [
     "Rachael-Anne",
     "Knight"
    ]
   ],
   "title": "The effect of pitch Span on intonational plateaux",
   "original": "sp02_439",
   "page_count": 4,
   "order": 95,
   "p1": "439",
   "pn": "442",
   "abstract": [
    "Previous research has indicated that the H* of a nuclear accent may be realised as a flat stretch of contour rather than as a single turning point. The duration of this plateau and its alignment within the accented syllable and foot are affected by the segmental and prosodic structure of the utterance. The present work investigates whether a non-structural variable, namely pitch span, also affects the realisation of the plateau. Speakers imitate all-sonorant utterances in different pitch spans. Both the duration and alignment of the plateau vary with pitch span but in ways different from their variation with prosodic structure. Results also indicate that the beginning and end of the falling movement within the contour are anchored within the syllable and foot for each speaker.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-95"
  },
  "krahmer02_speechprosody": {
   "authors": [
    [
     "Emiel",
     "Krahmer"
    ],
    [
     "Zsófia",
     "Ruttkay"
    ],
    [
     "Marc",
     "Swerts"
    ],
    [
     "Wieger",
     "Wesselink"
    ]
   ],
   "title": "Pitch, eyebrows and the perception of focus",
   "original": "sp02_443",
   "page_count": 4,
   "order": 96,
   "p1": "443",
   "pn": "446",
   "abstract": [
    "We report on an experiment with a Talking Head, aimed at finding out the relative contributions of pitch accents and rapid eyebrow movements for the perception of focus. For this purpose, we use a \"dialogue reconstruction\" experiment: subjects have to perform a perceptual task in which they have to determine on the basis of the distributions of pitch accent and eyebrow movements what the focus is of the current utterance. Our results reveal that both pitch accents and eyebrow movements can have a significant effect on the perception of focus, albeit that the effect of pitch is much larger than that of eyebrows.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-96"
  },
  "lacheretdujour02_speechprosody": {
   "authors": [
    [
     "Anne",
     "Lacheret-Dujour"
    ]
   ],
   "title": "The intonational marking of topical salience in spontaneous speech evidence from spoken French",
   "original": "sp02_447",
   "page_count": 4,
   "order": 97,
   "p1": "447",
   "pn": "450",
   "abstract": [
    "Our analysis of prosodic patterns in spontaneous speech in French is based on the hypothesis that intonation, far from being the reflection of syntactical and rhythmical organisation only, also depends on informative structure. This hypothesis is illustrated here by the role of prosodic markedness in the expression of topic. We propose a bottom-up modelisation of prosody, from signal processing (segmentation and labelling of prosodic units according to perceptual constraints) to phonological representation in terms of autonomous principles which reflect the intonational structure as it is co-constructed by speaker and hearer. A functional reading of our prosodic model is then proposed, regarding constraints derived from informative structure for topic construction.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-97"
  },
  "lee02_speechprosody": {
   "authors": [
    [
     "Wai-Sum",
     "Lee"
    ],
    [
     "Fangxin",
     "Chen"
    ],
    [
     "K. K.",
     "Luke"
    ],
    [
     "Liqin",
     "Shen"
    ]
   ],
   "title": "The prosody of bisyllabic and polysyllabic words in Hong Kong Cantonese",
   "original": "sp02_451",
   "page_count": 4,
   "order": 98,
   "p1": "451",
   "pn": "454",
   "abstract": [
    "This is a phonetic study of the prosody of bisyllabic and polysyllabic words in Hong Kong Cantonese. The values of the three prosodic properties, duration, F0, and intensity, of the words are determined by the type of tones on the component syllables of words as well as the position of the syllables in the words. The F0 characteristic of the citation tones is maintained, where they are realized on bisyllabic or polysyllabic words. With the same tone on the component syllables of words, the duration of the rime is noticeably longer in the final syllable than in the non-final. However, the F0 and intensity are lower for the final syllable of words. The duration of the syllable-initial consonant is longer in the initial syllable, if the consonant is an aspirate or fricative. However, the duration of the syllable-initial sonorant is shorter in the initial syllable. The duration variation of the unaspirated initial consonants of the component syllables of words is not significant.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-98"
  },
  "legac02_speechprosody": {
   "authors": [
    [
     "David",
     "Le Gac"
    ]
   ],
   "title": "Tonal alternations and prosodic structure in Somali",
   "original": "sp02_455",
   "page_count": 4,
   "order": 99,
   "p1": "455",
   "pn": "458",
   "abstract": [
    "This paper investigates the prosody of focalisation in Somali, a cushitic tonal accent language. The Somali nouns undergo many tonal accent alternations according to the discursive contexts. A primary aim of the study is to explain these alternations by assuming that they are triggered by intonative tones. However, very little attention has been devoted to the intonation of Somali. As Somali has morphological focus particles, it has been traditionally accepted that this language has no intonative focus marking. This paper disproves this assumption, by providing a phonetic description of F0 configurations and showing that a process of downdrift, intonative high tones and a low tone of focalisation express the information structure.\n",
    "Finally, a phonological model of the prosody of Somali will be proposed. To be precise, it will be argued that the low tone of focalisation is the central element of a recursive hierarchical structure, and that it triggers tonal accent alternations and governs intonative tones. Furthermore, it will be suggested that Somali has two independent tonal tiers, and that the coalescence of these tonal tiers produces the melodic paterns at the phonetic level.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-99"
  },
  "lim02_speechprosody": {
   "authors": [
    [
     "Lisa",
     "Lim"
    ],
    [
     "Umberto",
     "Ansaldo"
    ]
   ],
   "title": "Prosodic erosion as a diagnostic of grammaticalisation in isolating languages: tone and stress in Sinitic",
   "original": "sp02_459",
   "page_count": 4,
   "order": 100,
   "p1": "459",
   "pn": "462",
   "abstract": [
    "This paper is concerned with the aspect of prosodic reduction typically observed in grammaticalised items within languages of the isolating, tonal type. In particular, it focuses on the prosodic features of grammaticalised morphemes in Mandarin, Cantonese and Hokkien (Min), and introduces three types of common prosodic erosion found in these languages, namely (a) reduction to neutral tone or tonal loss, (b) weakened stress, and (c) contraction involving tonal reduction.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-100"
  },
  "louali02_speechprosody": {
   "authors": [
    [
     "Naïma",
     "Louali"
    ],
    [
     "Amina",
     "Mettouchi"
    ]
   ],
   "title": "Structures intonatives en berb&# 8;re: l²&# 9;nonc&# 9; pr&# 9;dicatif",
   "original": "sp02_463",
   "page_count": 4,
   "order": 101,
   "p1": "463",
   "pn": "466",
   "abstract": [
    "In this paper, the authors investigate the role of intonation in relation to syntax and information structure, through the study of a versatile grammatical structure: the non-verbal predicate. This structure can form a single utterance, but it can also function as a clause, in cleft sentences for instance. F0 contours for those two types are different. The prosodic study of focalization in cleft sentences is then confronted to that of topicalization, both structures presenting similar F0 patterns. Despite the obvious differences at the level of information structure, this similarity points to a common property of topicalization and focalization: both structures are departures from the unmarked Berber word order (VSO). Note: The body of this paper is written in French.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-101"
  },
  "man02_speechprosody": {
   "authors": [
    [
     "Vicky C. H.",
     "Man"
    ]
   ],
   "title": "Focus effects on Cantonese tones: an acoustic study",
   "original": "sp02_467",
   "page_count": 4,
   "order": 102,
   "p1": "467",
   "pn": "470",
   "abstract": [
    "This paper discusses how the prosodic marking of sentential focus influences the acoustical pattern of F0 in Cantonese monosyllabic words. Results indicate that tone identities are maintained regardless of the focus conditions, and that a substantial pitch range expansion is associated with narrow focus. Pitch range is affected by the tone-focus interaction. The pitch range differences between the broad focus and narrow focus readings of each target word are insignificant.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-102"
  },
  "marandin02_speechprosody": {
   "authors": [
    [
     "J. M.",
     "Marandin"
    ],
    [
     "Claire",
     "Beyssade"
    ],
    [
     "Elisabeth",
     "Delais-Roussarie"
    ],
    [
     "A.",
     "Rialland"
    ]
   ],
   "title": "Discourse marking in French: C accents and discourse moves",
   "original": "sp02_471",
   "page_count": 4,
   "order": 103,
   "p1": "471",
   "pn": "474",
   "abstract": [
    "It is currently assumed that the prosodic realization of utterances is sensitive to the Ground/ Focus articulation. However, the discourse thematic organization also plays a crucial role : in German and English, a specific category of pitch accent does play a role in marking discourse move (see [1] and the analysis of B accents in [2]). In this paper, we investigate how discourse moves are expressed in French, in particular prosodically.\n",
    "s Lambrecht, K., 1994. Information structure and sentence form : Topic, focus and the mental representations of discourse referents. Cambridge studies in Linguistics 71, Cambridge University Press. Büring, D., 1998. Focus and Topic in a complex model of Discourse. Ms. Büring’s website.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-103"
  },
  "marotta02_speechprosody": {
   "authors": [
    [
     "Giovanna",
     "Marotta"
    ]
   ],
   "title": "L'intonation des énonc&# 9;s interrogatifs ouverts dans l'Italien toscan",
   "original": "sp02_475",
   "page_count": 4,
   "order": 104,
   "p1": "475",
   "pn": "478",
   "abstract": [
    "The intonation of wh-questions in the Toscan variety of Lucques is the topic of this communication. The theoretical framework is the one proposed by autosegmental phonology. Wh-words do not show a constant association with Nuclear Pitch Accent. We observed that perché only is associated with H*, while the others morphemes (e.g. chi \"who\", che \"what\", dove \"where\") are often devoided of any PA. The interaction with syntax can explain the different melodic profiles of wh-questions we found in our data. Note: The body of this paper is written in French.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-104"
  },
  "martel02_speechprosody": {
   "authors": [
    [
     "Karine",
     "Martel"
    ]
   ],
   "title": "Mutual knowledge and prosody in young children",
   "original": "sp02_479",
   "page_count": 4,
   "order": 105,
   "p1": "479",
   "pn": "482",
   "abstract": [
    "This work aims at modelising the use of the suprasegmental system and its relation with the enunciative structure in young children in a dialogue situation with a competent speaker. The role of the intonative and temporal parameters during the grammaticalisation period, which takes place between 2 and 3.5 years of age is investigated in this paper. Results show that children who use intonation precociously for communicative purposes, also use it in a specific way related to their ability to detach themselves from the context. Three chronological periods emerge. As time goes by the complexification of the grammatical structures generates a functional redistribution of prosody.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-105"
  },
  "martin02_speechprosody": {
   "authors": [
    [
     "Philippe",
     "Martin"
    ]
   ],
   "title": "Regional variations of sentence intonation in French - the continuation contour in Parisian French",
   "original": "sp02_483",
   "page_count": 4,
   "order": 106,
   "p1": "483",
   "pn": "486",
   "abstract": [
    "Numerous studies on regional variations of French sentence intonation have been conducted for some time, even before any phonological description of intonation was available. These studies are therefore characterized by a strong phonetic bias, leading researchers to gather large sets of experimental data, which once statistically organized, would give an empirical account of intonational differences existing between varieties of French.\n",
    "In contrast with these studies, we proposed a phonetic description of some intonational regional differences based on a phonological description, in which as in any classical phonetic study of, say, vowel quality, the phonological analysis precedes phonetic description of the data. In the theoretical approach chosen, stressed syllables are encoded with features such as duration and melodic variations, which in turn indicate a (prosodic) organization of the sentence.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-106"
  },
  "mayer02_speechprosody": {
   "authors": [
    [
     "Jörg",
     "Mayer"
    ],
    [
     "Dirk",
     "Wildgruber"
    ],
    [
     "Axel",
     "Riecker"
    ],
    [
     "Grzegorz",
     "Dogil"
    ],
    [
     "Hermann",
     "Ackermann"
    ],
    [
     "Wolfgang",
     "Grodd"
    ]
   ],
   "title": "Prosody production and perception: converging evidence from fMRI studies",
   "original": "sp02_487",
   "page_count": 4,
   "order": 107,
   "p1": "487",
   "pn": "490",
   "abstract": [
    "Clinical observations of distortions of production and perception of prosody implicate that distinct, non-overlapping neural circuits are responsible for distinct prosodic cues and functions. These observations motivate a question whether similar evidence can be found in the neurologically intact brain. The experiment presented in this paper was constructed to check the neuroanatomical basis of the prosody generator, a functional unit in the phonological system which integrates and controls the variation of prosodic parameters [1]. The results show that relatively small, non-overlapping, fronto-basal areas of both the right and the left hemisphere are involved in the generation of prosody. Futhermore, we found clear evidence for the functional lateralization of prosody processing. Generating linguistically geared prosody revealed exclusively left hemisphere activation, while the production of affective prosody revealed right hemisphere activation only. Additionally, our results show interesting analogies with activation patterns of perception paradigms of recent functional imaging studies.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-107"
  },
  "mejvaldova02_speechprosody": {
   "authors": [
    [
     "Jana",
     "Mejvaldová"
    ],
    [
     "Petr",
     "Horák"
    ]
   ],
   "title": "Synonymie et homonymie attitudinale en tch&# 8;que et en fran&# 7;ais",
   "original": "sp02_491",
   "page_count": 4,
   "order": 108,
   "p1": "491",
   "pn": "494",
   "abstract": [
    "Abstract In this paper we try to demonstrate communicative and language functions of prosodic expressions of attitudes. In addition to the universal expressions, which are comprehensible regardless of the mother tongue, there exist the prosodic realizations typical of a particular language. This ones function as language signs, whose principal quality is arbitrariness. As in the case of verbal signs, the relation between prosodic signs and their meaning is not symmetrical. Even within one and the same language, there can be found frequent cases of synonymy or homonymy. In the communication between two speakers, where at least one of them is not speaking his mother tongue, the situation is more complicated. Note: The body of this paper is written in French.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-108"
  },
  "menezes02_speechprosody": {
   "authors": [
    [
     "C.",
     "Menezes"
    ],
    [
     "Donna",
     "Erickson"
    ],
    [
     "Osamu",
     "Fujimura"
    ]
   ],
   "title": "Contrastive emphasis: comparison of pitch accents with syllable magnitudes",
   "original": "sp02_495",
   "page_count": 4,
   "order": 109,
   "p1": "495",
   "pn": "498",
   "abstract": [
    "Contrastive emphasis as elicited from a semi-spontaneous dialogue paradigm was studied with respect to pitch accents and syllable magnitude. In this study, syllable magnitude is defined within the C/D model framework whereby the magnitude of the syllable is related to the displacement of the jaw from the occlusal plane. Articulatory data were collected using the x-ray microbeam facility at the University of Wisconsin. Fundamental frequency patterns were extracted using WAVES+, and the pitch patterns were transcribed using the ToBI system. The results indicate that for all speakers syllable magnitude increases with emphasis in a linear fashion, such that on the average, words that were well-perceived as emphasized have larger jaw opening than those that were poorly perceived as emphasized. The pitch accent associated with the emphasized word differs both within and across speakers. For well-perceived emphasis, the pitch accents can be H*, !H*, L+H*, L*+H, and L*+!H, and these same pitch accents also occur for the same speaker for moderately or poorly-perceived emphasis situations.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-109"
  },
  "mertens02_speechprosody": {
   "authors": [
    [
     "Piet",
     "Mertens"
    ]
   ],
   "title": "Synthesizing elaborate intonation contours in text-to-speech for French",
   "original": "sp02_499",
   "page_count": 5,
   "order": 110,
   "p1": "499",
   "pn": "502",
   "abstract": [
    "This paper presents a modular TTS system (called MINGUS) which exploits syntactic information contained in the input and allows additional annotation of the input in order to obtain particular intonation contours or to vary most prosodic parameters. This system is based on a tonal representation of French intonation, on a model of the interaction between syntax and prosody, and on a model of the semantic and pragmatic aspects of intonation.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-110"
  },
  "milde02_speechprosody": {
   "authors": [
    [
     "Jan-Torsten",
     "Milde"
    ],
    [
     "Ulrike",
     "Gut"
    ]
   ],
   "title": "A prosodic corpus of non-native speech",
   "original": "sp02_503",
   "page_count": 4,
   "order": 111,
   "p1": "503",
   "pn": "506",
   "abstract": [
    "The paper describes the design and implementation of an XML-based corpus environment for prosodically annotated data. The TASX-environment (TASX: Time Aligned Signal data eXchange format) constitutes the technical basis for a corpus designed to explore the acquisition of prosody by second language learners. It supports all aspects of the corpus setup procedure: XML-based annotation of the speech data, all transformation of non XML-annotations, and the web-based analysis and dissemination of the data.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-111"
  },
  "minematsu02_speechprosody": {
   "authors": [
    [
     "Nobuaki",
     "Minematsu"
    ],
    [
     "Mariko",
     "Sekiguchi"
    ],
    [
     "Keikichi",
     "Hirose"
    ]
   ],
   "title": "Performance improvement in estimating subjective agedness with prosodic features",
   "original": "sp02_507",
   "page_count": 4,
   "order": 112,
   "p1": "507",
   "pn": "510",
   "abstract": [
    "In this paper, we propose a technique which automatically estimates speakers’ agedness only with acoustic, not linguistic, information of their utterances. This method is realized by integrating GMM(Gaussian Mixture Model)-based speaker recognition techniques with modules for calculating prosody-based agedness scores. We firstly divided speakers of two databases, JNAS and S(senior)-JNAS, into two groups by listening tests. One group has only the speakers whose speech sounds so aged that one should take special care when he/she talks to them. The other group has the remaining speakers of the two databases. After that, each speaker group was modeled with GMM. Experiments of automatic identification of the speaker group showed the correct identification rate of 91%. To improve the performance, two prosodic features were considered, i.e, speech rate and local perturbation of power. Using these features, the identification rate was raised up to 95%. Finally, using scores calculated by integrating the GMM and the prosodic modules, experiments were carried out to automatically estimate speakers’ agedness. The results showed high correlation between speakers’ agedness estimated subjectively by humans and the automatically calculated scores with the proposed method.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-112"
  },
  "mixdorff02b_speechprosody": {
   "authors": [
    [
     "Hansjörg",
     "Mixdorff"
    ],
    [
     "Noam",
     "Ami"
    ]
   ],
   "title": "The prosody of modern Hebrew - a quantitative study",
   "original": "sp02_511",
   "page_count": 4,
   "order": 113,
   "p1": "511",
   "pn": "514",
   "abstract": [
    "The current paper presents a preliminary study of Modern Hebrew prosody using a quantitative model. In a small corpus of segmentally identical utterances the place of focus and sentence mode were systematically varied. Following the rationale of MFGI, the Mixdorff-Fujisaki Model of German intonation, the phonetic properties of the contrast lending intonemes were examined. These properties are remarkably similar to those of German: The place of focus is marked by high accent command amplitudes and reduction of post-focal accents whereas pre-focal accents remain almost unaffected. Questions and non-terminal utterances are marked by rising intonation on the last accented item.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-113"
  },
  "mixdorff02c_speechprosody": {
   "authors": [
    [
     "Hansjörg",
     "Mixdorff"
    ],
    [
     "Martti",
     "Vainio"
    ],
    [
     "Stefan",
     "Werner"
    ],
    [
     "Juhani",
     "Järvikivi"
    ]
   ],
   "title": "The manifestation of linguistic information in prosodic features of Finnish",
   "original": "sp02_515",
   "page_count": 4,
   "order": 114,
   "p1": "515",
   "pn": "518",
   "abstract": [
    "The current paper presents a preliminary study of Finnish prosody using a quantitative model. In a small corpus of segmentally identical utterances the focus, the sentence mode and the place of the phrase boundary were systematically varied. Following the rationale of MFGI, the Mixdorff- Fujisaki Model of German intonation, the phonetic properties of the contrast-lending intonemes were examined. These properties differ strongly from those of German: Although the place of narrow focus is marked by higher accent command amplitudes, tone switches on pre-focal and postfocal accents are never completely deleted. Yes/no questions with final rises are perceived as less natural by Finnish listeners than those marked by a question particle. Nonterminal utterances are not marked by clear rises, but rather by a fall that does not reach the lower edge of the speaker's F0 range as in declaratives.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-114"
  },
  "miyamoto02_speechprosody": {
   "authors": [
    [
     "Tadao",
     "Miyamoto"
    ],
    [
     "Crystal",
     "Johnson"
    ]
   ],
   "title": "Accentual phrasing in Japanese: the significance of underlying accents",
   "original": "sp02_519",
   "page_count": 4,
   "order": 115,
   "p1": "519",
   "pn": "522",
   "abstract": [
    "The parsing of an intermediate phrase into its component accentual phrases in Japanese has had many proposed mechanisms. The most common theories have involved syntactic configurations, and, recently, optimality theory has been gaining in popularity. This study examined the speech of five female speakers of Standard Tokyo dialect of Japanese. These speakers demonstrated that accentual phrase construction depended not on syntax, but on the underlying accentuation of words.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-115"
  },
  "mobius02_speechprosody": {
   "authors": [
    [
     "Bernd",
     "Möbius"
    ],
    [
     "Grzegorz",
     "Dogil"
    ]
   ],
   "title": "Phonemic and postural effects on the production of prosody",
   "original": "sp02_523",
   "page_count": 4,
   "order": 116,
   "p1": "523",
   "pn": "526",
   "abstract": [
    "Phonemic settings and the internal models that they represent are learned in the process of language and speech acquisition. Postural settings, in contrast, rely on continuous auditory monitoring and tend to break down quickly if this monitoring process is inhibited during speech production. Evidence presented in the literature seems to indicate that stable internal models are mostly associated with segmental phonemic targets, whereas prosodic features often display postural characteristics. In this paper it is argued that the dichotomy of phonemic and postural settings applies not only to segmental properties of speech but to prosodic features as well. Phonemic and postural effects on the production of prosody are reviewed and it is suggested that the boundary between phonemic and postural effects on a given prosodic feature is flexible. We further hypothesize that the speaker may rely on a set of acquired internal models and select from this set a particular model depending on communicative and situative constraints.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-116"
  },
  "navas02_speechprosody": {
   "authors": [
    [
     "Eva",
     "Navas"
    ],
    [
     "Inmaculada",
     "Hernáez"
    ],
    [
     "Nerea",
     "Ezeiza"
    ]
   ],
   "title": "Assigning phrase breaks using CARTs for Basque TTS",
   "original": "sp02_527",
   "page_count": 4,
   "order": 117,
   "p1": "527",
   "pn": "530",
   "abstract": [
    "This paper presents a prosodic phrasing method for the Basque language, to improve naturalness in text to speech synthesis. Binary classification trees are trained with morphological and syntactic information to predict locations of breaks. Overall score achieved by the prediction tree is 92.53%, which compares positively with the results published for other languages.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-117"
  },
  "nesterenko02_speechprosody": {
   "authors": [
    [
     "Irina",
     "Nesterenko"
    ]
   ],
   "title": "French listeners counting syllables in read French and Russian: implications for the cognitive realty of syllable",
   "original": "sp02_531",
   "page_count": 4,
   "order": 118,
   "p1": "531",
   "pn": "534",
   "abstract": [
    "This paper examines the question of cognitive status of syllable as a linguistic unit. The experiment was conceived in the objective to test, in a metalinguistic task of counting the syllables, put to French speaking subjects, whether the syllable is a mere methodological concept adopted in linguistic descriptions or whether there is a cognitive reality behind it. Working with filtered stimuli permits to concentrate the attention on the role of the syllable in the prosodic organisation of the utterance.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-118"
  },
  "nilsenova02_speechprosody": {
   "authors": [
    [
     "Marie",
     "Nilsenová"
    ]
   ],
   "title": "A game-theoretical approach to the meaning of intonation in rising declaratives and negative polar questions",
   "original": "sp02_535",
   "page_count": 4,
   "order": 119,
   "p1": "535",
   "pn": "538",
   "abstract": [
    "On a closed set of English data, consisting of rising declaratives and outer-negation polar questions, we show some advantages of a pragmatic game-theoretical approach to the analysis of intonation, in particular an End Rise.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-119"
  },
  "oliveira02_speechprosody": {
   "authors": [
    [
     "Miguel",
     "Oliveira"
    ]
   ],
   "title": "Pausing strategies as means of information processing in spontaneous narratives",
   "original": "sp02_539",
   "page_count": 4,
   "order": 120,
   "p1": "539",
   "pn": "542",
   "abstract": [
    "This paper investigates the role of pause in the process of information organization in narrative discourse. Following the cognitive research on pausing strategies, the present study assumes that the frequency of pause usage varies as a function of the content of the individual sections in a narrative. The material used for the analysis consisted of a number of spontaneous narratives. The results failed to demonstrate any association between type of information and pausing phenomena, but it revealed the existence of a pattern of varying hesitancy that generally correspond to the different sections in a narrative. This would suggest that pausing in narrative is primarily governed by the cognitive rhythm of speech.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-120"
  },
  "ouden02_speechprosody": {
   "authors": [
    [
     "Hanny den",
     "Ouden"
    ],
    [
     "Leo",
     "Noordman"
    ],
    [
     "Jacques",
     "Terken"
    ]
   ],
   "title": "The prosodic realization of organizational features of texts",
   "original": "sp02_543",
   "page_count": 4,
   "order": 121,
   "p1": "543",
   "pn": "546",
   "abstract": [
    "This study investigates the prosodic realization of organizational features of texts. Twenty read aloud news reports were annotated according to Rhetorical Structure Theory (RST). This theory defines the clustering of elementary units (clauses) into larger segments (hierarchical organization), the relative importance of units (nuclearity) and the rhetorical relations between segments. The prosodic features we considered were pause durations between segments, pitch range and articulation rate of the segments. It was found that pause duration and pitch range reflect the hierarchical organization of a text: the lower a text segment is embedded within the hierarchy of a text, the shorter the pauses and the lower the pitch range. Also, a nuclear segment is read slower than a non-nuclear segment. Finally, rhetorical relations affect pause duration. For example, causal relations are associated with shorter pauses than non-causal relations. We conclude that the organizational features of texts as provided by RST are reflected by prosodic characteristics.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-121"
  },
  "oudeyer02_speechprosody": {
   "authors": [
    [
     "Pierre-Yves",
     "Oudeyer"
    ]
   ],
   "title": "Novel useful features and algorithms for the recognition of emotions in human speech",
   "original": "sp02_547",
   "page_count": 4,
   "order": 122,
   "p1": "547",
   "pn": "550",
   "abstract": [
    "Recent years have been marked by the development of robotic pets or partners such as small animals or humanoids. People interact with them using natural human social cues, in particular emotional expressions. It is crucial that robot can detect the emotional information contained in speech using only prosodic features, since this is often the only information that they can measure. We present here the first large scale experiment in which a large feature set space and a large machine learning algorithm space are searched concurrently. We describe new features which prove to be much more efficient than the traditional features used in the litterature.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-122"
  },
  "oudeyer02b_speechprosody": {
   "authors": [
    [
     "Pierre-Yves",
     "Oudeyer"
    ]
   ],
   "title": "The synthesis of cartoon emotional speech",
   "original": "sp02_551",
   "page_count": 4,
   "order": 123,
   "p1": "551",
   "pn": "554",
   "abstract": [
    "Recent years have been marked by the increasing development of personal robots such as small pets or humanoids, often having young and cartoon like personalities. A key feature they currently lack is the ability to speak in a emotional life-like manner. We present here a technology that makes this possible by using concatenative speech synthesis.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-123"
  },
  "pan02_speechprosody": {
   "authors": [
    [
     "Ho-Hsien",
     "Pan"
    ]
   ],
   "title": "The location of f0 offset targets for taiwanese long tones",
   "original": "sp02_555",
   "page_count": 4,
   "order": 124,
   "p1": "555",
   "pn": "558",
   "abstract": [
    "This paper presents the alignment of offset targets for five Taiwanese long tones, HH, LH, HL, ML, and MM, in different contexts. The location and value of offset target, in terms of F0 turning point, peak and valley, relative to the tonebearing syllable was studied. Corpus was sentences with five syllables. Tonal values of the second, third, and fourth syllables in these sentences were varied, while the tonal values of first and fifth (final) syllables were controlled. F0 data were extracted from 5%, 20%, 40%, 60%, 80% and 95% points into the duration of second, third and fourth syllables. Results showed that F0 turning points for HH and MM tones located before offset boundaries of the second and third syllables; F0 targets for LH, HL and ML tones at the second syllables located after the offset boundaries. The turning points for HH tone in the penultimate syllables occurred after the offset boundaries, while the turning points for MM tone occurred before the boundaries. At the penultimate and antepenultimate syllables, the location of offset targets of HL and ML tones depended on the following tonal onsets. When followed by M onset, the targets occurred after the offset boundary of the syllables; when followed by H onset, the tonal targets occurred before the boundaries. There is a systematic relationship between offset tonal target and offset boundary of tone-bearing syllable in Taiwanese.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-124"
  },
  "payacanals02_speechprosody": {
   "authors": [
    [
     "Marta",
     "Payà Canals"
    ]
   ],
   "title": "Incidental clauses in spoken Catalan: prosodic characteristics and pragmatic function",
   "original": "sp02_559",
   "page_count": 4,
   "order": 125,
   "p1": "559",
   "pn": "562",
   "abstract": [
    "This paper is an investigation of incidental clauses in spoken Catalan. Our aim is to define the prosodic characteristics of incidental clauses and their functions in the discourse. After an analysis of a sample of incidental clauses in spoken Catalan (taken from semispontaneous argumentative and narrative productions), the following conclusions are reached: incidental clauses are often produced between silences; they are produced in a lower register than the principal utterance in which they are inserted, with less intensity, with a compressed pitch range, and they tend to be followed by a noticeable tonal reset at the beginning of the continuation of the main utterance. Usually, the incidental clause is produced with a final falling tone, but clauses which have a modalisation value tend to finish with a rising tone. Finally, we present a pragmatic interpretation of the insertion of an incidental clause within the discourse as a rupture of conversational principles, since it complicates the listener’s information processing task. In the interests of successful communicative cooperation, a) the incidental clause function must have a benefit for the listener that surpasses the cost, and b) the incidental clause must be emitted with a sufficient number of clues (prosodic, gestural, syntactic, lexical, or semantic) for the listener to be able to identify it as a supplementary piece of the discourse.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-125"
  },
  "pellegrino02_speechprosody": {
   "authors": [
    [
     "François",
     "Pellegrino"
    ],
    [
     "Jean-Hugues",
     "Chauchat"
    ],
    [
     "Ricco",
     "Rakotomalala"
    ],
    [
     "Jérôme",
     "Farinas"
    ]
   ],
   "title": "Can automatically extracted rhythmic units discriminate among languages?",
   "original": "sp02_563",
   "page_count": 4,
   "order": 126,
   "p1": "563",
   "pn": "566",
   "abstract": [
    "This paper deals with rhythmic modeling and its application to language identification. Beside phonetics and phonotactics, rhythm is actually one of the most promising features to be considered for language identification, but significant problems are unresolved for its modeling. In this paper, an algorithm dedicated to rhythmic segmentation is described. Experiments are performed on read speech for 5 European languages. Several algorithms are compared. They show that salient features may be automatically extracted and efficiently modeled from the raw signal: a linear discriminant analysis of the extracted features results in a 80 % percent of correct language identification for the 5 languages, using 20 s duration utterances. Additional experiments reveal that the automatic rhythmic units convey also speaker specific features.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-126"
  },
  "peters02_speechprosody": {
   "authors": [
    [
     "Jörg",
     "Peters"
    ]
   ],
   "title": "Tonal effects on rhythm in West Middle German",
   "original": "sp02_567",
   "page_count": 4,
   "order": 127,
   "p1": "567",
   "pn": "570",
   "abstract": [
    "Chanted speech differs from ordinary speech in that its intonational patterns are manifested not only with a characteristic pitch contour, but also with certain rhythmic properties. The chanted call of English and German is a well-known example. It contains a high pitch and a mid pitch, each aligned with a stressed syllable. The pitch of the chanted call is level throughout the syllables that follow the stressed syllables bearing high and mid pitch. When the stressed syllables are closely spaced, they are lengthened. The lengthening provides additional space for sustaining pitch, but it also changes the rhythmic properties of the utterance. The present paper shows that similar effects of tonal structure on rhythm may be found in ordinary speech. We report evidence from three urban vernaculars of West Middle German and propose a phonological analysis that accounts for the similarity of the regional contours to the chanted call.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-127"
  },
  "pietrosemoli02_speechprosody": {
   "authors": [
    [
     "Lourdes",
     "Pietrosemoli"
    ],
    [
     "Elsa",
     "Mora"
    ]
   ],
   "title": "Dysprosody in three patients with vascular cerebral damage",
   "original": "sp02_571",
   "page_count": 3,
   "order": 128,
   "p1": "571",
   "pn": "574",
   "abstract": [
    "The data on the neurological bases of prosody are apparently contradictory. This has led to the postulation of four different hypotheses about the cerebral organization of prosody. In the present study the rhythm and melodic contours of spontaneous speech are analyzed for two patients with vascular damage in the right hemisphere and for one in the left hemisphere. The acoustic analysis demonstrated some prosodic problems with relation to intonation but more with rhythm. These data reinforce the hypothesis of bilateral control of prosody and suggest the intervention of sub-cortical areas. They also contribute to the rejection of the organizational model of prosody in the right hemisphere as parallel to the linguistic organization in the left hemisphere.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-128"
  },
  "piot02_speechprosody": {
   "authors": [
    [
     "Olivier",
     "Piot"
    ],
    [
     "Mehdi",
     "Lyaghat"
    ]
   ],
   "title": "Expression et reconnaissance de onze attitudes assertives et interrogatives en persan standard",
   "original": "sp02_575",
   "page_count": 4,
   "order": 129,
   "p1": "575",
   "pn": "578",
   "abstract": [
    "This is a study of the way emotional and cognitive attitudes may be expressed by prosody in standard Persian. Six assertive and five interrogative attitudes were produced on target words included in a short sentence. These target words were chosen on the basis of a cross-variation of both place of accent and word length. The great variability of contours thus obtained were quite highly recognized by native subjects. This study thus shows how some currently used attitudes may be expressed in Persian so as to be robustly recognized, and also sheds some light on the controversial issue of the phonetics of accent in this language. Note: The body of this paper is written in French.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-129"
  },
  "portes02_speechprosody": {
   "authors": [
    [
     "Cristel",
     "Portes"
    ],
    [
     "Emmanuelle",
     "Rami"
    ],
    [
     "C.",
     "Auran"
    ],
    [
     "Albert Di",
     "Cristo"
    ]
   ],
   "title": "Prosody and discourse: a multi-linear analysis",
   "original": "sp02_579",
   "page_count": 4,
   "order": 130,
   "p1": "579",
   "pn": "582",
   "abstract": [
    "The aim of this paper is to present the multi-linear approach being developed among the ProDiGE research group at the Institut de Phonétique of the Laboratoire Parole & Langage (Université de Provence) in Aix-en-Provence. We first introduce the conceptual bases of this approach, before focusing our attention on the prosodic levels which constitute one of the lines in our formal and functional representation. In the last part, we present a sample analysis grid of part of our spontaneous speech corpus, detailing each level in turn.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-130"
  },
  "post02_speechprosody": {
   "authors": [
    [
     "Brechtje",
     "Post"
    ]
   ],
   "title": "French tonal structures",
   "original": "sp02_583",
   "page_count": 4,
   "order": 131,
   "p1": "583",
   "pn": "586",
   "abstract": [
    "Despite the rather large body of literature on French intonation, there is no agreement about the number of contrastive contours in the system. Since the descriptions use different methodologies and theoretical frameworks, their relative merit cannot be evaluated straightforwardly.\n",
    "This paper introduces a tonal analysis of French intonation that is based on empirical evidence. The stressed syllables and boundaries in the utterances determine at which locations melodic changes can occur, and the tonal structure specifies how the melody can be varied at those points. Thus, the analysis states unambiguously which variations in pitch function contrastively, and its claims can be experimentally verified.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-131"
  },
  "prieto02_speechprosody": {
   "authors": [
    [
     "Pilar",
     "Prieto"
    ]
   ],
   "title": "Coarticulation and stability effects in tonal clash contexts in Catalan",
   "original": "sp02_587",
   "page_count": 4,
   "order": 132,
   "p1": "587",
   "pn": "590",
   "abstract": [
    "This paper discusses the effects of tonal clash (or strict adjacency between two accents) on the phonetic realization of H* accents in Catalan. The analysis of the data shows that the adjacency of two rising accents triggers a drastic temporal reorganization of the F0 gestures involved, resulting in anticipation of the first gesture and delay of the second. Specifically, in crowded tonal environments we find that the first peak is placed significantly earlier with respect to the syllable onset and offset and the start of the second rise is located significantly later in the second syllable. Thus, the data reveals that F0 gestures are roughly timed to accented syllables, keeping a more o less floating relationship with the segmentals: both right and left-hand prosodic contexts (including clash situations) determine the alignment patterns of both the valley and the peak. Finally, no significant differences were found on the H scaling in clash vs. non-clash environments.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-132"
  },
  "qian02_speechprosody": {
   "authors": [
    [
     "Yao",
     "Qian"
    ],
    [
     "Wuyun",
     "Pan"
    ]
   ],
   "title": "Prosodic word: the lowest constituent in the Mandarin prosody processing",
   "original": "sp02_591",
   "page_count": 4,
   "order": 133,
   "p1": "591",
   "pn": "594",
   "abstract": [
    "This paper proposed a novel method, which is using prosodic word as the lowest constituent in the prosody processing, to solve the prosody problem of Mandarin concatenative speech synthesizer based on a large corpus. The results, obtained from applying new solution to deal with the intonational prominence placement and break boundaries assigning in text-to-speech systems, are positive and encouraging.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-133"
  },
  "rialland02_speechprosody": {
   "authors": [
    [
     "A.",
     "Rialland"
    ],
    [
     "Jenny",
     "Doetjes"
    ],
    [
     "G.",
     "Rebuschi"
    ]
   ],
   "title": "What is focused in c'est XP qui/que cleft sentences in French?",
   "original": "sp02_595",
   "page_count": 4,
   "order": 134,
   "p1": "595",
   "pn": "598",
   "abstract": [
    "Cleft sentences are generally viewed as a focus-related sentence type. Based on an analysis of prosody, it will be shown that there are clefts with other types of informational structure than focus/post-focus, whose existence raises the question of the role and meaning of cleft structures as a whole. It is proposed here that cleft structures do not impose a focus on the XP, but focus (or \"zoom in\") on the relationship between an XP (or part of an XP) and the relative clause (or \"coda\"), which is presupposed but not necessarily given.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-134"
  },
  "riecker02_speechprosody": {
   "authors": [
    [
     "Axel",
     "Riecker"
    ],
    [
     "Dirk",
     "Wildgruber"
    ],
    [
     "Grzerorz",
     "Dogil"
    ],
    [
     "Jörg",
     "Mayer"
    ],
    [
     "Hermann",
     "Ackermann"
    ],
    [
     "Wolfgang",
     "Grodd"
    ]
   ],
   "title": "Hemispheric lateralization effects of rhythm implementation during syllable repetitions: a fMRI study",
   "original": "sp02_599",
   "page_count": 4,
   "order": 135,
   "p1": "599",
   "pn": "602",
   "abstract": [
    "Rhythm in terms of the modulation of syllable durations represents an information-bearing feature of verbal utterances contributing both to the meaning of a sentence (linguistic prosody) as well as a speaker’s emotional expression (affective prosody). In order to delineate the neural structures subserving rhythmic shaping of speech production, functional magnetic resonance imaging (fMRI) was performed during (a) monotonous syllable repetitions and (b) production of syllable triplets with lengthening either of the initial or final unit. The latter pattern of syllable durations can be considered the prototypical rhythmic structure contributing both to linguistic and affective prosody. A cognitive subtraction approach (rhythmic versus monotonous iterations) revealed activation of right-sided perisylvian areas (superior temporal gyrus, Broca analogon and adjacent premotor cortex) as well as contralateral subcortical structures (putamen and thalamus). Presumably, these responses reflect a righthemisphere rehearsal mechanism of rhythmic patterns and lefthemisphere monitoring of verbal output.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-135"
  },
  "rietveld02_speechprosody": {
   "authors": [
    [
     "Toni",
     "Rietveld"
    ],
    [
     "Joop",
     "Kerkhoff"
    ]
   ],
   "title": "The temporal alignment of l*h accents",
   "original": "sp02_603",
   "page_count": 4,
   "order": 136,
   "p1": "603",
   "pn": "606",
   "abstract": [
    "Targets of pitch accents have generally been defined on the basis of production data. Obviously, most of the research on tonal targets has focussed on peaks associated with H*L accents as these are very well identifiable, in contrast to the lows associated with L*. In the perception experiments reported here it is made clear that, in Dutch, the conventional target positions of L* and H* (being the F0-valley and the F0- peak respectively) do not coincide. The valley associated with L* which gives rise to the perception of a sentence accent occurs much earlier in a syllable than the peak associated with H*. No significant effect was found for the position of the accent: nuclear or prenuclear. Confirmation was found for the existence of the phonological contrast between H* H% and L*H H% in Dutch.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-136"
  },
  "rilliard02_speechprosody": {
   "authors": [
    [
     "Albert",
     "Rilliard"
    ],
    [
     "Véronique",
     "Aubergé"
    ]
   ],
   "title": "Towards a linguistic validation of a prosodic generation model",
   "original": "sp02_607",
   "page_count": 4,
   "order": 137,
   "p1": "607",
   "pn": "610",
   "abstract": [
    "This paper deals with an approach of prosody evaluation and modelisation, tested together a prosodic model and a prosodic generator, to produce a compared diagnostic of their linguistic competencies. Three evaluation experiments are succinctly described. The first one consists in an online measurement by listeners of the prosodic quality; the second one uses tuned stimuli to test the differences perceived by subjects, and the last one uses delexicalised stimuli to present separately a pure prosodic stimulus and a syntactic stimulus. Their efficiency and disadvantages are analysed along a compared analysis of their results.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-137"
  },
  "rolland02_speechprosody": {
   "authors": [
    [
     "Guillaume",
     "Rolland"
    ],
    [
     "Hélène",
     "Loevenbruck"
    ]
   ],
   "title": "Characteristics of the accentual phrase in French: an acoustic, articulatory and perceptual study",
   "original": "sp02_611",
   "page_count": 4,
   "order": 138,
   "p1": "611",
   "pn": "614",
   "abstract": [
    "The purpose of this study is to evaluate the acoustic, articulatory and perceptual relevance of the Accentual Phrase (AP) in French. The AP is the lowest level of the hierarchical model of French intonation proposed by Jun and Fougeron [7]. A corpus of 22 sentences, each likely to yield 3 APs, was recorded for 4 native French speakers. Our first aim was to describe the acoustic properties of the AP. We measured both primary (LH*) and secondary (LHi) accents in terms of F0 peak values, F0 slopes, duration of the F0 rises, duration of the peak-bearing syllables and number of syllables needed for the rise. We found that the AP was often realized as [LHiLH*], with the H* peak featuring a higher F0 value, a longer duration, a stronger syllable-anchoring than Hi, and the LH* rise being more dynamic than LHi. We compared these acoustic results with those of a previous articulatory analysis and confirmed the preponderance of H* over Hi. Then using perceptual tests, we tried to evaluate the ability of French listeners to slice utterances into Accentual Phrases. The slicing scores show that the listeners could well split the sentences into separate APs. Once this ability quantified, we tried to match these results with the acoustic measurements to address the following question: what makes an AP be perceived as a unit? We suggest that the Accentual Phrase is perceived as a unit mainly because of its tonal (low-high-low-higher), durational (AP-final syllable longest) and dynamic (long small rise - brief large rise) characteristics.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-138"
  },
  "pierluigi02_speechprosody": {
   "authors": [
    [
     "Salvo Rossi",
     "Pierluigi"
    ],
    [
     "Francesco",
     "Palmieri"
    ],
    [
     "Francesco",
     "Cutugno"
    ]
   ],
   "title": "A method for automatic extraction of fujisaki-model parameters",
   "original": "sp02_615",
   "page_count": 4,
   "order": 139,
   "p1": "615",
   "pn": "618",
   "abstract": [
    "The utility of a model describing pitch profiles in speech signals is of fundamental importance in many application areas and especially in natural-sounding text-to-speech system. Fujisaki-model [1] has shown considerable accuracy on many languages, despite its simplicity. The inverse problem, i.e. the extraction of the input parameters which generated an observed pitch contour, that could be of great interest in the field of automatic extraction of prosodic parameters from a given speech signal, is a much harder task. This paper suggests a method for input parameters estimation based on two steps: an initial guessing algorithm based on relative extremes, and a refinement procedure based on a gradient optimization algorithm. Preliminary results of analysis/synthesis of pitch contours show excellent performance of the proposed method.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-139"
  },
  "sander02_speechprosody": {
   "authors": [
    [
     "Kerstin",
     "Sander"
    ],
    [
     "Patricia",
     "Roth"
    ],
    [
     "Henning",
     "Scheich"
    ]
   ],
   "title": "The identification of sad prosodies differentiates between high and low repressive women",
   "original": "sp02_619",
   "page_count": 4,
   "order": 140,
   "p1": "619",
   "pn": "622",
   "abstract": [
    "We investigated with fMRI whether different lateralization types of cortical activation in prosodic tasks are caused by different stress-related coping strategies. After classifying healthy women as high or low repressive they performed four different identification tasks with acoustically presented speech material while being in the MR scanner. The two materials presented in blocks were emotionally irrelevant CV syllables and adjectives with a mix of different prosodic intonations. Sad and happy intonations had to be targeted by two affective identification tasks in the same adjective mixtures. As controls for stimulus-material effects the phoneme /a/ had to be identified both in the syllables and in the adjectives. This design allowed to test influences of coping strategies and affective tasks on lateralization of cortical activation. Results showed no differences in global cortical lateralization as a function of high or low repressiveness and no global support for either the valence hypothesis or the right-hemisphere hypothesis of emotional processing. However, we observed differences in auditory and sensory speech cortex. In accordance to the construct of repression/sensitization, high repressive women showed larger left, low repressive women larger right hemisphere activation during the identification of sad intonations. Thus, differences in stress-related coping strategies may not lead to general differences in cortical lateralization, but may depend on specific elicitors and task-relevant brain areas. In contrast, the identification of happy intonations led to strong and rightlateralized global cortical activation independent of coping strategies which complies with the right-hemisphere hypothesis of emotional processing. In addition, this may reflect general cognitive and arousal effects of task difficulty as well as auditory cue-specific attentional effects.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-140"
  },
  "sauerland02_speechprosody": {
   "authors": [
    [
     "Uli",
     "Sauerland"
    ],
    [
     "Oliver",
     "Bott"
    ]
   ],
   "title": "Prosody and scope in German inverse linking constructions",
   "original": "sp02_623",
   "page_count": 4,
   "order": 141,
   "p1": "623",
   "pn": "626",
   "abstract": [
    "In German, prosody interacts with quantifier scope. We investigate this interaction in inverse linking constructions. We present evidence from elicited production of linguistically naive speakers supporting the following two claims: 1) There are two kinds of inverse linking constructions of which only the prepositional type requires a marked intonation contour for inverse scope. 2) In the prepositional construction, a double focus contour is employed with inverse scope rather that a topic-focus (rise-fall) contour as previously assumed (Krifka 1998).\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-141"
  },
  "schaeffler02_speechprosody": {
   "authors": [
    [
     "Felix",
     "Schaeffler"
    ],
    [
     "Pär",
     "Wretling"
    ],
    [
     "Eva",
     "Strangert"
    ]
   ],
   "title": "On the development of a quantity typology for Swedish dialects",
   "original": "sp02_627",
   "page_count": 4,
   "order": 142,
   "p1": "627",
   "pn": "630",
   "abstract": [
    "This article reports first results of a quantity typology study of Swedish dialects, conducted within the Swedia2000 project (see also www.swedia.nu). The examination of recordings from 20 different areas suggests three preliminary types of quantity distinctions: one type shows the usual Swedish complementary quantity distinction, one type uses an additional quantity pattern and one type shows remarkable amounts of pre-aspiration.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-142"
  },
  "schirmer02_speechprosody": {
   "authors": [
    [
     "Annett",
     "Schirmer"
    ],
    [
     "Sonja A.",
     "Kotz"
    ]
   ],
   "title": "Sex differentiates the STROOP-effect in emotional speech: ERP evidence",
   "original": "sp02_631",
   "page_count": 4,
   "order": 143,
   "p1": "631",
   "pn": "634",
   "abstract": [
    "The present study investigated the processing of emotional speech in men and women. The stimulus material consisted of words with positive, neutral or negative meaning that were spoken with either congruent or incongruent emotional prosody. In one task, participants judged the emotional prosody while ignoring the word meaning, in another task participants judged the emotional word meaning while ignoring the prosody. The event related potentials (ERPs) revealed an interaction of emotional prosody and word meaning only in female participants. Incongruent trials elicited an enhanced N400 amplitude as compared to congruent trials. Male participants failed to show an interaction. Rather, ERPs revealed independent effects for word meaning and emotional prosody, suggesting that men process both types of emotional information independently.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-143"
  },
  "schon02_speechprosody": {
   "authors": [
    [
     "D.",
     "Schön"
    ],
    [
     "C.",
     "Magne"
    ],
    [
     "M.",
     "Schrooten"
    ],
    [
     "M.",
     "Besson"
    ]
   ],
   "title": "The music of speech: electrophysiological approach",
   "original": "sp02_635",
   "page_count": 4,
   "order": 144,
   "p1": "635",
   "pn": "638",
   "abstract": [
    "This experiment was aimed at studying the changes in the brain electrical activity associated with some aspects of prosodic processing and at comparing the results with those obtained for the melodic processing of short musical phrases, by manipulating the F0 of the final word/note. Both musicians and non-musicians were presented with French sentences, ending with prosodically congruous, weakly or strongly incongruous words, and with short musical phrases ending with congruous, weakly or strongly incongruous notes. Both Reaction Times (RTs) and Evoked Related Potentials (ERPs) were recorded. In both the prosodic and melodic conditions, RTs were shorter for strong incongruities than for weak incongruities and congruous completions. ERP recorded in both conditions showed that large positive components (P600s) were associated with incongruous stimuli. Moreover, in both cases, the amplitude of the P600 component was larger, and its latency was shorter, for the strong than for the weak incongruities. Interestingly, an early negative component (N150) develop in response to strong incongruities. For the musicians, this N150 component is clearly localized over right temporo-frontal electrodes, specifically in the melodic condition. For non-musicians, the N150 is more broadly distributed across scalp sites. These results point to strong similarities in the processing of prosodic and melodic incongruities, and a general cognitive process may be at play in both cases. However, they also point to some early differences which may reflect the effects of musical expertise.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-144"
  },
  "schweitzer02_speechprosody": {
   "authors": [
    [
     "Antje",
     "Schweitzer"
    ],
    [
     "Norbert",
     "Braunschweiler"
    ],
    [
     "Edmilson",
     "Morais"
    ]
   ],
   "title": "Prosody generation in the Smartkom project",
   "original": "sp02_639",
   "page_count": 4,
   "order": 145,
   "p1": "639",
   "pn": "642",
   "abstract": [
    "This paper describes the intonation prediction algorithm used in the speech synthesis component of the SmartKom dialog system. Both prosodic phrasing and default accent prediction operate on syntactic structure generated by a language generation module. Two configurational rules are applied to find candidate prosodic phrases. A harmonization algorithm selects the best candidates taking into account rhythm as well as a parameter specifying the optimal length of prosodic phrases. Depth of embedding and location within the syntactic structure determine the default accentuation, which can be modified depending on semantic factors.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-145"
  },
  "selkirk02_speechprosody": {
   "authors": [
    [
     "Elisabeth",
     "Selkirk"
    ]
   ],
   "title": "Contrastive FOCUS vs. presentational focus: prosodic evidence from right node raising in English",
   "original": "sp02_643",
   "page_count": 4,
   "order": 146,
   "p1": "643",
   "pn": "646",
   "abstract": [
    "This paper reports a difference in English between the prosodic properties of contrastive FOCUS and presentational focus entities when they are immediately followed within the sentence by a presentational focus. In this context, the contrastive FOCUS shows not only a L+H* pitch accent, but also a following phonological phrase break, marked by both a L- phrase accent and temporal disjuncture. In the same context, presentational focus shows a pitch accent H* and no phonological phrase break (no L- and no disjuncture). Since these differences in prosody correlating with different Focus types are not plausibly construed as the realization of distinct tonal morphemes, I suggest that the contrastive/presentational contrast is present in the interface informational/syntactic structure itself, and makes itself felt in the phonological representation through the action of syntax-phonology interface constraints which distinguish the two Focus types.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-146"
  },
  "simon02_speechprosody": {
   "authors": [
    [
     "Anne Catherine",
     "Simon"
    ],
    [
     "Anne",
     "Grobet"
    ]
   ],
   "title": "Intégration ou autonomisation prosodique des connecteurs",
   "original": "sp02_647",
   "page_count": 4,
   "order": 147,
   "p1": "647",
   "pn": "650",
   "abstract": [
    "We argue here that the analysis of \"discourse markers\" in spoken discourse must take into consideration their intonational configuration (with or without a declination reset, followed by a pause, etc.), because these configurations inform us about different forms of clause combining (direct vs indirect relation, scope of the connector, etc.). Note: The body of this paper is written in French.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-147"
  },
  "smirnova02_speechprosody": {
   "authors": [
    [
     "Natalia",
     "Smirnova"
    ]
   ],
   "title": "On the phonological status of the HL*h vs. h*LH timing-related tonal opposition in Dutch",
   "original": "sp02_651",
   "page_count": 4,
   "order": 148,
   "p1": "651",
   "pn": "654",
   "abstract": [
    "The paper deals with one timing-related opposition of nuclear accents within the falling-rising HLH% pitch contour typically observed in Dutch questions. It appears that speaker preferences for either H*LH% or HL*H% nuclear accent type are to a considerable extent determined by the duration of the \"nucleus+tail\" part and that the analysed opposition is neutralised in monosyllabic nuclei with minimum voicing. Possible phonological interpretations of the observed dependency are given, the most likely suggesting an allotonic nature of the analysed timing-related distinction.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-148"
  },
  "sugahara02_speechprosody": {
   "authors": [
    [
     "Mariko",
     "Sugahara"
    ]
   ],
   "title": "Conditions on post-FOCUS dephrasing in Tokyo Japanese",
   "original": "sp02_655",
   "page_count": 4,
   "order": 149,
   "p1": "655",
   "pn": "658",
   "abstract": [
    "This paper investigates whether or not presence or absence of a post-FOCUS Minor Phonological Phrase boundary in Tokyo Japanese is conditioned by grammatical factors such as the presence or absence of a syntactic boundary and a pitch accent. Each boundary of a Minor Phonological Phrase (henceforth Minor Phrase or MiP) coincides with an F0 rise from the initial syllable to the second syllable. The result of our production experiment shows that there is always a significant F0 rise (i.e. a MiP boundary) at the onset of a post- FOC word as long as (i) an XP boundary or (ii) a pitch accent is present. That is to say, only when conditions (i) and (ii) are absent, the MiP boundary disappears at the onset of a post- FOC word. In this way, post-FOC dephrasing in Tokyo Japanese is not arbitrary but governed by grammatical factors.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-149"
  },
  "thurgood02_speechprosody": {
   "authors": [
    [
     "Ela",
     "Thurgood"
    ]
   ],
   "title": "The recognition of geminates in ambiguous contexts in Polish",
   "original": "sp02_659",
   "page_count": 4,
   "order": 150,
   "p1": "659",
   "pn": "662",
   "abstract": [
    "This paper examines the pre-vocalic long fricative /v:/ occurring in a context in which the difference in meaning between two sentences, one with a short fricative and one with a long fricative, is solely dependent on the perception of the consonant length. The goal is to investigate the perception of the segmental duration with the length varying between that of a short and that of long consonant. Perception is measured in terms of responses to stimuli of various lengths produced by 26 Polish subjects and in terms of the melodic variation (F0) found in their responses.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-150"
  },
  "todd02_speechprosody": {
   "authors": [
    [
     "Richard",
     "Todd"
    ]
   ],
   "title": "Speaker-ethnicity: attributions based on the use of prosodic cues",
   "original": "sp02_663",
   "page_count": 4,
   "order": 151,
   "p1": "663",
   "pn": "666",
   "abstract": [
    "The earlier work of [1] showed that listeners could discern speaker-ethnicity from both full and shortened stretches of casually-produced speech. The type of cues listeners used to accomplish this remained unclear, however. In this study the phonetic detail of speech was removed by filtering; both mono- and multilingual subjects were then required to determine the ethnicity of speakers using the prosodic cues that remained. Results show that attributions can still be made using such cues. Also seen was that monolingual listeners tended to be the better performers. Overall however, the task was less trivial than the majority of subjects had anticipated.\n",
    "",
    "",
    "Todd, R., 1998. Auditory Perception and Ethnic Group Attribution of Unknown Voices: Assessing the Robustness of Experienced Listeners’ Ratings when Confronted with Non-Native but Proficient English Speech. Proceedings of The Institute of Acoustics: Speech ‘98, 6, 343-350.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-151"
  },
  "tseng02_speechprosody": {
   "authors": [
    [
     "Chiu-yu",
     "Tseng"
    ]
   ],
   "title": "The prosodic status of breaks in running speech: examination and evaluation",
   "original": "sp02_667",
   "page_count": 4,
   "order": 152,
   "p1": "667",
   "pn": "670",
   "abstract": [
    "Recent investigations of prosody organization appeared to focus more on how best to determine operating prosodic units and how these units are put together. However, the prosodic role of breaks/pauses in running speech has not received due attention. This paper shows that breaks in running speech functions as a prosodic unit on their own, are perceptually significant in a systematic manner and therefore should be considered as a necessary feature and cue in the organization of speech prosody.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-152"
  },
  "ulbrich02_speechprosody": {
   "authors": [
    [
     "Christiane",
     "Ulbrich"
    ]
   ],
   "title": "A comparative study of intonation in three standard varieties of German",
   "original": "sp02_671",
   "page_count": 4,
   "order": 153,
   "p1": "671",
   "pn": "674",
   "abstract": [
    "This paper presents a comparative analysis of declarative intonation produced by standard speakers of German from Austria, Germany and Switzerland. The analysis was based on a directly comparable corpus of speech data. A perception test with phoneticians from the three countries suggested (1) that speakers from the three varieties produce different tunes on accented syllables, and (2) that there are differences in the phonetic realisation of accented syllables. German speakers produce salient intensity differences between accented and unaccented syllables but Swiss and Austrian speakers do not.\n",
    "These hypotheses were investigated via phonological and acoustic analyses. The results revealed cross-varietal differences in tune structure in the German data on the one hand and the Swiss and the Austrian data on the other. Swiss and Austrian tunes ended with an intonation-phrase internal, possibly stress-seeking boundary tone followed by a final boundary tone. German utterances did not have two boundary tones. Cross-varietal differences in the phonetic realisation of accents were found also. In nuclear accents, intensity differences between accented and unaccented syllables were greater in German utterances than in Swiss and Austrian utterances.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-153"
  },
  "venditti02_speechprosody": {
   "authors": [
    [
     "Jennifer J.",
     "Venditti"
    ],
    [
     "Matthew",
     "Stone"
    ],
    [
     "Preetham",
     "Nanda"
    ],
    [
     "Paul",
     "Tepper"
    ]
   ],
   "title": "Discourse constraints on the interpretation of nuclear-accented pronouns",
   "original": "sp02_675",
   "page_count": 4,
   "order": 154,
   "p1": "675",
   "pn": "678",
   "abstract": [
    "This paper reports the results from an experimental study of on-line interpretation of nuclear-accented (subject) pronouns in English. We present data suggesting that (i) the type of inferred discourse coherence relation, and (ii) the ability to resolve the presupposition of contrast evoked by the accent locally, influences the interpretation of accented pronouns. In addition, our data tell us something about the time-course of incremental interpretation of utterances with accented subject pronouns. We find that both potential antecedents are evoked immediately upon hearing the accented pronoun. A preference for one referent over the other only emerges once subsequent propositional information is encountered which lends support for the inferred discourse relation.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-154"
  },
  "viallet02_speechprosody": {
   "authors": [
    [
     "François",
     "Viallet"
    ],
    [
     "Bernard",
     "Teston"
    ],
    [
     "Ludovic",
     "Jankowski"
    ],
    [
     "Alain",
     "Purson"
    ],
    [
     "Jean Claude",
     "Peragut"
    ],
    [
     "Jean",
     "Regis"
    ],
    [
     "Tatiana",
     "Witjas"
    ]
   ],
   "title": "Effects of pharmacological versus electrophysiological treatments on Parkinsonian dysprosody",
   "original": "sp02_679",
   "page_count": 4,
   "order": 155,
   "p1": "679",
   "pn": "682",
   "abstract": [
    "Dysprosody represents an essential part of the lack of speech intelligibility in Parkinson disease. To date, patients’ management has been based on two therapeutic interventions: L-DOPA medication and/or sub-thalamic nucleus (STN) stimulation. Herein, we studied speech production in two groups of ten patients (one group for each treatment), by means of three prosodic parameters: pitch, intensity, and duration.\n",
    "The results of this study show a clear effect only on the pitch parameter (mean F0 and F0 standard deviation) with either treatment: L-DOPA or STN stimulation. No significant change was obtained on either intensity or duration with these treatments.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-155"
  },
  "vizcainoortega02_speechprosody": {
   "authors": [
    [
     "Francisco",
     "Vizcaino Ortega"
    ]
   ],
   "title": "A preliminary analysis of yes/no questions in Glasgow English",
   "original": "sp02_683",
   "page_count": 4,
   "order": 156,
   "p1": "683",
   "pn": "686",
   "abstract": [
    "One of the three possible intonation patterns found in Glasgow English y/n questions end in mid pitch. An account of this contour with H% - relatively high pitch - though explanatorily adequate because of a semantic generalisation that groups most questions together, is descriptively inadequate because of the pitch height consistently reached, mid level, and not relatively high pitch. To achieve both explanatory and descriptive adequacy, I propose an analysis with downstep of the right boundary tone H, which would yield a unified account of these mid level endings. This proposal, then, means another possible phonetic implementation of H%.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-156"
  },
  "wagner02_speechprosody": {
   "authors": [
    [
     "Petra",
     "Wagner"
    ],
    [
     "Eva",
     "Fischenbeck"
    ]
   ],
   "title": "Stress perception and production in German stress clash environments",
   "original": "sp02_687",
   "page_count": 4,
   "order": 157,
   "p1": "687",
   "pn": "690",
   "abstract": [
    "Several production and perception experiments have been carried out in order to investigate, whether stress clash environments in A(BC)-compounds really trigger a stress shift or a destressing of the secondary stress or not. The results indicate that stress shifting is rather rare than common in German. If it occurs, it manifests itself both on a production and perception level. This situation remains stable, no matter if listeners are presented the full acoustic signal or only delexicalised stimuli. The only environment where stress shift tends to take place more often are words consisting of four syllables. These allow for placement of an additional foot. Stress clashes in trisyllabic compounds are often handled by a destressing of the secondary accent as an alternative to stress shift. However, in the majority of stress clash environments, listeners did perceive the primary and secondary stress in the immediate neighbourhood. Obviously, a stress clash creates less of a problem in German than it does in other Germanic languages.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-157"
  },
  "watanabe02_speechprosody": {
   "authors": [
    [
     "Michiko",
     "Watanabe"
    ]
   ],
   "title": "Fillers as indicators of discourse segment boundaries in Japanese monologues",
   "original": "sp02_691",
   "page_count": 4,
   "order": 158,
   "p1": "691",
   "pn": "694",
   "abstract": [
    "We investigated distribution of fillers (filled pauses) in the vicinity of boundaries of different strengths in Japanese monologues, to understand whether fillers may convey information about the location and the strength of boundaries. Consistent with the results of studies on Dutch monologues, fillers tend to increase as the boundary strength grows. It has also been revealed that fillers tend to occur phrase-initially, more strongly at deeper boundaries than at shallower ones. Regarding filler types, the frequency of eto grows most sharply as boundary strength increases, as does e to a lesser degree. These findings indicate that occurrence of fillers, particularly phrase-initial eto and e, provide contributory evidence to discourse boundaries.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-158"
  },
  "welby02_speechprosody": {
   "authors": [
    [
     "Pauline",
     "Welby"
    ]
   ],
   "title": "The realization of early and late rises in French intonation: a production study",
   "original": "sp02_695",
   "page_count": 4,
   "order": 159,
   "p1": "695",
   "pn": "698",
   "abstract": [
    "The results of a production study of two speakers provide evidence against models of French intonation in which there is a one-to-one correspondence between a syllable and each of the L (low) and H (high) tones of a rise. The results also fail to confirm claims about the influence of the consonant or vowel status of an accentable syllable on the placement of the H of the early rise. The L tone of the early rise consistently straddled the boundary between the last function word and first content word of the phrase (e.g., for un ENfant SAGE, the L tone would be realized very late in un or very early in EN), with a low leading plateau extending leftward to the beginning of the phrase. This timing is accounted for in the current proposal by a double association of the L tone of a LH- edge tone to the left edge of the phrase and to the left edge of the first content word of a phrase, similar to the double association of phrase accents discussed in Grice et al. (2000) for a number of languages.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-159"
  },
  "wendt02_speechprosody": {
   "authors": [
    [
     "Beate",
     "Wendt"
    ],
    [
     "Henning",
     "Scheich"
    ]
   ],
   "title": "The \"magdeburger prosodie-korpus\"",
   "original": "sp02_699",
   "page_count": 3,
   "order": 160,
   "p1": "699",
   "pn": "702",
   "abstract": [
    "Previous studies on prosody perception showed inconsistent results concerning the functional role of the hemispheres. One argument for this might be the stimulus material was not sufficiently evaluated. Thus, we developed a corpus which fulfils this requirement.\n",
    "The \"Magdeburger Prosodie-Korpus\" which was specifically developed for the requirements of fMRI and MEG studies contains two parts. The first part consists of German nouns, the second part of pseudo-words, with both parts being spoken with different emotional prosodies by an actor and an actress. All nouns were evaluated with respect to the emotional connotation (positive, negative, neutral) of their semantic content. The results showed that only a small number of nouns received the same emotional assessment from the participants. The different emotional prosodies of the pseudo-words were assessed by a group of expert (phonetician) and non-expert listeners who are all native German speakers. All emotional prosodies (happiness, sadness, fear, anger, disgust, and neutral), spoken by the man and the woman, were identified by more than 70% of all listeners, except for sadness of the man. There were no significant differences with respect to the gender of the listeners or the speakers.\n",
    "The acoustic analysis showed differences in specific acoustic features of the various emotional prosodies, for example, pitch contour, duration, stress, and intensity. The results were added to the database of the \"Magdeburger Prosodie-Korpus\".\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-160"
  },
  "wretling02_speechprosody": {
   "authors": [
    [
     "Pär",
     "Wretling"
    ],
    [
     "Eva",
     "Strangert"
    ],
    [
     "Felix",
     "Schaeffler"
    ]
   ],
   "title": "Quantity and preaspiration in Northern Swedish dialects",
   "original": "sp02_703",
   "page_count": 4,
   "order": 161,
   "p1": "703",
   "pn": "706",
   "abstract": [
    "Preaspiration is not unusual in connection with unvoiced consonants in Swedish. In all the 20 Northern Swedish dialects covered in this study unvoiced stops following stressed vowels are preaspirated to at least some extent, although preaspiration is not characteristic for all speakers. However, in two of the dialects preaspiration plays a more prominent and even normative role, being a means to maintain quantity distinctions. Preaspiration moreover fills this function in different ways in the two dialects. The description of this dependence on preaspiration for quantity distinctions is the topic of this paper.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-161"
  },
  "yang02_speechprosody": {
   "authors": [
    [
     "Yufang",
     "Yang"
    ],
    [
     "Bei",
     "Wang"
    ]
   ],
   "title": "Acoustic correlates of hierarchical prosodic boundary in Mandarin",
   "original": "sp02_707",
   "page_count": 4,
   "order": 162,
   "p1": "707",
   "pn": "710",
   "abstract": [
    "The aim of this paper is to present a systematical analysis of the acoustic correlates of hierarchical prosodic boundaries. This analysis is based on a large labeled corpus of Mandarin Chinese. The acoustic correlates include the lowest value of pitch and the duration of the silence. The prosodic structure is defined thanks to a perception experiment. The main results are : a) the declination of intonation in Chinese is achieved through the bottom line of the intonational contour ; b) the acoustic correlates of prosodic word boundaries are preboundary lengthening and a slight pitch reset of the bottom line of intonation ; c) the acoustic correlates of prosodic phrase boundaries and intonational phrase boundaries are a significant pitch reset of the bottom line of intonation and the insertion of a silence. Moreover, the higher the prosodic boundary is, the higher the extent of the pitch reset is and the longer the silence is. There is no significant difference on pre-boundary lengthening between the syllables on these two boundaries.\n",
    "In conclusion, pre-boundary lengthening is the acoustic correlate of weak boundary. Pitch reset is that of medium boundary, while silence is that of strong boundary. The acoustic correlate of lower boundaries can also occur on larger boundaries, but the acoustic correlate of larger boundaries usually does not occur on lower boundaries.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-162"
  },
  "yuan02_speechprosody": {
   "authors": [
    [
     "Jiahong",
     "Yuan"
    ],
    [
     "Chilin",
     "Shih"
    ],
    [
     "Greg P.",
     "Kochanski"
    ]
   ],
   "title": "Comparison of declarative and interrogative intonation in Chinese",
   "original": "sp02_711",
   "page_count": 4,
   "order": 163,
   "p1": "711",
   "pn": "714",
   "abstract": [
    "We model the differences between declarative and interrogative intonation in Chinese with Stem-ML, an intonation description language combined with an algorithm for translating tags into quantitative prosody. Our study shows that the diverse surface patterns can be accounted for by two consistent gestures: 1. Interrogative intonation has a higher phrase curve than declarative intonation; 2. Sentence final syllables have more careful intonation and wider pitch swings in interrogative sentences. Phrase curves of the two intonation types tend to be parallel and boundary tones are not necessary for modeling the differences between the two intonation types in Chinese.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-163"
  },
  "yuen02_speechprosody": {
   "authors": [
    [
     "Ivan",
     "Yuen"
    ]
   ],
   "title": "Tonal invariance and downtrend in Cantonese",
   "original": "sp02_715",
   "page_count": 4,
   "order": 164,
   "p1": "715",
   "pn": "718",
   "abstract": [
    "Studies of downtrend have reported that accents/tones are realised at progressively lower F0 values during an utterance. Listeners are reported to compensate for such F0 variations over time( Pierrehumbert 1979). Underlying the downtrend studies is the assumption that the phonological categories under investigation are invariant over time and that declination can be factored out of the quantitative characterisation of a given phonological category. In studying Vietnamese tones, Earle (1975) found that variable F0 values for tones can be resolved to distinctive tonal categories in relation to a normalised tonal space: after normalisation, stable and consistent tonal relations were uncovered. The current paper investigates whether such a normalisation is possible as the tonal space changes over time with declination. A production study based on read speech showed first that there is downtrend in Cantonese, and second tonemes exhibit quantitative invariance relative to a locally-determined tonal space.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-164"
  },
  "zaki02_speechprosody": {
   "authors": [
    [
     "A.",
     "Zaki"
    ],
    [
     "A.",
     "Rajouani"
    ],
    [
     "Z.",
     "Luxey"
    ],
    [
     "M.",
     "Najim"
    ]
   ],
   "title": "Rules based model for automatic synthesis of f0 variation for declarative Arabic sentences",
   "original": "sp02_719",
   "page_count": 4,
   "order": 165,
   "p1": "719",
   "pn": "722",
   "abstract": [
    "This paper deals with automatic generation of fundamental frequency (F0) contours for standard Arabic language. We use synthesis by rule for modelling Arabic intonation. The proposed model is based on the assumption that linguistic information is contained in target points of intonative contour. The perception of Arabic lexical accent is correlated with variations of F0. Rules used to determine target points are based particularly on accentuation algorithm. The existence of a declination phenomenon is discussed and introduced in our model. The validation of this model is carried out by TTS system based on TD-PSOLA technique. We provide an evaluation of our results based on perceptive test. The proposed processing of intonation allows a noticeable improvement of speech synthesis naturalness.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-165"
  },
  "zee02_speechprosody": {
   "authors": [
    [
     "Eric",
     "Zee"
    ]
   ],
   "title": "The effect of speech rate on the temporal organization of syllable production in Cantonese",
   "original": "sp02_723",
   "page_count": 4,
   "order": 166,
   "p1": "723",
   "pn": "726",
   "abstract": [
    "The study investigates the effect of speech rate on the temporal organization of syllable production of in Hong Kong Cantonese. The results show that all the component segments of the test syllables, including the vowel-nasal transitions and elementelement transitions in the diphthongs, contribute to the reduction of the entire syllable durations in fast speech. While the percentages of duration reduction for the syllable-initial consonants in all the test syllables are similar, the percentages of duration reduction for the vowels, vowel-nasal transitions, syllable-final nasals, first vowel elements, element-element transitions, and second vowel elements vary according to the types of syllable structure in the language.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-166"
  },
  "zellnerkeller02_speechprosody": {
   "authors": [
    [
     "Brigitte",
     "Zellner Keller"
    ]
   ],
   "title": "Revisiting the status of speech rhythm",
   "original": "sp02_727",
   "page_count": 4,
   "order": 167,
   "p1": "727",
   "pn": "730",
   "abstract": [
    "Text-to-Speech synthesis offers an interesting manner of synthesising various knowledge components related to speech production. To a certain extent, it provides a new way of testing the coherence of our understanding of speech production in a highly systematic manner. For example, speech rhythm and temporal organisation of speech have to be well-captured in order to mimic a speaker correctly.\n",
    "The simulation approach used in our laboratory for two languages supports our original hypothesis of multidimensionality and non-linearity in the production of speech rhythm. This paper presents an overview of our approach towards this issue, as it has been developed over the last years.\n",
    "We conceive the production of speech rhythm as a multidimensional task, and the temporal organisation of speech as a key component of this task (i.e., the establishment of temporal boundaries and durations). As a result of this multidimensionality, text-to-speech systems have to accommodate a number of systematic transformations and computations at various levels. Our model of the temporal organisation of read speech in French and German emerges from a combination of quantitative and qualitative parameters, organised according to psycholinguistic and linguistic structures. (An ideal speech synthesiser would also take into account subphonemic as well as pragmatic parameters. However such systems are not yet available). Online Synthesis: http://www.unil.ch/servlets/imm/SyntheseServlet Sound examples: http://www.unil.ch/imm/docs/LAIP/LAIPTTS.html\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-167"
  },
  "zetterholm02_speechprosody": {
   "authors": [
    [
     "Elisabeth",
     "Zetterholm"
    ]
   ],
   "title": "Intonation pattern and duration differences in imitated speech",
   "original": "sp02_731",
   "page_count": 4,
   "order": 168,
   "p1": "731",
   "pn": "734",
   "abstract": [
    "The present paper is a study of one impersonator and one of his voice imitations. The aim of the study was to investigate how he changes his own voice and speech behavior in order to get close to the target speaker’s. A comparison is made between three recordings of the same text material: the target speaker, the voice imitation and the impersonator’s own voice and dialect. The results presented in this paper focus on mean fundamental frequency, intonation pattern and duration differences. It is obvious that the impersonator changes his dialect and articulation in the voice imitation.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-168"
  },
  "zharkova02_speechprosody": {
   "authors": [
    [
     "Natalia N.",
     "Zharkova"
    ]
   ],
   "title": "Acquisition of prosody in Russian",
   "original": "sp02_735",
   "page_count": 4,
   "order": 169,
   "p1": "735",
   "pn": "738",
   "abstract": [
    "In this study, a 1.5-hour conversation of a three-year-old Russian girl and her mother was audiotaped and analysed. The speech of the girl is not typical of her normally developing peers, as many vowels and consonants are substituted by different ones, and segmental information is no more sufficient for adequate semantic interpretation. The present study shows that although the child’s speech is deviant in some way, the girl has acquired most of the intonation models of the native language, which is normal for three-year-old Russian children.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-169"
  },
  "zu02_speechprosody": {
   "authors": [
    [
     "Yiqing",
     "Zu"
    ],
    [
     "Hong",
     "Zheng"
    ]
   ],
   "title": "Effect of prosodic structure on segmental variants",
   "original": "sp02_739",
   "page_count": 4,
   "order": 170,
   "p1": "739",
   "pn": "742",
   "abstract": [
    "There is a large amount of segmental variants in a natural speech corpus. It is very important to label those variants correctly for a corpus based TTS system. We successfully applied automatic triphone segmentation to a large speech corpus with syllable segmentation and prosodic annotation. In this paper, we also report (1) recognition error analysis based on prosodic structure, and (2) the relationship between coarticulation phenomena and prosodic position.\n",
    ""
   ],
   "doi": "10.21437/SpeechProsody.2002-170"
  }
 },
 "sessions": [
  {
   "title": "Invited Papers",
   "papers": [
    "mozziconacci02_speechprosody",
    "wichmann02_speechprosody",
    "zeipollermann02_speechprosody",
    "wightman02_speechprosody",
    "mixdorff02_speechprosody",
    "li02_speechprosody",
    "gussenhoven02_speechprosody",
    "fretheim02_speechprosody",
    "hirschberg02_speechprosody",
    "toepel02_speechprosody",
    "pell02_speechprosody",
    "fodor02_speechprosody",
    "xu02_speechprosody",
    "dimperio02_speechprosody",
    "santen02_speechprosody",
    "ramus02_speechprosody",
    "cummins02_speechprosody",
    "grabe02_speechprosody"
   ]
  },
  {
   "title": "Contributed Papers",
   "papers": [
    "arnold02_speechprosody",
    "astesano02_speechprosody",
    "asu02_speechprosody",
    "atterer02_speechprosody",
    "auberge02_speechprosody",
    "aufterbeck02_speechprosody",
    "bagou02_speechprosody",
    "barbosa02_speechprosody",
    "batusek02_speechprosody",
    "bertrand02_speechprosody",
    "birch02_speechprosody",
    "bishop02_speechprosody",
    "botinis02_speechprosody",
    "boulademareuil02_speechprosody",
    "bouzon02_speechprosody",
    "caelenhaumont02_speechprosody",
    "campione02_speechprosody",
    "cao02_speechprosody",
    "cardenosopayo02_speechprosody",
    "chen02_speechprosody",
    "chen02b_speechprosody",
    "chung02_speechprosody",
    "claen02_speechprosody",
    "contini02_speechprosody",
    "cutugno02_speechprosody",
    "dainora02_speechprosody",
    "delaisroussarie02_speechprosody",
    "delmonte02_speechprosody",
    "doetjes02_speechprosody",
    "dohalskazichova02_speechprosody",
    "durand02_speechprosody",
    "ehrette02_speechprosody",
    "romera02_speechprosody",
    "erdem02_speechprosody",
    "erdem02b_speechprosody",
    "eriksson02_speechprosody",
    "fagyal02_speechprosody",
    "fant02_speechprosody",
    "faraco02_speechprosody",
    "fernandez02_speechprosody",
    "fletcher02_speechprosody",
    "fletcher02b_speechprosody",
    "francusik02_speechprosody",
    "fretheim02b_speechprosody",
    "friedrich02_speechprosody",
    "frota02_speechprosody",
    "frota02b_speechprosody",
    "galves02_speechprosody",
    "garcia02_speechprosody",
    "ghazali02_speechprosody",
    "gibbon02_speechprosody",
    "gilifivela02_speechprosody",
    "grabe02b_speechprosody",
    "granstrom02_speechprosody",
    "greenberg02_speechprosody",
    "grnnum02_speechprosody",
    "gubrynowicz02_speechprosody",
    "gustafsoncapkova02_speechprosody",
    "gut02_speechprosody",
    "hansson02_speechprosody",
    "hedberg02_speechprosody",
    "hermentdujardin02_speechprosody",
    "herry02_speechprosody",
    "hind02_speechprosody",
    "hirose02_speechprosody",
    "hirose02b_speechprosody",
    "holm02_speechprosody",
    "hu02_speechprosody",
    "ishi02_speechprosody",
    "ito02_speechprosody",
    "ito02b_speechprosody",
    "kang02_speechprosody",
    "kehrein02_speechprosody",
    "kida02_speechprosody",
    "kiriyama02_speechprosody",
    "kitazawa02_speechprosody",
    "knight02_speechprosody",
    "krahmer02_speechprosody",
    "lacheretdujour02_speechprosody",
    "lee02_speechprosody",
    "legac02_speechprosody",
    "lim02_speechprosody",
    "louali02_speechprosody",
    "man02_speechprosody",
    "marandin02_speechprosody",
    "marotta02_speechprosody",
    "martel02_speechprosody",
    "martin02_speechprosody",
    "mayer02_speechprosody",
    "mejvaldova02_speechprosody",
    "menezes02_speechprosody",
    "mertens02_speechprosody",
    "milde02_speechprosody",
    "minematsu02_speechprosody",
    "mixdorff02b_speechprosody",
    "mixdorff02c_speechprosody",
    "miyamoto02_speechprosody",
    "mobius02_speechprosody",
    "navas02_speechprosody",
    "nesterenko02_speechprosody",
    "nilsenova02_speechprosody",
    "oliveira02_speechprosody",
    "ouden02_speechprosody",
    "oudeyer02_speechprosody",
    "oudeyer02b_speechprosody",
    "pan02_speechprosody",
    "payacanals02_speechprosody",
    "pellegrino02_speechprosody",
    "peters02_speechprosody",
    "pietrosemoli02_speechprosody",
    "piot02_speechprosody",
    "portes02_speechprosody",
    "post02_speechprosody",
    "prieto02_speechprosody",
    "qian02_speechprosody",
    "rialland02_speechprosody",
    "riecker02_speechprosody",
    "rietveld02_speechprosody",
    "rilliard02_speechprosody",
    "rolland02_speechprosody",
    "pierluigi02_speechprosody",
    "sander02_speechprosody",
    "sauerland02_speechprosody",
    "schaeffler02_speechprosody",
    "schirmer02_speechprosody",
    "schon02_speechprosody",
    "schweitzer02_speechprosody",
    "selkirk02_speechprosody",
    "simon02_speechprosody",
    "smirnova02_speechprosody",
    "sugahara02_speechprosody",
    "thurgood02_speechprosody",
    "todd02_speechprosody",
    "tseng02_speechprosody",
    "ulbrich02_speechprosody",
    "venditti02_speechprosody",
    "viallet02_speechprosody",
    "vizcainoortega02_speechprosody",
    "wagner02_speechprosody",
    "watanabe02_speechprosody",
    "welby02_speechprosody",
    "wendt02_speechprosody",
    "wretling02_speechprosody",
    "yang02_speechprosody",
    "yuan02_speechprosody",
    "yuen02_speechprosody",
    "zaki02_speechprosody",
    "zee02_speechprosody",
    "zellnerkeller02_speechprosody",
    "zetterholm02_speechprosody",
    "zharkova02_speechprosody",
    "zu02_speechprosody"
   ]
  }
 ],
 "doi": "10.21437/SpeechProsody.2002"
}