{
 "title": "ESCA/NATO Workshop on Speech under Stress",
 "location": "Lisbon, Portugal",
 "startDate": "14/9/1995",
 "endDate": "15/9/1995",
 "conf": "SUS",
 "year": "1995",
 "name": "sus_1995",
 "series": "",
 "SIG": "",
 "title1": "ESCA/NATO Workshop on Speech under Stress",
 "date": "14-15 September 1995",
 "papers": {
  "protopapas95_sus": {
   "authors": [
    [
     "Athanassios",
     "Protopapas"
    ],
    [
     "Philip",
     "Lieberman"
    ]
   ],
   "title": "Effects of vocal <i>f</i><sub>0</sub> manipulations on perceived emotional stress",
   "original": "sus5_001",
   "page_count": 4,
   "order": 1,
   "p1": "1",
   "pn": "4",
   "abstract": [
    "In this study we investigated the effect of jitter and long-term Fo measures on perceived emotional stress using stimuli synthesized with the LPC coefficients of a steady vowel and varying Fo-tracks. The original Fo tracks were taken from naturally occurring speech in stressful and not stressful conditions. Stimuli with more jitter were rated as sounding more hoarse but not more stressed. Mean and maximum Fo within an utterance correlated highly (r>0.8) with stress ratings but range of Fq did not correlate significantly with the stress ratings, especially after the effect of maximum Fo was removed by stepwise regression.\n",
    ""
   ]
  },
  "whitmore95_sus": {
   "authors": [
    [
     "Jeffrey",
     "Whitmore"
    ],
    [
     "William",
     "Storm"
    ]
   ],
   "title": "Voice changes during sustained duty periods",
   "original": "sus5_005",
   "page_count": 4,
   "order": 2,
   "p1": "5",
   "pn": "8",
   "abstract": [
    "Research was conducted to determine if alterations in the acoustical characteristics of voice occur over periods of sustained wakefulness. Twelve male United States Air Force B-1B aircrewmen participated in the study. The participants served in teams of four and performed three 36-hour experimental periods (missions) in a high-fidelity simulator. The missions were interspersed with 36-hour rest breaks. Data were lost from two members of the third team due to a communication malfunction. Speech, cognitive, and subjective fatigue data were collected approximately every three hours for 11 trials per mission. Fundamental frequency and speech duration were both found to vary significantly over trials (fundamental frequency F(10,90)=2.63, p=0076, speech duration F(10,90)=2.5, p=.0106). Speech duration results also showed a significant main effect of mission (F(2,18)=6.91, p=.0082). The speech data follow the same trend as the data from the cognitive tests and subjective measures. A strong diurnal pattern is reflected in nearly all of the dependent measures. Overall, the results support the proposition that voice may be a reliable and valid indicator of a speaker's fatigue state.\n",
    ""
   ]
  },
  "waters95_sus": {
   "authors": [
    [
     "Jeff",
     "Waters"
    ],
    [
     "Steve",
     "Nunn"
    ],
    [
     "Brenda",
     "Gillcrist"
    ],
    [
     "Eric",
     "VonColln"
    ]
   ],
   "title": "The effect of stress on the glottal pulse",
   "original": "sus5_009",
   "page_count": 3,
   "order": 3,
   "p1": "9",
   "pn": "11",
   "abstract": [
    "A study was performed on task-loaded and normal speech from nine speakers to determine whether there are any measurable effects on the excitation signal, primarily the shape of the glottal pulse. Inverse filtering of the original speech was used to recover the glottal pulse train. Measures included pitch, amplitude, rising slope, closing slope, and three factors derived from a beta function model of the glottal pulse. Results suggest there are measurable effects on the excitation signal in stressed speech. These effects are largely speaker dependent. Analysis of the measures suggest stress in the majority of speakers causes a significant variation in pitch, and either a narrowing of the glottal pulse independent of pitch or a significant shift in the pulse mass.\n",
    ""
   ]
  },
  "arnfield95_sus": {
   "authors": [
    [
     "Simon",
     "Arnfield"
    ],
    [
     "Peter",
     "Roach"
    ],
    [
     "Jane",
     "Setter"
    ],
    [
     "Peter",
     "Greasley"
    ],
    [
     "Dave",
     "Horton"
    ]
   ],
   "title": "Emotional stress and speech tempo variation",
   "original": "sus5_013",
   "page_count": 3,
   "order": 4,
   "p1": "13",
   "pn": "15",
   "abstract": [
    "In studying the effect of emotional stress on speech, it is necessary to give attention to variations in speaking tempo. Recordings made for the Emotion in Speech project are being analysed both for prosodic and for emotional content. A simple measurement procedure for speech tempo is being used to look for cases of acceleration and deceleration in conditions of emotional stress.\n",
    ""
   ]
  },
  "noyes95_sus": {
   "authors": [
    [
     "Jan",
     "Noyes"
    ],
    [
     "Chris",
     "Baber"
    ]
   ],
   "title": "Speech recognition in adverse environments: the role of human mediation",
   "original": "sus5_017",
   "page_count": 4,
   "order": 5,
   "p1": "17",
   "pn": "20",
   "abstract": [
    "Automatic Speech Recognition (ASR) technology allows human speech signals to be used in order to carry out pre-set activities; upon detection and recognition of a sound or string of sounds, the recogniser can be programmed to execute pre-determined actions. Consequently, many groups of individuals have benefited from using ASR in human-machine interaction, human to human communications and as a means of control in their immediate environments. It is generally recognised that environmental factors play a major role in influencing the use of ASR technology, and applications would be anticipated as being more successful in environments which do not impede the attainment of acceptable recognition performance.\n",
    "In terms of extending the use of speech recognition technology to so-called 'adverse environments', an immediate solution might be to attempt to build recognisers robust enough to cope with environmental stressors, and indeed this is happening. However, the characteristics of the technology only represent one side of the interaction process, and do not take into account the role of human mediation. The influence of environmental factors can be shaped by human mediation, i.e. by decisions and efforts made by the user to counter the possible effects of different environmental factors. The conclusion drawn here is that although the focus of the research effort has been towards implementing mediation through the technology, there are also many benefits to be attained from consideration of the user's role when interacting with ASR technology.\n",
    ""
   ]
  },
  "thompson95_sus": {
   "authors": [
    [
     "J.",
     "Thompson"
    ],
    [
     "J. S.",
     "Mason"
    ]
   ],
   "title": "Effects of anxiety in visual and audio speech databases",
   "original": "sus5_021",
   "page_count": 4,
   "order": 6,
   "p1": "21",
   "pn": "24",
   "abstract": [
    "A large proportion of current speech related research is founded upon databases collected under controlled conditions. The manner in which they are collected is likely induce variations due to anxiety, and analysis of a typical speech database is presented supporting this. Trends in speaker identification (SI) error rates correlate with postulated trends in anxiety levels along the time course of data collection. Further analysis using estimated glottal waveforms shows a speaker that causes high SI errors to have speech that exhibits characteristics of higher stress at the initial phase of database recording.\n",
    ""
   ]
  },
  "bard95_sus": {
   "authors": [
    [
     "Ellen G.",
     "Bard"
    ],
    [
     "C.",
     "Sotillo"
    ],
    [
     "A. H.",
     "Anderson"
    ],
    [
     "M. M.",
     "Taylor"
    ]
   ],
   "title": "The DCIEM map task corpus: spontaneous dialogue under sleep deprivation and drug treatment",
   "original": "sus5_025",
   "page_count": 4,
   "order": 7,
   "p1": "25",
   "pn": "28",
   "abstract": [
    "This paper describes a corpus of 216 unscripted task-oriented dialogues which were produced by normal adults in the course of a sleep deprivation experiment under 3 drug conditions. The materials on which the dialogues were based limit vocabulary and genre. Preliminary examination of length and task performance measures indicate effects of drug treatments and sleep deprivation. The corpus and accompanying materials are being made available on CD-ROM.\n",
    ""
   ]
  },
  "tischer95_sus": {
   "authors": [
    [
     "Bernd",
     "Tischer"
    ]
   ],
   "title": "Acoustic correlates of perceived emotional stress",
   "original": "sus5_029",
   "page_count": 4,
   "order": 8,
   "p1": "29",
   "pn": "32",
   "abstract": [
    "In this study the predictability of 15 discrete emotions (e.g. fear, uncertainty, rage, anger, sadness, love, tenderness, satisfaction, joy, sexual pleasure, surprise) and 6 bipolar emotional dimensions (feeling good/bad, strong/weak, certain/uncertain, tense/relaxed, excited/calm, sympathetic/not sympathetic) by 39 acoustic parameters was tested by multiple regression analysis. The stimulus material consisted of 60 utterances expressing 15 emotions (constant wording: SAG DAS NOCHMAL. ICH KANN'S NICHT GLAUBEN. WAS FÜR EIN TAG). For each emotion the quality of the emotional impression is nearly perfectly predictable from acoustic parameters. Within the domain of emotional stress the acoustic correlates of excitement, tension, feeling good/bad, fear, uncertainty, anger, sadness and surprise were examined seperately. Results show that perceived excitement is mainly mediated by fundamental frequency (within-syllable and between-syllable variation), whereas negative evaluated excitement and anxiety is mediated by (short) vowel duration and rising intensity within sentences. Anger, fear, uncertainty, sadness and surprise can be discriminated by additional acoustic features of speed, intensity and fundamental frequency. However, with increasing utterance length the impression of emotional stress is mediated by different acoustic features. Most of the 39 parameters affect the perceived emotional state only locally, at single parts of the utterances. Only four parameters have a stable influence on within-utterance variations of perceived emotional stress (within-utterance variations of F0, variations of vowel duration, downward F0 perturbation, sudden increase of intensity between phonological phrases).\n",
    ""
   ]
  },
  "applebaum95_sus": {
   "authors": [
    [
     "T. H.",
     "Applebaum"
    ],
    [
     "B. A.",
     "Hanson"
    ],
    [
     "P.",
     "Morin"
    ]
   ],
   "title": "Recognition strategies for Lombard speech",
   "original": "sus5_033",
   "page_count": 4,
   "order": 9,
   "p1": "33",
   "pn": "36",
   "abstract": [
    "Environmental noise is a stress which induces the Lombard style of speech. The effects of this change in speech style is observed on three automatic speech recognition systems. A low complexity word recognizer using reliably found regions of high phoneme similarity was found to perform as well, under normal and Lombard speech styles, as an HMM-based recog- nizer using cepstral coefficients and their derivatives.\n",
    ""
   ]
  },
  "baber95_sus": {
   "authors": [
    [
     "Chris",
     "Baber"
    ],
    [
     "Jan",
     "Noyes"
    ]
   ],
   "title": "Automatic speech  recognition systems: effects of environmental stressors",
   "original": "sus5_037",
   "page_count": 4,
   "order": 10,
   "p1": "37",
   "pn": "40",
   "abstract": [
    "There are a number of types of environmental stressor which can have an adverse impact on the use of automatic speech recognition. In this paper, a systems approach to the problem is presented, in which the system comprises the human and the speech recognition device performing specific tasks in a defined environment. From this perspective, the locus of the effects of environmental stressors can be seen to be the interface between human and speech recognition device. This means that it is important to appreciate the effects of the stressors on both human performance and speech production, and the likely consequences of these effects for the efficiency of the speech recognition system.\n",
    ""
   ]
  },
  "womack95_sus": {
   "authors": [
    [
     "Brian D.",
     "Womack"
    ],
    [
     "John H. L.",
     "Hansen"
    ]
   ],
   "title": "Stressed speech classification with application to robust speech recognition",
   "original": "sus5_041",
   "page_count": 4,
   "order": 11,
   "p1": "41",
   "pn": "44",
   "abstract": [
    "It is well known that the variability in speech production due to task induced stress contributes significantly to loss in speech recognition performance. If an algorithm could be formulated which estimates the speech stress condition, then such knowledge could be integrated to improve robustness of speech recognizers in adverse conditions. In this paper, the problem of automatic stressed speech recognition is addressed. The primary goal is to formulate a tandem HMM and neural network based algorithm for stress independent recognition. To motivate an effective stress classifier, an analysis is performed of speech produced across eleven stress conditions (e.g. Angry, Clear, Fast, Lombard, Loud, Slow, Soft, etc.). Features that differentiate stress using a previously established stressed speech database (SUSAS) are employed (with 11 speakers). Two neural network algorithms are formulated to estimate a speech stress condition probability vector (with classification rates on the order of 58-100%). The stress classification output probability vector is used to weight the outputs of a codebook of stress dependent HMM recognizers to generate an improved overall recognition score. It is suggested that this approach will accommodate the intra-speaker variability due to task induced stress in adverse conditions.\n",
    ""
   ]
  },
  "boughazale95_sus": {
   "authors": [
    [
     "Sahar E.",
     "Bou-Ghazale"
    ],
    [
     "John H. L.",
     "Harisen"
    ]
   ],
   "title": "Improving recognition and synthesis of stressed speech via feature perturbation in a source generator framework",
   "original": "sus5_045",
   "page_count": 4,
   "order": 12,
   "p1": "45",
   "pn": "48",
   "abstract": [
    "The objectives of this work are two fold, consisting of improving both speech recognition and synthesis of speech under stress. Improved recognition is achieved by generating simulated-stress tokens to replace neutral data used in the recognizer training phase. The second goal is directed at generating stressed speech from neutral speech. This is accomplished by formulating speech parameter models for angry, Lombard effect, and loud speaking conditions, and perturbing the parameters of neutral speech. The studies/evaluations conducted are based on a previously established stress database, called SUSAS (Speech Under Simulated and Actual Stress). Results show that the token generation training method improved isolated word recognition by an overall average of 15% when compared to neutral trained isolated word recognition. Results from formal listener evaluations of stress perturbed neutral speech show successful classification rates of 87% for angry speech, 75% for Lombard effect speech, and 92% for loud speech.\n",
    ""
   ]
  },
  "ruiz95_sus": {
   "authors": [
    [
     "Robert",
     "Ruiz"
    ],
    [
     "Emmanuelle",
     "Absil"
    ],
    [
     "Bruno",
     "Gramatica"
    ],
    [
     "Bernard",
     "Harmegnies"
    ],
    [
     "Claude",
     "Legros"
    ],
    [
     "Dolors",
     "Poch"
    ]
   ],
   "title": "Spectrum-related variabilities in stressed speech under laboratory and real conditions",
   "original": "sus5_049",
   "page_count": 4,
   "order": 13,
   "p1": "49",
   "pn": "52",
   "abstract": [
    "Emotional stress induced by various types of situations leads to vocal signal modifications. Previous studies have indicated that stressed speech has a higher fundamental frequency Fo and presents noticeable changes in the spectrum of vowels.\n",
    "In this paper, spectrum-related variations are studied. All the corresponding spectrum-related indicators are applied to stress detection in a laboratory situation (Stroop's psychometric stress test) and a real situation (Cockpit Voice Recording) inducing emotional disturbances.\n",
    ""
   ]
  },
  "absil95_sus": {
   "authors": [
    [
     "Emmanuelle",
     "Absil"
    ],
    [
     "Bruno",
     "Gramatica"
    ],
    [
     "Bernard",
     "Harmegnies"
    ],
    [
     "Claude",
     "Legros"
    ],
    [
     "Dolors",
     "Poch"
    ],
    [
     "Robert",
     "Ruiz"
    ]
   ],
   "title": "Time-related variabilities in stressed speech under laboratory and real conditions",
   "original": "sus5_053",
   "page_count": 4,
   "order": 14,
   "p1": "53",
   "pn": "56",
   "abstract": [
    "The paper presents pitch-based analyzes of stressed speech corpora drawn from both artificial and real situations. The laboratory corpus is obtained by means of the Stroop test, the real-case corpus is extracted from the CVR of a crashed airplane. Analyzes relying on pitch are presented, and an index of microprosodic variation, (i, is introduced. The discriminating powers of the parameters used are studied in both situations by means of inferential statistics and discriminant analyzes. The results confirm the validity of laboratory experiments on stress, but emphazise quantitative as well as qualitative differences between the situations and speakers involved.\n",
    ""
   ]
  },
  "castellanos95_sus": {
   "authors": [
    [
     "A.",
     "Castellanos"
    ],
    [
     "J. M.",
     "Benedi"
    ],
    [
     "F.",
     "Casacuberta"
    ]
   ],
   "title": "An acoustic-phonetic analysis of Spanish Lombard speech",
   "original": "sus5_057",
   "page_count": 4,
   "order": 15,
   "p1": "57",
   "pn": "60",
   "abstract": [
    "The Lombard effect is a pronunciation phenomenon which consists of the articulatory changes made by the speakers in order to be more intelligible in a noisy environment. As a usual consequence, it affects the normal intelligibility of a human speaker and degrades the performance of a speech recognizer. The main purpose of the study presented in this paper was to characterize the possible common tendencies of some acoustic features in different phonetic units for Lombard speech. For each feature and each phonetic unit well-known statistical tests were applied using a large Spanish continuous speech corpus. As a result, previously reported changes produced in Lombard speech with regard to normal speech are confirmed, in general. Nevertheless, some new clear and homogeneous tendencies have been observed.\n",
    ""
   ]
  },
  "benson95_sus": {
   "authors": [
    [
     "Peter",
     "Benson"
    ]
   ],
   "title": "Analysis of the acoustic correlates of stress from an operational aviation emergency",
   "original": "sus5_061",
   "page_count": 4,
   "order": 16,
   "p1": "61",
   "pn": "64",
   "abstract": [
    "The acoustic correlates of psychological stress have largely been examined through artificial means. Task overloads and loud noise have been used to generate changes in a person's voice which, it has been hoped, are similar to actual changes found in an operational environment. Purely artificial approaches such as pretending to be angry have also been used. These approaches offer no guarantee that the measured changes are indeed the changes found in the real situation.\n",
    "An audio tape of pilot's speech during a serious aircraft malfunction, engine failure of the single-engine F-16 was obtained and analyzed. The tape records speech both before and after the incident. Analyses were made of the linguistic structure of the speech and acoustics. Acoustic measures included pitch, spectral slope and formant frequencies. Additionally, time-warped versions of pre- and post-incident examples of the same words were compared using a cepstral-distance measure, in an effort to determine how stress might effect recognition performance.\n",
    ""
   ]
  },
  "steeneken95_sus": {
   "authors": [
    [
     "Herman J. M.",
     "Steeneken"
    ]
   ],
   "title": "Speech under stress conditions in military operations: description of a project conducted by the NATO research study group on speech processing RSG10",
   "original": "sus5_065",
   "page_count": 5,
   "order": 17,
   "p1": "65",
   "pn": "69",
   "abstract": [
    "The NATO research study group RSG.10 started a project on the effect of stress on speech production. The underlying question is the consequences of variation of the speech quality on speech based systems.\n",
    "The study includes the compilation and dissemination of data bases in order to trigger research in a wider community. Presently three data bases are available. The respective stressors are: sleep deprivation, workload and emotional stress. The relevance of calibration of the data base with respect to objective and subjective stress measures is discussed.\n",
    "For some examples an analysis at phoneme level seems to be required as phoneme group specific effects were observed.\n",
    ""
   ]
  },
  "murray95_sus": {
   "authors": [
    [
     "Iain R.",
     "Murray"
    ],
    [
     "John L.",
     "Arnott"
    ],
    [
     "Elissaveta A.",
     "Rohwer"
    ]
   ],
   "title": "The strains of emotional stress in synthetic speech",
   "original": "sus5_071",
   "page_count": 4,
   "order": 18,
   "p1": "71",
   "pn": "74",
   "abstract": [
    "Text-to-speech and other speech output technologies are becoming increasingly widespread, especially as input technologies improve and facilitate applications with both speech input and output. Although speech output systems now generally have very high intelligibility, most are still easily identified as artificial voices and no commercial systems yet allow prosodic variation due to emotion and related factors. This is largely due to the complexity of incorporating such naturalness factors, and our very limited knowledge of what voice changes actually occur due to the speaker's emotion. However, prosodic content in synthetic speech is seen as increasingly important as interactive computer systems become more common, and there is presently renewed interest in the investigation of human vocal emotion and the expansion of synthesis models to allow greater prosodic variation.\n",
    "This paper will review progress to date in the investigation of human vocal emotions and their simulation in synthetic speech, and requirements for future research which is required to develop this area will be presented.\n",
    ""
   ]
  },
  "baber95b_sus": {
   "authors": [
    [
     "Chris",
     "Baber"
    ]
   ],
   "title": "The effects of workload on the use of speech  recognition systems",
   "original": "sus5_075",
   "page_count": 8,
   "order": 19,
   "p1": "75",
   "pn": "82",
   "abstract": [
    "The range of applications of speech technology has increased dramatically over the past two decades. With this increase, comes a new set of problems relating to the use of the technology. In this paper, one aspect of this set of problems is considered: workload.\n",
    "The paper is divided into nine main sections. In the first two sections the aims of the paper and the topic of workload are introduced. In the third section, the effects of workload on human performance are reviewed. In the fourth section the status of workload as a stressor is considered. In the fifth section the effects of stress on performance are considered. In the sixth section, the production of speech is discussed and in the seventh section consideration is given to the possible effects of workload on the production of speech and on the use of speech recognition systems. In the eigth section the notion of workload is extended to consider the effect of physical workload on the use of speech recognition. Throughout the paper a number of problems will be highlighted and in the ninth section a number of proposals for solving these problems are presented.\n",
    ""
   ]
  },
  "junqua95_sus": {
   "authors": [
    [
     "Jean-Claude",
     "Junqua"
    ]
   ],
   "title": "The influence of acoustics on speech production: a noise-induced stress phenomenon known as the Lombard reflex",
   "original": "sus5_083",
   "page_count": 8,
   "order": 20,
   "p1": "83",
   "pn": "90",
   "abstract": [
    "Recently, a number of researchers reported quantitative results about the acoustic changes between normal and Lombard speech. These results highlighted that the nature of the Lombard reflex is highly speaker-dependent. In this paper, after briefly discussing the influence of acoustics on speech production, we summarize some important characteristics of the Lombard reflex. Then, we review some experimental results showing how the Lombard reflex varies with the speaker gender, the language, and the environment (type of noise). Finally, we briefly discuss the use of relational features as a way to reduce the influence of the Lombard reflex on automatic speech recognizers.\n",
    ""
   ]
  },
  "hansen95_sus": {
   "authors": [
    [
     "John H. L.",
     "Hansen"
    ]
   ],
   "title": "Analysis and compensation of speech under stress & noise for environmental robustness in speech recognition",
   "original": "sus5_091",
   "page_count": 8,
   "order": 21,
   "p1": "91",
   "pn": "98",
   "abstract": [
    "It is well known that the introduction of acoustic background distortion and the variability resulting from environmentally induced stress causes speech recognition algorithms to fail. It is suggested that recent studies based on a Source (reinvalor Frame work can provide the necessary foundation to establish robust speech recognition techniques. This research encompasses three inter-related issues; (i) analysis and modeling of speech characteristics brought on by workload task stress, speaker emotion/stress, or speaking in noise (Lombard effect), (ii) adaptive signal processing methods tailored to speech enhancement and stress equalization, and (iii) formulation of new recognition algorithms which are robust in adverse environments. An overview of a statistical analysis of the SUSAS database is presented. Finally, three novel approaches for signal enhancement and stress equalization have been combined to address the issue of recognition under noisy stressful conditions.\n",
    ""
   ]
  },
  "legros95_sus": {
   "authors": [
    [
     "Claude",
     "Legros"
    ]
   ],
   "title": "Discussion on \"emotion\"",
   "original": "sus5_099",
   "page_count": 0,
   "order": 22,
   "p1": "99 (abstract)",
   "pn": "",
   "abstract": [
    "In some cases, emotion leads to extremely unpleasant situations, and even tight ones. It is the case of aeronautic failures and all other situations dealing with security of people.\n",
    "Therefore, one has always been interested in knowing the real psychological (emotional) state of a person. But the word \"emotion\" covers a very wide range of definitions corresponding to as many as states. So, before going on, we must answer the following preliminary questions: \"What emotion are we studying?\" and \"Why are we studying emotion?\" Two reasons arise: the simple knowledge and the quick identification of the emotion in order to act to try to cancel it and its possible effects.\n",
    "One can quote some examples in which the early knowledge of the psychophysical state could help efficiently to clear up a rising difficulty: aeronautic small incident which could deteriorate into severe one, admission service of a bank, heavy trucks drivers, and so on...\n",
    "These are one of the reasons why a lot of researchers from all domains asked themselves on the way to follow to estimate the generally said \"emotional state\" of a person.\n",
    "Previous to any estimation of emotion, it is needed to define it. Scherer, in its 1986 report, said that \"a greater precision in the description of the emotional state to be studied\" is needed to go further. How to Qualify the Emotional State of a Person?\n",
    "The first idea is to ask the person concerned on his (her) own feeling. It has already been said (Scherer 1986) that the answers are not accurate enough to be reliable all the more because these estimations, for a lot of reasons, are often unclear. Nevertheless, emotions can be divided into several usual categories, but acoustical correlates are not so easy to perform.\n",
    "As this direct investigation is not really usable, it remains some indirect features: emotion could be characterized by its effects on people submitted to it.\n",
    "One of the ways followed is based on medical analyses. It seems that they are quiet reliable in some cases such as stress. But, estimation is very huge and needs a great amount of sensors. Furthermore, it seems that other kinds of emotions, such as anxiety, fear... are much more difficult to investigate by these ways.\n",
    "Finally, it soon appeared that the emotion state acts on the speech of the person and already during the 40's researches arised. The main benefit of speech investigations is that the data are very easy to collect. It is now well known that speech quality changes under the effect of emotion. But these changes vary with the kind of emotion and the same parameter may vary in opposite way for two different emotion types.\n",
    "Voice parameters extracted from speech are numerous but could be divided into 3 main categories: fundamental frequency and derivatives, spectral investigations (specially formants analyses) and duration criteria.\n",
    "A very large amount of researches have been conducted on these topics and as the correlates between emotions and acoustics are now obvious, it is therefore needed to consider the problem as a whole to be able to go further. Simulated Versus Real Situations\n",
    "Most of the studies are performed with actors simulating the different emotions. This is not a real situation and the comparison between the two situations may become rather difficult because the psychological state is not at all the same. By the way, some simulated situations can reach the real ones (e.g. flight simulators for pilots training).\n",
    "Therefore, let us point out the main questions we have to answer, keeping in mind that we are rather interested in stress. Main Questions What is emotion? What is the best way to define it? Has stress the same stutus as other emotions? What kind of emotion is speech able to deal with? Is it possible to graduate emotion in order to follow to the closest its growth and, may be, to act before the situation becomes serious? Is it needed to graduate emotion by a separate way from acoustics (psychology, medicine...) and then to graduate the acoustic parameters, or is it better to directly graduate emotion by the way of the fluctuations of the acoustic parameters? Are laboratory experiments a good way to estimate what could happen in real cases, and how to skip from one to the other?\n",
    "All these questions shall be discussed during the workshop.\n",
    ""
   ]
  },
  "baber95c_sus": {
   "authors": [
    [
     "Chris",
     "Baber"
    ],
    [
     "Claude",
     "Legros"
    ]
   ],
   "title": "How do people cope with stress in the use of speech recognition?",
   "original": "sus5_101",
   "page_count": 0,
   "order": 23,
   "p1": "101 (abstract)",
   "pn": "",
   "abstract": [
    "Aims of Discussion: to consider the different strategies that people adopt in stress conditions; to relate the experience of discussants in dealing with stress conditions; to outline possible solutions to the problems of stress, particularly in terms of the interaction between users and speech recognition devices.\n",
    "Outline of key topics\n",
    "It is clear that various forms of stress can have an adverse affect on the success of speech recognition systems. The workshop has considered a number of different forms of stress, e.g., environmental stress such as noise, emotional stress, workload stress. Each of the different types of stress appears to share some general effects and to have some effects peculiar to the form of stress. The effects can be considered in terms of the consequences for speech recognition performance, the consequences for human-computer interaction, and the consequences for human performance. For instance, consider vibration as a form of stress: the performance of the recogniser might be impaired by the mechanical effects of vibration, the human-computer interaction might be impaired by the instability of the speaker's voice, in terms of human performance control of motor and visual response might be impaired. In this instance, the problem of coping with stress would appear to be less one of adapting human behaviour (as the effects of stress would appear to lie outside the person's control) and more in one of adapting the technology. On the other hand, the effects of some forms of stress do have the potential to be modified by the person, e.g., in terms of noise, the effects on human performance can be overcome by adoption of an appropriate strategy, while the effects of human-computer interaction can be approached using appropriate algorithms to deal with phenomena such as the Lombard effect. This implies that people are, within some limits, able to modify the effects of stress on their performance and on their production of speech, and that it may be possible for system design to capitalise on predictable relationships between stress, performance and speech recognition.\n",
    "People attending this discussion are asked to bring with them examples of applications and work that they have been involved in or know about in which stress has had an impact on both speech recognition performance and human performance. From these examples, the discussion will seek to develop possible causes of the problems and possible solutions for future developments.\n",
    ""
   ]
  },
  "kunzel95_sus": {
   "authors": [
    [
     "Herman",
     "Künzel"
    ]
   ],
   "title": "Discussion on \"analysis techniques\"",
   "original": "sus5_103",
   "page_count": 0,
   "order": 24,
   "p1": "103 (abstract)",
   "pn": "",
   "abstract": [
    "The excellent papers submitted to the \"analysis techniques\" section of this workshop suggest a wide range of topics for our discussion. Some of the points which, in view of the future research, would seem of special interest to me are: comparability of results gained in laboratory and real-world situations artifacts of laboratory and simulated-stress experiments comparability of investigations using different types of stressors use of state-of-the-art (computer-based) polygraphy as an instrument for the assessment of the somatic response to various aspects and types of stress a tentative inventory of phonetic, acoustic, and linguistic parameters for stress investiga- tions.\n",
    "With regard to the last issue, I should like to raise the question whether we have reached a stage at which it may be possible to set up some kind of standardized set of parameters for empirical investigations into stress. This would greatly enhance the comparability of future studies.\n",
    ""
   ]
  }
 },
 "sessions": [
  {
   "title": "Poster Contributions",
   "papers": [
    "protopapas95_sus",
    "whitmore95_sus",
    "waters95_sus",
    "arnfield95_sus",
    "noyes95_sus",
    "thompson95_sus",
    "bard95_sus",
    "tischer95_sus",
    "applebaum95_sus",
    "baber95_sus",
    "womack95_sus",
    "boughazale95_sus",
    "ruiz95_sus",
    "absil95_sus",
    "castellanos95_sus",
    "benson95_sus"
   ]
  },
  {
   "title": "Tutorial Papers",
   "papers": [
    "steeneken95_sus",
    "murray95_sus",
    "baber95b_sus",
    "junqua95_sus",
    "hansen95_sus"
   ]
  },
  {
   "title": "Discussion Outline",
   "papers": [
    "legros95_sus",
    "baber95c_sus",
    "kunzel95_sus"
   ]
  }
 ]
}