{
 "series": "TAI",
 "title": "The Second International Conference on Tone and Intonation",
 "location": "Singapore, Singapore",
 "startDate": "18/11/2023",
 "endDate": "20/11/2023",
 "URL": "https://www.asianlp.sg/conferences/tai2023/",
 "chair": "Chair: Minghui Dong",
 "conf": "TAI",
 "name": "tai_2023",
 "year": "2023",
 "SIG": "SProSIG",
 "title1": "The Second International Conference on Tone and Intonation",
 "booklet": "intro.pdf",
 "date": "18-20 November 2023",
 "month": 11,
 "day": 18,
 "now": 1713858969702651,
 "papers": {
  "tsukada23_tai": {
   "authors": [
    [
     "Kimiko",
     "Tsukada"
    ],
    [
     "Đích Mục",
     "Đào"
    ],
    [
     "Trang Le Thi",
     "Huyen"
    ]
   ],
   "title": "Cross-language Perception of the Japanese Singleton/Geminate Contrast: Case of Vietnamese Speakers With and Without Japanese Language Experience",
   "original": "02",
   "order": 1,
   "page_count": 5,
   "abstract": [
    "To examine the effect of Japanese learning experience on consonant length, we compared the perception of Japanese singleton/geminate contrasts by three groups of Vietnamese speakers with varying Japanese experience. Two of the Vietnamese groups consisted of learners of Japanese with one group participating in Vietnam and the other in Japan. The third Vietnamese group consisted of participants inexperienced in Japanese. A group of 10 native Japanese speakers participated as controls. The overall mean discrimination accuracy was 67%, 80%, 91% and 99% for the non-learner group, the learner group in Vietnam, the learner group in Japan and the native Japanese group, respectively. A clear difference between the two learner groups in Japan and Vietnam demonstrates learnability of Japanese consonant length beyond early childhood in an immersion setting. At the same time, a non-negligible difference between the native Japanese and the advanced learner groups suggests genuine difficulty of Japanese consonant length."
   ],
   "p1": 1,
   "pn": 5,
   "doi": "10.21437/TAI.2023-1",
   "url": "tai_2023/tsukada23_tai.html"
  },
  "hirayama23_tai": {
   "authors": [
    [
     "Manami",
     "Hirayama"
    ],
    [
     "Hyun Kyung",
     "Hwang"
    ],
    [
     "Takaomi",
     "Kato"
    ]
   ],
   "title": "OCP and downstep in Japanese",
   "original": "03",
   "order": 2,
   "page_count": 4,
   "abstract": [
    "This paper investigates the effect of the Obligatory Contour Principle (OCP) on downstep in Japanese. The study examines the impact of sequences of adjectives with the same endings on downstep, hypothesizing that the OCP may inhibit downstep in such cases. A production experiment involving ten speakers reveals the presence of downstep in all four phrase conditions. The results suggest that the effect of accentuation varies among phrase types, with the interaction not being significant in some cases. The study discusses how the OCP might explain the smallest degree of pitch lowering in specific phrase structures. The findings indicate that downstep occurs in all tested phrase types, but the significance of the degree of downstep may vary depending on the inclusion of certain factors in the statistical model. Additional research with a larger dataset is recommended for conclusive results."
   ],
   "p1": 6,
   "pn": 9,
   "doi": "10.21437/TAI.2023-2",
   "url": "tai_2023/hirayama23_tai.html"
  },
  "seeliger23_tai": {
   "authors": [
    [
     "Heiko",
     "Seeliger"
    ],
    [
     "Anne",
     "Lützeler"
    ],
    [
     "Constantijn",
     "Kaland"
    ]
   ],
   "title": "The perception of German wh-phrase-final intonation",
   "original": "04",
   "order": 3,
   "page_count": 5,
   "abstract": [
    "This article follows up on a previous study on German wh-questions and wh-exclamatives, conducting a perception study to assess native German listeners' perception of F0 contours. Cluster analysis was used to classify entire contours, focusing on utterance-final pitch. Results indicate perceived similarity was influenced by various factors including duration, speaker gender, and F0 register. The study demonstrates listeners' ability to distinguish abstracted F0 contours and sensitivity to both categorical and continuous distinctions in intonation."
   ],
   "p1": 10,
   "pn": 14,
   "doi": "10.21437/TAI.2023-3",
   "url": "tai_2023/seeliger23_tai.html"
  },
  "noguchi23_tai": {
   "authors": [
    [
     "Hiroto",
     "Noguchi"
    ]
   ],
   "title": "Mutual predictability of the accent patterns of Tokyo and Osaka Japanese",
   "original": "05",
   "order": 4,
   "page_count": 4,
   "abstract": [
    "Studies have shown a relationship between the accent patterns of native words in Tokyo and Osaka Japanese. However, this paper presents a quantitative study focusing on whether knowledge of one dialect aids in predicting the accent patterns of the other. The results reveal that Osaka accent pattern information enhances prediction rates of Tokyo Japanese accent patterns, but not vice versa. Machine learning and Kansai Japanese are proposed as efficient tools for describing endangered dialects in Japan. This study highlights the use of machine learning to predict accent patterns of dialects using dialects with known accent patterns, emphasizing longer words and non-Yamato or non-native words. The methods involved data-driven research, machine learning, and accent pattern prediction using neural networks. The findings suggest that low-frequency words' accent patterns are similar to high-frequency words, demonstrating the predictability of accent patterns using Kansai Japanese and word frequency data. The study offers insights into the predictability of accent patterns in Japanese dialects and the potential application of machine learning to improve efficiency in accent pattern collection."
   ],
   "p1": 15,
   "pn": 18,
   "doi": "10.21437/TAI.2023-4",
   "url": "tai_2023/noguchi23_tai.html"
  },
  "lee23_tai": {
   "authors": [
    [
     "Seunghun J.",
     "Lee"
    ],
    [
     "Julián",
     "Villegas"
    ],
    [
     "Kunzang",
     "Namgyal"
    ]
   ],
   "title": "Tonal Contrast in Drenjongke (Bhutia): an Electroglottographic Study",
   "original": "13",
   "order": 5,
   "page_count": 5,
   "abstract": [
    "This paper investigates how phonation and tone interrelate in Drenjongke (Bhutia), a two-tone Tibeto-Burman language, by presenting results of electroglottography (EGG) data. EGG data of syllabary reading was collected from twelve Drenjongke speakers in Sikkim, India. The results show that phonation in Drenjongke has partial relevance to the realization tone depending on the nature of the tone: lexical or post-lexical. The study also addresses questions regarding OQ values obtained from EGG, the interrelationship between voiced aspirates and OQ, and the articulatory basis for tonal contrast in Drenjongke, among other findings."
   ],
   "p1": 19,
   "pn": 23,
   "doi": "10.21437/TAI.2023-5",
   "url": "tai_2023/lee23_tai.html"
  },
  "jia23_tai": {
   "authors": [
    [
     "Pingping",
     "Jia"
    ]
   ],
   "title": "The Interaction of Tonal and Metrical Prominence in the Pingding Variety of Chinese",
   "original": "22",
   "order": 6,
   "page_count": 5,
   "abstract": [
    "The study explores how metrical prominence and tonal prominence interact in the Pingding Variety of Chinese (PD), challenging the notion that tonal languages lack metrical prominence and word stress. Data from a 2019 field study on PD reveal instances of tone deletion in metrically weak but tonally prominent syllables. The study proposes that metrical prominence on the leftmost syllable of a phonological word interacts with a scale of tonal prominence, leading to tone deletion. The tonal prominence hierarchy aligns with the cognitive saliency of high and contour tones. Tone deletion occurs within lexemes but not in phrases, and only if the tones of the unstressed syllables are more prominent than the tone of the stressed syllable. This phenomenon extends to trisyllabic sequences and longer monomorphemic lexemes. The study suggests that metrical prominence can be perceived as tonal saliency, and tone deletion occurs when tonal saliency and metrical prominence diverge. The analysis presented in this study for the data is cast in the framework of Optimality Theory. Index Terms: tones, word stress, prosody, Chinese."
   ],
   "p1": 24,
   "pn": 28,
   "doi": "10.21437/TAI.2023-6",
   "url": "tai_2023/jia23_tai.html"
  },
  "andreeva23_tai": {
   "authors": [
    [
     "Bistra",
     "Andreeva"
    ],
    [
     "Snezhina",
     "Dimitrova"
    ]
   ],
   "title": "Vocative Intonation in Bulgarian",
   "original": "29",
   "order": 7,
   "page_count": 5,
   "abstract": [
    "The study investigates vocative intonation in Bulgarian. Nine female native speakers of Standard Bulgarian produce 3 repetitions of 10 names, 2 to 4 syllables long, with final or penultimate stress in 4 different scenarios within a Discourse Completion Task in order to elicit neutral vocative, insistent vocative, challenging chant, and vocative chant. Speakers exhibit both consistent and variable tune choices, employing different tunes within the same scenario. In [-long] vocative tunes, non-high vowels in unstressed positions undergo raising without merging with their higher counterparts. In [+long] tunes, the final vowel does not undergo reduction, contradicting the phonological vowel reduction pattern in Bulgarian. The research enhances the understanding of the interplay between phonetics and phonology in vocative intonation research."
   ],
   "p1": 29,
   "pn": 33,
   "doi": "10.21437/TAI.2023-7",
   "url": "tai_2023/andreeva23_tai.html"
  },
  "shi23_tai": {
   "authors": [
    [
     "Yibing",
     "Shi"
    ],
    [
     "Francis",
     "Nolan"
    ],
    [
     "Brechtje",
     "Post"
    ]
   ],
   "title": "Polysyllabic tone sandhi and morphosyntax in Xiangshan Wu Chinese",
   "original": "32",
   "order": 8,
   "page_count": 5,
   "abstract": [
    "In this study, we examined disyllabic and trisyllabic tone sandhi patterns in Xiangshan Wu Chinese, an under-studied Northern Wu variety. Detailed acoustic analyses revealed both left- and right-dominant disyllabic tone sandhi patterns in Xiangshan Wu Chinese correlated with morphosyntax. An asymmetry in tone sandhi patterns was found in two left-branching trisyllabic compounds. While the disyllabic data aligned with previous theoretical accounts, the trisyllabic patterns presented challenges for existing frameworks, calling for re-evaluations. Theoretical analyses based on a syntax-driven edge-based approach and a stress-driven metrical approach were explored but failed to fully explain the observed sandhi patterns. The study provides new phonetic evidence on tone sandhi in Xiangshan Chinese and highlights the need for further investigations."
   ],
   "p1": 34,
   "pn": 38,
   "doi": "10.21437/TAI.2023-8",
   "url": "tai_2023/shi23_tai.html"
  },
  "huang23_tai": {
   "authors": [
    [
     "Yu-Xian (Claire)",
     "Huang"
    ]
   ],
   "title": "Stylised Tone and Intonation in Dog Directed Speech",
   "original": "33",
   "order": 9,
   "page_count": 5,
   "abstract": [
    "Dogs, domesticated for millennia, crucial in human society, are often considered family. Recently, dog-directed speech (DDS) has gained attention for its linguistic features akin to infant-directed speech (IDS) and child-directed speech (CDS). While DDS shares similarities, such as shorter utterances, more questions and a high-pitched voice, it diverges in aspects like vowel hyperarticulation. Despite extensive research on IDS and CDS, DDS remains understudied. This research explores DDS in American, British English, and Taiwan Mandarin, focusing on tone and intonation. Participants interacted with a dog, and interactions were recorded and analysed. In Taiwan Mandarin, DDS tones exhibited higher F0 mean, minimum, and maximum. English DDS showed stylised intonational patterns, differing from adult-directed speech. This research enhances our understanding of how sociophonetic, pragmatic, and typological language internal factors shape different interactional contexts."
   ],
   "p1": 39,
   "pn": 43,
   "doi": "10.21437/TAI.2023-9",
   "url": "tai_2023/huang23_tai.html"
  },
  "terhiija23_tai": {
   "authors": [
    [
     "Viyazonuo",
     "Terhiija"
    ],
    [
     "Zhonei I",
     "Gwirie"
    ],
    [
     "Priyankoo",
     "Sarmah"
    ]
   ],
   "title": "Tonal coarticulation in Angami level tones",
   "original": "34",
   "order": 10,
   "page_count": 5,
   "abstract": [
    "Angami (Tenyidie) is a language with only level tones in its tonal inventory. The paper investigates the contextual effects of tones in Angami disyllables by exploring how the tones in the second syllables affect the tones in the first syllable, and vice versa. The study reveals that Angami has bi-directional tonal coarticulation which is both assimilatory and dissimilatory in nature, with higher tones (T1, T2, and T3) dissimilating while lower tones (T4 and T5) assimilating. The paper also highlights F0 height dependency in Angami tonal coarticulation, with high tone T1 inducing the highest effect on contextual tones. Statistical tests were conducted to substantiate the observations, providing unique insights into tonal coarticulatory phenomena in a level tone-only language. The study contributes to the understanding of Tibeto-Burman languages and tonal coarticulation in world languages in general."
   ],
   "p1": 44,
   "pn": 48,
   "doi": "10.21437/TAI.2023-10",
   "url": "tai_2023/terhiija23_tai.html"
  },
  "burroni23_tai": {
   "authors": [
    [
     "Francesco",
     "Burroni"
    ],
    [
     "James",
     "Kirby"
    ]
   ],
   "title": "Speakers adaptively plan and execute f0 trajectories under rate changes: Evidence from Thai contour tones",
   "original": "35",
   "order": 11,
   "page_count": 5,
   "abstract": [
    "This paper investigates how Bangkok Thai speakers produce contour tones in the face of speech rate variations. Two production experiments were conducted with 44 Bangkok Thai speakers to analyze the f0 trajectories of three contour tones produced at different rates and tonal contexts. Results indicate that Thai speakers adaptively plan and execute contour tones to preserve characteristic f0 shapes even at faster rates, although some tonal combinations at faster rates may exhibit shapes resembling truncation and contour compression. The study challenges previous claims of tone truncation and suggests that tones scale with tone-bearing unit duration. The interaction between rate changes and surrounding tonal contexts plays a role in shaping f0 contours at different speech rates. The study also discusses the similarities between strategies for coping with rate variation in segmental and tonal production and offers hypotheses on how adaptive planning and blending of tone commands may explain observed effects."
   ],
   "p1": 49,
   "pn": 53,
   "doi": "10.21437/TAI.2023-11",
   "url": "tai_2023/burroni23_tai.html"
  },
  "huang23b_tai": {
   "authors": [
    [
     "Yishan",
     "Huang"
    ]
   ],
   "title": "Encoding Tone Sandhi in Zhangzhou Southern Min: An Inter-disciplinary Exploration",
   "original": "39",
   "order": 12,
   "page_count": 5,
   "abstract": [
    "This study adopts an interdisciplinary approach to explore the nature of tone sandhi in Zhangzhou Southern Min, a Sinitic dialect spoken in southern Fujian, mainland China. The dialect's tone sandhi system is right-dominant, with the sandhi domain aligning with syntactic phrase boundaries. The study finds that the sandhi process is phonologically inert to surrounding tones, but highly sensitive to the phonetics of their environments. Tonal neutralization occurs across linguistic contexts, making it challenging to determine the directionality of tonal alternation. The study proposes a morphological nature to characterize Zhangzhou tones, where sandhi tones have morphophonemic relations with citation tones, while non-sandhi tones have allophonic relations. This exploration enhances our understanding of tone sandhi in Southern Chinese dialects and may serve as a model for investigating similar phenomena in other languages."
   ],
   "p1": 54,
   "pn": 58,
   "doi": "10.21437/TAI.2023-12",
   "url": "tai_2023/huang23b_tai.html"
  },
  "pornpottanamas23_tai": {
   "authors": [
    [
     "Warunsiri",
     "Pornpottanamas"
    ],
    [
     "Sireemas",
     "Maspong"
    ],
    [
     "Pittayawat",
     "Pittayaporn"
    ]
   ],
   "title": "A Preliminary Investigation of the Phonetic Characteristics of Moklen Tones",
   "original": "42",
   "order": 13,
   "page_count": 5,
   "abstract": [
    "Moklen, an endangered Austronesian language in Southern Thailand, is important for studying tonogenesis. This study analyzed the acoustic properties of Moklen tones using eight native speakers. Results showed that f0 is the primary cue for tonal contrast, along with differences in vowel quality and phonation type. The study suggests similarities to register distinctions in other languages, hinting at a possible transphonologization of laryngeal properties into prosodic ones. The origin of Moklen tones remains uncertain, and further research is needed to understand the phonetic cues used in Moklen tonal perception."
   ],
   "p1": 59,
   "pn": 63,
   "doi": "10.21437/TAI.2023-13",
   "url": "tai_2023/pornpottanamas23_tai.html"
  },
  "kaland23_tai": {
   "authors": [
    [
     "Constantijn",
     "Kaland"
    ],
    [
     "Matthew",
     "Gordon"
    ],
    [
     "Jiyoung",
     "Jang"
    ],
    [
     "Argyro",
     "Katsika"
    ]
   ],
   "title": "No effects of f0 manipulation and phrase position in Korean word recognition",
   "original": "43",
   "order": 14,
   "page_count": 5,
   "abstract": [
    "Work on pitch accent languages has shown that f0 shape facilitates word recognition. That is, listeners are faster recognizing words which are accented than words which are unaccented. Less is known about the role of f0 in languages that do not make use of pitch accents. In those languages, it could be that f0 still contributes to word recognition to some extent or that word recognition is aided by boundary tones, rather than pitch accents. Korean is a language without pitch accents, making use of boundary tones only (i.e., edge language). The current study extends earlier work by replicating its experimental paradigm, i.e. it tests the effects of f0 shape and phrase position in a word recognition experiment. The results confirm the status of Korean as an edge language and are interpreted in a prosodic typological context..."
   ],
   "p1": 64,
   "pn": 68,
   "doi": "10.21437/TAI.2023-14",
   "url": "tai_2023/kaland23_tai.html"
  },
  "hasan23_tai": {
   "authors": [
    [
     "Malek Al",
     "Hasan"
    ],
    [
     "Shakuntala",
     "Mahanta"
    ]
   ],
   "title": "The Effect of Post-tonic Lengthening and F0 in Syrian Arabic Prosody",
   "original": "46",
   "order": 15,
   "page_count": 4,
   "abstract": [
    "The role of final boundary is well-known in the intonation literature, but whether post-tonic lengthening influences intonation and prosodic structure in languages is not very well- known. In this paper, we investigate the role of F0 and post-tonic lengthening in Syrian Arabic and show how they play an important role in Syrian Arabic (henceforth SyrA) sentence- level prosody. The results have implications for understanding prosodic contrasts in SyrA intonation and the role of F0 and duration in languages that have not been studied before."
   ],
   "p1": 69,
   "pn": 72,
   "doi": "10.21437/TAI.2023-15",
   "url": "tai_2023/hasan23_tai.html"
  },
  "ojha23_tai": {
   "authors": [
    [
     "Neetesh Kumar",
     "Ojha"
    ],
    [
     "Shakuntala",
     "Mahanta"
    ]
   ],
   "title": "Vowels, Tones, and Tonogenesis in Braj",
   "original": "47",
   "order": 16,
   "page_count": 5,
   "abstract": [
    "The current study first acoustically plots the vowel space of Braj, a language in northcentral India, showing 10 phonetically conditioned vowels. It introduces the existence of a tonogenetic basis in Braj created by the loss of breathy glottal fricatives leading to lexical tonal contrasts. An ANOVA conducted on F0 information from Braj speech showed a significant difference in F0 values between tonal and neutral words. The study suggests that the loss of breathy glottal fricatives created a low tone in Braj, aligning it with North West IA languages. The paper also discusses the historical context, linguistic influence, and status of Braj as a language. Objectives of the study included acoustically plotting the vowel space, analyzing vowel length contrasts, exploring lexical tone existence, and investigating tonal contours and tonogenetic motivations in Braj."
   ],
   "p1": 73,
   "pn": 77,
   "doi": "10.21437/TAI.2023-16",
   "url": "tai_2023/ojha23_tai.html"
  },
  "horo23_tai": {
   "authors": [
    [
     "Luke",
     "Horo"
    ],
    [
     "Pamir",
     "Gogoi"
    ],
    [
     "Gregory D.S.",
     "Anderson"
    ]
   ],
   "title": "Phonetic Correlates of Syllable Prominence in Mundari",
   "original": "51",
   "order": 17,
   "page_count": 5,
   "abstract": [
    "This study examines the phonetic properties of syllable prominence in Mundari and addresses an ongoing debate among scholars regarding stress patterns in the language. The study is based on acoustic analysis of Mundari disyllables and polysyllables that are recorded from male and female Mundari speakers while they produced the target forms in various intonational configurations. The analysis focuses on three acoustic cues of syllable prominence, including vowel duration, vowel intensity, and fundamental frequency (F0). The findings suggest i) that duration likely plays a role in delimiting right edges of utterances, and thus not a word-level phenomenon, ii) that intensity may once have been a cue of prominence on second syllables but this system, if once present (as it is in related languages), has now broken down, and iii) that fundamental frequency has an unexpected gender skewing seen in the patterns attested. These results furthered our understanding of the stress system of Mundari, emphasizing the prominence of specific syllables across different word lengths, using instrumental acoustic data for the first time."
   ],
   "p1": 78,
   "pn": 82,
   "doi": "10.21437/TAI.2023-17",
   "url": "tai_2023/horo23_tai.html"
  },
  "schauffler23_tai": {
   "authors": [
    [
     "Nadja",
     "Schauffler"
    ],
    [
     "Nora",
     "Ketschik"
    ],
    [
     "André",
     "Blessing"
    ],
    [
     "Kerstin",
     "Jung"
    ],
    [
     "Toni",
     "Bernhart"
    ],
    [
     "Anna",
     "Kinder"
    ],
    [
     "Julia",
     "Koch"
    ],
    [
     "Jonas",
     "Kuhn"
    ],
    [
     "Sandra",
     "Richter"
    ],
    [
     "Rebecca",
     "Sturm"
    ],
    [
     "Gabriel",
     "Viehhauser"
    ],
    [
     "Thang",
     "Vu"
    ]
   ],
   "title": "Exploring intonational patterns of poetic speech: Insights from a large corpus of German poetry",
   "original": "57",
   "order": 18,
   "page_count": 5,
   "abstract": [
    "Poetic speech has often been described to differ from readings of prose and other texts in a number of features. This study investigates prosodic features in a large corpus of over 1400 German poetry recitations spanning from the 1950s to the 2000s, exploring the influence of factors such as the length of the poem, authorship, and time of recitation on speech rate and pitch variation. The results reveal significant changes in recitation rate and pitch range over time, indicating diachronic trends in recitation patterns. The study also highlights the impact of the poem's author on how it is performed, with different authors leading to variations in recitation rate and pitch range. These findings lay the groundwork for a refined poetic speech synthesis model that can capture stylistic nuances related to speakers, authors, or recitation trends, enabling a deeper exploration of their aesthetic effects. The study emphasizes the value of computational methods in analyzing large corpora to uncover new insights in the field of poetic speech analysis."
   ],
   "p1": 83,
   "pn": 87,
   "doi": "10.21437/TAI.2023-18",
   "url": "tai_2023/schauffler23_tai.html"
  },
  "chan23_tai": {
   "authors": [
    [
     "Le Xuan",
     "Chan"
    ],
    [
     "Rina",
     "Furusawa"
    ],
    [
     "Seunghun J.",
     "Lee"
    ]
   ],
   "title": "Variable Pitch Accent and Prosodic Phrasing in Japanese Adjectival Complex DPs",
   "original": "61",
   "order": 19,
   "page_count": 5,
   "abstract": [
    "This study investigated how complex DPs in Japanese are prosodically phrased, and whether an interaction occurs between pitch accent and prosodic phrasing. Using f0 cues, we found that complex DPs made up of two adjectival modifiers and a head noun can have two possible phrasings: a recursive structure (Adj1 (Adj2 N)) and non-recursive ternary phrasing (Adj1 Adj2 N). Our results show that for complex DPs in Japanese, a non-recursive flat phrasing seems to be the default prosody structure, but AU depicts a recursive pattern, which we attribute to phonetic restrictions on f0 realization."
   ],
   "p1": 88,
   "pn": 92,
   "doi": "10.21437/TAI.2023-19",
   "url": "tai_2023/chan23_tai.html"
  },
  "wang23_tai": {
   "authors": [
    [
     "Xiyao",
     "Wang"
    ]
   ],
   "title": "Untangling the Word-Tone System: The Basic Tonal and Prosodic Patterns in Choca-ngaca",
   "original": "66",
   "order": 20,
   "page_count": 5,
   "abstract": [
    "In many Southeast Asian tone languages, the syllable serves as the domain for tone. However, a word-tone system has been identified in several Bodic language branches of the Himalayas and surrounding areas. The Tamangic branch is most frequently mentioned in literature, followed by Tibetan. Choca-ngaca is an example of such a Tibetan language, but it remains greatly underdocumented. This study is pioneering, working with a single female speaker to explore word-tone mechanisms in Choca-ngaca. It analyzed different lexical and phrasal contexts for a range of syllabic structures, including monosyllable, disyllable, trisyllable, and multisyllable forms. Findings indicate that the tone in this word-tone language typically emphasizes the initial syllable of a word. The tone's high or low categorization influences the prosodic pattern of the entire word or phrase in both disyllabic contexts and more complex constructions. Additionally, the interaction between tone and consonant has been investigated within monosyllabic contexts, revealing that Choca-ngaca's tones are distinguished by the voicing of the initial obstruents and a set of lateral approximants."
   ],
   "p1": 93,
   "pn": 97,
   "doi": "10.21437/TAI.2023-20",
   "url": "tai_2023/wang23_tai.html"
  },
  "cangemi23_tai": {
   "authors": [
    [
     "Francesco",
     "Cangemi"
    ],
    [
     "Aviad",
     "Albert"
    ]
   ],
   "title": "PraaPer: Simple, Rich, and Intuitive Representations for Tone and Intonation",
   "original": "67",
   "order": 21,
   "page_count": 3,
   "abstract": [
    "We introduce PraaPer, a new workflow for the visualization of pitch. Praaper is a user-friendly plug-in for Praat that combines traditional methods for the representation of tone and intonation with rich approximations offered by recent methods like ProPer. PraaPer aims to address the limitations of standard visualizations by providing intuitive representations and rich depictions of pitch strength. The workflow involves manual annotation tasks to create periograms that display fundamental frequency contours modulated by periodic strength. PraaPer can be used in Singleton mode for individual files or Batch mode for multiple files, allowing users to customize parameters for data extraction and visualization. The tool is designed to be accessible to a wide range of users, advancing research on tone and intonation."
   ],
   "p1": 98,
   "pn": 100,
   "doi": "10.21437/TAI.2023-21",
   "url": "tai_2023/cangemi23_tai.html"
  },
  "li23_tai": {
   "authors": [
    [
     "Jinhao",
     "Li"
    ]
   ],
   "title": "Study on Chinese Tone Acquisition of Learners from Different Language Backgrounds",
   "original": "70",
   "order": 22,
   "page_count": 5,
   "abstract": [
    "This study makes two hypotheses with opposite conclusions: (1) According to the “L1 transfer,” the hypothesis that tonal language speakers (TLSs) produce better Chinese tones than non-tonal language speakers (NTLSs) is proposed; (2) According to the SLM, the hypothesis that non-tonal language speakers produce better Chinese tones than tonal language speakers is proposed. The research results show that Thai learners (ThLs) performed significantly better than Bangladeshi learners (BdLs) in T1, T3, and T4; there was no significant difference in T2, but ThLs performed better than BdLs audibly. The tone duration pattern of BdLs and ThLs is not much different from that of CNSs, but the T4 duration of ThLs is longer. ThLs already have the awareness of tone sandhi in T3; BdLs are more sensitive to duration in T4. In summary, the result supports the hypothesis of “L1 transfer” that TLSs produce better Chinese tones than NTLSs, tonal experience of L1 facilitates the acquisition of Chinese tones."
   ],
   "p1": 101,
   "pn": 105,
   "doi": "10.21437/TAI.2023-22",
   "url": "tai_2023/li23_tai.html"
  },
  "juliao23_tai": {
   "authors": [
    [
     "Mariana",
     "Julião"
    ],
    [
     "Helena",
     "Moniz"
    ],
    [
     "Alberto",
     "Abad"
    ]
   ],
   "title": "Exploring the Utility of Automatically Generated References for Assessing L2 Prosody",
   "original": "81",
   "order": 23,
   "page_count": 5,
   "abstract": [
    "Prosody is an essential aspect of effective communication, with prominence playing a significant role in speech intelligibility. This study explores a novel approach, Goodness of Prominence (GoPr), to evaluate the quality of spoken sentences in terms of prominence. The method comprises an acoustic-based branch for prosody classification and a text-based branch for prosody prediction. Testing on L2 data yielded a correlation coefficient of 0.310. Challenges in prosody assessment include variations in speech production, the one-to-many problem in prominence, data limitations, and the need for tailored classifiers. The study contributes insights to the discourse on prosody assessment and highlights the challenges in assessing L2 speech proficiency."
   ],
   "p1": 106,
   "pn": 110,
   "doi": "10.21437/TAI.2023-23",
   "url": "tai_2023/juliao23_tai.html"
  },
  "saikia23_tai": {
   "authors": [
    [
     "Krisangi",
     "Saikia"
    ],
    [
     "Shakuntala",
     "Mahanta"
    ]
   ],
   "title": "Exploring Rhythmic Patterns in Deori and Mising using Read Speech Data",
   "original": "84",
   "order": 24,
   "page_count": 5,
   "abstract": [
    "This research aims to examine the speech rhythm of the Deori and Mising languages spoken in the state of Assam, India. A series of production experiments were conducted to explore the acoustic properties of rhythm measures in Deori and Mising languages. Rhythm measures including %V, ∆V, ∆C, rPVIC, nPVIV, varcoV and varcoC were used in our analysis. When we compare the %V and ∆C values of Deori and Mising languages with other languages, they appear to situate between syllable-timed languages like French and Spanish and a mora-timed language like Japanese. However, upon plotting nPVI-V and rPVI-C values, as well as nPVI-V and %V values against each other, the results suggest a different trend. Deori tends to cluster with French, typically categorized as a syllable-timed language, while Mising moves towards English, a stress-timed language. Furthermore, we employed the Pearson correlation to investigate the interactions between utterance length, speaking tempo, and rhythm measures. This approach allows us to explore how these factors intertwine and potentially influence one another within the linguistic contexts of Deori and Mising."
   ],
   "p1": 111,
   "pn": 115,
   "doi": "10.21437/TAI.2023-24",
   "url": "tai_2023/saikia23_tai.html"
  }
 },
 "sessions": [
  {
   "title": "Full papers submitted after the conference",
   "papers": [
    "tsukada23_tai",
    "hirayama23_tai",
    "seeliger23_tai",
    "noguchi23_tai",
    "lee23_tai",
    "jia23_tai",
    "andreeva23_tai",
    "shi23_tai",
    "huang23_tai",
    "terhiija23_tai",
    "burroni23_tai",
    "huang23b_tai",
    "pornpottanamas23_tai",
    "kaland23_tai",
    "hasan23_tai",
    "ojha23_tai",
    "horo23_tai",
    "schauffler23_tai",
    "chan23_tai",
    "wang23_tai",
    "cangemi23_tai",
    "li23_tai",
    "juliao23_tai",
    "saikia23_tai"
   ]
  }
 ],
 "doi": "10.21437/TAI.2023"
}