{
 "series": "TAI",
 "title": "1st International Conference on Tone and Intonation (TAI)",
 "location": "Sonderborg, Denmark",
 "startDate": "06/12/2021",
 "endDate": "09/12/2021",
 "URL": "http://tai2020.org/",
 "chair": "Chair: Oliver Niebuhr",
 "intro": "intro.pdf",
 "conf": "TAI",
 "year": "2021",
 "name": "tai_2021",
 "SIG": "SProSIG",
 "title1": "1st International Conference on Tone and Intonation",
 "title2": "(TAI)",
 "date": "6-9 December 2021",
 "booklet": "tai_2021.pdf",
 "papers": {
  "niebuhr21_tai": {
   "authors": [
    [
     "Oliver",
     "Niebuhr"
    ],
    [
     "Radek",
     "Skarnitzl"
    ]
   ],
   "title": "Those who shout the loudest - Do they sound more charismatic?",
   "original": "1",
   "page_count": 5,
   "order": 1,
   "p1": 1,
   "pn": 5,
   "abstract": [
    "Intensity, i.e. loudness or vocal effort, is known to contribute to the perception of speaker charisma, but, compared to the other domains of prosody, very few details are known about this contribution. We address this research gap based on 51 public speeches and associated investment-based charisma ratings of 50 listeners. The question was, if and to what degree various level, variation, and spectral-distribution measures related to vocal effort can connect the public-speaking performances with their charisma ratings – in the sense of significant correlations. Results show that variation and distribution measures yield more and stronger significant correlations than level measures, but with notable sex-specific differences. We discuss our results in terms of links between vocal effort and voice quality and with respect to the general status of loudness in charisma perception.\n"
   ],
   "doi": "10.21437/TAI.2021-1"
  },
  "wright21_tai": {
   "authors": [
    [
     "Jonathan",
     "Wright"
    ],
    [
     "Melissa",
     "Baese-Berk"
    ]
   ],
   "title": "Factors affecting the incidental formation of novel tone categories",
   "original": "16",
   "page_count": 5,
   "order": 2,
   "p1": 6,
   "pn": 10,
   "abstract": [
    " The present research investigated the acquisition of novel tone categories using natural tokens and an incidental learning paradigm. Through three experiments we demonstrated that native English participants, from 18 to 66 years old, can use incidental learning with natural tokens to form four novel tone categories after a short training session with very high, even perfect, accuracy. These findings confirm results from previous studies suggesting that participants can effectively learn novel\nsound categories via incidental learning. Across the three experiments we used incidental learning to\nexamine factors known to impact novel sound category acquisition. We demonstrated that high variability of tokens within trials resulted in greater learning than variability spread out across trials. Further, training on a single talker resulted in robust learning and but a sharp decline when generalizing to novel talkers. By contrast, training on multiple talkers resulted in less learning, but there no difference when generalizing learning to novel talkers. Further, the presence of an unfamiliar vowel did not impact the incidental formation of novel tone categories. The three experiments illustrated that incidental learning paradigms are an effective and efficient means for learning novel tone categories and for investigating factors known to impact novel sound category acquisition."
   ],
   "doi": "10.21437/TAI.2021-2"
  },
  "sostarics21_tai": {
   "authors": [
    [
     "Thomas",
     "Sostarics"
    ],
    [
     "Jennifer",
     "Cole"
    ]
   ],
   "title": "Epistemic Meaning and the LLL Tune in American English",
   "original": "18",
   "page_count": 5,
   "order": 3,
   "p1": 11,
   "pn": 15,
   "abstract": [
    "In American English, the pitch pattern at the end of a prosodic phrase—the nuclear tune—conveys pragmatic meaning, which can be characterized in epistemic terms as relating to the mutual beliefs of the speaker and their addressee [1]. Epistemic accounts have been offered for the meaning of rising and falling nuclear tunes [2], or a mid-level pitch plateau [3], but the epistemic contribution for many other tunes has not been addressed. This paper addresses one such gap in the literature, examining the meaning of the L*L-L% contour in American English through two experiments testing listeners’ preferences for H*LL% vs. L*L-L% with declarative sentences as a function of whether the associated proposition is ruled in (congruent with speaker and addressee shared knowledge) or ruled out (incongruent). Our results show that listeners find L*L-L% to be more felicitous than H*L-L% in ruled-out contexts, despite prior claims that H*L-L% is the default tune for declarative assertions. A follow-up experiment shows that the preference for L*L-L% in ruled-out contexts remains even when the intonation is made redundant by explicit acknowledgement of the ruledout status of the proposition. We conclude that L*L-L% makes an independent epistemic contribution to utterance meaning in American English and propose that a speaker uses L*L-L% to signal that they withhold their commitment to the propositional content of their utterance.\n"
   ],
   "doi": "10.21437/TAI.2021-3"
  },
  "sandberg21_tai": {
   "authors": [
    [
     "Kate",
     "Sandberg"
    ],
    [
     "Jennifer",
     "Cole"
    ]
   ],
   "title": "The Consistent Meaning of Intonational Tunes Across Sentence Type in American English",
   "original": "19",
   "page_count": 5,
   "order": 4,
   "p1": 16,
   "pn": 20,
   "abstract": [
    "Compositional accounts of intonational nuclear tune meaning propose that tunes have an impact on speech act meaning that is independent from the sentence type [1, 2, 3, 4]. We provide experimental support for this account through two intonation perception experiments on American English comparing the speech act inferences listeners draw based on rising (L*HH%) and falling (H*L-L%) imperatives with those drawn based on rising and falling declaratives [5]. Native speakers of American English heard steep rising, shallow rising, and falling intonation on imperative sentences and performed a 2AFC task asking them to categorize each utterance as a Suggestion or a Command. Our results indicate that rising and falling tunes result in the same types of speech act meaning inferences when paired with imperatives (Commands vs. Suggestions) as they do with declaratives (Assertions vs. Questions) [5]. Additionally, we show that within-category variation for a single tune in terms of the pitch span (e.g. shallow rising vs. steep rising tunes) affects the likelihood of a given speech act response in the same manner for imperatives as for declaratives, although this pattern is limited to the non-default tune + type pairing.\n"
   ],
   "doi": "10.21437/TAI.2021-4"
  },
  "zarka21_tai": {
   "authors": [
    [
     "Dina El",
     "Zarka"
    ],
    [
     "Barbara",
     "Schuppler"
    ]
   ],
   "title": "A configurational approach to the prosody of topic and focus in Egyptian Arabic. Testing the importance of accent-based and utterance-based acoustic cues",
   "original": "22",
   "page_count": 5,
   "order": 5,
   "p1": 21,
   "pn": 25,
   "abstract": [
    "Recent research on Egyptian Arabic suggests that topic and focus are realized by different pitch events and that a focus is followed by post-focus attenuation. It is, however, not known how well these structures are discriminated and which are the relevant acoustic cues. We present results from a Random Forest based discrimination between two topic and two focus types, using 62 acoustic cues over the utterance, of which 37 are related to the target accent. All categories are discriminated very well with some confusion between the subtypes. The two most important cues are the velocity of the fall of the target accent and the scaling of the following peak, followed by the amount of fall in the accent and the intensity of the utterancefinal word/syllable. Further important findings are that f0 is especially important to distinguish between target accents and to indicate register lowering, that intensity features are only related to the target word and the last word, and that duration is only relevant in the target accent. This suggests that the target accent is signaled by all acoustic cues, but primarily by a pitch fall, and post-focus attenuation by immediate register lowering and a salient intensity drop at the end of the utterance."
   ],
   "doi": "10.21437/TAI.2021-5"
  },
  "teras21_tai": {
   "authors": [
    [
     "Pire",
     "Teras"
    ],
    [
     "Tuuli",
     "Tuisk"
    ]
   ],
   "title": "Broken tone in Livonian and Leivu",
   "original": "27",
   "page_count": 5,
   "order": 6,
   "p1": 26,
   "pn": 30,
   "abstract": [
    "This paper focuses on the phonetic realisation of the broken tone in the highly endangered Finnic languages – Leivu and Livonian. An investigation of the temporal and tonal characteristics of words with the plain tone and broken tone consisting of a long first syllable and a short second syllable in spontaneous speech was carried out. The changes in pitch alignment, durations, and duration ratios of the syllables in disyllabic words were analysed and the role of intensity was studied. The analysis revealed a difference in the observed acoustic characteristics in words with either plain tone or broken tone. Also, differences between Leivu and Livonian were observed. With respect to tonal characteristics, two distinct patterns are evident. In words with broken tone, the pitch peak in the primary-stressed syllable is earlier, while in words with plain tone the peak is late. In Livonian, the duration of the syllable nucleus is slightly shorter in broken tone words than in plain tone words, in Leivu it can be longer.\n"
   ],
   "doi": "10.21437/TAI.2021-6"
  },
  "mcpherson21_tai": {
   "authors": [
    [
     "Laura",
     "McPherson"
    ],
    [
     "Don",
     "Daniels"
    ],
    [
     "Caroline",
     "Hendy"
    ]
   ],
   "title": "Lexical and grammatical tone in Wiru (Southern Highlands Province, PNG)",
   "original": "28",
   "page_count": 5,
   "order": 7,
   "p1": 31,
   "pn": 35,
   "abstract": [
    "This paper presents the first description of the tonal system in Wiru, a Trans New Guinea language spoken in the Southern Highlands Province of Papua New Guinea. Wiru has a mixed prosodic system, with both word-initial stress as well as lexical and grammatical tone based off of two tonal primitives: H and L. Both tones are phonologically active, as evidenced by the presence of contour tones and the preservation of floating L tones in cases of H tone spread. The domain of the tone contrast is a left-aligned trochaic foot, which can be specified as /H/, /HL/, or /LH/. Grammatical tone is found at the phrase level, particularly within noun phrases. In particular, certain noun phrase modifiers, including demonstratives and relative clauses, trigger replacive grammatical tone melodies on the modified noun. Phonological processes affecting tone include dramatic phrase-final lowering as well as bidirectional H-tone spread.\n"
   ],
   "doi": "10.21437/TAI.2021-7"
  },
  "erickson21_tai": {
   "authors": [
    [
     "Donna",
     "Erickson"
    ]
   ],
   "title": "Articulatory Prosody: A comparison of Mandarin Chinese and Japanese",
   "original": "29",
   "page_count": 5,
   "order": 8,
   "p1": 36,
   "pn": 40,
   "abstract": [
    "This paper is a synopsis of a series of research studies previously reported about articulatory prosody, based on jaw displacement data collected from Mandarin Chinese and Japanese speakers using electromagnetic articulography (EMA). On one hand, Mandarin Chinese has tone contrast while Japanese has pitch accents. However, the experimental data suggest that in terms of articulatory prosody, they are similar. The term ‘articulatory prosody” as discussed here is used to describe prosodically-motivated jaw displacement patterns. Both Mandarin Chinese and Japanese have final and initial phrasal stress, implemented by increased jaw displacement, and the jaw displacement patterns seem to be independent of the F0 contours of the tones/pitch accents. Acoustically, both Mandarin Chinese and Japanese show F1 increases with increased jaw displacement; Mandarin Chinese also shows increased duration. The results suggest that for both Mandarin Chinese and Japanese, it is the pattern of jaw displacement that provides the underlying prosodic framework of phrase-initial and phrase-final stress, resulting in increased F1 for (the low vowel /a/) in both languages, and increased duration for Mandarin Chinese.\n"
   ],
   "doi": "10.21437/TAI.2021-8"
  },
  "sahkai21_tai": {
   "authors": [
    [
     "Heete",
     "Sahkai"
    ],
    [
     "Eva Liina",
     "Asu"
    ],
    [
     "Pärtel",
     "Lippus"
    ]
   ],
   "title": "Prosodic characteristics of exclamatives and questions in Estonian",
   "original": "30",
   "page_count": 5,
   "order": 9,
   "p1": 41,
   "pn": 45,
   "abstract": [
    "This study investigates the prosody of Estonian exclamations as compared to questions. The materials consisted of string-identical wh-exclamatives and wh-interrogatives that were elicited using contexts prompting the two different readings. The data was recorded from 21 female speakers of Standard Estonian. The analysis revealed various important prosodic differences between the two speech acts. First of all, exclamations were characterised by the presence of a prominent pitch accent that has also been found to signal exclamatives in other languages. Exclamations also showed a significantly longer duration of the whole utterance which could be associated with their expressive nature. Exclamations and questions did not, however, differ with respect to pitch range. Other characteristics of exclamations were a significantly lower mean f0 including both lower initial and final pitch as well as more frequent occurrence and a larger proportion of creaky voice towards the end of the utterance. Additionally, differences between the two speech acts in the placement of the nuclear pitch accent were found.\n"
   ],
   "doi": "10.21437/TAI.2021-9"
  },
  "mixdorff21_tai": {
   "authors": [
    [
     "Hansjörg",
     "Mixdorff"
    ],
    [
     "Philippe",
     "Boula de Mareüil"
    ],
    [
     "Albert",
     "Rilliard"
    ],
    [
     "Valentina De",
     "Iacovo"
    ]
   ],
   "title": "Can the prosody of statements and various types of questions be identified in Gallo-Romance dialects?",
   "original": "35",
   "page_count": 5,
   "order": 10,
   "p1": 46,
   "pn": 50,
   "abstract": [
    "In the current study four types of speech acts in several GalloRomance dialects are examined: statements, polar questions, incredulous questions (expecting a negative response), and queries for confirmation (expecting a positive response). In a perception experiment we found that the first two types are generally reliably identified whereas for the latter two, only a limited number of utterances yielded recognition rates far above chance. We identified confusions mostly between polar and incredulous questions, as well as between the other two. When examining prosodic differences between the four classes that facilitated discrimination, we found that they mostly concerned the fundamental frequency (F0) contours, especially in the latter part of the utterances.\n"
   ],
   "doi": "10.21437/TAI.2021-10"
  },
  "horo21_tai": {
   "authors": [
    [
     "Luke",
     "Horo"
    ],
    [
     "Gregory",
     "Anderson"
    ]
   ],
   "title": "Prosody and Morphosyntax in Sora: A preliminary study",
   "original": "37",
   "page_count": 5,
   "order": 11,
   "p1": 51,
   "pn": 55,
   "abstract": [
    "Sora (a Munda language of eastern India) is key to debates on the interconnectedness of prosodic systems and morphosyntax typologically and areally, specifically that contact driven shift of prosody from right-headed/iambic to left-headed/trochaic at the word-level can trigger a wholescale restructuring of the morphosyntax including the rise of polysynthesis from an originally largely isolating profile (Donegan and Stampe 1983, 2004, Donegan 1993). But instrumental data on Sora prosody reveal that all cues of prominence found to be active (duration, intensity, fundamental frequency) converge on second syllables being more prominent in disyllables. Vowels in first syllables show greater centralization and a narrowed vowel space, and vowel phonemes are more peripheral and perceptually distinct in second syllables in such words (Horo and Sarmah 2015, Horo 2017, Horo Sarmah and Anderson 2020). Thus, the language has never undergone a shift to trochaic structure at the level of p(rosodic)-word, therefore p-words can have no causa relationship to the structure of phrases or to the morphosyntax really in any sense yet identified, nor to the rise of the complex g(rammatical)-words in the language, as word prosody reflects the old Austroasiatic pattern. The studies referenced above examined only uninflected p-words. In this study we report on the role of intonation and phonological processes in defining different morphotactic classes of elements in inflected and derived nominal words. Speech data of native Sora speakers of both genders were collected in isolation, in inherently quasifocal frames, and in out-of-focus frames to control for various\nutterance-level and information structure considerations as well.\n"
   ],
   "doi": "10.21437/TAI.2021-11"
  },
  "gao21_tai": {
   "authors": [
    [
     "Man",
     "Gao"
    ]
   ],
   "title": "Comparison of Pitch Variation and Pitch Range in L1 and L2 Mandarin Chinese",
   "original": "39",
   "page_count": 5,
   "order": 12,
   "p1": 56,
   "pn": 60,
   "abstract": [
    "The objective of this work is to investigate speakers’ fundamental frequency in L1 and L2 Mandarin speech. A comparison of various measures including F0 mean, maximum and minimum F0 and F0 range was made between native and L2 speakers’ five different types of speech. Two native Mandarin Chinese speakers and two L2 Chinese speakers whose native language is Swedish were invited to read disyllabic words in isolation, statements, questions, text and hold a conversation with the author. Acoustic measures were performed on the speech data for analyzing the speakers’ F0 uses. The findings seem to suggest that L2 Mandarin deviates from L1 Mandarin systematically but in a different manner depending on the speech genre. The results are likely to be related to different sound structures and the cultural norms of reading various speech genres in Mandarin and Swedish, as well as the influence one’s native language has on one’s L2 language production.\n"
   ],
   "doi": "10.21437/TAI.2021-12"
  },
  "torres21_tai": {
   "authors": [
    [
     "Catalina",
     "Torres"
    ],
    [
     "Pauline",
     "Welby"
    ]
   ],
   "title": "Segments as carriers of prosodic information in word onsets",
   "original": "42",
   "page_count": 5,
   "order": 13,
   "p1": 61,
   "pn": 65,
   "abstract": [
    "Research has shown that listeners exploit prosodic cues to carry out word segmentation, and that the choice of cues and how these are weighted are language specific. French accentual phrases are demarcated to the left edge with a phrase initial rising (LHi) accent. Listeners are sensitive to the start of the rise (from L to Hi) which is used for word segmentation and to disambiguate between segmentally identical pairs. However, it is unclear whether prosodic cues are only used when disambiguation is required or if they play a more general role. Additionally, it remains an open question as to how sensitive listeners are to prosodic information of the initial rise encoded at the segmental level. This study examines whether microprosodic variations influence word recognition in less well studied segmental environments such as consonant clusters. A manipulation of duration and fundamental frequency cues at the word onset was performed. Results show that lexical activation was significantly delayed for words with onsets containing voiced consonant clusters of the type /bl/. Lexical access was also delayed for onsets of the type /pl/, although the effect was weaker. These results provide preliminary evidence that French listeners are sensitive to fine-grained prosodic information on segments.\n"
   ],
   "doi": "10.21437/TAI.2021-13"
  },
  "yang21_tai": {
   "authors": [
    [
     "Cathryn",
     "Yang"
    ],
    [
     "Pittayawat",
     "Pittayaporn"
    ],
    [
     "James",
     "Kirby"
    ],
    [
     "Sujinat",
     "Jitwiriyanont"
    ]
   ],
   "title": "Change and stability in the tonal contours of King Rama IX of Thailand, 1959-1997",
   "original": "43",
   "page_count": 5,
   "order": 14,
   "p1": 66,
   "pn": 70,
   "abstract": [
    "Studies of change across the lifespan have enabled a more nuanced understanding of segmental sound change, but this method has hardly ever been used in tone change research. This study, one of the first longitudinal studies of tone, investigates the tonal contours of King Rama IX of Thailand across a 38-year period (1959-1997). During the 20th century, Thai Tone 3 (“Falling”) changed from mid-falling to high-falling. The study examines whether King Rama IX’s T3 pronunciation changed during the period of investigation, and if so, whether the change was in the same direction as the community trend. The data consist of 16 recordings of the King’s commencement speeches at Chulalongkorn University. F0 was extracted from 1317 T3 tokens and fitted to a cubic polynomial function. Linear mixed model results and post-hoc analysis of estimated marginal means indicate a period of change followed by stability: T3’s F0 onset raised and the slope became steeper between the 1960’s and the 1980’s (in line with community trends), but not between the 1980’s and 1990’s. These findings align with previous research showing that adults have the potential to change in the post-adolescent period, but they also may resist change when that aligns with their identity.\n"
   ],
   "doi": "10.21437/TAI.2021-14"
  },
  "juhasz21_tai": {
   "authors": [
    [
     "Kornélia",
     "Juhász"
    ],
    [
     "Huba",
     "Bartos"
    ]
   ],
   "title": "Mandarin Chinese sentence intonation patterns in the production of Hungarian learners of Chinese",
   "original": "44",
   "page_count": 5,
   "order": 15,
   "p1": 71,
   "pn": 75,
   "abstract": [
    "In this acoustic analysis, we aim to examine how Hungarian learners of Mandarin Chinese (MC) contrast and distinguish the intonation patterns of unmarked and 吗 ma-particle marked yes-no questions vs. statements. Since Chinese is a tonal language, the issue of intonation is more complicated than in non-tonal languages, such as Hungarian. L1 patterns for question intonation differ from the L2, and we expect learners not to produce MC questions with the elevated characteristic of f0 (compared to statements), due to L1 transfer. Moreover, we expect Hungarians to produce less variability in f0 range than natives. To test these assumptions, first we extracted a grid of f0 realization, i.e., the highest peaks and lowest troughs of each syllable, attaining the spine of the f0 structure. Then we analyzed f0 range, as the difference between maximal and minimal f0. Our results showed that Hungarians produce MC questions without the elevated f0 characteristic of natives’ production, and the expected f0 range differences were partially confirmed.\n"
   ],
   "doi": "10.21437/TAI.2021-15"
  },
  "le21_tai": {
   "authors": [
    [
     "Giang",
     "Le"
    ],
    [
     "Chilin",
     "Shih"
    ],
    [
     "Yan",
     "Tang"
    ]
   ],
   "title": "Distortion in Tone Production due to the Lombard Effect",
   "original": "45",
   "page_count": 5,
   "order": 16,
   "p1": 76,
   "pn": 80,
   "abstract": [
    "This study investigates the Lombard effect triggered at different noise levels on the F0 contours of tones in Northern Vietnamese. We hypothesize that due to the human talkers’ limited capacity for hyper-articulation, the dynamic range of the F0 contours may be decreased, potentially resulting in a reduced distinction between lexical tones. For example, for rising tones, the slopes of the overall F0 contours might be flattened at higher noise levels if the demand for hyper-articulation forces elevation of the F0 contours to an unsustainable level. Acoustic analyses of speech produced in quiet and two noise levels confirmed that the F0 contours are raised across all lexical tones and talkers in noise and the dynamic range of the F0 contours decreased for tone C2. The results broadly supported the hypotheses that hyper-articulation due to the Lombard effect may cause tone distortion. The present findings are promising and invite further research into whether tone confusion is experienced by human listeners.\n"
   ],
   "doi": "10.21437/TAI.2021-16"
  },
  "cotosolano21_tai": {
   "authors": [
    [
     "Rolando",
     "Coto-Solano"
    ],
    [
     "Diệp",
     "Trần"
    ]
   ],
   "title": "Priming Effects of Tones in Visual Processing of Vietnamese",
   "original": "46",
   "page_count": 7,
   "order": 17,
   "p1": 81,
   "pn": 87,
   "abstract": [
    "This paper presents an experiment to detect the presence of visual tonal priming in Vietnamese. We carried out a lexical decision task with masked priming with 23 Native speakers of Vietnamese. We compared the reaction times of (i) identical primes and targets, which share consonants, vowels and tones, (ii) primes/targets with different tones, which share only the consonants and vowels, and (iii) completely unrelated primes/targets, where no elements are shared. Prime-target pairs with shared consonants and vowels but different tones had significantly faster RTs than unrelated prime-target pairs (645 vs. 674 ms, p<0.05). This means that consonants and vowels produce a facilitation effect. We also found that prime-target pairs with shared consonants and vowels but different tone have significantly slower RTs than identical prime/targets (645 vs. 622 ms, p<0.05). This is evidence that tones provide facilitation separate from that of segments. Several hypotheses can explain this pattern: This could be an effect of visual similarity of tonal diacritics in the prime/targets, or it could be related to the Vietnamese writing system. The explicit and stable tonal marking in Vietnamese writing, which is unavailable in Mandarin, Cantonese, Thai – languages for which tonal priming is elusive – might result in greater tonal metacognition and stronger priming effects.\n"
   ],
   "doi": "10.21437/TAI.2021-17"
  },
  "bottcher21_tai": {
   "authors": [
    [
     "Marlene",
     "Böttcher"
    ],
    [
     "Fabian",
     "Schubö"
    ]
   ],
   "title": "Pronoun vs. preposition – where is stress assigned in German prepositional phrases?",
   "original": "47",
   "page_count": 4,
   "order": 18,
   "p1": 88,
   "pn": 91,
   "abstract": [
    "It has been assumed that function words do not carry phrasal stress unless they are focused or phrased separately. The results from recent studies on German, however, suggest that unfocused function words optionally bear phrasal stress, depending on their phonological size and aspects of grammatical structure. The present study investigates the phrasal stress patterns of pronouns and prepositions in German prepositional phrases (PPs). In a controlled production study with nine participants, we tested for an impact of the phonological size of the pronoun (mono- vs. disyllabic) and the functional type of the PP (directional vs. non-directional) on the presence and location of phrasal stress. The non-directional PPs involved the preposition von (‘by’) whereas the directional PPs involved the preposition zu (‘to’). The results suggest that stress is regularly realised on function words in German PPs with a pronominal complement. Disyllabic pronouns were found to bear phrasal stress more frequently than monosyllabic pronouns. In nondirectional PPs, the pronominal complement received stress in the majority of instances. In directional PPs, phrasal stress was mostly assigned to the preposition (and not to the pronoun). We propose that this pattern results from the relative informativeness of the preposition.\n"
   ],
   "doi": "10.21437/TAI.2021-18"
  },
  "myers21_tai": {
   "authors": [
    [
     "Scott",
     "Myers"
    ]
   ],
   "title": "Effects of consonant type on tone realization in Luganda",
   "original": "48",
   "page_count": 5,
   "order": 19,
   "p1": 92,
   "pn": 96,
   "abstract": [
    "The f0 realization of tone categories requires voicing, so speakers and listeners must adapt to interruptions of voicing. Speakers have been shown to truncate the f0 excursion or compress its time-course in order to fit it into voiced sonorant intervals shortened by encroaching voiceless consonants [5–8]. In this study, the effect of consonants on f0 trajectories were investigated in Luganda (Bantu, Uganda). Speakers produced Luganda sentences including a C1-V1-C2-V2 interval, in which V1 was a short vowel with a high tone, and C1 and C2 varied in manner (sonorant, voiced obstruent, voiceless obstruent) and quantity (singleton, geminate). It was found that when C2 was voiceless, speakers sped up the f0 rise up to the voiceless interval, and slowed down the f0 fall during the voiceless interval. These adjustments had the effect of concentrating the f0 movements for the high tone in the voiced intervals before and after the voiceless interval. Voiceless C1, on the other hand, had no effect on the timing of the f0 trajectory, suggesting that part of the trajectory obscured by voiceless C1, the onset of the f0 rise, is less important to perceivers than the part obscured by voiceless C2.\n"
   ],
   "doi": "10.21437/TAI.2021-19"
  },
  "huang21_tai": {
   "authors": [
    [
     "Karen",
     "Huang"
    ]
   ],
   "title": "Production of the Taiwanese Southern Min tones by L1 Mandarin speakers",
   "original": "50",
   "page_count": 5,
   "order": 20,
   "p1": 97,
   "pn": 101,
   "abstract": [
    "This study compares the Taiwanese Southern Min (TSM) tones produced by L1 Mandarin speakers and L1 TSM speakers in Taiwan. TSM has seven lexical tones with complex tone sandhi rules while Mandarin only has four lexical tones with a Tone 3 Sandhi. The acoustic study shows that the L1 Mandarin group produced all seven tones with pitch registers and contours similar to the L1 TSM group, including the uncategorized midlevel tone (Tone 7) and two short tones (Tone 4 & 8). In addition, the L1 Mandarin speakers produce accurate sandhi tones at non-XP-final positions. They had no difficulty applying the tone sandhi rules, suggesting that they might have stored the sandhi forms lexically. The further comparison to L1 Mandarin group’s Mandarin tones suggests that the rising and the falling tones were assimilated to their native ones. However, they struggled to reduce the duration of the two TSM short tones to the same degree as the L1 TSM speakers, which suggests that durational differences were more difficult than the pitch for them to acquire.\n"
   ],
   "doi": "10.21437/TAI.2021-20"
  },
  "prechtel21_tai": {
   "authors": [
    [
     "Christine",
     "Prechtel"
    ]
   ],
   "title": "Lexical Stress Strength vs Macro-Rhythm Strength: An Inverse Relationship Between Prominence Cues",
   "original": "51",
   "page_count": 5,
   "order": 21,
   "p1": 102,
   "pn": 106,
   "abstract": [
    "In Jun’s [1] model of prosodic typology, phrase-medial tonal rhythm, or macro-rhythm (MacR), is one of the parameters used to classify languages. A language has strong MacR if its intonation regularly alternates between high and low tones over a word-sized prosodic unit in a phrase [1:522]. The model predicts that languages with an Accentual Phrase (AP) marked by a rising or falling tone will have stronger MacR than languages with various types of pitch accents. Jun observed that languages with weak MacR tend to have strong acoustic correlates of stress while languages with strong MacR tend to have weak acoustic correlates of stress. Therefore, she predicted an inverse correlation between the strength of lexical stress and the strength of MacR. The current study tests this prediction by comparing the lexical stress and MacR correlates of English, Uyghur, and Bengali. The results of a production experiment found that English had the strongest stress correlates, followed by Uyghur, followed by Bengali, and the results of a MacR perception experiment found some support for the opposite ranking (i.e., Bengali > Uyghur > English). These preliminary results suggest a potential trade-off between prominence cues and support for the predicted inverse relationship.\n"
   ],
   "doi": "10.21437/TAI.2021-21"
  },
  "kelterer21_tai": {
   "authors": [
    [
     "Anneliese",
     "Kelterer"
    ],
    [
     "Saskia",
     "Wepner"
    ],
    [
     "Sophie",
     "Christian"
    ],
    [
     "Barbara",
     "Schuppler"
    ],
    [
     "Dina El",
     "Zarka"
    ]
   ],
   "title": "Prosodic cues to agreement and disagreement prefaces in Austrian German conversations",
   "original": "52",
   "page_count": 5,
   "order": 22,
   "p1": 107,
   "pn": 111,
   "abstract": [
    "While the expression of speaker alignment has been of interest in Conversation Analysis for decades, the prosody of (dis)agreement has so far only received little attention. This is the first investigation of the timing of agreement and disagreement turns in conversational Austrian German and the prosody of prefaces to these turns. To assess the timing and prosody, we extracted the duration of the pause before the (dis)agreeing turn, the duration of the preface, examined its F0 shape and performed linear and logistic regression analyses to estimate the relationship of these features with (dis)agreement. We find that agreement prefaces tend to be short and uttered after a short pause. Prefaces to straightforward disagreements are also produced after a short pause but tend to be long. Prefaces to a sub-category of disagreeing turns (“yes you’re right, but…”) tend to be long and uttered after a long pause. Various F0 shapes occur in all three types of prefaces, but there is a robust relationship between dip-rises and prefaces to straightforward disagreements. While the timing patterns are in line with previous findings in the literature on speaker alignment, we did not find unique F0 patterns for agreement or disagreement.\n"
   ],
   "doi": "10.21437/TAI.2021-22"
  },
  "feindt21_tai": {
   "authors": [
    [
     "Kathrin",
     "Feindt"
    ],
    [
     "Martina",
     "Rossi"
    ],
    [
     "Margaret",
     "Zellers"
    ]
   ],
   "title": "The time course of pitch variation towards possible places of speaker transition in German and Swedish",
   "original": "53",
   "page_count": 5,
   "order": 23,
   "p1": 112,
   "pn": 116,
   "abstract": [
    "A large body of studies has been carried out to investigate the phonology of conversation. One of the main issues is the significance of certain linguistic settings for turn-taking. The present study adds to the ongoing discussion by investigating pitch movements at different time points: (i) at the turn end, (ii) 200ms before potential turn boundary, (iii) 500ms before potential turn boundary. These values are exacted and compared between different situations of speaker change, backchannels and floor keeps. Moreover, we carry out a cross-linguistic comparison by analyzing pitch as a turn-taking cue in two languages i.e. German and Swedish. Results of our pilot study give evidence for differences concerning final pitch patterns before the offset of speech. Most strikingly, we find much more variation in the pitch span of German speakers, while Swedish is more restricted in F0 variation at turn boundaries. We also observe that German speakers terminate turns with a higher F0 compared to Swedish speakers, who fall more often to their baseline pitch. Interpreted are these findings in the light of structural differences between German and Swedish concerning deployment of pitch accents as being either lexical or for prominence marking. The Swedish pitch accent permits the use of pitch for conversational purposes while German allows a free variation of F0\n"
   ],
   "doi": "10.21437/TAI.2021-23"
  },
  "schubo21_tai": {
   "authors": [
    [
     "Fabian",
     "Schubö"
    ]
   ],
   "title": "Tonal scaling and alignment in Javanese",
   "original": "55",
   "page_count": 5,
   "order": 24,
   "p1": 117,
   "pn": 121,
   "abstract": [
    "The present study provides basic insights into the tonal properties of Javanese, an Austronesian language that is mainly spoken in the central and eastern parts of Java, Indonesia. This language is particularly interesting with regard to prosody because it lacks lexical stress and lexical tone. A pilot production study was conducted with a single speaker, who produced a total of 96 sentences with SVO word order. The distribution of tonal events suggests that the sentences are subdivided into two prosodic phrases, one containing the subject and another one containing the remaining material. Both phrases involved a local pitch rise on the final syllable. In sentence-final position, the pitch peak was followed by a fall in case a sonorant coda consonant was present, but not if such a consonant was absent. Based on these findings, a preliminary account on the tonal patterns of Javanese is discussed, addressing several discrepancies found in the literature.\n"
   ],
   "doi": "10.21437/TAI.2021-24"
  },
  "cole21_tai": {
   "authors": [
    [
     "Jennifer",
     "Cole"
    ],
    [
     "Jeremy",
     "Steffman"
    ]
   ],
   "title": "The primacy of the rising/non-rising dichotomy in American English intonational tunes",
   "original": "61",
   "page_count": 5,
   "order": 25,
   "p1": 122,
   "pn": 126,
   "abstract": [
    "In American English, phrase-final pitch trajectories have been described as resulting from a sequence of three tonal elements whose combinations define an inventory of phonologically contrastive nuclear tunes [1]. We investigate the distinctive status of nuclear tunes, testing imitative production of sentences paired with one of 8 nuclear tunes, and testing pairwise perceptual discrimination of the same tunes. Results from group- and individual-level clustering analyses of F0 trajectories of imitated tunes reveal maximally 5 distinct tunes, with the most robust distinctions between two tune classes: rising and non-rising. Converging results are obtained from perceptual discrimination. A further finding is that the phonetic distance between tunes is a good predictor of discrimination accuracy, but accuracy is better than predicted for pairwise discrimination across the rising/non-rising classes, and worse than predicted for tunes grouped together in the rising class. These results suggest a robustness hierarchy of tune distinctions with a primary rising/non-rising distinction. This hierarchy reflects holistic shape distinctions, but does not align with the proposed tripartite composition of tunes.\n"
   ],
   "doi": "10.21437/TAI.2021-25"
  },
  "bottcher21b_tai": {
   "authors": [
    [
     "Marlene",
     "Böttcher"
    ]
   ],
   "title": "Semantic vs. Prosodic Prominence – Pronouns Realisation in spontaneous Mono- and Bilingual English",
   "original": "63",
   "page_count": 5,
   "order": 26,
   "p1": 127,
   "pn": 131,
   "abstract": [
    "The phonological realisation of pronouns (reduced vs. explicit) is conditioned by information structure. The choice of a reduced expression depends on the availability in a language. In stress languages like English PRONs are generally unstressed, while focus allows for stressed forms. Pro-drop languages like Turkish, make a distinction between null and overt pronouns. The availability of two structures in bilinguals is prone to transfer. A recent study on spontaneous intonation reported stressed non-focused pronouns in English (Böttcher & Zerbian, 2020). Their bilingual group comprised speakers from different language background (including pro-drop languages) which is taken up in this study. The present paper presents an analysis of prosodically prominent PRONs and their relation to contrastive focus in spontaneous English narrations by 4 mono- and 16 bilingual speakers (Russian, Turkish, Greek, German) from the RUEG corpus. Speakers of all groups produced stressed PRONs independent of contrast related to the previously reported aspects of prosodic phrasing. Bilinguals frequently left contrastive pronouns unmarked, avoiding stress realisations,while monolinguals marked contrastive PRONs prosodically. The results are in line with the overall tendency for bilingual speakers’ prosody to follow unmarked structural constraints eg. phrasing) rather than marked pragmatic constraints (MHD, cf. Zerbian, 2015).\n"
   ],
   "doi": "10.21437/TAI.2021-26"
  },
  "kaland21_tai": {
   "authors": [
    [
     "Constantijn",
     "Kaland"
    ],
    [
     "Naomi",
     "Peck"
    ],
    [
     "T. Mark",
     "Ellison"
    ],
    [
     "Uta",
     "Reinöhl"
    ]
   ],
   "title": "An initial exploration of the interaction of tone and intonation in Kera'a",
   "original": "64",
   "page_count": 5,
   "order": 27,
   "p1": 132,
   "pn": 136,
   "abstract": [
    "This paper provides a first acoustic analysis of the lexical tones found in Kera’a, an endangered language spoken in the North-East of India (Arunachal Pradesh). Minimal existing work provides impressionistic descriptions of the tone system and leads to diverging claims. Apart from lexical contrasts, tones are reported to be affected by sociolinguistic variables such as clan and gender, as well as by elicitation setting. The present study explores these factors using f0 contours found in monosyllabic words that were produced by speakers that differed in gender, clanlectal background and in different elicitation contexts. Cluster analyses were used to explore the f0 variation. Preliminary results suggest interactions between speaker and elicitation context and shed a new light on the realisation of tones in Kera’a.\n"
   ],
   "doi": "10.21437/TAI.2021-27"
  },
  "berger21_tai": {
   "authors": [
    [
     "Stephanie",
     "Berger"
    ],
    [
     "Margaret",
     "Zellers"
    ]
   ],
   "title": "Pitch accent position, peak height, and prominence level relative to accented vowel onset on YouTube",
   "original": "66",
   "page_count": 5,
   "order": 28,
   "p1": 137,
   "pn": 141,
   "abstract": [
    "Prominence can be expressed using several strategies, such as the position of the accent relative to the accented vowel (later pitch accents tend to be perceived as more prominent) or the height of the pitch peak that is associated with the prominent syllable (higher pitch peaks are likewise perceived as more prominent). These strategies are investigated here for a sample of YouTubers, in whose case it is necessary to draw an audience in quickly. Speaking expressively is thus important, and strong or emphatic prominences are one way to do that. We find that the YouTubers in the sample used significantly more non-early peaks than early peaks, and more emphatic prominences than weak prominences. The timing of the accents does not seem to be tied to the prominence level, but emphatic accents were produced with higher pitch peaks than the other prominence levels. Results differed depending on speaker origin.\n"
   ],
   "doi": "10.21437/TAI.2021-28"
  },
  "jabeen21_tai": {
   "authors": [
    [
     "Farhat",
     "Jabeen"
    ],
    [
     "Petra",
     "Wagner"
    ],
    [
     "Jutta",
     "Hartmann"
    ]
   ],
   "title": "Creativity and Variability in the Perception of Prosody and Focus Marking in German",
   "original": "67",
   "page_count": 5,
   "order": 29,
   "p1": 142,
   "pn": 146,
   "abstract": [
    "The interplay between accentuation patterns and information structure has received considerable attention in the field. The current study aims to investigate the extent to which German listeners are tolerant of (mis)matching accentuation presented in wide and contrastive narrow focus contexts. In a perception experiment, we presented our participants with sentences produced with congruent accentuation in terms of the elicited focus context as well as with mismatching accentuation. The mismatches comprised accent type only or both accent type and position. The participants rated the appropriateness of each accentuation pattern presented in narrow or wide focus contexts. The analysis of their ratings showed that German listeners are sensitive to (mis)matches in accentuation type and position in different focus contexts. The listeners dispreferred mismatching accent type in wide focus when L* nuclear accent was replaced with L+H*. However, replacing L+H* in narrow focus with L* received high appropriateness ratings. Participants also preferred the earlier placement of nuclear pitch accent in wide focus, while dispreferring the mismatching accent position in narrow focus context. Furthermore, they varied in their tolerance for different types of mismatching input. This indicates that German listeners are sensitive to variation in terms of accent type and position as well as focus marking."
   ],
   "doi": "10.21437/TAI.2021-29"
  },
  "herubin21_tai": {
   "authors": [
    [
     "Aimee",
     "Herubin"
    ]
   ],
   "title": "Lesbian Pitch Level and Span: A Case Study of Cameron Esposito",
   "original": "69",
   "page_count": 4,
   "order": 30,
   "p1": 147,
   "pn": 150,
   "abstract": [
    "This study investigates the pitch level and span of comedian Cameron Esposito in conversation with four groups of interlocutors: straight women, lesbian women, gay men, and straight men. While lesbian women have their own unique linguistic behaviors (e.g. [1]), speakers, regardless of sexual orientation, often accommodate to their interlocutor to signify a common social identity ([2], [3]). Research suggests that pitch level and span may be a source of phonetic variation between straight and lesbian women ([1], [4]). Furthermore, recent research shows that queer speakers can modulate stereotypically queer acoustic variants based on their interlocutor ([5]), in line with [6], who proposed that differences in speech between queer and straight speakers would only be found where community solidarity is desired. This research endeavors to answer the following questions: does Cameron Esposito alter her pitch level and span when speaking with interlocutors of different sexualities; does this vary between different discourse contexts? Cameron Esposito was chosen for this study because she is a prominent lesbian in the entertainment industry and is actively involved with members of LGBTQ+ communities. She has hosted her own podcast since 2017 where she routinely uses professional audio recording equipment while interviewing guests from the LGBTQ+ community. Speech was collected from podcasts in which Esposito speaks on a variety of topics with a single interlocutor. Speech produced with the two queer groups of interlocutors, gay men and lesbian women, was collected from Esposito’s podcast Queery. Speech produced with the straight interlocutors, straight men and women, was collected from podcast episodes in which Esposito was a guest. A total of 414 speech tokens of 5-10s were coded by interaction structure and macro speech act, modified from [7]. Coding was done in Elan and exported to Praat. Minimum and maximum pitch measurements in Hertz were extracted every 10ms using a Praat script with a maximum pitch setting of 500Hz. Tokens that fell within the upper or lower 5% were removed to eliminate extreme values. Calculations of average pitch level in Hertz and span in semitones, as well as statistical analysis, were conducted in R. A multiple linear regression analysis suggests significant results are present for pitch level and span with straight male interlocutors across discourse contexts, see Figure 1. Esposito both lowers her average pitch level and speaks with a narrower pitch span when in conversation with the straight male podcasters used in this study. There is no significant difference between queer interlocutors in pitch level or span. These results are discussed in the context of communication accommodation ([8]) and linguistic markers of sexual orientation (e.g. [9])."
   ],
   "doi": "10.21437/TAI.2021-30"
  },
  "chen21_tai": {
   "authors": [
    [
     "Xiaocong",
     "Chen"
    ],
    [
     "Caicai",
     "Zhang"
    ]
   ],
   "title": "Encoding of contextual tonal alternations in word production in Teochew",
   "original": "72",
   "page_count": 5,
   "order": 31,
   "p1": 151,
   "pn": 155,
   "abstract": [
    "Context-dependent tonal alternations occur abundantly in many Chinese dialects, but how they are encoded in speech production is still unclear. Previous research on Mandarin third-tone sandhi production has suggested that the encoding of sandhi tonal variant may involve an online computation process in the phonological encoding before articulation, but it is unknown whether this also applies to the tone sandhi in other Chinese dialects. In the current study, we employed an odd-one-out implicit priming task to investigate the encoding process of a similar tonal alternation phenomenon in Teochew (a Min Chinese dialect), whereby Tone 2 (T2) and Tone 3 (T3) exhibit different sandhi tonal variants in the non-phrasal-final positions depending on the following tones. Our two experiments showed that compared to the tonal unrelated condition, the word production latencies were significantly facilitated by a similar magnitude when the underlying tonal category was shared, regardless of the surface sandhi tonal values. These results indicate that different contextual-dependent sandhi tonal variants in Teochew are probably represented as the same underlying representation in the lexicon, but their realization is more likely to occur in the course of articulation in anticipation of the subsequent tonal context. This stands in contrast to the findings from Mandarin third-tone sandhi, suggesting different processing mechanisms could be engaged for different types of tonal alternations."
   ],
   "doi": "10.21437/TAI.2021-31"
  },
  "lundmark21_tai": {
   "authors": [
    [
     "Malin Svensson",
     "Lundmark"
    ]
   ],
   "title": "Evidence of segmental articulations: Acceleration determines vowel segment duration in Swedish Word Accents",
   "original": "73",
   "page_count": 5,
   "order": 32,
   "p1": 156,
   "pn": 160,
   "abstract": [
    "This study addresses a one-to-one relation between articulation and acoustics at segment boundaries. The study focuses on Swedish word accents and how a rising or falling tone affect vowel segment duration. The paper explains how segment boundaries are a result of rapid movements of the articulators. In the acceleration profile, this is identified as peak acceleration, which can be measured. The timing of two acceleration peaks (the distance between them is referred to as a posture interval) determines the duration of the acoustic segment. The purpose of the study is to see whether the posture intervals of active articulators correlate with the acoustic vowel segment, even if duration is affected by tonal context. To this end, acoustic and articulatory data on long and short open vowels, produced by 18 Swedish speakers, have been collected. The data includes vowel acoustic segment duration, and peak acceleration of lip and tongue tip movements. The results suggest that: a) acoustic vowel segments can be determined by timing of consonantal articulation; b) peak acceleration successfully capture the acoustic changes constituting the segment boundary, at least for nasal stops; c) laryngeal production affects all orofacial movements, as the tone affects the timing of the consonantal articulation."
   ],
   "doi": "10.21437/TAI.2021-32"
  },
  "lialiou21_tai": {
   "authors": [
    [
     "Maria",
     "Lialiou"
    ],
    [
     "Aviad",
     "Albert"
    ],
    [
     "Alexandra",
     "Vella"
    ],
    [
     "Martine",
     "Grice"
    ]
   ],
   "title": "Periodic energy mass on head and edge tones in Maltese wh-constructions",
   "original": "76",
   "page_count": 5,
   "order": 33,
   "p1": 161,
   "pn": 165,
   "abstract": [
    "This paper is concerned with the relation between tonal association and prosodic strength in different tone bearing positions in Maltese wh-words. In these words, tones are associated with the stressed syllable (head association) in indirect and quoted questions, but with the initial syllable (edge association) in direct questions. In a language that has pitch accents to cue prominence (a head prominence language according to Jun's typology), the initial syllable, if not stressed, would not typically cue prominence, but rather juncture. Using periodic energy mass as a measure of strength, and thus prominence, we found that mass enhancement is not conditioned by tonal association (either head or edge) but rather by the lexical stress. Whereas the present study shows that the word-initial H tone does not affect the relative prominence between the stressed syllable and the word-initial one, and thus does not cue prominence on the initial syllable, there is a potentially different prominence-cueing function of this early H peak. That is, for example a prominence cueing function at the word level (i.e., one which makes the entire word more prominent) driven by modality or pragmatic force."
   ],
   "doi": "10.21437/TAI.2021-33"
  },
  "spina21_tai": {
   "authors": [
    [
     "Nadja",
     "Spina"
    ],
    [
     "Fabian",
     "Schubö"
    ]
   ],
   "title": "Vowel length affects pre-boundary lengthening in Czech",
   "original": "77",
   "page_count": 5,
   "order": 34,
   "p1": 166,
   "pn": 170,
   "abstract": [
    "This study investigates the patterns of pre-boundary lengthening (PBL) in Czech, a language with phonemic length distinctions. Studies on Finno-Ugric languages found that PBL can be restricted or absent on vowels for which a corresponding longer phoneme with the same quality exists in the inventory. The present study provides the first investigation of a Slavic language in this regard. A production experiment was conducted that tested for an impact of vowel length on the presence and amount of PBL in trisyllabic words with antepenultimate stress. The results showed that short and long vowels undergo lengthening in all positions, but short vowels in pre-final syllables tend to involve a smaller amount of relative lengthening than long vowels. Furthermore, the results are compatible with the assumption that the initiation of PBL is linked to the stressed syllable, as has been observed in Germanic languages. The initiation point, however, shifts to the following syllable if the distance between the stressed syllable and the end of the word is increased."
   ],
   "doi": "10.21437/TAI.2021-34"
  },
  "chen21b_tai": {
   "authors": [
    [
     "Yue",
     "Chen"
    ],
    [
     "Yi",
     "Xu"
    ]
   ],
   "title": "Parallel Recognition of Mandarin Tones and Focus from continuous F0",
   "original": "78",
   "page_count": 5,
   "order": 35,
   "p1": 171,
   "pn": 175,
   "abstract": [
    "In tonal languages not only lexical tones but also prosodic focus can be encoded by generating F0 contours. Such concurrent encoding of tone and intonation in speech production can be computationally simulated by speech synthesis models. It is yet unclear, however, how exactly both tone and focus can be decoded in perception from a single stream of surface F0 contours. In this study, we applied the support vector machine (SVM) model to recognize tone and focus from F0 trajectories in an experimental Mandarin corpus to indirectly answer the question. Three sub-experiments were run to compare the recognition strategies: recognizing tones only, recognizing focus only, and recognizing tones and focus at the same time. The recognition rate of the four tones regardless of focus was 88.3%. The recognition rate for focus regardless of tone was 77.5%. The overall recognition rates for tone-focus combinations were similar to the previous two experiments, while the breakdown of the accuracies showed that the recognition rate varied extensively across both focus conditions and tone conditions. Those results showed that the perception of tone and focus from continuous speech is likely dependent on each other, and tone and focus could be recognized in parallel."
   ],
   "doi": "10.21437/TAI.2021-35"
  },
  "lee21_tai": {
   "authors": [
    [
     "Jonathan Him Nok",
     "Lee"
    ]
   ],
   "title": "Low boundary tone: Evidence from the acoustic differences between Cantonese sentence-final particles with low-falling tone",
   "original": "79",
   "page_count": 5,
   "order": 36,
   "p1": 176,
   "pn": 180,
   "abstract": [
    "This study investigated the nature of the tones on Cantonese sentence-final particles (SFPs) with low-falling tone. Four Cantonese SFPs with different intonations were examined: aa4, le4, lei4, and zaa4. Ten native adult speakers of Cantonese participated in production experiments. Smoothing Spline ANOVA results suggested that, despite the same citation tone (tone 4, low-falling tone), the F0 of aa4, le4, and zaa4 was significantly lower than that of lei4 when they functioned as expressing intonation at the utterance-final position. However, there were no significant differences between the F0 of all four SFPs and their (near-)homophones when they were produced as lexical items in the middle of a sentence. The F0 differences found between the SFPs at the utterance-final position can be attributed to the superimposition of low boundary tone on aa4, le4, and zaa4. My results supported the hypothesis that the low-falling tone on aa4, le4, and zaa4 is a combination of lexical tone (tone 4) and intonation (low boundary tone), and that on lei4 is merely tonal."
   ],
   "doi": "10.21437/TAI.2021-36"
  },
  "niu21_tai": {
   "authors": [
    [
     "Yufei",
     "Niu"
    ],
    [
     "Peggy Pik Ki",
     "Mok"
    ]
   ],
   "title": "The effect of L2 proficiency on pitch and phonation sensitivity in naïve tone perception—A study of Wenzhou dialect tone perception by English learners of Mandarin",
   "original": "81",
   "page_count": 5,
   "order": 37,
   "p1": 181,
   "pn": 185,
   "abstract": [
    "Studies have shown that learning a tone language facilitates naïve tone perception for native speakers of non-tone languages. However, tone is a multidimensional concept and phonation also plays an important role in tone perception. In this study, 20 native English speakers of different Mandarin levels, 20 native English and native Mandarin speakers (all naïve to the Wenzhou Wu dialect) participated in an AX discrimination task of the Wenzhou dialect because the eight tones in two registers contrast in both pitch and phonation: high register (modal voice) vs. low register (breathy voice). Mandarin T3 often co-occurs with creaky voice while in English, creaky voice is a sociophonetic marker. We asked whether the exposure to one phonation type (creaky voice) at a different linguistic level (indexical in English, allophonic in Mandarin) could lead to an increased sensitivity to another phonation type (breathy voice). Our results demonstrated that Mandarin experience could increase the sensitivity to both pitch and phonation for native English speakers and their performance was positively correlated with L2 proficiency. Moreover, the high proficiency L2 learners significantly outperformed native Mandarin speakers, which implied a cumulative facilitating effect that L2 learners could benefit from both L1 and L2 experience in terms of pitch and phonation."
   ],
   "doi": "10.21437/TAI.2021-37"
  },
  "zhou21_tai": {
   "authors": [
    [
     "Fang",
     "Zhou"
    ],
    [
     "Si",
     "Chen"
    ],
    [
     "Angel",
     "Chan"
    ],
    [
     "Eunjin",
     "Chun"
    ],
    [
     "Bei",
     "Li"
    ],
    [
     "Tempo",
     "Tang"
    ],
    [
     "Phoebe",
     "Choi"
    ]
   ],
   "title": "Mapping prosody and meaning by Cantonese-speaking children with and without autism spectrum disorder",
   "original": "83",
   "page_count": 4,
   "order": 38,
   "p1": 186,
   "pn": 189,
   "abstract": [
    "Effective usage of prosody enables speakers to stress new and important information while deemphasizing old and less important information. The current study investigates how children with and without Autism Spectrum Disorder (ASD) perceive focus-marking in Cantonese. We presented matched and mismatched conversation pairs regarding broad and narrow focus conditions to participants aged six to ten and test their ability by using a naturalness judgmental task. Compared to the performance of adults, the results showed that children have difficulties in integrating prosodic cues and information structure marking regardless of their IQ, language ability or autistic condition in general."
   ],
   "doi": "10.21437/TAI.2021-38"
  },
  "hellmuth21_tai": {
   "authors": [
    [
     "Sam",
     "Hellmuth"
    ],
    [
     "Ciara",
     "Farrelly"
    ]
   ],
   "title": "Intonational variation and change in York English",
   "original": "84",
   "page_count": 5,
   "order": 39,
   "p1": 190,
   "pn": 194,
   "abstract": [
    "The variety of English spoken in the city of York, UK, is of sociolinguistic interest due to ‘recycling’ of traditional dialectal forms such as Definite Article Reduction (‘to t’pub’) and Past-Reference come (‘I come home late last night’) by younger (typically male) speakers; in apparent time studies based on the York English Corpus (YEC), middle-aged speakers (aged 50-70) used these forms less than older speakers (>70), so the patterns had previously appeared to be falling out of use. In this paper we first argue for the existence of a distinctive ‘Yorkshire rise-fall’ nuclear contour, which is sufficiently different in form and distribution from rise-fall contours reported for other varieties of British English that it can be characterized as a traditional (prosodic) feature of Yorkshire dialects. We then explore whether the observed patterns of variation in lexical-grammatical variables are mirrored in variation and change in use of this distinctive Yorkshire rise-fall nuclear contour, in apparent time, via qualitative analysis of data from the YEC."
   ],
   "doi": "10.21437/TAI.2021-39"
  },
  "alzamil21_tai": {
   "authors": [
    [
     "Aljawharah",
     "Alzamil"
    ],
    [
     "Sam",
     "Hellmuth"
    ]
   ],
   "title": "The prosodic realisation of focus in Saudi Arabic dialects in comparative perspective",
   "original": "86",
   "page_count": 5,
   "order": 40,
   "p1": 195,
   "pn": 199,
   "abstract": [
    "Production data from speakers of three varieties of Saudi Arabic (Najdi/Hijazi/Jizani), in two age groups, are used to explore whether generalizations about prosodic focus marking in Urban Hijazi Arabic reported by Alzaidi et al. [1] are i) shared with other Saudi dialects, ii) stable across generations of speakers, and iii) maintained in the context of other focus strategies. Data was elicited using a question-and-answer reading task (cf. [1]) but also a picture description task which gives speakers freedom to express focus by all grammatical means available. In both paradigms, parallel target words were presented in different contexts to elicit broad focus versus two types of narrow focus. Quantitative analysis of acoustic properties in the stressed syllable of target words across conditions is reported, alongside visualization of the F0 contour and qualitative analysis of alternative focus marking strategies. Results show some differences between dialects in the type and degree of acoustic cues observed in on-focus positions. Off-focus cues, in both pre-focus and post-focus positions, are similar across dialects. All three dialects display alternative focus marking strategies, with indications of a potential trade-off between non-prosodic strategies versus on-focus prosodic marking."
   ],
   "doi": "10.21437/TAI.2021-40"
  },
  "katsuda21_tai": {
   "authors": [
    [
     "Hironori",
     "Katsuda"
    ],
    [
     "Jeremy",
     "Steffman"
    ]
   ],
   "title": "Prominence-boundary interactions in speech perception: evidence from Japanese vowel length",
   "original": "89",
   "page_count": 5,
   "order": 41,
   "p1": 200,
   "pn": 204,
   "abstract": [
    "This study examines prominence-boundary interactions as they relate to the perception of durational cues in Tokyo Japanese. We tested if the lexical pitch accent (lexical prominence) status of a word mediates the effects of a prosodic boundary in the perception of contrastive vowel length. We implemented a two-alternative forced choice perception task in which listeners categorized a vowel duration continuum as a phonemically short or long vowel, while we manipulated pitch accentuation and phrasing as contextual cues. We first replicated a recent finding (Steffman & Katsuda [1]) that listeners require longer phrase-final vowel durations (as compared to phrase-medial) to perceive vowel as phonemically long: a compensatory perceptual adjustment for final lengthening. We further find that this boundary effect is mediated by pitch accent, consistent with recent speech production results (Seo et al. [2]) which show that a pitch accent reduces the magnitude of final lengthening in a word (i.e., unaccented words undergo greater final lengthening). Our perception results indicate that listeners accordingly require even longer vowel duration for a long vowel percept when a target word is both phrase-final and unaccented. Overall, our results show that listeners take both prominence and prosodic boundaries into consideration when they compute vowel length: a perceptual analog to intricate prominence-boundary effects in speech production."
   ],
   "doi": "10.21437/TAI.2021-41"
  },
  "zhou21b_tai": {
   "authors": [
    [
     "Wei William",
     "Zhou"
    ]
   ],
   "title": "Identifying Mandarin Tones with Intonation is Difficult for L2 Learners, Regardless of Their Experience",
   "original": "91",
   "page_count": 4,
   "order": 42,
   "p1": 205,
   "pn": 208,
   "abstract": [
    "In Mandarin Chinese, fundamental frequency (f0) is the primary cue for the identification of both lexical tone and intonation. When tone and intonation coincide, the f0 parameters of intonation-overlaid tones deviate from those of citation tones. In this study, a tone identification experiment was conducted with both inexperienced and experienced second language (L2) learners to investigate how well L2 learners identify tones produced in two different intonation patterns (statement and question) and whether increased L2 experience facilitates the identification. The results showed that tones overlaid by question intonation were more difficult to identify than those not. Moreover, the experienced learners did not outperform the inexperienced learners, suggesting that identifying intonation-overlaid tones is difficult for learners, regardless of their L2 experience."
   ],
   "doi": "10.21437/TAI.2021-42"
  },
  "gregori21_tai": {
   "authors": [
    [
     "Alina",
     "Gregori"
    ],
    [
     "Frank",
     "Kügler"
    ]
   ],
   "title": "An Empirical Investigation on the Perceptual Similarity of Prosodic Language Types",
   "original": "93",
   "page_count": 5,
   "order": 43,
   "p1": 209,
   "pn": 213,
   "abstract": [
    "This study explores whether prosodic similarities of typological prosodic language types can be perceived by German native speakers. For this purpose, two online perception experiments were conducted containing twelve typologically and geographically diverse languages. Participants were asked to judge their prosodic similarity. Results showed that languages with mainly word-level prosodic properties were judged as similar to one another, while languages employing sentence-level prosodic properties were not clearly perceived as similar to their specific language type. Frequent confusions of Intonation and Phrase languages indicate a high perceptional similarity of languages belonging to these prosodic types. This leads to the assumption that the adopted distinction of prosodic properties is not completely represented in perception. Rather, additional prosodic factors influence the perception of the sentence prosody of languages."
   ],
   "doi": "10.21437/TAI.2021-43"
  },
  "vallsrates21_tai": {
   "authors": [
    [
     "Io",
     "Valls-Ratés"
    ],
    [
     "Oliver",
     "Niebuhr"
    ],
    [
     "Pilar",
     "Prieto"
    ]
   ],
   "title": "Effects of public speaking virtual reality trainings on prosodic and gestural features",
   "original": "97",
   "page_count": 5,
   "order": 44,
   "p1": 214,
   "pn": 218,
   "abstract": [
    "Previous studies have revealed that virtual reality (VR) is able to suggest to the human brain a real environment, as it was stated in 1989 when the term 'virtual reality' was coined. In the field of public speaking, studies have mainly focused on how VR environments can help reduce public speaking anxiety. However, there is no focus on VR training in educational settings and, more specifically, on how VR training can help improve subsequent public-speaking performances in front of a real audience. The present study aims at analyzing the prosodic and gestural effects that VR settings have on speakers. A total of 31 secondary school students participated either in a VR oral-presentation training facing a VR audience, or in a control condition in which oral presentations were practiced alone in a room. Prosodic and gestural measures of speaking style were analyzed and compared between the two groups, each of which performed three rounds of practicing in three consecutive weeks. Training with VR resulted in longer speaking time and more pausing, an increase in f0 values and more gesturing, all of which suggests a stronger audience orientation. By contrast, the non-VR speakers developed in the opposite direction."
   ],
   "doi": "10.21437/TAI.2021-44"
  },
  "langer21_tai": {
   "authors": [
    [
     "Corinna",
     "Langer"
    ],
    [
     "Frank",
     "Kügler"
    ]
   ],
   "title": "Focus and Prosodic Cues in Hungarian Noun Phrases",
   "original": "98",
   "page_count": 5,
   "order": 45,
   "p1": 219,
   "pn": 223,
   "abstract": [
    "This study investigates the prosodic patterns of complex noun phrases in Hungarian in order to disentangle the roles of structural (syntactic) and prosodic prominence. While Hungarian has fixed syntactic positions for (narrow, exclusive) focus and topic, the structural marking of information structure cannot disambiguate multiple possible interpretations when the focus position is filled with complex phrases. We conducted a production study with complex noun phrases in the syntactic focus position, where contexts elicited either focus on the whole phrase or only on parts of it (e.g. only the noun). Our results show that while there is predominantly consistent prosodic marking of the left-edge of the syntactic focus position, there are different prosodic patterns in the NP depending on the position and the domain of focus. Thus, despite the structurally prominent syntactic focus position in Hungarian, prosodic prominence marking plays an independent role in focus marking."
   ],
   "doi": "10.21437/TAI.2021-45"
  },
  "abbas21_tai": {
   "authors": [
    [
     "Abeer",
     "Abbas"
    ],
    [
     "Sun-Ah",
     "Jun"
    ]
   ],
   "title": "Prosodic Structure of Farasani Arabic: Accentual Phrase without a Pitch Accent",
   "original": "100",
   "page_count": 5,
   "order": 46,
   "p1": 224,
   "pn": 228,
   "abstract": [
    "This study proposes a model of intonational phonology of Farasani Arabic, a dialect of Arabic spoken on the Farasan Islands, Saudi Arabia, based on the Autosegmental-Metrical framework [1], [2], [3]. Tonal patterns of utterances, produced in neutral and narrow focus contexts, were collected from seven Farasani native speakers. The findings show that Farasani Arabic, which has lexical stress, is typologically unique in that it has no pitch accent unless a word is emphasized. Instead, in neutral focus, most words form an Accentual Phrase (AP), marked by a Low tone on its left edge and a High tone (Ha) on its right edge. Additionally, there are two prosodic units above the AP: an Intermediate Phrase (ip) and an Intonational Phrase (IP). An ip is marked, on its final syllable, by a high boundary tone (H-), which is higher than the preceding Ha tone and delimits syntactic constituents such as relative clauses, adjuncts, and alternative questions. An IP is defined by a boundary tone [H%, L%, !H%, or HLH%] on its final syllable, overriding the boundary tone of the lower prosodic units. The findings on the AP and lack of pitch accents are discussed in terms of the typology of word-prominence type."
   ],
   "doi": "10.21437/TAI.2021-46"
  },
  "li21_tai": {
   "authors": [
    [
     "Kechun",
     "Li"
    ],
    [
     "Francis",
     "Nolan"
    ],
    [
     "Brechtje",
     "Post"
    ]
   ],
   "title": "The Right Edge of the IP in Cantonese Focus Perception",
   "original": "108",
   "page_count": 5,
   "order": 47,
   "p1": 229,
   "pn": 233,
   "abstract": [
    "Prosodic focus in Cantonese is found to lack f0 marking both at on-focal and post-focal positions, and instead, the fine-grained differences in meanings related to focus tend to be conveyed through sentence-final particles. Less discussed is the role of edge tones, which are part of the intonational phonology fulfilling a function similar to that of sentence-final particles. It has been reported that a lengthened falling contour attached to the final syllable conveys contrastive focus or serves as a signal to draw attention. In the current study, a perception experiment was conducted with stimuli manipulated to have prominence on either subject or object, interacting with an edge tone on the last syllable. Both a linguistic task of rating appropriateness and a metalinguistic task of annotating emphasised syllables were adopted. The combined results of the two tasks revealed that edge tones can trigger the perception of prominence on the final syllable, but when the context requires, edge tones can be reinterpreted at the discourse level as indicating a preceding focus. The prevalence of edge tones along with the rich inventory of sentence-final particles in Cantonese points to the salience of the right edge of the IP in focus marking."
   ],
   "doi": "10.21437/TAI.2021-47"
  },
  "einfeldt21_tai": {
   "authors": [
    [
     "Marieke",
     "Einfeldt"
    ],
    [
     "Bettina",
     "Braun"
    ]
   ],
   "title": "Pitch accent distribution and tonal alignment in Swiss German and German children",
   "original": "109",
   "page_count": 5,
   "order": 48,
   "p1": 234,
   "pn": 238,
   "abstract": [
    "The acquisition of an intonation language necessitates to learn which words to accent, which pitch accents to choose and their correct realization (e.g., the alignment of tonal targets with the accented syllable). Languages differ in these respects, even when they are closely related: Adult speakers of Swiss German and Southern German differ in frequency of pitch accent choice (more L*+H in Swiss German) and the alignment of tonal targets (later in Swiss German). We investigate the choice and realization of rising pitch accents (L+H*, L*+H) by 2-to-3- year-old children from these languages (varieties spoken in the Cantone of Zurich and Baden-Wuerttemberg). We annotated productions from a semi-spontaneous naming task and compared pitch accent choice and alignment in disyllabic trochaic nouns. Results showed more L*+H in Swiss German compared to Southern German children, mirroring the adult pattern. The alignment of the starred tone (e.g., L* in L*+H) was influenced by the duration of the accented syllable (the longer, the later), but this pattern was modulated by pitch accent type and language: stronger effects of duration in Southern German L+H* and weaker effects in both Swiss German accents. We discuss the results in terms of the phonological system of the two languages."
   ],
   "doi": "10.21437/TAI.2021-48"
  },
  "hofenbitzer21_tai": {
   "authors": [
    [
     "Justin",
     "Hofenbitzer"
    ],
    [
     "Bettina",
     "Braun"
    ],
    [
     "Maribel",
     "Romero"
    ]
   ],
   "title": "The connection between prosodic realisations of German Wh-questions and their pragmatic embeddings",
   "original": "110",
   "page_count": 5,
   "order": 49,
   "p1": 239,
   "pn": 243,
   "abstract": [
    "We hypothesise that a speaker using falling intonation on a Wh-question, which corresponds to the default contour in German, indicates to their addressee the possibility to respond with a null-answer like “nobody” or “nothing”. With a rising intonation, on the other hand, the speaker is supposed to explicitly deny the possibility of such an answer due to prior knowledge that the existential implication of the question is true. We ran two perception experiments, in which participants were exposed to two types of contexts, either allowing or disallowing the null-answer, followed by either a rising or a falling Wh-question. Results show that participants did not integrate context and contour. Nevertheless, both variables influenced the participants’ acceptability ratings. Results are discussed in terms of semantics and pragmatics of questions."
   ],
   "doi": "10.21437/TAI.2021-49"
  },
  "barrault21_tai": {
   "authors": [
    [
     "Axel",
     "Barrault"
    ],
    [
     "Pauline",
     "Welby"
    ],
    [
     "James",
     "German"
    ]
   ],
   "title": "The perceptual relevance of the French Initial Rise in identifying the left edge of a contrastive focus",
   "original": "115",
   "page_count": 5,
   "order": 50,
   "p1": 244,
   "pn": 248,
   "abstract": [
    "This study addresses the interplay between information structure and intonation in French. In a forced-choice perception task, we tested whether the French Initial Rise (Initial Rise) is of relevance in identifying the left edge of a non-corrective contrastive focus. Participants listened to two-clause sentences with parallel structures in the two clauses in which the segmental information of the direct object head noun in the second clause was missing (see Figure 1). Crucially, there was always a contrast on the final color adjective modifying the noun. On the intonational residual, we manipulated the presence (LHiLH*) or absence (LLH*) of an Initial Rise. Participants were asked to choose between the Given or a New referent. The latter would reflect a contrastive interpretation of the entire post-verbal argument, while the former would reflect a contrastive interpretation restricted to the final adjectival modifier of the direct object noun phrase. Results showed no bias toward either of the two interpretations as a function of the presence or absence of the Initial Rise as marking the left edge of a contrastive focus. As anticipated, however, the sentences’ parallelism induced an overall bias toward a contrastive interpretation. Several factors that may explain the present null result are discussed under the hypothesis that the Initial Rise is a weak cue to focus."
   ],
   "doi": "10.21437/TAI.2021-50"
  },
  "mady21_tai": {
   "authors": [
    [
     "Katalin",
     "Mády"
    ],
    [
     "Uwe",
     "Reichel"
    ],
    [
     "Anna",
     "Kohári"
    ],
    [
     "Ádám",
     "Szalontai"
    ]
   ],
   "title": "The role of accommodation in expressing emotions to newborn babies",
   "original": "120",
   "page_count": 5,
   "order": 51,
   "p1": 249,
   "pn": 253,
   "abstract": [
    "Infant-directed speech (IDS) carries signals expressing strong positive emotions towards the baby. This has been shown in various studies for e.g. higher f0 and energy, lower speech rate etc. Longitudinal studies comparing adult-directed (AD) and ID speech revealed that the difference between acoustic features usually connected with strong and positive emotions were not present directly from birth in mothers’ speech, but emerged only at a later time point. In this study, emotion expression in terms of arousal and valence was investigated through labellers’ perception in two groups: primipara mothers giving birth to their first child, and multipara mothers who were already experienced in IDS with their older children. A set of fixed sentences taken from semi-spontaneous speech was scored by labellers. Both arousal and valence scores were higher in IDS. Arousal scores were further apart in the multipara group, while this distinction was not present for valence. A set of acoustic parameters were investigated according to low and high perceived arousal and valence in the same data set."
   ],
   "doi": "10.21437/TAI.2021-51"
  },
  "krepsz21_tai": {
   "authors": [
    [
     "Valéria",
     "Krepsz"
    ],
    [
     "Anna",
     "Huszár"
    ],
    [
     "Katalin",
     "Mády"
    ]
   ],
   "title": "The relationship between boundary markers and audible inhalation in Hungarian read speech",
   "original": "121",
   "page_count": 5,
   "order": 52,
   "p1": 254,
   "pn": 258,
   "abstract": [
    "It is well known that prosodic features – next to meaning-modifying and meaning-clarifying functions – can also act as boundary markers, however, it is unclear that which prosodic cues and in what combination. The results of previous research, have yielded contradictory results as to which are the strongest, most frequently occurring, or most consistent prosodic cues, in part due to different languages and methods. Dissimilarly from most languages analyzed earlier, Hungarian is a left-headed head-/edge prominence language. Therefore, the aim of the present study was to investigate the difference in the relationship of prosodic boundary markers and the audible inhalation between the two kinds of clauses in Hungarian read speech and according to the length of the first clauses of the sentences. Based on 20 young adult male and female Hungarian speakers' text and sentence reading, altogether 320 (coordinated, CO and subordinated, SUB) clause end positions were examined. Silent pauses, the appearance of high/low tones, creaky voice, and the realization of the audible inhalation (based on the agreement of 2 annotators) were labeled. The results revealed differences between boundary marking in CO and SUB clauses: SUB clauses were more often realized with no marking, while CO boundaries were labeled with low tone and creaky voice. Besides, notable differences were also observed in the boundary marking cues after long and short clauses."
   ],
   "doi": "10.21437/TAI.2021-52"
  },
  "brugos21_tai": {
   "authors": [
    [
     "Alejna",
     "Brugos"
    ],
    [
     "Enkeleida",
     "Kapia"
    ]
   ],
   "title": "Prosodic and Non-Prosodic Cues to Prominence and Boundaries: Evidence from an RPT study in Albanian",
   "original": "124",
   "page_count": 5,
   "order": 53,
   "p1": 259,
   "pn": 263,
   "abstract": [
    "This paper reports evidence from the Rapid Prosody Transcription method (RPT, cf. Cole & Shattuck-Hufnagel, 2016) in the study of a little-described language. We bring forth results from two perception experiments on the prosody of Albanian, which provide important evidence in the perceptibility of prosodic and non-prosodic correlates in the language’s prosodic system, shedding more light on its complexity. Albanian listeners in this study show moderate to substantial agreement in the perception of both prosodic prominences and boundaries, conforming to what has been found in RPT studies from other languages so far (Cole at al, 2010; Baumann & Winter, 2015; Riesberg at al, 2020). In doing so, listeners’ perception of prosodic structure correlates with both prosodic cues, i.e. PoLaR intonational categories (Ahn et al, 2019), and non-prosodic cues, i.e. syntactic break and part of speech, suggesting that these factors may serve as cues to prominence and boundary perception."
   ],
   "doi": "10.21437/TAI.2021-53"
  },
  "myrberg21_tai": {
   "authors": [
    [
     "Sara",
     "Myrberg"
    ]
   ],
   "title": "Utterance-final rises and focus marking in South Swedish",
   "original": "125",
   "page_count": 5,
   "order": 54,
   "p1": 264,
   "pn": 268,
   "abstract": [
    "This paper presents a production study investigating the frequency of utterance-final rises in South Swedish. These rises are interesting from a dialect typological perspective. Recent findings suggest that South Swedish has two-peak accents utterance medially, whereas previous typologies have assumed only one-peak accents for South Swedish dialects. The South Swedish two-peak accents are similar to accents described from East Norwegian and West Swedish, and since these dialects are characterized by final rises in addition to their two-peak accents, better knowledge of final rises in South Swedish can be expected to contribute to the understanding of the South Swedish two-peakedness. Nine participants from three locations in South Sweden (Laholm, Hässloholm, Sjöbo) are recorded reading 1080 sentences. The f0 in the utterance final syllables are analyzed using Prosogram. The results indicate that the number of final rises increases in the more northerly locations, supporting a successive transition from one- to two-peaked dialects rather than a binary distinction as predicted by previous work."
   ],
   "doi": "10.21437/TAI.2021-54"
  },
  "fischer21_tai": {
   "authors": [
    [
     "Kerstin",
     "Fischer"
    ],
    [
     "Oliver",
     "Niebuhr"
    ],
    [
     "Maria",
     "Alm"
    ],
    [
     "Åsa",
     "Abelin"
    ],
    [
     "Egil",
     "Albertsen"
    ],
    [
     "Ali",
     "Asadi"
    ]
   ],
   "title": "Towards a Prosodic Visualization Tool for Language Learners",
   "original": "129",
   "page_count": 4,
   "order": 55,
   "p1": 269,
   "pn": 272,
   "abstract": [
    "In this paper, we present an online tool for the visualization of prosodic information developed in a Nordplus project to enable speakers of the Scandinavian languages to understand their neighboring languages better. The free online tool visualizes intonation contours in different degrees of stylization and presents stress marks for syllables that are emphasized; furthermore, it provides different download and playback options. We describe the steps we have taken to ensure that the tool is useful for language teachers; specifically, we report on a qualitative user study in which 14 teachers have tested the tool and its functionalities. We can conclude that the visualization tool is likely to facilitate the creation of new teaching material for teachers and possibly also for language learners."
   ],
   "doi": "10.21437/TAI.2021-55"
  },
  "nagao21_tai": {
   "authors": [
    [
     "Jun",
     "Nagao"
    ],
    [
     "Marta",
     "Ortega-Llebaria"
    ]
   ],
   "title": "The interaction of micro- and macro-rhythm measures in English and Japanese as first and second languages",
   "original": "131",
   "page_count": 5,
   "order": 56,
   "p1": 273,
   "pn": 277,
   "abstract": [
    "﻿L2 rhythm has often been measured as the duration variation of vowel and consonant intervals using Varco and PVI measures (micro-rhythm). In the present study, in addition to micro-rhythm, we examined macro-rhythm (i.e., the duration variation of intervals between F0 events), and vowel duration in relation to three phonological patterns (i.e., content vs. function words, stressed and unstressed vowels, and final sentence lengthening) in a series of attempts by two Japanese students of English to imitate approximately 2-minute segments of English TED talks. In general, both participants obtained native-like Varco and nPVI scores for vowels and consonants in their last imitation attempt. In contrast, only one of the participants related the variation of vowel duration to stress. The same participant obtained macro-rhythm scores closer to those of the English TED talk. A debriefing interview indicated that neither participant showed conscious awareness of their changes in macro-rhythm. These results suggest that Japanese speakers may need to learn stress and micro-rhythm patterns before implementing macro-rhythm, and that the often-used micro-rhythm measures of rhythm need to be complemented with both macro-rhythm measures and phonological patterns’ measures in order to capture L2 rhythmic patterns more accurately. Pedagogically, imitation seems to work for some learners to learn macro-rhythm patterns.\n"
   ],
   "doi": "10.21437/TAI.2021-56"
  },
  "alm21_tai": {
   "authors": [
    [
     "Maria",
     "Alm"
    ],
    [
     "Jardar Eggesbø",
     "Abrahamsen"
    ],
    [
     "Åsa",
     "Abelin"
    ],
    [
     "Egil",
     "Albertsen"
    ],
    [
     "Jacques",
     "Koreman"
    ]
   ],
   "title": "Parameters of tonal variation in and between three Scandinavian languages",
   "original": "132",
   "page_count": 5,
   "order": 57,
   "p1": 278,
   "pn": 282,
   "abstract": [
    "The three Scandinavian languages Danish, Norwegian and Swedish are closely related languages, but they all have their own distinct “speech melody”. Also language-internally, there are characteristic regional speech melodies. In this paper, we take the literature as a point of departure for discussing and demonstrating what inventory of prosodic parameters must be considered to account for the tonal characteristics of these three languages and their varieties. A direct comparison is made difficult by different linguistic traditions. We thus discuss what units could be equivalent and suggest terms and definitions for a crosslinguistic comparison.\n"
   ],
   "doi": "10.21437/TAI.2021-57"
  },
  "alm21b_tai": {
   "authors": [
    [
     "Maria",
     "Alm"
    ]
   ],
   "title": "The “Frog Melody”: A variation of the Scania Swedish tone accent 2 melody to encourage children",
   "original": "133",
   "page_count": 5,
   "order": 58,
   "p1": 283,
   "pn": 287,
   "abstract": [
    "Swedish is known for having two lexically diverse tone accents, called accent 1 and accent 2 in modern literature. The choice between the two accents is determined by the language system, and the distribution rules for the accents vary between varieties [1]. The most important function of the tone accents is their use as pitch accents in prominence signalling in utterances [1], [2]. The accent melodies associated with the two accents also differ between varieties [1]. In this paper, a first tonal and functional outline of a variation of a Scania Swedish tone accent 2 melody is presented, with the working name “frog melody”. Interestingly, this variation seems to be associated with attitudinal meanings in addition to prominence signalling. The “frog melody” changes the association between accent melody tones and syllables, while remaining a clear case of the (South-eastern) Scania Swedish accent 2 type.\n"
   ],
   "doi": "10.21437/TAI.2021-58"
  },
  "niehof21_tai": {
   "authors": [
    [
     "Jana",
     "Niehof"
    ],
    [
     "Oliver",
     "Niebuhr"
    ]
   ],
   "title": "What’s pitch got to do with it?  – The connection between speech prosody and investor-pitch success",
   "original": "134",
   "page_count": 5,
   "order": 59,
   "p1": 288,
   "pn": 292,
   "abstract": [
    "German investor-pitch presentations were acoustically ana-lyzed based on five tonal and five non-tonal prosodic features. Results show that both feature sets significantly predicted the placements of these presentations in the ‘Rheinland Pitch’ com-petition series. We conclude in line with previous studies on speaker charisma that prosody plays a considerable role for the success of presentations and their speakers.\n"
   ],
   "doi": "10.21437/TAI.2021-59"
  }
 },
 "sessions": [
  {
   "title": "Full papers submitted after the conference",
   "papers": [
    "niebuhr21_tai",
    "wright21_tai",
    "sostarics21_tai",
    "sandberg21_tai",
    "zarka21_tai",
    "teras21_tai",
    "mcpherson21_tai",
    "erickson21_tai",
    "sahkai21_tai",
    "mixdorff21_tai",
    "horo21_tai",
    "gao21_tai",
    "torres21_tai",
    "yang21_tai",
    "juhasz21_tai",
    "le21_tai",
    "cotosolano21_tai",
    "bottcher21_tai",
    "myers21_tai",
    "huang21_tai",
    "prechtel21_tai",
    "kelterer21_tai",
    "feindt21_tai",
    "schubo21_tai",
    "cole21_tai",
    "bottcher21b_tai",
    "kaland21_tai",
    "berger21_tai",
    "jabeen21_tai",
    "herubin21_tai",
    "chen21_tai",
    "lundmark21_tai",
    "lialiou21_tai",
    "spina21_tai",
    "chen21b_tai",
    "lee21_tai",
    "niu21_tai",
    "zhou21_tai",
    "hellmuth21_tai",
    "alzamil21_tai",
    "katsuda21_tai",
    "zhou21b_tai",
    "gregori21_tai",
    "vallsrates21_tai",
    "langer21_tai",
    "abbas21_tai",
    "li21_tai",
    "einfeldt21_tai",
    "hofenbitzer21_tai",
    "barrault21_tai",
    "mady21_tai",
    "krepsz21_tai",
    "brugos21_tai",
    "myrberg21_tai",
    "fischer21_tai",
    "nagao21_tai",
    "alm21_tai",
    "alm21b_tai",
    "niehof21_tai"
   ]
  }
 ],
 "doi": "10.21437/TAI.2021"
}