{
 "series": "TAI",
 "title": "The Third International Conference on Tone and Intonation",
 "location": "Herrsching, Germany",
 "startDate": "16/5/2025",
 "endDate": "18/5/2025",
 "URL": "https://tai2025.org",
 "chair": "Chairs: James Kirby, Francesco Burroni, Enkeleida Kapia, Felicitas Kleber, Sireemas Maspong",
 "intro": "booklet.pdf",
 "conf": "TAI",
 "name": "tai_2025",
 "year": "2025",
 "SIG": "SProSIG",
 "title1": "The Third International Conference on Tone and Intonation",
 "booklet": "booklet.pdf",
 "date": "16-18 May 2025",
 "month": 5,
 "day": 16,
 "now": 1761153978138139,
 "papers": {
  "culhane25_tai": {
   "authors": [
    [
     "Kirsten",
     "Culhane"
    ],
    [
     "Constantijn",
     "Kaland"
    ]
   ],
   "title": "Acoustic correlates of stress in Kupang Malay: a preliminary analysis",
   "original": "6",
   "order": 1,
   "page_count": 5,
   "abstract": [
    "This paper presents a preliminary investigation of the acoustic correlates of word stress in Kupang Malay, one of several Malay varieties spoken in eastern Indonesia. It is impressionistically described as having word stress falling on either the penultimate or ultimate syllable of the word, and minimal pairs are reported. This study investigates measures of spectral tilt, duration and vowel quality, using data from spontaneous speech. It finds that syllables described as stressed are longer, have shallower spectral tilt values, and have vowels which are more peripheral in the vowel space. These findings provide evidence for the production of word stress in Kupang Malay."
   ],
   "p1": 1,
   "pn": 5,
   "doi": "10.21437/TAI.2025-1",
   "url": "tai_2025/culhane25_tai.html"
  },
  "lee25_tai": {
   "authors": [
    [
     "Albert",
     "Lee"
    ],
    [
     "Penghao",
     "Cai"
    ],
    [
     "Zhiqiang",
     "Zhu"
    ],
    [
     "Peggy",
     "Mok"
    ]
   ],
   "title": "Tonal effects on articulation in Mandarin: An ultrasound study",
   "original": "9",
   "order": 2,
   "page_count": 4,
   "abstract": [
    "The interaction between fundamental frequency (F0) and vowel articulation has been extensively studied, with physiological accounts predicting that lower F0 is associated with greater vowel aperture. However, an earlier articulatory study on Mandarin has reported findings that challenge this prediction, particularly for the high vowel /i/ condition. To verify these reported anomalies and assess individual variability among speakers, we conducted an ultrasound tongue imaging study with a larger sample size (23 native Mandarin speakers), and analyzed the effects of lexical tone, vowel, speech rate, and coda type on tongue shape. Our results reveal substantial inter-speaker variability in how tone affects vowel articulation, with only a minority (2 out of 23) replicating previously reported anomalous patterns. These findings underscore the complexity of tone-vowel interaction in Mandarin and highlight the need for larger samples and cross-linguistic comparison."
   ],
   "p1": 6,
   "pn": 9,
   "doi": "10.21437/TAI.2025-2",
   "url": "tai_2025/lee25_tai.html"
  },
  "lorenzen25_tai": {
   "authors": [
    [
     "Janne",
     "Lorenzen"
    ],
    [
     "Stefan",
     "Baumann"
    ]
   ],
   "title": "Form- and meaning-related factors in the production and perception of prominence",
   "original": "10",
   "order": 3,
   "page_count": 5,
   "abstract": [
    "We present data from a production and a perception study investigating the interplay of form- and meaning-related aspects of prominence in German. On the meaning side, we concentrate on the lexical and referential information status (IS) of nominal target words. On the formal side, which comprises morphosyntactic and phonological structure as well as acoustic properties of speech, we focus on grammatical role, position in the sentence, accent status, accent type, and measures related to F0 scaling and alignment, duration, and intensity. We find evidence that lexical newness and the initial position boost prosodic prominence of a word in production. In perception, listeners are mainly guided by accent status, word duration, and accent type. We conclude that meaning determines nuclear accent position, which in turn is decisive for prominence perception. Additionally, a word in initial sentence position is a powerful attractor of prosodic strength in both production and perception."
   ],
   "p1": 10,
   "pn": 14,
   "doi": "10.21437/TAI.2025-3",
   "url": "tai_2025/lorenzen25_tai.html"
  },
  "repp25_tai": {
   "authors": [
    [
     "Sophie",
     "Repp"
    ],
    [
     "Heiko",
     "Seeliger"
    ]
   ],
   "title": "Modal particle meets prosody: Speech act modification in declarative questions",
   "original": "17",
   "order": 4,
   "page_count": 5,
   "abstract": [
    "We present data from a production study in German that explores prosodic effects of subtle pragmatic meaning differences in the domain of speech acts. We study effects of the modal particle wohl in assertions and declarative questions (DQ), where wohl signals that the information conveyed (assertion) or proposed (DQ) is based on an inference that the speaker made on the basis of indirect evidence. We show that the presence of wohl in DQ has prosodic effects on the final boundary tone, and in the nuclear and post-nuclear regions. We argue that these effects signal reduced interrogativity: the speaker is less open towards the answer, signaling a bias for the truth of their own inference."
   ],
   "p1": 15,
   "pn": 19,
   "doi": "10.21437/TAI.2025-4",
   "url": "tai_2025/repp25_tai.html"
  },
  "mixdorff25_tai": {
   "authors": [
    [
     "Hansjörg",
     "Mixdorff"
    ]
   ],
   "title": "Analysis of F0 Contour Alignment in Expressions of Attitude",
   "original": "18",
   "order": 5,
   "page_count": 5,
   "abstract": [
    "Following the framework established by Rilliard et al. we collected audio-visual corpora of short attitudinal expressions in German, Cantonese and Hindi, recognizing attitudes as fundamental components of speech communication. Attitudes exhibit emotional components but can be seen much more as communicative strategies than simple displays of affect. A crucial feature of the speech signal is the fundamental frequency contour F0, which we modulate during speech.  So far no studies exist examining whether there are consistent melodic contours or “tunes” associated with attitudes. Hence we aim to investigate whether specific tonal patterns appear in certain attitudes. Since attitudes are paralinguistic phenomena, they interact with underlying linguistic elements depending on the particular language such as stressed syllables and phrase boundaries. For the current study, we concentrate on the German and Hindi equivalents of &quot;a banana&quot; from our corpus. Isačenko and Schädlich/Stock and Zacharias characterized F0 contours in German as series of communicatively motivated tone switches, major transitions in the F0 contour aligned with accented syllables. These can be seen as phonetic realizations of phonologically distinct intonational elements, referred to as &quot;intonemes.&quot; Stock defined three classes of intonemes that primarily differentiate sentence modality. Building upon this conceptual framework, Author1 developed a model of German prosody that links prosodic features such as F0, duration, and intensity to the syllable as the fundamental unit of speech rhythm. To quantify the interval and timing of the tone switches relative to the syllabic grid, this framework adopts the Fujisaki model which generates a given F0 contour by combining three main components: a speaker-specific base frequency Fb, a phrase component, and an accent component. Our results show that attitudes differ systematically with regard to intoneme types assigned as well as tone switch intervals."
   ],
   "p1": 20,
   "pn": 24,
   "doi": "10.21437/TAI.2025-5",
   "url": "tai_2025/mixdorff25_tai.html"
  },
  "pitcher25_tai": {
   "authors": [
    [
     "Sophia",
     "Pitcher"
    ]
   ],
   "title": "A Tenth Century ToBI Transcription of Tiberian Hebrew",
   "original": "25",
   "order": 6,
   "page_count": 5,
   "abstract": [
    "A thousand years before modern researchers developed a system for transcribing the prosodic features of speech, scribal scholars in Tiberias known as Masoretes devised a set of notations to preserve their oral reading tradition of the Hebrew Bible. The Masoretic prosodic orthography functions like a ToBI transcription, iconically indicating contrastive relative pitch and four levels of breaks in the flow of speech: clitics, prosodic words, minor prosodic phrases, and major prosodic phrases [see 12]. The Tiberian Hebrew corpus contributes to the expanding “database for prosodic typology” [7, p. vii], providing access to prosodic data in an extraordinary range of orally performed literature, including narrative, poetry, procedural and hortatory discourse. Examples of the orthography’s representation of Tiberian Hebrew intonation and prosodic phrase structure are presented, as are findings regarding the system’s interface with phonetic lengthening, and the syntax, semantics, and discourse-pragmatics of Tiberian Hebrew."
   ],
   "p1": 25,
   "pn": 29,
   "doi": "10.21437/TAI.2025-6",
   "url": "tai_2025/pitcher25_tai.html"
  },
  "heim25_tai": {
   "authors": [
    [
     "Johannes",
     "Heim"
    ],
    [
     "Judith",
     "Schlenter"
    ],
    [
     "Sophie",
     "Repp"
    ]
   ],
   "title": "Prosodic variation in negative and positive polarity questions in English",
   "original": "42",
   "order": 7,
   "page_count": 5,
   "abstract": [
    "We report findings from a US Soap corpus analysis and a web-based perception task on prosodic variation in positive and negative polarity questions to explore the encoding of question bias. We extracted 160 contours from four actors to annotate nuclear contours and pitch accents on the auxiliary, which both have been identified as potential bias markers. Our analysis suggests that question types differ less by nuclear contours than by frequent use of auxiliary accents in negative questions. We find a wider accent repertoire for the auxiliary than what was previously observed, including a ‘step accent’ (notation: L*|H) for positive questions and a fast rise ((L+H)*) for negative questions, in addition to the familiar high (H*) and rising (L+H*, L*+H) accents. However, results from a perception study using the same stimuli suggest that nuclear contour is the strongest indicator of bias in negative questions, while auxiliary accentuation plays a bigger role in positive questions."
   ],
   "p1": 30,
   "pn": 34,
   "doi": "10.21437/TAI.2025-7",
   "url": "tai_2025/heim25_tai.html"
  },
  "seeliger25_tai": {
   "authors": [
    [
     "Heiko",
     "Seeliger"
    ],
    [
     "Constantijn",
     "Kaland"
    ]
   ],
   "title": "Perception compared to clustered intonation variation in German wh-questions",
   "original": "45",
   "order": 8,
   "page_count": 5,
   "abstract": [
    "This article presents the results of a perception study using hummed F0 contours as stimuli. The original contours were produced in a production study investigating German wh-questions and wh-exclamatives, and had previously been classified using cluster analysis. A previous perception study on the same dataset had found that the output of the cluster analysis was predictive of perceived contour similarity, but that contour duration and F0 register (both of which were normalized for the original cluster analysis) also had a large influence.\nIn this study, we normalized the stimuli in terms of duration and F0 register. Original cluster membership was not predictive of perceived similarity, suggesting that the original clusters did not form `pure&#x27; perceptual classes when correcting for duration and register. However, cluster analysis applied directly to the subset of stimuli did result in a clustering that was predictive of perceived similarity. We also investigated correlations between acoustic differences and perceived similarity for the four quarters of each contour pair. Results show that only later acoustic differences have an impact on perception."
   ],
   "p1": 35,
   "pn": 39,
   "doi": "10.21437/TAI.2025-8",
   "url": "tai_2025/seeliger25_tai.html"
  },
  "le25_tai": {
   "authors": [
    [
     "Trang",
     "Le"
    ],
    [
     "Mariko",
     "Kondo"
    ],
    [
     "Yixuan",
     "Huang"
    ]
   ],
   "title": "The role of pitch contours in Vietnamese learners' perception of Japanese vowel lengths",
   "original": "52",
   "order": 9,
   "page_count": 5,
   "abstract": [
    "This study examined how Vietnamese learners perceive Japanese vowel length contrasts under different pitch contour conditions. Eighty Vietnamese learners (21 pre-intermediate, 42 upper-intermediate, and 17 advanced) and thirteen native Japanese speakers completed an identification task. The stimuli consisted of 20 minimal pairs, with pitch contours of long vowels varied according to within-word position. Results showed that perceptual accuracy followed the order: Initial.H-HL ≈ Final.H-HH &gt; Initial.L-LH &gt; Final.L-LL. Dynamic pitch movement (HL, LH) and high pitch (HH) facilitated long vowel identification, whereas flat low contours (LL) hindered accuracy. Long vowels were often misheard as short in Final.L–LL, and short vowels were misheard as long in Initial.L–LH. No significant proficiency effects emerged. Vietnamese listeners reached native-like performance in the favorable contexts (Initial.H-HL, Final.H-HH) but performed significantly worse than natives in the challenging ones (Initial.L-LH, Final.L-LL). This suggests that Vietnamese listeners’ perception of Japanese vowel length is not uniform but shaped by pitch context."
   ],
   "p1": 40,
   "pn": 44,
   "doi": "10.21437/TAI.2025-9",
   "url": "tai_2025/le25_tai.html"
  },
  "shigemori25_tai": {
   "authors": [
    [
     "Lia Saki Bucar",
     "Shigemori"
    ],
    [
     "Yuki",
     "Asano"
    ]
   ],
   "title": "Tonal sound change in Kagoshima Japanese: Production of monosyllabic words",
   "original": "53",
   "order": 10,
   "page_count": 5,
   "abstract": [
    "The aim of this study is to determine how lexical pitch patterns produced by different speaker groups in two varieties of Japanese, Kagoshima Japanese (KJ) and Tokyo Japanese (TJ), are realised acoustically, with a focus on how the increasing influence of TJ affects the pitch patterns of younger KJ speakers. KJ and TJ are both lexical pitch accent languages, but there is no general way to predict the accent pattern in one variety based on the other. A tonal sound change has been reported in which innovative speakers of KJ switch lexical pitch accent categories, when KJ and TJ differ in the presence (or absence) of a lexical pitch accent. The primary difference between the lexical pitch accent categories is the presence or absence of a f0 fall, therefore a discrete cosine transformation was carried out on the f0 contours and the coefficient reflecting the slope was extracted. Statistical analysis using linear mixed effect models confirmed that in their productions younger speakers neutralize the contrast as described in previous literature. However, our results suggest that TJ has an even greater effect than previously described."
   ],
   "p1": 45,
   "pn": 49,
   "doi": "10.21437/TAI.2025-10",
   "url": "tai_2025/shigemori25_tai.html"
  },
  "kaland25_tai": {
   "authors": [
    [
     "Constantijn",
     "Kaland"
    ],
    [
     "Valentina",
     "Schiattarella"
    ]
   ],
   "title": "Word-level acoustic prominence in Siwi Berber: a paradigmatic and syntagmatic study",
   "original": "56",
   "order": 11,
   "page_count": 5,
   "abstract": [
    "Siwi is a Berber language spoken in the Siwa and El Gara oases (Egypt). In several works, Siwi is claimed to have word stress, although no systematic acoustic analysis has been carried out so far. Particularly challenging to such an analysis is the report of several terminologically divergent stress claims. In general, little is known about Siwi prosody. The current study therefore reports a bottom-up exploratory approach to acoustic prominence at the word level based on spontaneous Siwi speech. This is done by a paradigmatic and a syntagmatic analysis to test the extent to which generalizable word prominence patterns exist in the language. The analyses were done by taking into account several acoustic measures (f0, duration, intensity) for different word classes (adverbs, nouns, prepositions). Nouns were furthermore analysed for whether their prominence patterns signal definiteness. Results provide a first indication that word length affects the prominence pattern in Siwi."
   ],
   "p1": 50,
   "pn": 54,
   "doi": "10.21437/TAI.2025-11",
   "url": "tai_2025/kaland25_tai.html"
  },
  "volin25_tai": {
   "authors": [
    [
     "Jan",
     "Volín"
    ],
    [
     "Adléta",
     "Hanžlová"
    ],
    [
     "Michaela",
     "Svatošová"
    ]
   ],
   "title": "Melodic prominence of verbs in Czech spoken narratives",
   "original": "62",
   "order": 12,
   "page_count": 5,
   "abstract": [
    "In spoken narratives, full verbs were recently found on occasion deaccented despite their central syntactic role. Deaccenting appeared to be linked with the information status of the verbs. In the current study, we ask how often the accented ones are more/less prominent in their f0 values relative to their prosodic neighbors. Narratives spoken by 16 speakers provided 473 cases of phrase-internal verbs (position typical of Czech). We used several f0 metrics and analyzed them considering the phonological status of the accents and the verb roles in the in-formation structure. The results suggest that Czech verbs do not typically dominate. In the case of strings of H* accents, up to 90"
   ],
   "p1": 55,
   "pn": 59,
   "doi": "10.21437/TAI.2025-12",
   "url": "tai_2025/volin25_tai.html"
  },
  "spina25_tai": {
   "authors": [
    [
     "Nadja",
     "Spina"
    ],
    [
     "Alfred",
     "Lameli"
    ]
   ],
   "title": "Slow or Long? Generational Variation of Pre-boundary Lengthening in Different Dialect Areas of German",
   "original": "64",
   "order": 13,
   "page_count": 5,
   "abstract": [
    "Pre-boundary lengthening (PBL), the increase in duration of segments immediately before prosodic boundaries, is well researched for variation between languages but studies on variation within languages are scarce. The present paper reports on a corpus analysis that investigated variation in PBL between different dialect regions of German and between different generations of speakers in these regions. Results suggest regional variation in PBL in terms of a north-south contrast. Low German speakers in the north produce stronger PBL than High German speakers in the south, in particular with older generations. Results are discussed in light of articulation rate."
   ],
   "p1": 60,
   "pn": 64,
   "doi": "10.21437/TAI.2025-13",
   "url": "tai_2025/spina25_tai.html"
  },
  "zsiga25_tai": {
   "authors": [
    [
     "Elizabeth",
     "Zsiga"
    ],
    [
     "Draga",
     "Zec"
    ]
   ],
   "title": "Culminativity and the Neutralization of Vowel Length in Four Neo-Štokavian Dialects",
   "original": "65",
   "order": 14,
   "page_count": 5,
   "abstract": [
    "Neo-Štokavian words have one of four prosodic shapes, traditionally described as Long Falling, Short Falling, Long Rising, and Short Rising. We analyze these four accents as resulting from the interaction of tone, stress, and vowel length. For the Falling accents, H tone and stress coincide on the initial syllable. For the Rising accents, H tone and stress do not coincide. The tonic syllable may be long or short. In this paper we present new data on the distribution of vowel length. We present results of an acoustic study, with eight speakers from each of four dialect areas: Novi Sad, Belgrade, Valjevo and Čačak. For words with Falling accent, H is consistently realized on the tonic syllable, and the vowel length distinction is maintained. For words with Rising accent, the location of the pitch peak may retract to the tonic syllable, with the pattern of retraction depending on dialect and phrasal position. We demonstrate that vowel length is lost when not coupled with either stress or high tone, an unusual interaction of different types of prominence. Importantly, the interaction is with lexical length and lexical tone: retraction does not result in neutralization."
   ],
   "p1": 65,
   "pn": 69,
   "doi": "10.21437/TAI.2025-14",
   "url": "tai_2025/zsiga25_tai.html"
  },
  "lo25_tai": {
   "authors": [
    [
     "Roger Yu-Hsiang",
     "Lo"
    ],
    [
     "Molly",
     "Babel"
    ]
   ],
   "title": "How merged are Cantonese tones in spontaneous speech?",
   "original": "67",
   "order": 15,
   "page_count": 5,
   "abstract": [
    "The tone inventory of Cantonese is traditionally described as having 6 contrastive tones, but scholars have identified several tone mergers-in-progress. These observations come from scripted speech and therefore may not reflect the degree of merger in conversation. This project uses speech from the 34 Cantonese interviews in the SpiCE corpus. We apply methods to capture f0 trajectories, consider duration, and our analytic methods consider population and individual level patterns, offering insight on sound change. Results indicate that at the population level, there is little evidence for differences between tones T2/T5 and T3/T4/T6 in f0, suggesting merger. However, predicted contours at the individual level reveal talkers exhibit different (non-)merger patterns. Population and individual-level patterns for duration suggest a difference between T2-T5 and T3-T6, but not T4-T6. Altogether, these results suggest that neutralization between reported merging tone pairs may be incomplete."
   ],
   "p1": 70,
   "pn": 74,
   "doi": "10.21437/TAI.2025-15",
   "url": "tai_2025/lo25_tai.html"
  },
  "sim25_tai": {
   "authors": [
    [
     "Jasper",
     "Sim"
    ],
    [
     "Julia",
     "Schwarz"
    ],
    [
     "Katrina Kechun",
     "Li"
    ],
    [
     "Adam",
     "Chong"
    ]
   ],
   "title": "Ethnic variation in perceptual sensitivity to stress-based f0 in Singapore English",
   "original": "71",
   "order": 16,
   "page_count": 4,
   "abstract": [
    "Lexical word stress, where one syllable in a word is specified as prosodically prominent or distinctive, is typically cued by multiple prosodic correlates. Whereas in mainstream English varieties stressed syllables may be marked by a pitch accent, in Singapore English (SgE), f0 typically peaks on the final syllable of content words, regardless of underlying stress, with f0 alignment distinguishing stressed syllables instead. Previous work has further shown that SgE speakers do not consistently produce this contrast. This raises the question of whether SgE listeners are perceptually sensitive to stress-based f0 differences. In this exploratory study, we tested 16 early bilingual native Singaporeans on typicality judgements using resynthesised stimuli with swapped f0 contours (e.g., carTOON ↔ CARpet). When stimuli were presented individually, both f0-matched and f0-mismatched stimuli were judged equally ‘Singaporean’, suggesting limited sensitivity. In a paired comparison task that directly contrasted f0-matched and f0-mismatched stimuli, only Mandarin-speaking listeners showed higher preference for f0-matching stimuli, but only for stress-initial words. These findings suggest that f0 is a weak perceptual correlate of stress for many speakers of SgE, with sensitivity shaped by prosodic position and language background—potentially enhanced by tone language experience but attenuated in speakers of languages without lexical stress."
   ],
   "p1": 75,
   "pn": 78,
   "doi": "10.21437/TAI.2025-16",
   "url": "tai_2025/sim25_tai.html"
  },
  "pharao25_tai": {
   "authors": [
    [
     "Nicolai",
     "Pharao"
    ],
    [
     "Rasmus",
     "Puggaard-Rode"
    ]
   ],
   "title": "A pitch accent for contrastive emphasis in Danish?",
   "original": "76",
   "order": 17,
   "page_count": 5,
   "abstract": [
    "This paper presents an exploratory study of a previously unde\nscribed tonal contour in Danish questions. We analyze pitch\ntrajectory data collected for a different purpose using functional\nprincipal component analysis and hierarchical clustering, which\nconverge to show that two distinct pitch patterns are used for\ncueing pragmatic focus in utterance medial position: the ‘ex\npected’ tonal contour that is generally used to signal stress in\nDanish regardless of the presence of focus (low–high), and an\nentirely differently shaped contour (high–low), which we inter\npret as cueing ‘extra’ contrastive emphasis. We are (somewhat\ncontroversially) proposing that the pattern may constitute a new\npitch accent for contrastive emphasis in Danish, although we\nalso call for more targeted research into the intonation of con\ntrastive emphasis in contemporary standard Danish."
   ],
   "p1": 79,
   "pn": 83,
   "doi": "10.21437/TAI.2025-17",
   "url": "tai_2025/pharao25_tai.html"
  },
  "wang25_tai": {
   "authors": [
    [
     "Yutong",
     "Wang"
    ],
    [
     "Mitko",
     "Sabev"
    ],
    [
     "Brechtje",
     "Post"
    ]
   ],
   "title": "The combined effect of focus and Beijing retroflex suffixation on tone",
   "original": "82",
   "order": 18,
   "page_count": 5,
   "abstract": [
    "This study examines how Beijing retroflex suffixation (BRS) interacts with focus prominence and lexical tone in Beijing Mandarin (BM), with particular attention to derived neutral tones (NTs). While prior work examined the spectral variations of BRS rimes, less is known about how F0 contours and syllable durations are realised under varying focus or with NTs. An acoustic experiment recorded six BM speakers producing both unsuffixed and suffixed forms under four focus conditions, and NT reduplications. The data were analysed using Generalised Additive Mixed Models and linear mixed-effects models. The results show that BRS does not consistently lower F0 or increase duration, pointing to a rime coalescence pattern. Post-focal compression and pre-focal reduction vary by tone. Suffixed NTs exhibit tone-specific F0 realisations and consistent lengthening, suggesting lighter metrical weight. Overall, the findings highlight the flexibility of BM’s prosodic system in encoding multiple pragmatic functions."
   ],
   "p1": 84,
   "pn": 88,
   "doi": "10.21437/TAI.2025-18",
   "url": "tai_2025/wang25_tai.html"
  },
  "adams25_tai": {
   "authors": [
    [
     "Jamie",
     "Adams"
    ]
   ],
   "title": "The Effect of Orthography on the Representation of Mandarin Tone in L1 English Listeners",
   "original": "84",
   "order": 19,
   "page_count": 5,
   "abstract": [
    "Research shows that orthography influences various aspects of second language (L2) learning, but its role in tone acquisition is not well understood. We tested L1 English listeners with no Mandarin experience assigned to one of three orthographic groups: pinyin, modpin (pinyin with right-aligned tone marks) and zhuyin. Replicating earlier work, zhuyin learners required the highest number of exposure cycles to reach 90"
   ],
   "p1": 89,
   "pn": 93,
   "doi": "10.21437/TAI.2025-19",
   "url": "tai_2025/adams25_tai.html"
  },
  "marchini25_tai": {
   "authors": [
    [
     "Gilly",
     "Marchini"
    ],
    [
     "Jeremy",
     "Steffman"
    ],
    [
     "Constantijn",
     "Kaland"
    ]
   ],
   "title": "Clustering methods in the analysis of intonation: the case of focus marking in Afro-Mexican Spanish",
   "original": "88",
   "order": 20,
   "page_count": 5,
   "abstract": [
    "In intonational research, clustering has recently been developed as a tool for analysis of F0 contours. It can facilitate data exploration without imposing top-down categorisation, and is thus particularly suited for assessment of patterns in un(der)-documented language varieties, or for patterns and categories which defy easy classification. Given the myriad of clustering techniques and related clustering parameters available, it is important to assess the impact of analyst choices. We compare how two clustering algorithms (k-means (KM) &amp; hierarchical agglomerative clusters (HC)) capture narrow vs. broad focus distinctions in Afro-Mexican Spanish, a marginalised variety whose prosody is yet to be documented. We ask: \n(RQ1) How evenly distributed are trajectories across clusters for each method?\n(RQ2) To what extent do algorithms agree on the optimal number of clusters?\n(RQ3) How do emergent distinctions map to focus condition (broad versus narrow)?\n",
    "Data analysed comes from controlled experiments conducted during fieldwork. 11 participants of Afro-Mexican Spanish participated, with 1,467 contours analysed. F0 was sampled at 20 time-normalised interval within each syllable, and z-scored within speaker. For both KM &amp; HC, we assess 2-6 clusters. \n",
    "Results highlight that whilst both methods capture narrow focus in the variety, they differ in their inclusion of extreme trajectories, with greater informed data cleaning required for HC and not KM. With extreme trajectories removed, both algorithms point to 4 clusters as optimal. \nDifferences are also noted in the distribution of tokens across clusters, with contours more evenly distributed for KM than for HC. Lastly, algorithms differ in their categorisation of broad focus, both highlighting the existence of different intermediary categories in this condition. We consider therefore these differences and their impact on the future documentation of this variety&#x27;s prosody."
   ],
   "p1": 94,
   "pn": 98,
   "doi": "10.21437/TAI.2025-20",
   "url": "tai_2025/marchini25_tai.html"
  },
  "li25_tai": {
   "authors": [
    [
     "Tong",
     "Li"
    ],
    [
     "Yao",
     "Yao"
    ]
   ],
   "title": "Production Evidence for the Perceptual Asymmetry of Mandarin Question and Statement Intonations",
   "original": "92",
   "order": 21,
   "page_count": 5,
   "abstract": [
    "The lack of invariant mapping between prosodic cues and category of intended meaning frequently occurs in prosody perception. In Mandarin, previous studies have shown that identifying questions is more difficult when the final tone is rising (T2) than when it is falling (T4). This study investigates the production mechanisms underlying this perceptual asymmetry. Question and statement intonations ending in T2 and T4 were elicited from eight female native speakers of Mandarin. We analyzed joint F0-duration covariation patterns of the whole utterance and prosodic cue distributions of the final syllable. The results revealed substantial tone-dependent differences in the use of F0 range and duration for question-statement distinction, particularly at the sentence end. Most speakers distinguished questions and statements ending in T2 by mean F0 and F0 range, whereas questions and statements ending in T4 were clearly distinguished by mean F0 and duration. This study also highlights the role of speaker-specific encoding strategies and prosodic cue variability in shaping prosodic perception."
   ],
   "p1": 99,
   "pn": 103,
   "doi": "10.21437/TAI.2025-21",
   "url": "tai_2025/li25_tai.html"
  },
  "souza25_tai": {
   "authors": [
    [
     "Ricardo Napoleao de",
     "Souza"
    ]
   ],
   "title": "A typological assessment of tonal languages in contact",
   "original": "95",
   "order": 22,
   "page_count": 5,
   "abstract": [
    "This study examines the behaviour of lexical tones in language contact scenarios from a typological perspective. While previous research suggests that lexical tones easily diffuse in contact situations, more detailed studies present a less consistent picture. Developments in the research on tonogenesis provide further evidence against contact-induced change. These issues are exacerbated by a generalised lack of understanding regarding the mechanisms behind contact-induced change in word prosody systems. \nDrawing from a large language sample specifically designed to assess contact situations on a global scale, this paper zooms in on 15 contact scenarios involving languages with lexical tone. For each language pair, the recipient language is also compared to its closest relative spoken outside the contact scenario, which serves as control for inheritance factors. Phonetic and phonological properties pertaining to tones are described using criteria from the phonological typology literature. \nVariables analysed encompass number of tones, shapes of contour tones, laryngeal setting, lexical vs. grammatical function for tones, presence of stress, and others. Similarities between languages are computed by assigning binary values to individual properties. Values are then summed across features and divided by the total number of possibilities, yielding an ‘Adaptation Score’ (0-1) for every scenario. Scores are then turned into a continuous probability distribution (i.e. Beta distribution) to assess uncertainty. \nThe results of the analyses reveal a low rate of change in word prosody systems: one third of the sample shows no change at all, with only three languages showing high probability of tone-induced change. These findings align with previous research suggesting that similarities between tone systems in a linguistic area may be superficial. These results cal for a reassessment of claims about the borrowability of ‘prosody’, especially as it refers to lexical tones."
   ],
   "p1": 104,
   "pn": 108,
   "doi": "10.21437/TAI.2025-22",
   "url": "tai_2025/souza25_tai.html"
  },
  "culhane25b_tai": {
   "authors": [
    [
     "Kirsten",
     "Culhane"
    ],
    [
     "Naomi",
     "Peck"
    ],
    [
     "Uta",
     "Reinöhl"
    ]
   ],
   "title": "No evidence for lexical stress in Kera’a, an endangered Trans-Himalayan language",
   "original": "103",
   "order": 23,
   "page_count": 5,
   "abstract": [
    "This paper examines whether or not we can find evidence for lexical stress in Kera&#x27;a (aka Idu (Mishmi)). Kera&#x27;a is an endangered Trans-Himalayan language primarily spoken in Arunachal Pradesh (India) by about 10 000 people. Some oft-found phonetic cues of stress - e.g. duration or intensity - feature as phonetic cues of the 5-way lexical tone system of Kera&#x27;a. There has been no study to date, however, of whether these or other cues also participate in a lexical stress system. We investigate in this paper the possibility that Kera’a has stress on either the first, penultimate or final syllable of the word. This is done by conducting acoustic analysis of duration, spectral tilt and vowel quality. We do not find, however, any consistent patterns which would support a stress analysis, leading us to the conclusion that stress is probably not a relevant feature of Kera’a phonology."
   ],
   "p1": 109,
   "pn": 113,
   "doi": "10.21437/TAI.2025-23",
   "url": "tai_2025/culhane25b_tai.html"
  },
  "li25b_tai": {
   "authors": [
    [
     "Katrina",
     "Li"
    ],
    [
     "Yiya",
     "Chen"
    ]
   ],
   "title": "Intonation-modulated tonal variations in Standard Mandarin",
   "original": "109",
   "order": 24,
   "page_count": 5,
   "abstract": [
    "Intonation plays a crucial role in shaping tonal realisation in tone languages, as both rely on f0 as the primary cue. In Standard Mandarin, previous descriptions have largely focused on how intonation alters average tonal contours, while the fine-grained variation patterns remain largely unexplored. This study examined how intonation introduces variations within tonal categories, influences the overall tonal space, and varies across individual speakers. Using functional principal component analysis (FPCA), the study analysed f0 contours of sentence-final T1, T2 and T4 in two datasets: laboratory speech with elicited question/statement contrast, and spontaneous conversational speech with naturalistic intonation variations. Results showed that the primary dimensions of variation (PCs) were structurally similar across tones, but tones drew on these dimensions to different degrees. When tone- and intonation-induced variations were simultaneously considered, both tone and intonation distinctions were statistically significant, with intonation exhibiting greater overlap and tone-specific realisations. Compared with laboratory data, spontaneous speech showed flatter contours, different stable regions, stronger reliance on register change, and more overlap in tonal realisations. Finally, T4 displayed greater speaker variability in signalling question/statement contrast than the other tones, suggesting diverse strategies for resolving the conflict between a falling lexical tone and rising intonation."
   ],
   "p1": 114,
   "pn": 118,
   "doi": "10.21437/TAI.2025-24",
   "url": "tai_2025/li25b_tai.html"
  },
  "stanhope25_tai": {
   "authors": [
    [
     "Rebekah",
     "Stanhope"
    ],
    [
     "Thomas",
     "Sostarics"
    ],
    [
     "Jennifer",
     "Cole"
    ]
   ],
   "title": "F0 correlates of perceived speaker surprise in American English: Accents vs. Edge Tones",
   "original": "113",
   "order": 25,
   "page_count": 5,
   "abstract": [
    "Previous work has proposed that the L+H* pitch accent is the\nprimary encoding of speaker surprise in English. However, studies in other Germanic languages have shown that perceived surprise may also be influenced by the scaling of L* and H* pitch accents, and by the scaling of the edge tones. This study tests whether Mainstream American English listeners’ perceptions of speaker surprise are sensitive to variation in L* and H* pitch accents, and whether perceived surprise is driven solely by the pitch accent or also influenced by the edge tones. We find that both the pitch accent and edge tones contribute to perceived speaker surprise in MAE. We explore an alternative analysis in terms of pitch span and pitch level, finding that while both phonetic parameters contribute to perceived surprise, neither fully account for the pattern of ratings in our data."
   ],
   "p1": 119,
   "pn": 123,
   "doi": "10.21437/TAI.2025-25",
   "url": "tai_2025/stanhope25_tai.html"
  },
  "passoni25_tai": {
   "authors": [
    [
     "Elisa",
     "Passoni"
    ],
    [
     "Sam",
     "Hellmuth"
    ],
    [
     "Joe",
     "Pearce"
    ]
   ],
   "title": "Exploring the foundations of intonational variation in (Multicultural) London English",
   "original": "114",
   "order": 26,
   "page_count": 5,
   "abstract": [
    "Recent work on London English has documented a highly systematic new phonological system in inner city areas, Multicultural London English (MLE), which is argued to have arisen out of intensive, multiethnic social contact. Segmental properties of MLE have been extensively researched, but, despite anecdotal reports of an ‘MLE intonation’, this possibility is yet to be systematically explored. This paper revisits generalisations made in the only available description of the inventory of nuclear contours in inner city London intonation, which was based on a subset of read speech data from IViE corpus London speakers. We apply landmark registered fPCA analysis of F0 in the original IViE data subset, by the original published prosodic contour labels, and by sentence type, with a focus on different types of questions (yes/no questions, wh-questions and declarative questions). We also explore for the first time patterns observed in questions extracted from unscripted data from the same London speakers, on the basis of auditory labelling of nuclear contours. The results show that the five contours listed reported for the London speakers and reflected in published IViE labels are not all differentiated in predicted curves from fPCA analysis, but instead only four distinct contours emerge.  Nevertheless, the distribution of broad contour types across sentence types visualised in the fPCA results mirror those reported as a result of auditory transcription. In our exploration of contours in unscripted speech, we find a similar pattern across sentence types also, but with more use of fall and rise-fall contours."
   ],
   "p1": 124,
   "pn": 128,
   "doi": "10.21437/TAI.2025-26",
   "url": "tai_2025/passoni25_tai.html"
  },
  "ta25_tai": {
   "authors": [
    [
     "Tan",
     "Ta"
    ]
   ],
   "title": "Arem: A Register Language without Tone",
   "original": "128",
   "order": 27,
   "page_count": 5,
   "abstract": [
    "Arem is a Vietic (Austroasiatic) language spoken in Quảng Bình province, north-central Vietnam. The language has been described as having a register contrast resulting from onset devoicing and a tone contrast resulting from the loss of the final glottal stop and deglottalization of glottalized sonorants. Some researchers claim that Arem does not have tone, but previous work did not provide any instrumental evidence for the existence or absence of tone in Arem. I conducted two production studies focused on (i) the Arem register and (ii) open syllables and syllables ending in glottal codas in Arem. The results show that the Arem register is signaled by vowel quality and phonation type differences but not f0. However, the glottal codas in Arem are still intact, and their duration, f0, and phonation effects on the preceding rhyme are too variable across speakers and registers to consider Arem as a tone language. The results of this study, therefore, contribute to a better understanding of register contrast in Arem, an extremely endangered language. These findings also shed light on hypotheses about registrogenesis in Southeast Asian languages, questioning previous assumptions and calling for modifications."
   ],
   "p1": 129,
   "pn": 133,
   "doi": "10.21437/TAI.2025-27",
   "url": "tai_2025/ta25_tai.html"
  },
  "ni25_tai": {
   "authors": [
    [
     "Tianyi",
     "Ni"
    ]
   ],
   "title": "Bidirectional Consonantal Effects on F0 Realization in Burmese",
   "original": "132",
   "order": 28,
   "page_count": 5,
   "abstract": [
    "This study investigates bidirectional effects of consonant voicing on vowel F0 in Burmese, with a focus on anticipatory patterns in toneless minor syllables. Beyond the well-known carry-over effect on the following vowel, we show that minor-syllable F0 is systematically raised before voiceless onsets and lowered before voiced onsets. Acoustic data from Burmese–English bilingual speakers were analyzed with linear mixed-effects models, revealing reliable voicing effects across /p/–/b/, /t/–/d/, /k/–/g/, and /s/–/z/ that are stronger in minor than in major syllables and only weakly modulated by lexical tone. Effects are concentrated near the minor-syllable offset and in the early portion of the major syllable, consistent with anticipatory and carry-over laryngeal influences. Ward hierarchical clustering grouped tokens primarily by voicing, with voiced onsets forming more compact F0 clusters and voiceless onsets showing greater dispersion. A random-forest classifier trained on late minor-syllable F0 predicted onset voicing above chance (61.7"
   ],
   "p1": 134,
   "pn": 138,
   "doi": "10.21437/TAI.2025-28",
   "url": "tai_2025/ni25_tai.html"
  },
  "mam25_tai": {
   "authors": [
    [
     "Sothornin",
     "Mam"
    ],
    [
     "Pittayawat",
     "Pittayaporn"
    ],
    [
     "Sireemas",
     "Maspong"
    ]
   ],
   "title": "Phonologization of pitch in Phnom Penh and Standard Khmer for cluster and disyllabic words",
   "original": "136",
   "order": 29,
   "page_count": 5,
   "abstract": [
    "In Phnom Penh Khmer (PPK), the [r] of Standard Khmer (SK) has been replaced with an aspiration [h] accompanied by a falling-rising pitch in the following vowel, thus creating minimal pairs such as [cʰuːk] ‘lotus’ and [cʰùːk] ‘pig’, corresponding to SK [cʰuːk] and [cruːk], respectively. This change was viewed as an incipient of tonogenesis as their distribution is very limited. However, a previously undocumented phenomenon—pitch lowering in the second syllable after voiced onsets in disyllabic words—suggests that tonogenesis may be well underway. In this study, we investigate f0 patterns in PPK monosyllables with onset clusters and disyllables, comparing them with SK pitch realizations. We aim to determine whether the pitch pattern has been phonologized in the PPK sound system. The wordlist includes cluster and disyllabic words to examine four groups of onset consonants. Data is collected from five native PPK speakers (two males and three females), where their f0 value is measured based on the final rime of the word. The result shows that the f0 trajectory in PPK clearly shows two categorically different pitch patterns one in a higher pitch range and the other in a lower pitch range. For SK, only a pattern of falling pitch contour is found. We also confirmed that the difference between voiceless and voiced disyllable f0 onset is approximately two standard deviations in PPK, a magnitude too large to be an intrinsic phonetic effect from the consonant. Therefore, in addition to words with r&gt;h, voiced stops and nasal onset consonants of the second syllable also exhibit the same f0 trajectory. The categorical difference suggests the pitch difference has been phonologized into a binary phonological distinction between a low and a high tone. Although whether the speaker makes use of this acoustic cue in perception remains an important question, these results suggest that tonogenesis in PPK may be more advanced than originally believed."
   ],
   "p1": 139,
   "pn": 143,
   "doi": "10.21437/TAI.2025-29",
   "url": "tai_2025/mam25_tai.html"
  },
  "qiu25_tai": {
   "authors": [
    [
     "Ào",
     "Qiú"
    ]
   ],
   "title": "Establishing underlying tonal contrast for two surface Mid tones: A case for Western Naxi",
   "original": "137",
   "order": 30,
   "page_count": 5,
   "abstract": [
    "Naxi, a Tibeto-Burman language spoken in southeastern China, is often characterized by a tonal complexity in its eastern varieties, while western dialects have been considered to exhibit a more straightforward syllable-tone system. This study shows that although Bōwān Naxi, a Western variety, has only four surface tones, it in fact operates with five underlying tone categories, among which two contrastive mid tones, termed Ma and Mb, are neutralized in monosyllabic verbs but exhibit distinct tonal patterns in multi-syllabic morphological contexts.\n",
    "Tonal behaviors of the 5 categories reveal that Ma is underlyingly associated with a floating high tone (/M#H/) while Mb is underlyingly toneless. Furthermore, historical comparison with the Lìjiāng dialect confirms that Ma and Mb are of different historical origins, which provides a basis for the underlying tonal contrast being used in comparative studies."
   ],
   "p1": 144,
   "pn": 148,
   "doi": "10.21437/TAI.2025-30",
   "url": "tai_2025/qiu25_tai.html"
  }
 },
 "sessions": [
  {
   "title": "Full papers submitted after the conference",
   "papers": [
    "culhane25_tai",
    "lee25_tai",
    "lorenzen25_tai",
    "repp25_tai",
    "mixdorff25_tai",
    "pitcher25_tai",
    "heim25_tai",
    "seeliger25_tai",
    "le25_tai",
    "shigemori25_tai",
    "kaland25_tai",
    "volin25_tai",
    "spina25_tai",
    "zsiga25_tai",
    "lo25_tai",
    "sim25_tai",
    "pharao25_tai",
    "wang25_tai",
    "adams25_tai",
    "marchini25_tai",
    "li25_tai",
    "souza25_tai",
    "culhane25b_tai",
    "li25b_tai",
    "stanhope25_tai",
    "passoni25_tai",
    "ta25_tai",
    "ni25_tai",
    "mam25_tai",
    "qiu25_tai"
   ]
  }
 ],
 "doi": "10.21437/TAI.2025"
}