{
 "title": "4th International Symposium on Tonal Aspects of Languages (TAL 2014)",
 "location": "Nijmegen, The Netherlands",
 "startDate": "13/5/2014",
 "endDate": "16/5/2014",
 "conf": "TAL",
 "year": "2014",
 "name": "tal_2014",
 "series": "TAL",
 "SIG": "SProSIG",
 "title1": "4th International Symposium on Tonal Aspects of Languages",
 "title2": "(TAL 2014)",
 "date": "13-16 May 2014",
 "booklet": "tal_2014.pdf",
 "papers": {
  "kubozono14_tal": {
   "authors": [
    [
     "Haruo",
     "Kubozono"
    ]
   ],
   "title": "Japanese pitch accent in a typological perspective",
   "original": "tl14_195",
   "page_count": 4,
   "order": 1,
   "p1": "195",
   "pn": "198",
   "abstract": [
    "Standard Tokyo Japanese has a rich pitch-accent system where multiple pitch patterns are differentiated from each other in terms of the presence/absence of an abrupt pitch fall as well as its position. However, this is only one type of system among the variety of pitch-accent systems found in the language. This paper looks at these pitch-accent systems from typological viewpoints, through a comparison of the standard variety with some regional dialects that show radically different features.\n",
    "Index Terms: pitch accent, Japanese dialects, distinctive feature, mora, question prosody\n",
    ""
   ]
  },
  "wong14_tal": {
   "authors": [
    [
     "Patrick C. M.",
     "Wong"
    ],
    [
     "Mark",
     "Antoniou"
    ]
   ],
   "title": "The neurophysiology of tone: four decades of research",
   "original": "tl14_199",
   "page_count": 5,
   "order": 2,
   "p1": "199",
   "pn": "202",
   "abstract": [
    "Tone processing has been used as a vehicle for investigating numerous questions concerning the neurophysiology of basic auditory perception, language, and music. Behavioral, dichotic-listening, lesion, and functional and anatomical neuroimaging studies have shed light on various debates of the neural organization of perceptual information. From our early fascination of hemispheric specialization to more recently the neurogenetics of language, the study of tone has always provided key evidence for our most current understanding of the brain. Here, we provide a historical overview of the key issues and present findings from our laboratory from the past decade that contribute to these debates.\n",
    "Index Terms: lexical tone, auditory perception, neurophysiology, neurogenetics\n",
    ""
   ]
  },
  "dicanio14_tal": {
   "authors": [
    [
     "Christian",
     "DiCanio"
    ],
    [
     "Jonathan D.",
     "Amith"
    ],
    [
     "Rey",
     "Castillo García"
    ]
   ],
   "title": "The phonetics of moraic alignment in Yoloxóchitl Mixtec",
   "original": "tl14_203",
   "page_count": 8,
   "order": 3,
   "p1": "203",
   "pn": "210",
   "abstract": [
    "This talk highlights recent research on the phonetics of tonal alignment in Yoloxóchitl Mixtec (YM). This language is notable for its large tonal inventory, where 20 tonal melodies contrast on monosyllabic words. The language’s phonological structure strongly supports the alignment of tonal targets to moras, resulting in contrastive contour types even within a single syllable, e.g. /1.3/ vs. /13.3/. Patterns of phonetic tonal alignment were investigated. The alignment of non-glottalized tonal targets was examined with original field data collected by the authors from 10 speakers. Words varied by word type (monosyllabic, disyllabic) and tone. Both the phonological patterning of tone and patterns of phonetic alignment demonstrate a strong pattern of moraic tonal alignment in YM. The F0 trajectories for bimoraic monosyllables closely match those of bimoraic disyllables. Moreover, in both word types, F0 movement is restricted to only the mora with the associated target. Thus, a rising /1.3/ tone shows a marked delay in F0 rise compared to the earlier rise observed with a /13.3/ tone. These findings support the notion that moras act as anchors for F0 targets and trajectories within tone production. Such patterns stand in stark contrast to studies on tone languages for which the syllable is the unit of tonal alignment. Taken as a whole, this research expands our knowledge of tonal phonetics and challenges what we believe is possible in the tonal systems of human languages. As a more general perspective on tonal phonetics will emerge from the consideration of a typologically-diverse set of languages, this work also highlights the increasing relevance of laboratory methods in phonetic fieldwork.\n",
    "Index Terms: Tone, Production, Oto-Manguean\n",
    ""
   ]
  },
  "heuven14_tal": {
   "authors": [
    [
     "Vincent J. van",
     "Heuven"
    ]
   ],
   "title": "Acoustic correlates and perceptual cues of word and sentence stress: mainly English and Dutch",
   "original": "tl14_211",
   "page_count": 7,
   "order": 4,
   "p1": "211",
   "pn": "217",
   "abstract": [
    "This is an abridged version of a tutorial on the (older) experimental literature on the acoustic correlates of, and their contribution to, human stress perception, mainly on the basis of research on English and Dutch. The emphasis is on establishing the relative importance of correlates amd cues. The conclusion is that a reliable acoustic correlate (e.g. peak intensity) is not necessarily a strong perceptual cue. Conversely, the strongest perceptual cue (i.e. pitch change) is acoustically an unreliable correlate.\n",
    "Index Terms: word stress, sentence stress, acoustic correlate, perceptual cue\n",
    ""
   ]
  },
  "mathes14_tal": {
   "authors": [
    [
     "Timothy K.",
     "Mathes"
    ]
   ],
   "title": "<i>extreme</i> tonal depressor effects in Khoisan: evidence from Tsua",
   "original": "tl14_001",
   "page_count": 5,
   "order": 5,
   "p1": "1",
   "pn": "5",
   "abstract": [
    "This paper reports on the interaction between Fundamental Frequency (F0), voicing and aspiration in Tsua, a Central Khoisan click language spoken in Botswana. Tsua lacks the tonal mobility of spreading and shifting found in many neighboring Bantu languages. Nevertheless, original field research in 2012 and 2013 revealed that Tsua has an extreme tonal depressor effect that lowers a post-consonantal, rootinitial H-tone’s production by ~50 Hz or more. Tonal depression can be triggered by voiced stops, aspirated stops or the glottal fricative /h/, an effect that has been missed by the small amount of previous research on Tsua. However, this inquiry also found that 19.2% of the root-initial H-tones that are expected to be depressed by the triggering environment are produced without depression, perhaps providing a reason as to why the effect has been overlooked. Cognates with the Central Khoisan languages G|ui and Kua were investigated to formulate a plausible explanation. It was determined that tonal depression exceptions with root-initial voiced stops in Tsua always correspond with G|ui and Kua cognates that have rootinitial nasals or nasalized clicks, consonants which do not trigger depression in Tsua. These results provide insight into diachronic sound change that has influenced the production of Tsua lexical tone.\n",
    "Index Terms: tone, production, depressors, consonant-tone interaction, Khoisan\n",
    ""
   ]
  },
  "remijsen14_tal": {
   "authors": [
    [
     "Bert",
     "Remijsen"
    ],
    [
     "Otto Gwado",
     "Ayoker"
    ]
   ],
   "title": "Evidence for contrastive tonal alignment in Shilluk",
   "original": "tl14_006",
   "page_count": 4,
   "order": 6,
   "p1": "6",
   "pn": "9",
   "abstract": [
    "It is widely assumed that tonal alignment is not contrastive in contour tones [1,2,3]. Contrary to this consensus, [4] recently presented evidence of contrastive alignment in falling contours in Dinka. The current study contributes to this area of investigation through an acoustic analysis of the relevant part of the tone system of another language: Shilluk. The dataset is built around the tonal contrast of Low vs. Early-aligned High Fall vs. Late-aligned High Fall vs. High. The descriptive statistics resulting from this study are in line with the hypothesis that tonal alignment can indeed be contrastive in falling contour tones.\n",
    "s Hyman, L. M. (1988). Syllable structure constraints on tonal contours. Linguistique Africaine 1, 49-60. Odden, D. (1995). Tone: African languages. In J.A. Goldsmith (ed.) The Handbook of Phonological Theory. Blackwell, 444-475. Yip, M. (2002). Tone. CUP. Remijsen, B. (2013). Tonal alignment is contrastive in falling contours in Dinka. Language 89, 297-327.\n",
    "",
    "",
    "Index Terms: tone, tonal alignment, contour tones, Shilluk\n",
    ""
   ]
  },
  "gope14_tal": {
   "authors": [
    [
     "Amalesh",
     "Gope"
    ],
    [
     "Shakuntala",
     "Mahanta"
    ]
   ],
   "title": "Lexical tones in Sylheti",
   "original": "tl14_010",
   "page_count": 5,
   "order": 7,
   "p1": "10",
   "pn": "14",
   "abstract": [
    "In this paper we examine the status of lexical tones in Sylheti. Sylheti is generally considered to be one of the varieties of Bangla (belonging to the Indo-Aryan language family). The consonant inventory of Sylheti has undergone significant reduction and restructuring, and lost all the aspirated stops due to obstruent weakening ([bhai>bai] \"brother\", [lathi> lati] \"kick\") and spirantization of the underlying voiceless bilabial stop (both aspirated and unaspirated) [p] and [ph] ([por] > [ɸɔr] \"read, [phul] > [ɸul] \"flower) and voiceless velar stop (both aspirated and unaspirated) [k] and [kh] ([kali] > [xali] \"ink\", [ [khal > xal] \"drain/channel\"). These processes gave birth to numerous homophones. Eight native speakers of Sylheti participated in a production experiment which recorded their utterances of 60 homophonous words (in a carrier sentence). However, in this paper we have concentrated only on the tonal properties of 24 monosyllabic words. The results show that the loss of breathy voice contrast and spirantization is compensated with a higher F0 in the adjacent vowels. The result of one-way ANOVA shows a highly significant effect of tone on F0 (measured at various points such as F0 at vowel mid-point (measured in Mel) p<0.05, [F(1, 414)=67.06, p=0.00)], max pitch (measured in Mel) p<0.05, [F(1, 414)=26.21, p=0.00], min pitch (measured in Mel) p<0.05, [F(1, 414)=40.83, p=0.00], average pitch (in Mel) p<0.05, [F(1, 414)=48.18, p=0.00].\n",
    "Index Terms: Sylheti, [+spread glottis], spirantization, homophone, tone, tonogenesis, production, perception.\n",
    ""
   ]
  },
  "mckendry14_tal": {
   "authors": [
    [
     "Inga",
     "McKendry"
    ]
   ],
   "title": "Evidence for rightward tone shift in Mixtec languages",
   "original": "tl14_015",
   "page_count": 4,
   "order": 8,
   "p1": "15",
   "pn": "18",
   "abstract": [
    "This paper compares data from different Mixtec languages to show that not all underlying tones align at the left edge of their sponsoring morpheme. This process is most thorough-going in South-eastern Nochixtlán Mixtec (MXY) where the tones of most morphemes are prohibited from aligning at the left edge. Thus for bimoraic morphemes, the underlying tones associate with the second mora, often giving rise to floating tones. The same restriction against the underlying tones aligning at the left edge also applies to monomoraic items with the result that the tone(s) sponsored by these morphemes occur as floating tones. I show that the considerable surface variation of tonal phenomena between Mixtec languages can be attributed to differences in alignment rather than differences of underlying tones. For MXY, I show that High, Mid and Low tones occur as floating tones. One outcome of this rightward shift in MXY is that stressed syllables are unspecified for tone.\n",
    "Index Terms: tone, alignment, Mixtec, tone shift, stress, floating tones\n",
    ""
   ]
  },
  "meyase14_tal": {
   "authors": [
    [
     "Savio Megolhuto",
     "Meyase"
    ]
   ],
   "title": "Four versus five: the number of tones in Tenyidie",
   "original": "tl14_019",
   "page_count": 4,
   "order": 9,
   "p1": "19",
   "pn": "22",
   "abstract": [
    "Abstract (abridged). Tenyidie. also known as the Anganii language, is a Tibeto-Bunnan language spoken in the Kohima district of Nagaland. Unlike most of the languages in this family, which have two or at the most three level tones, it has four level tones.   In this study, we report on two aspects of the tones in Tenyidie - first, the categorisation of the tones in the language: and then, we go on to motivate a phonological representation for the phonetically non-distinct fifth tone.   Observing the pattern of alternations in morphological derivations, it could be difficult to explain why while h and H generate an L tone on the following suffix and M and L generate an M tone for the same set of data, in another set. h and M generate an h tone on the suffix and H and L generate an H tone.   Based on Yip (2002). we show how the morphophonemic alternation can be explained as a consequence of a two tier structure, as:    ±Upper    |    ±raised Finally, turning to the other issue concerning the number of tones in Tenyidie. though phonetic studies point to the language having only four tones, grammarians of Tenyidie claim that there are five, capturing native speakers' intuition. We extend our phonological analysis to the fifth tone arguing for a bi-tonal representation basing our analysis on the same set of moiphophonemic alternation. The fifth tone is observed as a tone which is phonetically High but has the property of Mid. Iudex Terms: tone, phonology, representation. Tenyidie. Anganii. Naga. Tibeto-Burman.\n",
    ""
   ]
  },
  "ouattara14_tal": {
   "authors": [
    [
     "Virpi",
     "Ouattara"
    ],
    [
     "Maija S.",
     "Peltola"
    ]
   ],
   "title": "Tone neutralization and tone spreading in the verb system of Samue (niger- congo, gur)",
   "original": "tl14_023",
   "page_count": 4,
   "order": 10,
   "p1": "23",
   "pn": "26",
   "abstract": [
    "This paper provides a presentation of tones in the verb system of Samue, a previously undocumented Gur language spoken in Burkina Faso. Our research shows that in Samue three lexical tones are contrastive: high (H), mid (M) and low (L). In the simplest morphological form of the verb, four tonal melodies are attested: H, M, L and MH. In the verb system, the lexical tone opposition is neutralized in the imperfective aspect and future tense, while the imperative mood and perfective aspect both bear the lexical tone. Our study further shows that tone spreading in Samue is regressive, although progressive spread is more common in tone languages. The process of regressive spreading of mid tone is a particularity of the Samue verbal tone system. Spreading occurs when some mid toned verbal particles are in direct contact with the preceding verb; the mid tone spreads to the verb. Spreading can be bounded concerning only one Tone Bearing Unit (TBU) leftwards, or unbounded concerning the whole verb. This depends on the verbal particle that triggers the spreading. Interestingly, our research also shows that in the case of different particles, the spreading concerns only high or only low toned verbs.\n",
    "Index Terms: tone spreading, tone neutralization, Gur (Niger-Congo), verb phrase\n",
    ""
   ]
  },
  "hamlaoui14_tal": {
   "authors": [
    [
     "Fatima",
     "Hamlaoui"
    ],
    [
     "Siri M.",
     "Gjersøe"
    ],
    [
     "Emmanuel-Moselly",
     "Makasso"
    ]
   ],
   "title": "High tone spreading and phonological phrases in Bàsàá",
   "original": "tl14_027",
   "page_count": 5,
   "order": 11,
   "p1": "27",
   "pn": "31",
   "abstract": [
    "High Tone Spreading (HTS), by which an underlying High tone associated with a mora spreads rightwards and associates with one or several following moras, is a major tonal process in Bàsàá (Cameroon, Bantu A43). We here examine the domain of application of this process and establish that HTS allows us to determine the right edge of Phonological Phrases. We discuss apparent counterevidence to this claim: in the postverbal domain, the distinction between arguments and adjuncts is neutralized, and HTS seems to apply in a purely linear fashion. We offer an account of this pattern using MATCHPHRASEMAX and MAX-BIN. Alternatively, we propose that prosody might here simply provide a window into the unexpected, but not so unusual syntax of this Bantu language.\n",
    "Index Terms: High Tone Spreading, Phonological Phrase, Prosody, Bantu, Syntax-Phonology Interface\n",
    ""
   ]
  },
  "yang14_tal": {
   "authors": [
    [
     "Xinlu",
     "Yang"
    ],
    [
     "Jie",
     "Liang"
    ],
    [
     "Marjoleine",
     "Sloos"
    ]
   ],
   "title": "Unmerging T2 and T3 in Urumqi accented standard Mandarin",
   "original": "tl14_032",
   "page_count": 4,
   "order": 12,
   "p1": "32",
   "pn": "35",
   "abstract": [
    "The Urumqi Mandarin dialect has three tones, whereas Standard (Beijing) Mandarin has four tones. Recently, younger speakers in Urumqi began to use Standard Mandarin in daily conversation. We investigate how they acquire the tones in Standard Mandarin, especially the rising tone (T2) which lacks a counterpart in Urumqi Mandarin. We will show that these younger speakers initially use Urumqi tones in Standard Mandarin (but for different lexical sets). At that stage, the production of T1, T3 and T4 approximates Standard Mandarin relatively well. However, T2 is merged with T3. In the second stage, unmerger of T2 and T3 occurs, which is characterized by a distinction between early (T2) and late (T3) low turning points in the dipping tone. In the third stage, further disambiguation occurs by lowering the lowest turning point in T3. However, the final rise of T2 is still missing. We assume that raising the final part of T2 will be the final step to be taken in the near future.\n",
    "Index Terms: tone, intonation, Mandarin, Urumqi\n",
    ""
   ]
  },
  "cheng14_tal": {
   "authors": [
    [
     "Chierh",
     "Cheng"
    ],
    [
     "Jenn-Yeu",
     "Chen"
    ],
    [
     "Yi",
     "Xu"
    ]
   ],
   "title": "An acoustic analysis of Mandarin tone 3 sandhi elicited from an implicit priming experiment",
   "original": "tl14_036",
   "page_count": 5,
   "order": 13,
   "p1": "36",
   "pn": "40",
   "abstract": [
    "This study analyses acoustic data elicited from an implicit priming experiment on tone 3 sandhi in Mandarin Chinese (a follow-up to Chen and Chen [1]) with the aim of examining how the tonal contours of lexical T2 and sandhi T3 are realised in a set that shared the initial parts of the word (i.e. the homogeneous condition, e.g. li3pin3, li3xiang3, li2dao3, li2guo3) and in a set that did not share the initial parts of the word (i.e. the heterogeneous condition, e.g. li3pin3, yan3jiang3 , yu2gang3, wei2xian3), respectively. F0 contours and their instantaneous velocity profiles values are used in a functional t-test which allows comparing the mean of two groups of contours along the time domain. We find that in the homogeneous condition, T2 and sandhi T3 are very similar to each other. However, in the heterogeneous condition, the amplitude and speed of the initial falling movements differ, and a time lag in directional change is present between T2 and sandhi T3. This finding suggests that the neutralisation of sandhi T3 and T2 is less complete in the heterogeneous condition than in the homogeneous condition. Additionally, compared to the heterogeneous condition, the longer duration of target syllables found in the homogeneous condition could point to an intricate online articulatory re-adjustment of tonal targets during tonal alternation.\n",
    "",
    "",
    "Chen, J.-Y., and Chen, T.-M., “Mechanism and locus of Tone 3 sandhi during Mandarin Chinese spoken word production,” Journal of Chinese Linguist., accepted in 2013.\n",
    "",
    "",
    "Index Terms: tone sandhi, Mandarin Chinese, implicit priming, functional data analysis\n",
    ""
   ]
  },
  "yu14_tal": {
   "authors": [
    [
     "Alan C. L.",
     "Yu"
    ],
    [
     "Hyunjung",
     "Lee"
    ],
    [
     "Jackson",
     "Lee"
    ]
   ],
   "title": "Variability in perceived duration: pitch dynamics and vowel quality",
   "original": "tl14_041",
   "page_count": 4,
   "order": 14,
   "p1": "41",
   "pn": "44",
   "abstract": [
    "Why are some sound patterns more commonly attested than others? This paper explores the hypothesis that DIFFERENTIAL PHONOLOGIZATION–when one phonetic precursor gives rise to a new phonological pattern more readily than another even when both sets of phonetic precursors may give rise to sound patterns–might arise as a result of variability in how the perceptual system copes with variation in the speech signal; variations that are more robustly normalized for are less likely to lead to the phonologization. To investigate this hypothesis, we examine listeners’ perceptual responses to covariation between duration, on the one hand, and conditioning factors, such as the dynamics of the fundamental frequency and vowel height on the other. We found that, while perceived duration of syllables is modulated by the abovementioned conditioning factors, the direction and magnitude of perceptual adjustments differ across conditioning factors, thus supporting the differential compensation approach to differential phonologization.\n",
    "Index Terms: Pitch, vowel quality, perceived duration, perceptual compensation\n",
    ""
   ]
  },
  "hoffmann14_tal": {
   "authors": [
    [
     "Christian W. G.",
     "Hoffmann"
    ],
    [
     "Makiko",
     "Sadakata"
    ],
    [
     "Ao",
     "Chen"
    ],
    [
     "Peter",
     "Desain"
    ],
    [
     "James M.",
     "McQueen"
    ]
   ],
   "title": "Within-category variance and lexical tone discrimination in native and non- native speakers",
   "original": "tl14_045",
   "page_count": 5,
   "order": 15,
   "p1": "45",
   "pn": "49",
   "abstract": [
    "In this paper, we show how acoustic variance within lexical tones in disyllabic Mandarin Chinese pseudowords affects discrimination abilities in both native and non-native speakers of Mandarin Chinese. Within-category acoustic variance did not hinder native speakers in discriminating between lexical tones, whereas it precludes Dutch native speakers from reaching native level performance. Furthermore, the influence of acoustic variance was not uniform but asymmetric, dependent on the presentation order of the lexical tones to be discriminated. An exploratory analysis using an active adaptive oddball paradigm was used to quantify the extent of the perceptual asymmetry. We discuss two possible mechanisms underlying this asymmetry and propose possible paradigms to investigate these mechanisms.\n",
    "Index Terms: tone, L2 perception, Mandarin, Dutch, perceptual asymmetry\n",
    ""
   ]
  },
  "ou14_tal": {
   "authors": [
    [
     "Jinghua",
     "Ou"
    ],
    [
     "Sam-Po",
     "Law"
    ],
    [
     "Roxana",
     "Fung"
    ],
    [
     "Sabrina",
     "Ho"
    ]
   ],
   "title": "The role of individual differences in cognitive ability in tone processing in Cantonese: preliminary findings",
   "original": "tl14_050",
   "page_count": 5,
   "order": 16,
   "p1": "50",
   "pn": "53",
   "abstract": [
    "Sound variations are persistent in the phonological system of all languages. Such variations, at the individual level, are exhibited by different patterns of perception and production. Recent studies have suggested individual differences in cognitive abilities as important sources of variability in speech processing. Yet, how different aspects of speech processing are associated with different components of cognitive abilities remains unclear. The present study aims to systematically assess the relationships between tone processing and various components of attention and working memory in the auditory and visual modalities among normal Cantonese-speaking individuals using a series of published tools. The individual variations in tone processing are captured in an on-going sound change – tone merging in Hong Kong Cantonese, in which normal native speakers are reported to lose the distinctions between tonal contrasts in perception and/or production. Three groups of participants have been identified, with one group of good perception and production of the six contrastive tones in Cantonese, a second group of good perception but poor production and a third group of good production but poor perception. The present findings suggest that domain general cognitive abilities including visual working memory and auditory attention switching/ control may contribute to an individual's speed in tone discrimination, and possibly play a role in sound change.\n",
    "Index Terms: individual differences, tone perception, tone production, Cantonese, cognitive ability, sound change\n",
    ""
   ]
  },
  "yang14b_tal": {
   "authors": [
    [
     "Anqi",
     "Yang"
    ],
    [
     "Aoju",
     "Chen"
    ]
   ],
   "title": "Prosodie focus marking iu child and adult Mandarin Chinese",
   "original": "tl14_054",
   "page_count": 5,
   "order": 17,
   "p1": "54",
   "pn": "58",
   "abstract": [
    "This study investigates how Mandarin Chinese speaking children and adults use prosody to mark focus in spontaneous speech. SVO sentences were elicited from 4- and 8-year-olds and adults in a game setting. Sentence-medial verbs were acoustically analysed for both duration and pitch range in different focus conditions. We have found that like the adults, the 8-year-olds used both duration and pitch range to distinguish focus from non-focus. The 4-year-olds used only duration to distinguish focus from non-focus, unlike the adults and 8-year-olds. None of the three groups of speakers distinguished contrastive focus from non-contrastive focus using pitch range or duration. Regarding the distinction between narrow focus from broad focus, the 4- and 8-year-olds used both pitch range and duration for this purpose, while the adults used only duration.\n",
    "Index Terms: focus, tone, Mandarin Chinese; L1 acquisition\n",
    ""
   ]
  },
  "tronnier14_tal": {
   "authors": [
    [
     "Mechtild",
     "Tronnier"
    ],
    [
     "Elisabeth",
     "Zetterholm"
    ]
   ],
   "title": "Swedish word accent production by L2-speakers with different tonal L1S",
   "original": "tl14_059",
   "page_count": 4,
   "order": 18,
   "p1": "59",
   "pn": "62",
   "abstract": [
    "This study addresses the question of whether L1-speakers of Vietnamese – a tone language – and L1-speakers of Somali – a language with tonal accents – differ in degree of accuracy when producing words that carry either of the two tonal accents in L2-Swedish. Some previous studies suggest that it is an advantage when discriminating between different tones in another tone language, if a speaker’s L1 is also a tone language; while others show that this may not necessarily be the case. Accuracy was studied with the help of identification tests, and the results for the L2-speakers were matched with the results for L1-speakers. It is revealed that no adequate distinction is made between the tone accents by either of the two groups of L2-speakers. The two tonal patterns are equally often obscured by L1-speakers of Somali, whereas speakers of L1-Vietamese produced patterns that were more frequently identified as one of the Swedish word accents, but not the other one.\n",
    "Index Terms: tone accent production in L2, tone accent identification, L1-Vietnamese, L1-Somali, tonal perception, foreign accent, L2-Swedish\n",
    ""
   ]
  },
  "zhou14_tal": {
   "authors": [
    [
     "Wencui",
     "Zhou"
    ],
    [
     "Mirjam",
     "Broersma"
    ]
   ],
   "title": "Perception of birth language tone contrasts by adopted Chinese children",
   "original": "tl14_063",
   "page_count": 4,
   "order": 19,
   "p1": "63",
   "pn": "66",
   "abstract": [
    "The present study investigates how long after adoption adoptees forget the phonology of their birth language. Chinese children who were adopted by Dutch families were tested on the perception of birth language tone contrasts before, during, and after perceptual training. Experiment 1 investigated Cantonese tone 2 (High-Rising) and tone 5 (Low-Rising), and Experiment 2 investigated Mandarin tone 2 (High-Rising) and tone 3 (Low-Dipping). In both experiments, participants were adoptees and non-adopted Dutch controls. Results of both experiments show that the tone contrasts were very difficult to perceive for the adoptees, and that adoptees were not better at perceiving the tone contrasts than their non-adopted Dutch peers, before or after training. This demonstrates that forgetting took place relatively soon after adoption, and that the re-exposure that the adoptees were presented with did not lead to an improvement greater than that of the Dutch control participants. Thus, the findings confirm what has been anecdotally reported by adoptees and their parents, but what had not been empirically tested before, namely that birth language forgetting occurs very soon after adoption.\n",
    "Index Terms: birth language, tone contrasts, perception, Cantonese, Mandarin\n",
    ""
   ]
  },
  "hao14_tal": {
   "authors": [
    [
     "Yen-Chen",
     "Hao"
    ]
   ],
   "title": "The application of the speech learning model to the L2 acquisition of Mandarin tones",
   "original": "tl14_067",
   "page_count": 4,
   "order": 20,
   "p1": "67",
   "pn": "70",
   "abstract": [
    "One major hypothesis of the Speech Learning Model (SLM) is that if the sounds in the second language (L2) are dissimilar to the learners’ first language (L1), learners are more likely to form new phonetic categories for these sounds after receiving sufficient L2 input and achieve native-like proficiency. As for the L2 sounds that are similar to the L1, learners often equate them with L1 categories and their perception and production may always deviate from native speakers. To apply the SLM to the learning of tones, this study investigates the way in which the perceived L2-L1 similarity affects the acquisition of Mandarin tones. Three groups of English speakers with no, little, and extensive Mandarin experience judge the English-likeness of the four Mandarin tones. Their ratings are used to make predictions about the L2 acquisition of tones based on the SLM. Then the experienced and inexperienced learners’ tone acquisition is evaluated by a perceptual identification task. The results show that the experienced learners obtain significantly higher accuracy than the inexperienced learners on tones perceived to be less similar to English, but not on the tone perceived to be more similar, generally confirming the SLM predictions. The three groups of English speakers differ to some extent in their L2-L1 similarity ratings, yet the predictions made from the experienced learners’ judgment account for the L2 acquisition outcome more precisely. This study concludes that the SLM can be applied to the learning of L2 tones, and the advanced L2 learners can more critically assess the L2-L1 similarity than those who have little or no knowledge of the L2.\n",
    ""
   ]
  },
  "kugler14_tal": {
   "authors": [
    [
     "Frank",
     "Kügler"
    ],
    [
     "Susanne",
     "Genzel"
    ]
   ],
   "title": "On the elicitation of focus – prosodic differences as a function of sentence mode of the context?",
   "original": "tl14_071",
   "page_count": 4,
   "order": 21,
   "p1": "71",
   "pn": "74",
   "abstract": [
    "This paper investigates whether the sentence mode of a context leads to differences in the prosodic realization of focus. Semantically, a communicative reaction in terms of a correction is expected to differ if the context is an assertion or a polar question. In two production studies using a picture naming task, 12 speakers of Mandarin Chinese were recorded reacting to context questions and context assertions which elicited focus on the subject. Experiment 1 examines the syntactic preference, i.e. the use of clefts, in responses to different contexts eliciting corrective and counterpresuppostional focus. In experiment 2, the same setting was used, but speakers were primed for their answers by test trials in order to receive comparable speech material for prosodic analysis. Results show (i) the well-known prosodic effect of focus, and (ii) no difference of elicitation method. Subject focus was preferably realized in basic SVO word order.\n",
    "Index Terms: focus, context, elicitation method, Mandarin Chinese\n",
    ""
   ]
  },
  "xu14_tal": {
   "authors": [
    [
     "Robert Bo",
     "Xu"
    ],
    [
     "Jingwen",
     "Li"
    ],
    [
     "Peggy",
     "Mok"
    ]
   ],
   "title": "The effect of orthography on L2 perception",
   "original": "tl14_075",
   "page_count": 4,
   "order": 22,
   "p1": "75",
   "pn": "78",
   "abstract": [
    "Mandarin Chinese has two orthographic systems: Chinese characters and Pinyin. While Pinyin is transparent to Mandarin pronunciation, characters are opaque and seldom relate to sound. This study aims to find out the effect of these two systems on Cantonese listeners who are L2 learners of Mandarin. Native Hong Kong Cantonese speakers participated in word recognition experiments which included a monosyllabic task and a disyllabic task. The results show that Cantonese listeners most often confused Tl and T4, and T2 and T3 in Mandarin. Pinyin and characters have influence on the perception of Cantonese listeners. While Pinyin facilitates the recognition in the monosyllabic task, but characters facilitate the disyllabic task, indicating the two tasks may have involved different processes.\n",
    "Index Terms: L2 perception, orthography, tone. Mandarin\n",
    ""
   ]
  },
  "lee14_tal": {
   "authors": [
    [
     "Seunghun J.",
     "Lee"
    ],
    [
     "Siri M.",
     "Gjersøe"
    ]
   ],
   "title": "Segmental effects on tone: an acoustic analysis of tonal polarity in Xitsonga",
   "original": "tl14_079",
   "page_count": 4,
   "order": 23,
   "p1": "79",
   "pn": "82",
   "abstract": [
    "Xitsonga nouns have plural prefixes that are added to a singular prefix-less root. These added prefixes (ADD) are described as being realized with a tone polar to the root vowel (RV): when RV is high (H) ADD is low (L), but when RV is L, ADD is H. Based on qualitative observations, Lee formally analyzes tonal polarity in a constraint-based framework. This paper presents results from quantitative analyses of two speakers (male and female) and shows that tonal polarity in Xitsonga is asymmetrical. First, only H-toned roots are preceded by the ADD prefix with a polar tone. Second, the ADD prefix before toneless roots has a surface L tone. Any large F0 difference in the latter case can be explained by segmental effects on pitch, such as depressor consonants and vowel height. The new findings are formalized by proposing that the specific OCP-H constraint outranks the general OCP constraint.\n",
    "Index Terms: Tonal polarity, Xitsonga, noun class prefixes, OCP, depressor consonants\n",
    ""
   ]
  },
  "chen14_tal": {
   "authors": [
    [
     "Ao",
     "Chen"
    ],
    [
     "Aoju",
     "Chen"
    ],
    [
     "René",
     "Kager"
    ],
    [
     "Patrick C. M.",
     "Wong"
    ]
   ],
   "title": "Rises and falls in Dutch and Mandarin Chinese",
   "original": "tl14_083",
   "page_count": 4,
   "order": 24,
   "p1": "83",
   "pn": "86",
   "abstract": [
    "Despite of the different functions of pitch in tone and nontone languages, rises and falls are common pitch patterns across different languages. In the current study, we ask what is the language specific phonetic realization of rises and falls. Chinese and Dutch speakers participated in a production experiment. We used contexts composed for conveying specific communicative purposes to elicit rises and falls. We measured both tonal alignment and tonal scaling for both patterns. For the alignment measurements, we found language specific patterns for the rises, but for falls. For rises, both peak and valley were aligned later among Chinese speakers compared to Dutch speakers. For all the scaling measurements (maximum pitch, minimum pitch, and pitch range), no language specific patterns were found for either the rises or the falls.\n",
    "Index Terms: alignment, scaling, lexical tone, pitch accent, tone language, non-tone language\n",
    ""
   ]
  },
  "liu14_tal": {
   "authors": [
    [
     "Liquan",
     "Liu"
    ],
    [
     "René",
     "Kager"
    ]
   ],
   "title": "The discrimination of tonal contrasts by monolingual and bilingual adults",
   "original": "tl14_087",
   "page_count": 4,
   "order": 25,
   "p1": "87",
   "pn": "90",
   "abstract": [
    "In previous TAL [1], we have demonstrated non-tone-learning monolingual and bilingual infants' tone perception in the first year of life. This talk presents a follow-up study on the tone discrimination patterns in the adulthood, specifically in Chinese (tone-language), Dutch (non-tone-language), and Dutch simultaneous bilingual adults (non-tone-languages). Interestingly, adults from all language conditions perform similarly in AX and AXB discrimination tasks for two tonal contrasts. A slight advantage can be observed in the sequence of Chinese adults > Dutch simultaneous bilingual adults > Dutch adults when perceiving a contracted (more difficult) tonal contrast in an upward order. The influence of bilingualism on tone perception as well as acoustic salience is discussed linking our previous finding that bilingual infants present earlier sensitivity rebound in discriminating tonal contrast [2].\n",
    "s Liu, L., & Kager, R. (2012). “Non-tone Monolingual and Bilingual Infants' Tone Perception under Perceptual Reorganization” TAL 2012 Proceedings, ISCA Archive Liu, L., & Kager, R. (2013). “How Bilingualism Alter Infants' Tone Perception during Perceptual Reorganization”. BUCLD 37 Proceedings, 231-240, Cascadilla Press.\n",
    "",
    "",
    "Index Terms: tone, adult, speech perception, bilingualism, acoustic salience\n",
    ""
   ]
  },
  "landgraf14_tal": {
   "authors": [
    [
     "Rabea",
     "Landgraf"
    ]
   ],
   "title": "Are you serious? irony and the perception of emphatic intensification",
   "original": "tl14_091",
   "page_count": 4,
   "order": 26,
   "p1": "91",
   "pn": "94",
   "abstract": [
    "Two perception experiments were conducted in order to study the function and signaling of two postulated subtypes of emphasis for intensity in German. The results of the first, semantic- differential experiment confirm previous findings of acoustic analyses that positive and negative intensification are two distinct subtypes of emphasis for intensity. Moreover, irony occurs when semantically positive target words are combined with negative intensification and vice versa. The second experiment makes use of this fact in an indirect-identification task. Results show that positive and negative intensification are pattern-based and only identified reliably when bundles of cues work together. In addition, irony can in fact be used as a new tool to better pinpoint prosodic meanings in utterances.\n",
    "Index Terms: emphasis, irony, perception, prosody.\n",
    ""
   ]
  },
  "kelly14_tal": {
   "authors": [
    [
     "Niamh",
     "Kelly"
    ],
    [
     "Rajka",
     "Smiljaniċ"
    ]
   ],
   "title": "The effects of pragmatic focus on norwegian tonal accent",
   "original": "tl14_095",
   "page_count": 5,
   "order": 27,
   "p1": "95",
   "pn": "99",
   "abstract": [
    "The present paper examines the effect of pragmatic focus on the realisation of the lexical pitch accent contrast in the Trøndersk variety of Norwegian. Target disyllabic words with accent 1 and accent 2 were read with broad and narrow focus by 10 native speakers of Trøndersk. Broad-to-narrow focus changes were implemented through an expanded pitch range and vowel lengthening for both accents. A different effect of focus on the two accents was also found. Accent 1 words had no change in the timing of tonal events in narrow focus compared to broad focus, while accent 2 words had a later alignment of the pitch contour in narrow focus. An unexpected H tone, a ‘word-focus tone’ was also found at the end of a number of target words. The results thus revealed that narrow focus affected pitch cues even though these are primarily used to distinguish the lexical pitch contrasts. Furthermore, the asymmetrical impact of focus on accent 1 and accent 2 words increases the distinction between two accents.\n",
    "Index Terms: lexical pitch accent, Norwegian, focus, Scandinavian, prosody\n",
    ""
   ]
  },
  "torreira14_tal": {
   "authors": [
    [
     "Francisco",
     "Torreira"
    ],
    [
     "Seán G.",
     "Roberts"
    ],
    [
     "Harald",
     "Hammarström"
    ]
   ],
   "title": "Functional trade-off between lexical tone and intonation: typological evidence from polar-question marking",
   "original": "tl14_100",
   "page_count": 4,
   "order": 28,
   "p1": "100",
   "pn": "103",
   "abstract": [
    "Tone languages are often reported to make use of utterancelevel intonation as well as of lexical tone. We test the alternative hypotheses that a) the coexistence of lexical tone and utterance-level intonation in tone languages results in a diminished functional load for intonation, and b) that lexical tone and intonation can coexist in tone languages without undermining each other’s functional load in a substantial way. In order to do this, we collected data from two large typological databases, and performed mixed-effects and phylogenetic regression analyses controlling for genealogical and areal factors to estimate the probability of a language exhibiting grammatical devices for encoding polar questions given its status as a tonal or an intonation-only language. Our analyses indicate that, while both tone and intonational languages tend to develop grammatical devices for marking polar questions above chance level, tone languages do this at a significantly higher frequency, with estimated probabilities ranging between 0.88 and .98. This statistical bias provides cross-linguistic empirical support to the view that the use of tonal features to mark lexical contrasts leads to a diminished functional load for utterance-level intonation.\n",
    "Index Terms: tone, intonation, functional load, linguistic typology.\n",
    ""
   ]
  },
  "shport14_tal": {
   "authors": [
    [
     "Irina",
     "Shport"
    ]
   ],
   "title": "Variation in prosodic phonology: individual differences in production of the pitch-accent contrast",
   "original": "tl14_104",
   "page_count": 4,
   "order": 29,
   "p1": "104",
   "pn": "107",
   "abstract": [
    "Instead of the robust three-way contrast in the productions of two-syllable words varied in their accentual type, two types of neutralization were observed in native speakers of Tokyo Japanese. Two speakers produced some unaccented words with the accent on the final syllable; the other two speakers always produced words with the accent on the final syllable as unaccented. The accentual patterns of words with the accent on the initial syllable were always distinct. The results suggest a two-way contrast in productions of the speakers, possibly, due to reanalysis. The individual variation observed in this small-scale study raises a question about the place of variation in the description of phonological tone contrasts.\n",
    "Index Terms: pitch-accent contrast, Tokyo Japanese, final-accented and unaccented, neutralization, production, reanalysis.\n",
    ""
   ]
  },
  "carpes14_tal": {
   "authors": [
    [
     "Daise Ribeiro",
     "Carpes"
    ],
    [
     "Juan Manuel",
     "Sosa"
    ],
    [
     "Izabel Christine",
     "Seara"
    ]
   ],
   "title": "Perception of tonal contrasts of non-exhaustivity in Brazilian Portuguese: an experimental study",
   "original": "tl14_108",
   "page_count": 4,
   "order": 30,
   "p1": "108",
   "pn": "111",
   "abstract": [
    "In this paper we discuss the perception of tonal contrasts of non-exhaustivity in Brazilian Portuguese in the interface prosody-semantics-pragmatics. In previous work on the production of F0 contours of utterances with non-exhaustive, exhaustive and contrastive foci [1], which was based on the speech of Florianópolis, eight subjects were asked to respond to three different situations designed to elicit the three foci. That production experiment tested whether the comprehension of non-exhaustive, exhaustive and contrastive foci is purely pragmatic in conversation, or if prosody, namely the tonal structure of the sentences, has a crucial role in this process. The results revealed that non-exhaustive focus is expressed by means of specific intonational contours, but also that the pitch curves with either exhaustive or contrastive focus seem to have a very similar intonational shape; for this reason these other foci would need lexical markers like ‘only’ and ‘not’. On the basis of those production results, the current paper addresses the question of whether and how intonation can direct the interpretation by listeners exposed to utterances with non-exhaustive focus, comparing these intonational contours with those of utterances with exhaustive and contrastive foci. With this purpose, two perceptual tests are carried out with twelve listeners. They ratified the proposed prosodic encodings of the types of foci under scrutiny in the tonal aspects of these foci, but not with respect to the relative duration of the syllables that make up the intonational nucleus of the sentences that have been analysed. The first perception test had the aim of verifying whether the tonal patterns identified as the most recurrent for each one of the foci under study would be so interpreted by the listeners; the second one has the aim of verifying timing, duration and pitch range issues. The results of the perception tests has revealed that there is a specific F0 curve that characterizes perceptually the non-exhaustive focus, described as a low prenucleus (L*), and a rising-falling nucleus (¡H*L%). These results have also revealed some effects with respect to the relative duration of the unstressed syllables as compared with the stressed one in the nuclear region of the utterances. Regarding the pitch contour distinction between non-exhaustive and contrastive foci, we identified a significant and systematic increase in the pitch height of the non-exhaustive focus, which suggests that pitch range is at least one of the parameters that characterizes and distinguishes the non-exhaustivity tonal design.\n",
    "",
    "",
    "Carpes, D. R., Sosa, J. M., Seara, I. C., “Experimento de produção sobre a prosódia da não exaustividade no português brasileiro”, in Revista Leitura, n. 51, 2014 (in press).\n",
    "",
    "",
    "Index Terms: tone, intonation, production, perception, Brazilian Portuguese.\n",
    ""
   ]
  },
  "perkins14_tal": {
   "authors": [
    [
     "Jeremy",
     "Perkins"
    ]
   ],
   "title": "Non-local consonant-tone interaction in Thai",
   "original": "tl14_112",
   "page_count": 4,
   "order": 31,
   "p1": "112",
   "pn": "115",
   "abstract": [
    "This paper presents a phonological account of consonant-tone sequence restrictions in Thai, positing a pair of new constraints, *[+CG]-[H]ì2 and LIC-T-Rt. *[+CG]-[H]ì2 restricts sequences of consonants and tones non-locally, referring instead to the notion of “head mora” of a syllable. LIC-T-Rt prefers a single tone to be right-aligned rather than left-aligned. Previous phonological accounts assumed that only high tone is banned following [+Constricted Glottis] ([+CG]) onsets in CV: syllables. However, new evidence based on a quantitative lexical analysis has shown that sequences of [+CG] consonants followed by rising tone do not occur in CV: syllables in Thai. High and rising tone both contain late H targets phonetically, and so a new restriction is posited where [+CG] onsets are banned preceding H tone, only when the H tone is linked to the second mora within the syllable. This constraint is motivated since late tonal targets are cross-linguistically preferred over early ones. The constraint, LIC-T-Rt, embodies this late tonal preference by exerting a preference to be right-aligned. The consonanttone restriction can thus be viewed as a case where the syllable’s tonal value is carried by the second mora, which acts as the “head” mora for the syllable.\n",
    "Index Terms: tone, Thai, Optimality Theory, consonant-tone interaction\n",
    ""
   ]
  },
  "chen14b_tal": {
   "authors": [
    [
     "Zhongmin",
     "Chen"
    ]
   ],
   "title": "On the relationship between tones and initials of the dialects in the shànghãi area",
   "original": "tl14_116",
   "page_count": 4,
   "order": 32,
   "p1": "116",
   "pn": "119",
   "abstract": [
    "This five-part study is an analysis of the relationship between tones and initials in the dialects of the Shànghãi area. Part one addresses the general relationship between tones and initials. Part two discusses the nature of voiceless stops followed by vowels with breathy phonation and the relationship between the stops and tones. Part three addresses the influence of aspirated stops on tones. Part four discusses the nature and distribution of the pre-glottalized stops and the influence of pre-glottalized stops on tones. Part five is a conclusion.\n",
    "Index Terms: Initial, Tone, Breathy phonation, Aspirated tone, Pre-glottalized stop\n",
    ""
   ]
  },
  "yang14c_tal": {
   "authors": [
    [
     "Li-chiung",
     "Yang"
    ]
   ],
   "title": "Tonal ambiguity in Mandarin",
   "original": "tl14_120",
   "page_count": 5,
   "order": 33,
   "p1": "120",
   "pn": "124",
   "abstract": [
    "Variation in tone fundamental frequency in Mandarin has long attracted intensive research focusing on the underlying factors that affect tonal shape. The current paper focuses on tone F0 shape different modes of speech and presents our results delineating the diversity of tonal F0 contour and how contextual elements affect realized tone shape in an acoustic environment with high variance of tonal shape. The current paper compares prosodic realizations of Mandarin tones in different speech modes, focusing on Tone 1 and Tone 4 to explore the tonal variability and the degree of F0 contour overlap. Our results find substantial overlap between these two tones among speakers and across different modes of speech. We identify several determinants of divergence and adherence to tonal defined shapes, and further find that speech mode is a critical element in acoustic ambiguity and in the degree of tonal F0 contour overlap in spoken Mandarin.\n",
    "Index Terms: Tone, prosody, Mandarin, tonal variability, spontaneous speech, tonal ambiguity\n",
    ""
   ]
  },
  "lyu14_tal": {
   "authors": [
    [
     "Shao-ren",
     "Lyu"
    ],
    [
     "Ho-hsien",
     "Pan"
    ]
   ],
   "title": "Tone merging in Hailu Hakka: a production study",
   "original": "tl14_125",
   "page_count": 4,
   "order": 34,
   "p1": "125",
   "pn": "128",
   "abstract": [
    "Tone merging and tonal confusion have been an interesting issue for a long time. This paper tries to investigate whether there is the phenomenon of merging tone in Hailu Hakka production. We focus on sandhi related tone pairs and level tone pairs. The results show that tone 24 and tone 33 is undergoing a sound change of merging in the younger speakers. It is proposed that both allophonic rules and acoustic similarity contribute to the merging tone 24 and 33. Index Terms: tone, merging, Hakka, sandhi, production, allophonic rule, acoustic similarity\n",
    ""
   ]
  },
  "jia14_tal": {
   "authors": [
    [
     "Yuan",
     "Jia"
    ]
   ],
   "title": "Tonal and sandhi patterns of shandong dialects",
   "original": "tl14_129",
   "page_count": 5,
   "order": 35,
   "p1": "129",
   "pn": "133",
   "abstract": [
    "The present study adopts phonetic experiment to systematically investigate the citation tone and tone sandhi patterns of Liaocheng and Taifan dialect. It aims to provide empirical data for the theoretical analysis and explore the diversities of tonal phenomenon within Shandong (Hereinafter, as SD) dialect. Results demonstrate that both of these two dialects have four citation tones, i.e., Tone 1(14), Tone2 (51), Tone3 (55), and Tone4 (35) in Liaocheng dialectGTone 1(14), Tone2 (51), Tone3 (55), and Tone4 (213) in Taifan dialect. Due to the difference of Tone4 between these two dialects, Taifan dialect exhibits more kinds of tone sandhi patterns than Liaocheng dialect. This result lies in the devious tone4 in Taifan dialect which triggers more tonal variations in disyllabic sequences.\n",
    "Index Terms: SD dialect, Liaocheng dialect, Taifan dialect, citation tone, Tone sandhi\n",
    ""
   ]
  },
  "westera14_tal": {
   "authors": [
    [
     "Matthijs",
     "Westera"
    ]
   ],
   "title": "Grounding topic and focus in biological codes",
   "original": "tl14_134",
   "page_count": 4,
   "order": 36,
   "p1": "134",
   "pn": "137",
   "abstract": [
    "A compositional theory of English intonational meaning is presented that is derived from Gussenhoven’s [1] biological codes. The resulting theory is compared to the more top-down approaches to focus and contrastive topic in the literature, suggesting how such stipulated semantic/pragmatic notions as ‘alternative’ and ‘strategy’ can be grounded – and revealing how they might be amended.\n",
    "",
    "",
    "Gussenhoven, C. (2004). The phonology of tone and intonation. Cambridge: Cambridge University Press.\n",
    "",
    "",
    "Index Terms: Intonational meaning, biological codes, pragmatics, topic and focus.\n",
    ""
   ]
  },
  "ambrazaitis14_tal": {
   "authors": [
    [
     "Gilbert",
     "Ambrazaitis"
    ],
    [
     "Johan",
     "Frid"
    ]
   ],
   "title": "F0 peak timing, height, and shape as independent features",
   "original": "tl14_138",
   "page_count": 5,
   "order": 37,
   "p1": "138",
   "pn": "142",
   "abstract": [
    "A considerable amount of evidence from several intonation languages (e.g., German, English, Italian) supports the idea that F0 peak timing, height, and shape variables form a feature bundle, which is used to encode two-fold intonational (e.g., sentence-level) pitch accent distinctions such as L+H* vs. L*+H. The three types of features in the bundle can be weighted differently but the outcome seems to be functionally equivalent. In this sense, they are ‘substitute phonetic features’. This paper presents data from two distinct prosodic dialect types of Swedish, a pitch-accent language, suggesting that these F0 variables can also be used independently of each other in order to encode two different contrasts (i.e., a three-fold contrast), each of which phonetically and functionally related to the L+H* vs. L*+H distinction in an intonation language. For Central Swedish, we observe two peak raising strategies which go along with differently shaped rises: ‘extending’ (= faster rise) and ‘shifting’ (= slower rise), which tend to be used to signal ‘speaker-related’ emphasis (e.g., ‘surprise’) or ‘messagerelated’ emphasis (e.g., ‘correction’), respectively. For Southern Swedish, we observe an ‘extended’ peak and an ‘extended and delayed’ peak.\n",
    "Index Terms: Intonation, prosody, focal accent, word accent, Swedish, emphasis, paralinguistic\n",
    ""
   ]
  },
  "yiu14_tal": {
   "authors": [
    [
     "Suki S. Y.",
     "Yiu"
    ]
   ],
   "title": "Tone Spans of Cantonese English",
   "original": "tl14_143",
   "page_count": 4,
   "order": 38,
   "p1": "143",
   "pn": "146",
   "abstract": [
    "This paper examines the newly developed tones in Cantonese English, with a particular interest in the tones spanning across syllables. It attempts to provide phonetic evidence for the tone spans and demonstrate the association of tones to syllables.   Audio-recording data elicited from six speakers of Cantonese English was processed with Praat, and then fitted to a smoothing spline analysis of variance with R to generate smoothing splines at 95% confidence intervals for determining if the the tones in different positions of a word are significantly different from each other. Pitch tracks of tones in individual words were also generated for a detailed examination of the tone contours of the tone spans.   Results showed that the realization of different tones was restricted by the position of the syllables in a word. Those tones are significantly different from each other. H spans, Ø spans and M spans were discussed and illustrated with tonal associations.\n",
    "Index Terms: tone, tone spans, Cantonese English, Hong Kong English\n",
    ""
   ]
  },
  "li14_tal": {
   "authors": [
    [
     "Jingwen",
     "Li"
    ],
    [
     "Robert Bo",
     "Xu"
    ],
    [
     "Peggy",
     "Mok"
    ]
   ],
   "title": "Effect of orthography on L2 production of Mandarin tones",
   "original": "tl14_147",
   "page_count": 5,
   "order": 39,
   "p1": "147",
   "pn": "151",
   "abstract": [
    "L2 production of tones has been widely discussed; however, the role of orthography in the learning process has received little attention. Previous studies suggested that the opaque orthography of Chinese characters plays an important role in both L2 production and perception. The present study further investigates the role of different orthographies (Pinyin vs. Chinese characters) in L2 production of Mandarin tones. Monosyllabic and disyllabic words were used as the test materials. The subjects were divided into two groups: high proficiency and low proficiency. The results showed that among the subjects of low language proficiency, Chinese character helps with L2 tone production; while among the subjects of high language proficiency, the effects of Chinese character and pinyin are comparable in L2 tone production. T2 and T3 have a very high chance to be confused across all the subjects, regardless of orthographies.\n",
    "Index Terms: orthography; L2 tone production; Mandarin; Cantonese\n",
    ""
   ]
  },
  "wu14_tal": {
   "authors": [
    [
     "Junru",
     "Wu"
    ],
    [
     "Yiya",
     "Chen"
    ]
   ],
   "title": "Tonal variants in the bilingual mental lexicon",
   "original": "tl14_152",
   "page_count": 4,
   "order": 40,
   "p1": "152",
   "pn": "155",
   "abstract": [
    "Bilinguals of Jinan Mandarin and Standard Chinese (SC) produce different tonal variants of the same Jinan word. These words typically share the same segmental composition as their SC counterparts. Among the tonal variants, usually only one variant is identical to the tonal contour of the SC counterpart (variant_id). The word-wise probability of variant_id varies between 0 and 1. Naming latency data were elicited for 400 Jinan words from 42 speakers to test how speakers of Jinan store the tonal variants, in particular, whether those who produce the variant_id might also store the tonally non identical variant (variant_ni) which they do not produce. We hypothesize that if a speaker who produces the variant_id does not store the unproduced variant_ni, the naming latency should only depend on the speaker’s choice of variant_id (yes/ no) and not on the word-wise probability of variant_id. On the other hand, if a speaker who produces the variant_id does store the unproduced variant_ni, the naming latency should depend on the word-wise probability of the speaker’s chosen variant. Our results provide support to the latter storage account.\n",
    "Index Terms: tone, production, metal lexicon\n",
    ""
   ]
  },
  "bin14_tal": {
   "authors": [
    [
     "Li",
     "Bin"
    ],
    [
     "Shao",
     "Jing"
    ]
   ],
   "title": "Development of sensitivity to tone correlates by learners of Mandarin",
   "original": "tl14_156",
   "page_count": 4,
   "order": 41,
   "p1": "156",
   "pn": "159",
   "abstract": [
    "This study examined how Vietnamese learners of Mandarin who varied in their learning experience perceived synthesized Mandarin tones. We aimed to assess whether and how learners’ sensitivity to tonal correlates is commensurate with their knowledge and experience in the target language. 60 Vietnamese learners of Mandarin in Hanoi, and native speakers of Mandarin, were recruited to participate in tone identification tasks. As expected, Mandarin speakers scored the highest among all groups of listeners. More advanced Vietnamese listeners performed better than inexperienced ones and the response patterns were resemble to the native Mandarin speakers. Results also suggest that experience in Mandarin interacted significantly with certain tonal correlate.\n",
    "Index Terms: Mandarin tone, Vietnamese, tone perception, development\n",
    ""
   ]
  },
  "kaland14_tal": {
   "authors": [
    [
     "Constantijn",
     "Kaland"
    ],
    [
     "Marie",
     "Postma-Nilsenová"
    ]
   ],
   "title": "Sound symbolic effects of intrinsic pitch and intrinsic intensity in Dutch vowels",
   "original": "tl14_160",
   "page_count": 4,
   "order": 42,
   "p1": "160",
   "pn": "163",
   "abstract": [
    "Listeners associate certain vowels and consonants with specific meanings, known as phonetic/sound symbolism. For example, the vowel /i/ is often associated with small, thin and more female entities compared to the vowel /ɑ/. Sound symbolism studies so far mainly focused on the effects of intrinsic pitch (F0) of vowels while no research has taken other intrinsic properties, such as intensity, into account. The present research investigates the effect of both intrinsic pitch and intrinsic intensity, which can be directly linked to vowel articulation, on perceptual associations. To this end a production task and a perception experiment have been carried out. The production task elicits read-aloud vowels from which measurements of intrinsic pitch and intrinsic intensity were taken. Results of an articulatory analysis on these measures show that intrinsic pitch and intrinsic intensity correlate negatively. Using a subset of the elicited vowels in the production task, the subsequent perception experiment investigated the effects of intrinsic pitch and intrinsic intensity on associated meanings. Results show that both intrinsic properties contribute to sound symbolism with intrinsic pitch being a stronger cue than intrinsic intensity.\n",
    "Index Terms: Intrinsic Pitch, Intrinsic Intensity, Phonetic Symbolism, Sound Symbolism, Articulation\n",
    ""
   ]
  },
  "lee14b_tal": {
   "authors": [
    [
     "Albert",
     "Lee"
    ],
    [
     "Yi",
     "Xu"
    ],
    [
     "Santitham",
     "Prom-on"
    ]
   ],
   "title": "Modeling Japanese F0 contours using the PENTAtrainers and AMtrainer",
   "original": "tl14_164",
   "page_count": 4,
   "order": 43,
   "p1": "164",
   "pn": "167",
   "abstract": [
    "This study is a user report on modeling and predicting the F0 contour of Japanese utterances with PENTA Model and AM Theory. Through a 2640-word corpus of Japanese, the two models were compared using two versions of PENTAtrainer, as well as newly developed AMtrainer, respectively. The respective modelling and synthesis accuracies of different models are discussed with reference to the type of input they require. The satisfactory results achieved by these tools demonstrate their potential in offering a fair and direct comparison between the two models. We call for more collaborative effort in comparative modeling to achieve this goal.\n",
    "Index Terms: AM Theory, PENTA Model, Pitch accent\n",
    ""
   ]
  },
  "postmanilsenova14_tal": {
   "authors": [
    [
     "Marie",
     "Postma-Nilsenová"
    ],
    [
     "Eric",
     "Postma"
    ],
    [
     "Yu",
     "Gu"
    ]
   ],
   "title": "No effect of language experience on spectral/fundamental listener type distribution: a comparison of Chinese and Dutch",
   "original": "tl14_168",
   "page_count": 4,
   "order": 44,
   "p1": "168",
   "pn": "171",
   "abstract": [
    "Individual listeners differ in their capacity to process complex tones. Past studies suggest that the distribution of listener types, though partly genetically determined, might also depend on the linguistic environment. Listeners raised in a tonal language may be more sensitive to perceive F0 changes both in music and speech, due to their vocal experience. Using the missing fundamental task, an earlier study by Ladd et al. (2013) found no differences between English and Chinese listeners, but did not take into account the potentially confounding effect of combination tones that arise in the cochlea. This study determines the listener-type distributions of Dutch and Chinese individuals while employing masking noise to suppress the perception of combination tones. The results show no differences in listenertype distribution in groups of Dutch and Chinese listeners. Simulations performed with a tonal and non-tonal memory-based computational model of pitch perception reveal that in both types of languages the fundamental listening mode is dominant.\n",
    "Index Terms: Tone, listener type, perception\n",
    ""
   ]
  },
  "toneli14_tal": {
   "authors": [
    [
     "Priscila Marques",
     "Toneli"
    ],
    [
     "Marina",
     "Vigário"
    ],
    [
     "Maria Bernadete M.",
     "Abaurre"
    ]
   ],
   "title": "Distinguishing emphatic and prosodic word initial stresses: evidence from Brazilian Portuguese",
   "original": "tl14_172",
   "page_count": 5,
   "order": 45,
   "p1": "172",
   "pn": "176",
   "abstract": [
    "In European Portuguese (EP), emphatic stress and initial stress have been reported to be optionally assigned to the first (or in some cases the second) syllable of a Prosodic Word (PW) [1]. In Brazilian Portuguese (BP), initial stress (and/or H-tone) has been claimed to be assigned with reference to the primary stress position and be dependent on the number of pretonic syllables within a PW [2]. [3], [4] and [5] suggest that in BP secondary stress assignment essentially signals the beginning of the PW in emphatic contexts, however. Although [5] reports that in emphatic contexts the initial stress and the ‘H-tone’ can coincide with a secondary stress, the nature of this type of stress and the difference between emphatic stress and PW initial stress in BP is in general not discussed. In this paper we argue that, although the two types of stresses in BP are tonally signaled, they are distinct, both in function and in distribution. Empirical data from two varieties of Portuguese spoken in Brazil (Paraná and Minas Gerais states) are presented, showing that the emphatic stress has a wider distribution than the initial stress, in neutral contexts. The emphatic stress may occur in any syllable from the stressed syllable leftwards, within the PW, including the syllable immediately adjacent to word-stress. The initial stress, by contrast, is found on the first or second pretonic syllable of PW, and there is a minimal distance of two syllables between initial stress and word-stress (e.g. governaDOres ‘governors’) [2]. We argue that the initial stress is an edge phenomenon, marking PW initial positions, unlike the emphatic stress. In both cases, the tonal association is evidence for the PW domain in BP, because neither type of stress exceeds the limits of this domain (i.e., none of them can appear in post-tonic syllables of non-final PW).\n",
    "s Vigário, M. “The Prosodic Word in European Portuguese”. Berlin/New York: Mouton de Gruyter, 2003. Frota, S. & Vigário, M., “Aspectos de prosódia comparada: ritmo e entoação no PE e no PB”, in R. V. Castro & P. Barbosa (Eds.), Actas do XV Encontro Nacional da Associação Portuguesa de Linguística, vol. 1, 533-555, Coimbra: APL, 2000. Abaurre, M. B. & Galves, C., “As diferenças rítmicas entre o Português Europeu e o Português Brasileiro: Uma Abordagem Otimalista e Minimalista”, DELTA - Revista de Documentação de Estudos em Lingüística Teórica e Aplicada. São Paulo, 14 (2), 377-403, 1998. Abaurre, M. B. & Fernandes-Svartman, F. R., “Secondary stress, vowel reduction and rhythmic implementation in Brazilian Portuguese”, in L. Bisol e C. R. Brescancini (Eds.), “Contemporary Phonology in Brazil, 54-83, Newcastle: Cambridge Scholars Publishing, 2008. Fernandes, F. R., “Acento secundário, atribuição tonal e ênfase em português brasileiro (PB)”, Estudos Lingüísticos (São Paulo), 38, 47-58, 2009.\n",
    "",
    "",
    "Index Terms: Initial Stress, Emphatic Stress, Brazilian Portuguese, Prosodic Word, Tonal Association\n",
    ""
   ]
  },
  "kohnlein14_tal": {
   "authors": [
    [
     "Björn",
     "Köhnlein"
    ]
   ],
   "title": "Pitch accents in Uspanteko: a metrical approach",
   "original": "tl14_177",
   "page_count": 4,
   "order": 46,
   "p1": "177",
   "pn": "180",
   "abstract": [
    "Uspanteko, a Mayan language spoken in Guatemala, shows a remarkably rich interaction between the location of stress, vowel quality and pitch accent / tone. An elaborate description of the patterns has recently been provided in [1], including a detailed phonological analysis. While acknowledging the elaborate argumentation underlying the analysis, this paper argues that there is one incorrect basic assumption in the approach advertised in [1], viz. that Uspanteko has lexical tone. Instead, I propose that both the tonal contrasts as well as the interactions with vowel quality derive from contrastive foot structure in the underlying representation. One consequence of the approach is that the tonal surface differences derive solely from the mapping of intonational tones, a prominence tone H* and a word-final boundary tone L; no tonal information is stored in the lexicon. As I show, the foot-based approach significantly simplifies the analysis and avoids some problematic assumptions that emerge under the tonal approach. From a broader perspective, the analysis contributes to an ongoing discussion on the phonological nature of tone accent oppositions, e.g. in Franconian and Scandinavian.\n",
    "",
    "",
    "Bennett, R. and Henderson, R., \"Accent in Uspanteko\", Natural Language and Linguistic Theory, 31(3):589-645, 2013.\n",
    "",
    "",
    "Index Terms: lexical tone, intonation, foot structure, stress\n",
    ""
   ]
  },
  "lan14_tal": {
   "authors": [
    [
     "Yizhou",
     "Lan"
    ],
    [
     "Sunyoung",
     "Oh"
    ]
   ],
   "title": "The effect of Mandarin tone on the perception and production of English consonant clusters",
   "original": "tl14_181",
   "page_count": 4,
   "order": 47,
   "p1": "181",
   "pn": "184",
   "abstract": [
    "The present study investigates the effect of language-specific features of L1 on the acquisition of L2. It is intended to show how English initial clusters are produced and perceived by Chinese advanced learners whose language does not allow clusters. Previously we found that Chinese advanced learners would simplify the syllable structure of the English clusters: Cantonese, a southern dialect, speakers delete or substitute one consonant whereas Mandarin, a northern dialect, speakers add a vowel. The present paper is to further analyze the acoustic properties of the inserted vowel in the productions of Mandarin speakers and compare them with those of a schwa. In addition, the paper aims to show the perceptual difference between native English speakers and Mandarin speakers. In the production study, minimal pairs contrasting an r-cluster and a schwa, such as /prit/ and /p.rit/, were collected from five advanced learners of English. Vowel part of the stimuli was extracted and analyzed for formants (F1, F2), pitch, and duration. The inserted vowel part in the clusters was significantly different from a schwa (p<.0001): it was shorter in duration and lower in pitch compared to the latter. Findings suggest that the Chinese learners of English use supra-segmental features to differentiate English syllable structure. The same production data were used in the perception study. Categorical perception tests under three conditions, namely, raw data, normalized duration, and normalized pitch, were given to each of the five native speakers of English and Mandarin Chinese to see whether they perceive the clusters with the inserted vowel differently. Results show a noticeable contrast between the language groups. While the English speakers failed to distinguish the clusters with the inserted vowel from the words with a schwa, the Chinese speakers were able to identify and discriminate the clusters with the high accuracy rate. The accuracy rate by the Chinese speakers, however, dropped drastically from 73-88% to below 50% when pitch was normalized to a level tone. Manipulations had no effect on the perceptions of the vowels by the native English speakers. Based on the experiments, the study suggests that the Mandarin speakers, even at the advanced level, rely on the L1 syllable structure and accommodate the English clusters to the Chinese syllable structure by adding a vowel with a low tone. This could indicate that the tone in Mandarin plays a large role as it is used to add functional meanings in the L2 acquisition. The study also supports the attention-based learning that L2 learning is kin to the salient features of L1.\n",
    "Index Terms: L2 acquisition, English consonant clusters, tonal effect, Mandarin tone.\n",
    ""
   ]
  },
  "yang14d_tal": {
   "authors": [
    [
     "Bei",
     "Yang"
    ],
    [
     "Nuoyi",
     "Yang"
    ]
   ],
   "title": "A preliminary study of tonal influence on weak syllables in Mandarin",
   "original": "tl14_185",
   "page_count": 4,
   "order": 48,
   "p1": "185",
   "pn": "188",
   "abstract": [
    "This study explores the weak syllable in disyllabic Mandarin words, including its location and difference from the full syllable, and whether the internal structure influences the degree of the syllable’s weakness. In what follows, we examine tonal variations of a disyllabic word’s affix and root. We use ANOVA and t-test to compare the tonal contours carried by semantically opaque and transparent affixes, and their counterpart roots. We also employ t-test to compare tonal duration. Our results indicate that there are some differences between full and weak syllables and that the weak syllable is located in the second syllable with regards to tonal contours. We also find that internal structure may be another factor influencing weak syllables.\n",
    "Index Terms: tone, disyllabic word, weak syllable\n",
    ""
   ]
  }
 },
 "sessions": [
  {
   "title": "Keynote Papers",
   "papers": [
    "kubozono14_tal",
    "wong14_tal",
    "dicanio14_tal",
    "heuven14_tal"
   ]
  },
  {
   "title": "Contributed Papers",
   "papers": [
    "mathes14_tal",
    "remijsen14_tal",
    "gope14_tal",
    "mckendry14_tal",
    "meyase14_tal",
    "ouattara14_tal",
    "hamlaoui14_tal",
    "yang14_tal",
    "cheng14_tal",
    "yu14_tal",
    "hoffmann14_tal",
    "ou14_tal",
    "yang14b_tal",
    "tronnier14_tal",
    "zhou14_tal",
    "hao14_tal",
    "kugler14_tal",
    "xu14_tal",
    "lee14_tal",
    "chen14_tal",
    "liu14_tal",
    "landgraf14_tal",
    "kelly14_tal",
    "torreira14_tal"
   ]
  },
  {
   "title": "Poster Sessions",
   "papers": [
    "shport14_tal",
    "carpes14_tal",
    "perkins14_tal",
    "chen14b_tal",
    "yang14c_tal",
    "lyu14_tal",
    "jia14_tal",
    "westera14_tal",
    "ambrazaitis14_tal",
    "yiu14_tal",
    "li14_tal",
    "wu14_tal",
    "bin14_tal",
    "kaland14_tal",
    "lee14b_tal",
    "postmanilsenova14_tal",
    "toneli14_tal",
    "kohnlein14_tal",
    "lan14_tal",
    "yang14d_tal"
   ]
  }
 ]
}