{
 "title": "6th International Symposium on Tonal Aspects of Languages (TAL 2018)",
 "location": "Berlin, Germany",
 "startDate": "18/6/2018",
 "endDate": "20/6/2018",
 "URL": "http://public.beuth-hochschule.de/~mixdorff/tal2018/",
 "chair": "Chair: Hansjörg Mixdorff",
 "conf": "TAL",
 "year": "2018",
 "name": "tal_2018",
 "series": "TAL",
 "SIG": "SProSIG",
 "title1": "6th International Symposium on Tonal Aspects of Languages",
 "title2": "(TAL 2018)",
 "date": "18-20 June 2018",
 "booklet": "tal_2018.pdf",
 "papers": {
  "dichter18_tal": {
   "authors": [
    [
     "Benjamin",
     "Dichter"
    ]
   ],
   "title": "Using ECoG to understand the representation of vocal pitch in humans",
   "original": "abs1",
   "page_count": 1,
   "order": 1,
   "p1": 1,
   "pn": 1,
   "abstract": [
    "The flexible control of vocal pitch during speech production and the perception of pitch during listening are fundamental aspects of human oral communication. Intonation patterns created by changing vocal pitch are a rich source of information for conveying and understanding meaning. Still, it is currently unknown how the brain generates the complex laryngeal motor commands that allow for prosody or how listeners are able to perceive it. Here, we used direct high-density cortical recordings from the human brain to determine the encoding mechanisms of vocal pitch control during natural speech production. We found neural activity at electrodes over the dorsal laryngeal motor cortex (dLMC) that was highly selective to vocal pitch encoding, but not for other features in speech articulation. Using a computational model of vocal pitch contours, we found that neural activity at a subset of dLMC electrodes was selective for producing pitch accents, but distinct from those that encoded voicing. The same neural populations showed similar pitch encoding in a non-speech singing task, suggesting a general control mechanism. Finally, we confirmed the causal, feed-forward involvement of dLMC in pitch production by using direct cortical stimulation to evoke laryngeal electromyographic responses and vocalizations. Together, these results reveal a neural basis for the voluntary control of vocal pitch in human speech.\n",
    "When listening to speech, humans understand prosodic patterns across a variety of sentences, speakers, and vocal ranges. In order to investigate how prosodic patterns are perceived during listening, we synthesized sentences that varied across speaker gender, emphasis pattern, and syllabic content. In the superior temporal gyrus, interspersed among electrodes representing syllabic/phonemic information, we found electrodes that encoded absolute pitch as well as electrodes that encoded relative pitch. Most electrodes were remarkably specific in which of the three features it encoded. The separation of representation provides a key insight into how the human brain processes speech prosody.\n",
    "Dr. Benjamin K Dichter studied under Dr. Edward Chang at UCSF, using electrocorticography in humans to uncover the neural mechanisms of speech production and perception. He is an NSF GRFP fellow, and received his PhD from the UC Berkeley - UCSF Joint Program in Bioengineering in 2017. Dr. Dichter recently joined the lab of Dr. Ivan Sotlesz at Stanford as a data scientist."
   ]
  },
  "kula18_tal": {
   "authors": [
    [
     "Nancy",
     "Kula"
    ]
   ],
   "title": "Tonal patterns and phonological processing in Bantu",
   "original": "abs2",
   "page_count": 1,
   "order": 14,
   "p1": 61,
   "pn": 61,
   "abstract": [
    "The talk will investigate High tone spreading patterns in two dialects of Bemba (central Bantu) contrasting differences in bounded and unbounded spreading. Two contrasting patterns of binary versus ternary spread will be illustrated, focusing on how these interact with the OCP and downstep. The talk further presents results of a perception experiment that investigates the perceptual robustness of the tonal patterns discussed to test whether speakers can distinguish binary, ternary and unbounded spreading, shedding some light on the status of derived tones in contrast to lexical tones.\n",
    "Nancy C. Kula is professor of Linguistics in the department of Language and Linguistics at the University of Essex. She did her PhD at the University of Leiden, The Netherlands on the phonology of Bemba. Her research focuses on Bantu Languages where she primarily works on phonology and the phonology-syntax interface, but has also worked on various aspects of Bantu morphosyntax. She has published on a range of topics in various international journals and is co-editor of the Bloomsbury Companion to Phonology (2013)."
   ]
  },
  "kugler18_tal": {
   "authors": [
    [
     "Frank",
     "Kügler"
    ]
   ],
   "title": "Intonation in tone languages",
   "original": "abs3",
   "page_count": 1,
   "order": 19,
   "p1": 82,
   "pn": 82,
   "abstract": [
    "In this talk I will focus on the issue of how much and which kind of intonation is found in a tone language. Phonological tone has F0 as its phonetic correlate to manifest lexical and/or grammatical distinctions in a tone language. F0, among duration and intensity, is also the most important correlate of intonation. So the general question is how much F0 is 'left over' in a tone language to signal pragmatic meaning usually expressed by intonation in a non-tone language. I will discuss the prosodic expression of focus and the prosodic expression of sentence mode as two core areas of pragmatic meaning conveyed by intonation.\n",
    "Frank Kügler holds currently a Heisenberg research fellowship from the German Research Foundation (DFG). He is affiliated with the Phonetics Institute at Cologne University, Germany. He received his Ph.D. degree from Potsdam University, Germany, in 2005. He then continued at Potsdam University as a postdoc and assistant professor. In 2017, he replaced the chair of phonology at Goethe University of Frankfurt, Germany. His research is primarily on prosody, studying tone and intonation from a cross-linguistic and typological perspective. Among others he investigates different linguistic factors such as syntax and information structure that influence the tonal realization and the phonological representation of tones in tone languages and non-tone (intonation) languages. He worked on typologically diverse languages such as German, Czech, Swedish, Hindi, Yucatec Maya, Mandarin Chinese, Akan, and Tswana."
   ]
  },
  "vainio18_tal": {
   "authors": [
    [
     "Martti",
     "Vainio"
    ]
   ],
   "title": "Tone and quantity: the psychoacoustic trade-offs in prosodic signaling",
   "original": "abs4",
   "page_count": 1,
   "order": 31,
   "p1": 139,
   "pn": 139,
   "abstract": [
    "Many languages exploit suprasegmental devices in signaling word meaning. Tone languages exploit fundamental frequency whereas quantity languages rely on segmental durations to distinguish otherwise similar words. Traditionally, duration and tone have been taken as mutually exclusive. However, some evidence suggests that, in addition to durational cues, phonological quantity is associated with and co-signaled by changes in fundamental frequency in quantity languages such as Finnish, Estonian, and Serbo-Croatian. It is also known that the fundamental frequency of a complex sound modulates the perceived duration of a sound. Higher pitch sounds are perceived longer compared to lower pitch sounds as shown by several independent studies since 1973. In my talk I will present a series of experiments that explore the interactions between tonal features of speech and both temporal and energy based features, and the ways these trade-offs are used to signal both phonological and functional aspects of language. Our research ranges from production studies to measuring complex auditory brainstem responses using participants from several different language groups.\n",
    "Professor Martti Vainio is the head of the Phonetics and Speech Synthesis Research Group and the Department of Digital Humanities at the University of Helsinki. Before his professorship prof. Vainio workded as a university lecturer in the discipline of language technology at the Department of Linguistics at the University of Helsinki. After that he held a Finnish Academy Fellowship and worked on emotional speech synthesis. He has also worked at the Aalto University and is currently collaborating with Academy Professor Paavo Alku on statistical speech synthesis. In addition to basic scientific research on speech he has been working on speech synthesis actively for more than twenty years. His doctoral dissertation examined the use of artificial neural networks in controlling prosody in text-to-speech synthesis. He has published more than a hundred papers on phonetics and speech synthesis research and is a former board-member of the board of the ISCA special interest group on speech synthesis (SynSIG). Prof. Vainio has been a principal investigator in several Finnish Academy and privately funded projects and has taken part in international projects with the Simple4All synthesis project coordinated by the University of Edinburgh being the latest. His most important research links are with Aalto University and the Center of Speech Technology Research at the University of Edinburgh."
   ]
  },
  "kuo18_tal": {
   "authors": [
    [
     "Grace",
     "Kuo"
    ]
   ],
   "title": "The disambiguation of the tonally identical sentences",
   "original": "29",
   "page_count": 5,
   "order": 33,
   "p1": 145,
   "pn": 149,
   "abstract": [
    "In this study, we present a sentence gating paradigm to\nexamine Taiwanese listeners’ use of prosodic phrasing to\ninterpret ambiguous sentences. The correspondence between\nthe phonetic attributes of the prosodic structures and the\nlisteners’ choice scores and confidence ratings in the gating\ntask are also analyzed. The results show that sentences were\ndisambiguated only at the disambiguation points and the most\nsalient cues were final lengthening and final pitch declination.\nMultiple linear regressions further show that listeners used not\nonly duration and f0 measures but also voice quality to make\ntheir judgments.\nIndex Terms: prosodic cues, sentence disambiguation, gating\nparadigm"
   ],
   "doi": "10.21437/TAL.2018-29"
  },
  "hualde18_tal": {
   "authors": [
    [
     "Jose Ignacio",
     "Hualde"
    ],
    [
     "Ander",
     "Beristain"
    ]
   ],
   "title": "Acoustic correlates of word-accent in Basque",
   "original": "20",
   "page_count": 5,
   "order": 23,
   "p1": 98,
   "pn": 102,
   "abstract": [
    "Basque dialects differ substantially in their accentual properties. Previous work has focused mainly on phonological aspects of this prosodic diversity, such as the systems of rules for accent assignment. Less attention has been paid to variation in the acoustic realization of word-accent. Here we examine the realization of lexical accentual prominence in three different local varieties, which represent the three main Basque prosodic types: Azpeitia (in Gipuzkoa), Ondarroa (Northern Bizkaia) and Goizueta (Navarre). We consider the role of differences between syllables in pitch and duration in establishing lexical contrasts in these three Basque dialects. The three varieties examined differ substantially in the use of these acoustic features as correlates of accent, which raises questions about their diachronic development and about the typology of accentual systems."
   ],
   "doi": "10.21437/TAL.2018-20"
  },
  "liu18_tal": {
   "authors": [
    [
     "Yi",
     "Liu"
    ],
    [
     "Jinghong",
     "Ning"
    ]
   ],
   "title": "The perception of Mandarin focus intonation by native English speakers",
   "original": "47",
   "page_count": 5,
   "order": 51,
   "p1": 232,
   "pn": 236,
   "abstract": [
    "",
    " Based on cue theory and PAM-S, this paper examines how acoustic cues in Mandarin focus sentences are perceived by native English speakers. Acoustic analysis of the stimuli spoken by a native speaker reveals that in perceptual tests, temporal and intensity cues had an effect in determining focus prominence produced by non-native learners, whereas the influence of these phonetic cues was not detected in the perception of native speakers. In contrast, pitch variation is the cue that facilitates native listeners’ perception of focus prosody in Mandarin. Moreover, pitch direction such as the interplay of tone and intonation, and emphasis locations in Mandarin are also factors affecting the focus perception of native English speakers. \n"
   ],
   "doi": "10.21437/TAL.2018-47"
  },
  "feng18_tal": {
   "authors": [
    [
     "Yan",
     "Feng"
    ],
    [
     "Gang",
     "Peng"
    ]
   ],
   "title": "The effect of duration on categorical perception of Mandarin tone and voice onset time",
   "original": "33",
   "page_count": 5,
   "order": 37,
   "p1": 164,
   "pn": 168,
   "abstract": [
    "Whether duration influences the categorical perception (CP) of speech is still a controversial issue. Investigations on the effect of duration of stimuli on the CP has led to opposing results. The present study focused on the effect of duration on the CP of Mandarin lexical tones and aspiration of stops, in which the speech rates were normal for speech production and perception. The results showed that there was no significant duration effect on the CP of lexical tones. However, we found that syllable duration significantly changed the voice onset time (VOT) values of boundary position of aspiration of stops, although the discrimination ability of aspiration was not influenced by syllable duration, indicating that people have a robust perceptual competence to systematically encode alterations of speech production."
   ],
   "doi": "10.21437/TAL.2018-33"
  },
  "hualde18b_tal": {
   "authors": [
    [
     "Jose Ignacio",
     "Hualde"
    ],
    [
     "Tomas",
     "Riad"
    ]
   ],
   "title": "Interaction between word accent and intonational boundaries in Latvian",
   "original": "6",
   "page_count": 5,
   "order": 7,
   "p1": 27,
   "pn": 31,
   "abstract": [
    "In Latvian, primary stressed long syllables of content words bear either a level or a falling pitch contour, due to a\nlexical tonal accent contrast. In this paper we examine the interaction between word accents and intonational boundary tones in Latvian. We assume that intonational contours result from the combination of word-level and utterance-level tones and consider how the word accents are realized in utterances with different pragmatic values, which are in part expressed by choice of boundary tone (L%, H%, HL%). The main result of our investigation is that the existence of a lexical tonal contrast in Latvian introduces some incompatibilities between accentual melodies and intonational boundary tones, which are resolved in different ways. Tentatively, we conclude that one resolution is to alter the tonal values of the word accents, in some instances leading to the positional neutralization of the contrast. Another strategy is assimilation between boundary tone and word accent. Which tone assimilates to which is left as an open question here."
   ],
   "doi": "10.21437/TAL.2018-6"
  },
  "lee18_tal": {
   "authors": [
    [
     "Seunghun",
     "Lee"
    ],
    [
     "Hyun Kyung",
     "Hwang"
    ],
    [
     "Tomoko",
     "Monou"
    ],
    [
     "Shigeto",
     "Kawahara"
    ]
   ],
   "title": "The phonetic realization of tonal contrast in Dränjongke",
   "original": "44",
   "page_count": 5,
   "order": 48,
   "p1": 217,
   "pn": 221,
   "abstract": [
    "Dra¨njongke is a Tiberto-Burman language spoken in Sikkim, India. The language has been described as having a two-way tonal contrast [1], but how the tonal contrast is realized phonetically has not been explored in detail. To fill this gap, we report an acoustic analysis of Dra¨njongke based on the speech of 12 native speakers, focusing on how the tonal contrast in Dra¨njongke manifests itself in syllabary readings. The results suggest that (i) in syllables consisting of only vowels (e.g. [a]), the tonal differences manifest themselves at the left edge of syllables, and more surprisingly, (ii) in syllables with sonorant onsets (e.g. [na]), the tonal differences primarily appear during the sonorant intervals, and can be neutralized during the vocalic intervals.\nThis paper discusses some theoretical implications of the observed patterns. First, we propose that phonologically, tones can be directly associated with consonants, a proposal independently motivated by an analysis of phonological consonant-tone interaction patterns in various languages [2]. Second, we address the general issue of how supralaryngeal gestures and laryngeal gestures are coordinated, the issue known under the rubric of “articulatory binding” [3]. We argue that articulatory binding—a principle that requires laryngeal gestures to be coordinated with supralaryngeal gestures to maximize their perceptual salience—is violable. "
   ],
   "doi": "10.21437/TAL.2018-44"
  },
  "mcpherson18_tal": {
   "authors": [
    [
     "Laura",
     "McPherson"
    ]
   ],
   "title": "Musical surrogate languages in the documentation of complex tone: the case of the Sambla balafon",
   "original": "13",
   "page_count": 5,
   "order": 15,
   "p1": 62,
   "pn": 66,
   "abstract": [
    "In documenting an undescribed language, tone can pose a significant challenge. In practically no other aspect of the phonology can such a small set of categories show such an overlapping range of pronunciation, especially in level-tone languages where f0 slope offers fewer clues to category. This paper demonstrates the unexpected tool offered by musical surrogate languages in the documentation of these tone systems. It draws on the case study of the Sambla balafon, a resonator xylophone played by many ethnicities in Burkina Faso and neighboring West African countries. The language of the Sambla people, Seenku (Northwestern Mande, Samogo), has a highly complex tonal system, whose four contrastive levels and multiple contour tones are encoded musically in the notes of the balafon, allowing musicians to communicate with each other and with spectators without ever opening their mouths. I show how the balafon data have shed light on a number of tonal contrasts and phenomena and raised questions about levels of the grammar and their mental representations."
   ],
   "doi": "10.21437/TAL.2018-13"
  },
  "yang18_tal": {
   "authors": [
    [
     "Wenjing",
     "Yang"
    ],
    [
     "Cathryn",
     "Yang"
    ]
   ],
   "title": "Reduction in Dali Nisu tone change-in-progress",
   "original": "10",
   "page_count": 5,
   "order": 11,
   "p1": 46,
   "pn": 50,
   "abstract": [
    "In this paper, reduction as a key mechanism in diachronic tone change is illustrated through an apparent-time study of tone changes-in-progress in Dali Nisu, a Tibeto-Burman minority language spoken in southwest China. 26 native speakers of Dali Nisu (11 female, 15 male) participate in a tonal production experiment. Linear mixed effects modelling results show that three reduction changes are in progress: 1) high level tone lowering, 2) low rising tone flattening, and 3) low falling tone flattening. As a result of (1) and (3), overall tonal range is decreasing. Voicing of syllable-initial consonants interact with the reduction changes: the magnitude of the reduction effect seen among younger, more educated speakers depends on voicing of the initial consonant. This case study provides a snapshot of tone change-in-progress, showing that tonal reduction is an important mechanism shaping tone change in syllable-tone languages."
   ],
   "doi": "10.21437/TAL.2018-10"
  },
  "lin18_tal": {
   "authors": [
    [
     "Chihkai",
     "Lin"
    ]
   ],
   "title": "Changes of entering tones in Mandarin Chinese revisited: From a corpus-based approach",
   "original": "38",
   "page_count": 4,
   "order": 42,
   "p1": 188,
   "pn": 191,
   "abstract": [
    "This paper explores the dispersion of entering tones from Middle Chinese to modern Mandarin Chinese by using a corpus-based approach. With 2698 corpus examples, this paper looks into how the manner and place of articulation of initials are related to the dispersion. The results suggest that sonorants and voiced obstruents show more salient tendencies than voiceless initials do in the dispersion of entering tones. Sonorants are highly associated with qùsheng, and voiced obstruents with yángpíng. Besides, labial initials are significantly different from coronal and dorsal initials in yángpíng, shangsheng and qùsheng. The corpus data also reveal that there is a low rate of dispersing into shangsheng for entering tones, as entering tones are incompatible with shangsheng in height. Entering tones are non-low, whereas shangsheng is low."
   ],
   "doi": "10.21437/TAL.2018-38"
  },
  "gerazov18_tal": {
   "authors": [
    [
     "Branislav",
     "Gerazov"
    ],
    [
     "Gérard",
     "Bailly"
    ],
    [
     "Yi",
     "Xu"
    ]
   ],
   "title": "The significance of scope in modelling tones in Chinese",
   "original": "37",
   "page_count": 5,
   "order": 41,
   "p1": 183,
   "pn": 187,
   "abstract": [
    "The Superposition of Functional Contours (SFC) prosody model decomposes the intonation and duration contours into elementary contours that encode specific linguistic functions. It can be used to extract these functional contours at multiple linguistic levels. The PySFC system, which incorporates the SFC, can thus be used to analyse the significance of including the neighbouring syllables in the scope of the tone functional contours in spoken Chinese on the modelling of prosody. Our results show that significant improvements of modelling tone functional contours are obtained by including the right syllable in the scope, but not the left one. We thus show that there is a larger carry-over effect for Chinese tones in contrast to an anticipatory one. This finding is in line with the established state-of-the-art."
   ],
   "doi": "10.21437/TAL.2018-37"
  },
  "patin18_tal": {
   "authors": [
    [
     "Cédric",
     "Patin"
    ]
   ],
   "title": "From tones to accents",
   "original": "4",
   "page_count": 5,
   "order": 5,
   "p1": 17,
   "pn": 21,
   "abstract": [
    "This paper is part of a larger research project on the hypothetical evolution of the prosodic system of Shingazidja, a Bantu language [G44a] of Comoros, from a tonal system to an accentual system. The first part of the paper describes the tonal properties of the language (e.g. long-distance tone shift) and its accentual properties (e.g. the insertion of a tone on the stressed syllable of an underlyingly toneless phrase), and briefly discusses tone reduction at the postlexical level. In the second part of the paper, the acoustic correlates of tone in the variety of Washili are explored. It is notably shown that the interplay of tone, stress and vowel aperture can lead to a shift of the metrical prominence that blurs the distinction between tone and accent in the language. Consequences of this process on the prosodic system of Shingazidja, and on our knowledge of tone loss in general, are addressed in a brief discussion."
   ],
   "doi": "10.21437/TAL.2018-4"
  },
  "gao18_tal": {
   "authors": [
    [
     "Jiayin",
     "Gao"
    ],
    [
     "Takayuki",
     "Arai"
    ]
   ],
   "title": "F0 perturbation in a \"pitch-accent\" language",
   "original": "12",
   "page_count": 5,
   "order": 13,
   "p1": 56,
   "pn": 60,
   "abstract": [
    "This study investigates the relation between consonant voicing and F0 in modern Tokyo Japanese, as produced by young female speakers. In a tone language, the F0 perturbation related to onset voicing has been reported to be inhibited, so that F0 can be maximally used in tonal contrasts. According to this explanation, the same pattern should be found in Tokyo Japanese, as F0 should be maximally used to signal its \"pitch-accent\".\nContrary to this prediction, our data show that in Tokyo Japanese, for the initial mora, F0 is remarkably lower after voiced than voiceless stops, and this effect lasts till the final part of the mora. However, the F0 level of the mora endpoint is maintained at H or L so that the pitch-accent pattern is well preserved.\nWe thus argue that the competing role of F0 in a pitch-accent language, or a tone language does not necessarily impose limitations on the F0 perturbation effect.\nWe also found that voiced stops are very often phonetically voiceless in utterance-initial position, while being phonetically voiced in utterance-medial position. Therefore, we question whether Tokyo Japanese is undergoing an incipient tonogenesis, given that the VOT cue is giving place to an F0 cue."
   ],
   "doi": "10.21437/TAL.2018-12"
  },
  "hu18_tal": {
   "authors": [
    [
     "Shuangshuang",
     "Hu"
    ],
    [
     "Ao",
     "Chen"
    ],
    [
     "Rene",
     "Kager"
    ]
   ],
   "title": "Influence of pitch dimensions on non-native tone perception by Dutch and Mandarin listeners",
   "original": "51",
   "page_count": 4,
   "order": 55,
   "p1": 252,
   "pn": 255,
   "abstract": [
    "Previous studies have shown that listeners of different language backgrounds attend to different pitch dimensions when perceiving non-native tones by acoustic approaches. The present study investigated which dimensions of pitch, namely, pitch contour, pitch level, together with the position where it occurs in a word, influenced non-native tone perception by tone language (Mandarin) and non-tone language (Dutch) listeners at the phonological level. A sequence-recall task with memory load and high phonetic variability was applied in the study. Language specific perceptual patterns were found for the two groups. Mandarin listeners outperformed Dutch listeners on encoding non-native pitch contour and pitch level contrasts on each position. Overall Mandarin listeners’ perception of non-native tones was independent on the position. However, they needed contextual tonal references when encoding non-native pitch level contrasts. Dutch listeners showed perceptual difficulties in encoding pitch contrasts phonologically and were found partially “tone deaf” due to the lack of contrastive tonal categories in their native language. They showed an overall preference to the word final position than word initial and word middle position when perceiving non-native tones at the phonological level. "
   ],
   "doi": "10.21437/TAL.2018-51"
  },
  "hao18_tal": {
   "authors": [
    [
     "Yen-Chen",
     "Hao"
    ],
    [
     "Chung-Lin",
     "Yang"
    ]
   ],
   "title": "The role of orthography in L2 segment and tone encoding by learners at different proficiency levels",
   "original": "50",
   "page_count": 5,
   "order": 54,
   "p1": 247,
   "pn": 251,
   "abstract": [
    "The present study compared the effect of two orthographic inputs on English speakers’ phonological encoding of Mandarin words: the Chinese Romanization Pinyin and Chinese characters. English speakers at three proficiency levels participated in a word-learning experiment. During the learning phase, half of the participants saw Pinyin of the target words (PY group), while the other half saw characters (CH group). After learning, the participants judged the matching of sound and meaning of 128 pairs, half of which were complete matches, while the other half mismatched the target either in segment or tone. The results showed that the Advanced learners in the CH group were more accurate than their counterparts in the PY group in rejecting tonal mismatches. In contrast, the Naïve participants in the PY group were more accurate in accepting the matches than those in the CH group. Moreover, participants in the PY group were overall insensitive to tonal mismatches regardless of their proficiency. In the CH group, on the other hand, the Advanced learners scored significantly higher with the tonal-mismatched items than the less experienced participants. This study suggests that characters are more effective than Pinyin in helping Advanced L2 learners encode the tones of new Mandarin words."
   ],
   "doi": "10.21437/TAL.2018-50"
  },
  "rahmani18_tal": {
   "authors": [
    [
     "Hamed",
     "Rahmani"
    ]
   ],
   "title": "Persian 'word stress' is a syntax-driven tone",
   "original": "31",
   "page_count": 4,
   "order": 35,
   "p1": 155,
   "pn": 158,
   "abstract": [
    "Prominence in Persian words is generally referred to as ‘word stress’. An important aspect in which the notion of Persian ‘word stress’ is flawed is that the location of ‘stressed’ syllables is entirely governed by syntax. That is, neither is it the case that ‘stressed’ syllables are in any way determined in the lexicon, nor is it the case that they are determined in the phonology, whether lexical or post-lexical, Persian ‘stress’ functions in syntax much as would a segmentally encoded particle."
   ],
   "doi": "10.21437/TAL.2018-31"
  },
  "mckendry18_tal": {
   "authors": [
    [
     "Inga",
     "McKendry"
    ]
   ],
   "title": "Evidence for Underlying Mid Tones in MXY Mixtec",
   "original": "35",
   "page_count": 5,
   "order": 39,
   "p1": 173,
   "pn": 177,
   "abstract": [
    "This paper provides evidence for the presence of underlying Mid tones in South-eastern Nochixtla´n Mixtec (MXY), an Otomanguean language of southern Mexico. I show that in the underlying tonal inventory there are High, Mid, and Low tones, as well as moras which are unspecified for tone. Thus, there are more options phonologically for the tone of a mora than the phonetic opposition shows. Evidence for this claim comes from the surface tonal patterns of nouns as well as verbal morphology. In addition to the underlying tones, there is also a default tone which is inserted when no other tone is available to provide a surface tone for a toneless TBU. However, this tone does not participate in phonological processes like the other specified tones, nor does it form part of tonal contours. Acoustic analysis shows that Default and Mid are phonetically indistinguishable. However, in the sequence High Low Mid, the Low tone is raised to Mid, whereas Low raising does not occur in the sequence High Low Default."
   ],
   "doi": "10.21437/TAL.2018-35"
  },
  "zhang18_tal": {
   "authors": [
    [
     "Gaoyuan",
     "Zhang"
    ],
    [
     "Jing",
     "Shao"
    ],
    [
     "Yubin",
     "Zhang"
    ],
    [
     "Caicai",
     "Zhang"
    ]
   ],
   "title": "Revisiting Hemispheric Lateralization for Cantonese Lexical Tone Processing in Dichotic Listening",
   "original": "26",
   "page_count": 5,
   "order": 29,
   "p1": 129,
   "pn": 133,
   "abstract": [
    "In this study, we aim to re-examine the issue of hemispheric lateralization for Cantonese lexical tone processing in dichotic listening. We are particularly interested in testing whether the previously reported the right-hemisphere advantage in Cantonese lexical tone processing in dichotic listening [1] is replicable. More importantly, we aim to explore whether the brain lateralization pattern for tone processing is influenced by tone awareness. Sixteen native Cantonese speakers that were proficient in Jyutping and eighteen matched controls were asked to discriminate and identify Cantonese tones in dichotic listening. A right-hemisphere advantage was found in the discrimination task but not in the identification task. Findings from the discrimination task were generally consistent with [1] and supported the acoustic hypothesis of brain lateralization in lexical tone processing. However, the identification task might require more higher-level linguistic processing in the left hemisphere, resulting in more bilateral processing. No differences in hemispheric advantage were found between the two groups, although the Jyutping group outperformed controls in tone discrimination and identification in some conditions. The temporary conclusion is that late learning of Jyutping in adulthood may have limited effect on shaping the brain lateralization of Cantonese lexical tone processing."
   ],
   "doi": "10.21437/TAL.2018-26"
  },
  "ho18_tal": {
   "authors": [
    [
     "Oi-Yee",
     "Ho"
    ],
    [
     "Jing",
     "Shao"
    ],
    [
     "Jinghua",
     "Ou"
    ],
    [
     "Sam-Po",
     "Law"
    ],
    [
     "Caicai",
     "Zhang"
    ]
   ],
   "title": "Tone Merging Patterns in Congenital Amusia in Hong Kong Cantonese",
   "original": "27",
   "page_count": 5,
   "order": 30,
   "p1": 134,
   "pn": 138,
   "abstract": [
    "Congenital amusia is a neurodevelopmental disorder, affecting fine-grained musical pitch processing without brain injury. This disorder also affects pitch processing in speech such as lexical tone perception. On the other hand, the phenomenon of tone merging has been observed among some speakers of Hong Kong Cantonese (HKC), who exhibit confusion between certain tone pairs in perception and/or production. It has been reported that tone merging may relate to individual variation in cognitive abilities of working memory and attention. The current study is a first attempt to investigate the relationship between amusia and tone merging by examining tone merging patterns in perception of amusics in HKC and their cognitive abilities of working memory and attention as well as pitch threshold. The results revealed a different profile of amusics from that of merger groups reported in previous studies. Amusics exhibited a profound impairment in discriminating tones compared to musically intact controls, which appeared to differ from the highly selective perceptual confusion of tone pairs reported in the merger groups. Regarding cognitive measures, amusics also demonstrated broad deficits in selective attention, working memory and inhibitory control. The temporary results imply that amusia might have a limited contribution to the previously reported tone merging."
   ],
   "doi": "10.21437/TAL.2018-27"
  },
  "grabowski18_tal": {
   "authors": [
    [
     "Emily",
     "Grabowski"
    ],
    [
     "Laura",
     "McPherson"
    ]
   ],
   "title": "ATLAS (Automated Tone Level Annotation System): A tonologist's and documentarian's toolkit",
   "original": "16",
   "page_count": 5,
   "order": 18,
   "p1": 77,
   "pn": 81,
   "abstract": [
    "This paper describes a novel computational toolkit for tonal analysis: ATLAS (Automated Tone Level Annotation System). Tone remains a challenge in many language documentation projects, and far too often still, one comes across descriptive and theoretical treatments of tone languages in which tone marking is entirely absent or of questionable accuracy. ATLAS takes as its input a WAV file and TextGrid delimiting tone-bearing segments and outputs normalized pitch level annotations intermediate between raw f0 and phonemic categories. These 'tone level' annotations represent a discrete numerical version of the dashes often used as a broad phonetic transcription of tone. The number of levels can be set by the researcher, and a number of raw phonetic measures are also outputted by the tool. ATLAS is designed to be used by anyone regardless of experience with tone or computational methods, thus promoting the inclusion of objective, replicable pitch data in documentary, descriptive, or theoretical materials on tone languages. We also show the utility of ATLAS’s broad phonetic annotations in understanding the surface realization of already determined phonemic categories and in making hypotheses about unanalyzed tone systems."
   ],
   "doi": "10.21437/TAL.2018-16"
  },
  "chow18_tal": {
   "authors": [
    [
     "Raymond Wen-Chun",
     "Chow"
    ],
    [
     "Yi",
     "Liu"
    ],
    [
     "Jing-Hong",
     "Ning"
    ]
   ],
   "title": "The Perception of Mandarin Tones by Thai and Indonesian Speakers",
   "original": "40",
   "page_count": 5,
   "order": 44,
   "p1": 197,
   "pn": 201,
   "abstract": [
    "This study makes use of diverse acoustic features to comprehensively examine the effects of native language (L1) experience, tonal context, segmental context (consonant aspiration type and vowel height), and the intrinsic phonetic similarity on the perception of Mandarin tones by Thai and Indonesian speakers. Two perception tasks which are four-alternative forced-choice identification tests for stimuli presented in isolation and carrier sentences were conducted. Results showed that Thai listeners performed significantly better than Indonesian counterparts in both identification tests and the assertion of tonal language speakers having advantages over the non-tonal L1 speakers in acquiring a new tonal language was supported in this study. However, both groups share some similar error patterns which might be due to the intrinsic phonetic similarity between the target tones. The effects of segmental context appeared to be not significant, while the tonal context was found to exert contrary effects on Thai and Indonesian listeners."
   ],
   "doi": "10.21437/TAL.2018-40"
  },
  "pan18_tal": {
   "authors": [
    [
     "Ho-Hsien",
     "Pan"
    ],
    [
     "Shao-Ren",
     "Lyu"
    ],
    [
     "Hsiao-Tung",
     "Huang"
    ],
    [
     "Mu-Fan",
     "Wang"
    ]
   ],
   "title": "Taiwanese Min Phonemic Tones and Prosodic Boundaries",
   "original": "8",
   "page_count": 4,
   "order": 9,
   "p1": 37,
   "pn": 40,
   "abstract": [
    "This study investigates (1) the occurrence of junctures relative to the IP, ip, word and syllable boundaries and (2) the effect of lexical frequencies on the occurrence of juncture tones.\nSpontaneous monologues from forty-one speakers recruited from five dialect regions in Taiwan was transcribed involving orthography, Speech Assessment Methods Phonetic Alphabet (SAMPA), phonemic tones, surface tones, syllable, segment, break, and miscellaneous tiers.\nThe results show that the percentages of juncture tones increased from under 10 % before a syllable boundary, to 30% before a word boundary, 50% to 70% before an ip boundary and finally from 50% to 80% before an IP boundary. Sandhi tones can surface before IP boundary as well.\nHigh frequency words, mostly grammatical function words and pronouns, are more likely to be produced with sandhi tones, but not low frequency words. "
   ],
   "doi": "10.21437/TAL.2018-8"
  },
  "syed18_tal": {
   "authors": [
    [
     "Nasir A.",
     "Syed"
    ],
    [
     "Abdul Waheed",
     "Shah"
    ],
    [
     "Yi",
     "Xu"
    ]
   ],
   "title": "Focus prosody in Brahvi and Balochi",
   "original": "3",
   "page_count": 5,
   "order": 4,
   "p1": 12,
   "pn": 16,
   "abstract": [
    "Previous research has shown that post-focus compression (PFC) - the reduction of F0 and intensity after a focused word, is present in some languages but absent in many others. It has been hypothesized that the cross-linguistic distribution of PFC parallels that of the Nostratic macro-family. The present study is a test of this Nostratic-origin hypothesis through a comparison of focus prosody in Brahvi, a Dravidian language, and Balochi, an Indo-Iranian language, both alleged members of the Nostratic macro-family. Twenty native speakers from each language produced declarative sentences with different focus conditions. Acoustic analysis showed that, in both languages, post-focus F0 peaks are significantly lower than those in baseline neutral-focus sentences. But post-focus lowering of F0 and intensity is greater in Balochi than in Brahvi. These results offer evidence that at least one of the Dravidian languages has PFC, which is consistent with the Nostratic-origin hypothesis. The weaker form of PFC in Brahvi, however, suggests that factors that may weaken PFC in a language need to be investigated, and other Dravidian languages also need to be studied for the presence of PFC."
   ],
   "doi": "10.21437/TAL.2018-3"
  },
  "zhang18b_tal": {
   "authors": [
    [
     "Kaile",
     "Zhang"
    ],
    [
     "Matthias",
     "Sjerps"
    ],
    [
     "Caicai",
     "Zhang"
    ],
    [
     "Gang",
     "Peng"
    ]
   ],
   "title": "Extrinsic normalization of lexical tones and vowels?Beyond a simple contrastive general auditory mechanism",
   "original": "46",
   "page_count": 5,
   "order": 50,
   "p1": 227,
   "pn": 231,
   "abstract": [
    "Spoken context provides valuable information for listeners to accommodate speech variability. One example of this influence is extrinsic normalization: the finding that formant and tone ranges in preceding context constrain the interpretation of subsequent tone and formant cues. One dominant hypothesis has been that contrastive general auditory processes play an important role in normalization. A contrastive general auditory mechanism suggests that speech and non-speech contexts should have similar contrastive influences on speech perception. The present study tests this prediction across segmental (formants) and suprasegmental (tone) speech cues. Participants listened to target stimuli that were preceded by either speech or non-speech contexts. Importantly, the cues that distinguished target stimuli were contrastively related to their context. The results demonstrate that speech contexts, but not non-speech context, induced significant contrastive effects on the perception of both lexical tones and formants. In addition, we observed considerable individual difference in the size and direction of context effects. Some listeners reliably demonstrated contrastive context effects while others demonstrated assimilative effects. These results suggest that the underlying mechanism of speech normalization is more complicated than simply contrastive general auditory processes."
   ],
   "doi": "10.21437/TAL.2018-46"
  },
  "ren18_tal": {
   "authors": [
    [
     "Xinran",
     "Ren"
    ],
    [
     "Peggy",
     "Mok"
    ]
   ],
   "title": "Tonogenesis in Seoul Korean and L3 Production of Korean stops by Cantonese- English Bilinguals",
   "original": "39",
   "page_count": 5,
   "order": 43,
   "p1": 192,
   "pn": 196,
   "abstract": [
    "This paper aims to investigate how tonogenesis in Seoul Korean affects non-native language acquisition in a multilingual context with L1 Cantonese, L2 English and L3 Korean. We are also interested to examine the source and direction of cross-linguistic influences in the acquisition of VOT and F0 patterns which are used for the stop contrasts. Sixteen L3 Korean learners differing in proficiencies (beginning vs. intermediate) were recorded reading a list of words embedded in carrier sentences in the three languages. Results from acoustic analyses found that the learners did not merge VOTs for the Korean lax and aspirated stop contrast, but they showed the tendency for tonogenesis, such as their heavy use of f0 in producing different Korean stops. Furthermore, comparison between the beginners and the intermediate learners revealed various cross-linguistic influences: regressive transfer of f0 on L1 and L2, bidirectional interaction of f0 values between L2 and L3, and L1 influence on the production of VOT in L2 and L3. These findings suggest that L3 transfer happens in a cue-by-cue manner, i.e. VOT and f0 need to be accounted for separately."
   ],
   "doi": "10.21437/TAL.2018-39"
  },
  "peralta18_tal": {
   "authors": [
    [
     "William",
     "Peralta"
    ]
   ],
   "title": "Tonogenesis: the perception of tone and the role of place of articulation in Kurtöp",
   "original": "17",
   "page_count": 5,
   "order": 20,
   "p1": 83,
   "pn": 87,
   "abstract": [
    "Previous work on tonogenesis in Kurtöp production (Hyslop 2009, Plane 2016) has\naddressed questions of propagation. They describe patterns\nwhereby environments following more sonorous onsets appear\nto develop tone prior to less sonorous onsets. Additionally,\nthe production study by Plane (2016) revealed that place of articulation\nmay also play a role in the order of tonogenetic sound\nchange for production. Perceptual evidence for these processes\nin Kurtöp has not yet been researched. As such, this paper assesses\nhow the sequence of tone propagation manifests in perception\nfor Kurtöp.\nA two-way forced choice perceptual identification task was\ndesigned to investigate the degree to which fundamental frequency\n(f0) has phonologized in Kurtöp perception. It tested\nthe hypothesis that contrastive tone develops following dorsal\nonsets prior to bilabial-dental onsets.\nThe results of the study show a division between the dorsal\nand bilabial-dental onset environments, whereby the dorsal onset\nenvironments exhibit more advanced phonologization of f0\nthan the bilabial-dentals, which corroborate the findings from\nprevious studies."
   ],
   "doi": "10.21437/TAL.2018-17"
  },
  "ramachers18_tal": {
   "authors": [
    [
     "Stefanie",
     "Ramachers"
    ],
    [
     "Susanne",
     "Brouwer"
    ],
    [
     "Paula",
     "Fikkert"
    ]
   ],
   "title": "Perception and lexical encoding of tone in a restricted tone language: Developmental evidence from Limburgian",
   "original": "22",
   "page_count": 6,
   "order": 25,
   "p1": 108,
   "pn": 113,
   "abstract": [
    "Within the large family of tone languages, differences exist with respect to the importance and phonetic realization of tones. It remains unclear how these differences influence the acquisition and processing of lexical tone. Limburgian, spoken in the south of the Netherlands, is assumed to have lexical tone, but it has a lower functional load than for example Mandarin Chinese. Moreover, lexical tone in Limburgian is subject to an intriguing amount of surface variation.\nWe compared performance of native Limburgians to native non-tonal Dutch controls on a series of behavioral experiments: Discrimination of lexical tone in the first year of life (Exp. 1) and in adulthood (Exp. 2), and the encoding of lexical tone during word learning in toddlers and adults (Exp. 3). Our results partly deviate from previous research on tone languages like Mandarin, but are on a par with recent findings with Japanese children, suggesting that the acquisition and processing of lexical tone indeed seems to be influenced by functional load and phonetic variability."
   ],
   "doi": "10.21437/TAL.2018-22"
  },
  "hussein18_tal": {
   "authors": [
    [
     "Hussein",
     "Hussein"
    ],
    [
     "Burkhard",
     "Meyer-Sickendiek"
    ],
    [
     "Timo",
     "Baumann"
    ]
   ],
   "title": "Tonality in Language: The Generative Theory of Tonal Music as a Framework for Prosodic Analysis of Poetry",
   "original": "36",
   "page_count": 5,
   "order": 40,
   "p1": 178,
   "pn": 182,
   "abstract": [
    "This contribution focuses on structural similarities between tonality\nand cadences in music on the one hand, and rhythmical patterns\nin poetic languages respectively poetry on the other hand.\nWe investigate two exemplary rhythmical patterns in modern and\npostmodern poetry to detect these tonality-like features in poetic\nlanguage: The Parlando and the Variable Foot. German poems\nreadout from the original poets are collected from the webpage\nof our partner lyrikline. We compared these rhythmical features\nwith tonality rules, explained in two important theoretical volumes:\nThe Generative Theory of Tonal Music and the Rhythmic\nPhrasing in English Verse. Using both volumes, we focused on\na certain combination of four different features: The grouping\nstructure, the metrical structure, the time-span-variation and the\nprolongation, in order to detect the two important rhythmical\npatterns which use tonality-like features in poetic language (Parlando\nand Variable Foot). Different features including pause\nand parser information are used in this classification process.\nThe best classification result, calculated by the f-measure, for\nParlando and Variable Foot is 0.69."
   ],
   "doi": "10.21437/TAL.2018-36"
  },
  "kelterer18_tal": {
   "authors": [
    [
     "Anneliese",
     "Kelterer"
    ],
    [
     "Gilbert",
     "Ambrazaitis"
    ],
    [
     "David",
     "House"
    ]
   ],
   "title": "Head beats as pitch-accompanying visual correlates of primary and secondary lexical stress: evidence from Stockholm Swedish compounds",
   "original": "25",
   "page_count": 5,
   "order": 28,
   "p1": 124,
   "pn": 128,
   "abstract": [
    "This study examines the interplay of (verbal) prosody with (visual) head and eyebrow movements in a 24-minute corpus of Swedish television news readings. The paper focuses on ‘double’ beat gestures, asking whether their occurrence relates to a word’s lexical prominence structure (simplex; compound), to lexical tonal prosody (Accent 1; Accent 2), or rather to prominence levels (+/- focal accent; +/- nuclear position).\nThe results suggest that double eyebrow beats are a marginal phenomenon. Double head beats are also rare (of the 688 words in our 4088-word corpus annotated for head beats, 28 have double head beats), but their usage follows a clear pattern: There is no preference for the nuclear position, but a strong preference to occur on a focally-accented compound (Accent 2), which is usually realized with two pitch peaks. In conjunction with previous findings on (single) head beats, the present results suggest that a head beat in this type of data can associate with lexical (primary or secondary) stress in case the stressed syllable is also marked by a (tonal or intonational) pitch peak. "
   ],
   "doi": "10.21437/TAL.2018-25"
  },
  "huang18_tal": {
   "authors": [
    [
     "Xunan",
     "Huang"
    ],
    [
     "Gaoyuan",
     "Zhang"
    ],
    [
     "Caicai",
     "Zhang"
    ]
   ],
   "title": "A Preliminary Study on the Productivity of Mandarin T3 Sandhi in Mandarin-speaking Children",
   "original": "18",
   "page_count": 5,
   "order": 21,
   "p1": 88,
   "pn": 92,
   "abstract": [
    "Mandarin Tone 3 (T3) sandhi is highly productive in novel words produced by native adult speakers. However, it is unclear when the sandhi pattern becomes productive in young children learning Mandarin Chinese as their mother tongue. To address this issue, this preliminary study examined the productivity of T3 sandhi in different age groups (children aged 3 to 6 and adults) in real words and two types pseudowords, semi-pseudowords that were non-occurring combinations of two real monosyllables (*AO) and pseudowords where the first syllable was an accidental gap (AG). Preliminary results showed that children’s application of T3 sandhi might reach an adult level in real words as early as three years old. However, in the *AO condition, children may reach an adult-like application at five years old. In the AG condition even the 6-year-old children may not reach an adult-like application rate; besides, among the children, the 3-year-old children performed worse than the older children although none of them were adult-like. These preliminary results imply that children’s learning of the tone sandhi words undergoes a gradual transformation from a rote-memory based lexical mechanism to a computation-based productive mechanism. Until six years of age, Mandarin-speaking children may not have developed the adult-like competence of computation mechanism. "
   ],
   "doi": "10.21437/TAL.2018-18"
  },
  "bahmanian18_tal": {
   "authors": [
    [
     "Nasimeh",
     "Bahmanian"
    ],
    [
     "Moharram",
     "Eslami"
    ]
   ],
   "title": "Early peak: a case in Persian",
   "original": "28",
   "page_count": 5,
   "order": 32,
   "p1": 140,
   "pn": 144,
   "abstract": [
    "This study investigates the intonational properties of vocative structure in standard Persian in the framework of Auto-segmental-metrical (AM) phonology. In Persian, all lexical units are stressed in their final syllable and there is a language-specific feature in Persian according to which pitch accents are aligned with lexically stressed syllables. Contrary to the said feature, all previous studies claim that in vocative structure, it is the first syllable that is accented. The present study suggests the intonational pattern of ^H+H*H-(L/H)% for vocative structure in Persian, using Persian Tone and Break Indices (PToBI) annotations. Here ^H stands for early peak aligned with the second syllable, and H* stands for the pitch accent aligned with the lexically stressed, here the last syllable and H- stands for the phrase tone which signals the non-finality in the vocative utterance. Perceptual experiments support the hypotheses behind the study."
   ],
   "doi": "10.21437/TAL.2018-28"
  },
  "vogel18_tal": {
   "authors": [
    [
     "Irene",
     "Vogel"
    ],
    [
     "Angeliki",
     "Athanasopoulou"
    ]
   ],
   "title": "The roles of pitch and phonation in Vietnamese and Mandarin",
   "original": "49",
   "page_count": 5,
   "order": 53,
   "p1": 242,
   "pn": 246,
   "abstract": [
    "Pitch and phonation may be used individually or together in languages: some languages do not make systematic use of either property, others use one or the other, and others a combination, where different relationships may hold. We investigate this last option in Mandarin and Vietnamese using substantial, systematically collected corpora, first with auditory and visual (spectrogram) assessment of the presence of Creaky Phonation (CP), then with acoustic and statistical (Binary Logistic Regression) Analyses. We focus on the s?c and ngã tones in Vietnamese, claimed to contrast in CP not F0, and all four tones of Mandarin, where CP often arises with Tone 3 (dipping), and possibly others. We propose that despite differences in the distribution of F0 and CP, both languages crucially require underlying tonal contrasts, but differ in the source and role of CP. In Mandarin, CP correlates with low F0, as a type of \"artifact\", resulting in gender differences. In Vietnamese, CP cannot be due to F0, as it appears with high tones; instead, it is an additional \"gesture\" speakers may introduce along with F0 in producing the ngã tone, but need not, as seen in the emergence of two speaker groups based on their use of CP. "
   ],
   "doi": "10.21437/TAL.2018-49"
  },
  "acharyya18_tal": {
   "authors": [
    [
     "Prarthana",
     "Acharyya"
    ],
    [
     "Shakuntala",
     "Mahanta"
    ]
   ],
   "title": "Production and perception of lexical tone in Deori",
   "original": "19",
   "page_count": 5,
   "order": 22,
   "p1": 93,
   "pn": 97,
   "abstract": [
    "",
    " Deori, a Tibeto-Burman language (henceforth TB) belonging to the Bodo- Koch language group [10] can be unambiguously called an endangered language [2]. This paper analyzes the production and perception of lexical tones in Deori. Most recently, some remnant lexical tonal contrast has been shown in Deori with acoustic evidence [11]. Following the minimal tonal contrast prevalent among the older generation [11] a production experiment was conducted to determine the tonal distinction in the speech of the younger generation. The production experiment was followed by a perception test to investigate the impact of language experience on the perception of lexical tones in Deori. The result of production test shows a trend of underlying tone reversal H>L; L>H in monosyllables and a considerable F0 variation in the disyllabic stems. The tone reversal can be described as tone swap where a high tone has a low fundamental frequency and vice-versa. The perception test result too shows a similar trend of tone reversal in monosyllables as the listeners tend to misidentify tones mainly the younger generation speakers. Our result indicates that social factors such as language experience play a role in the categorization of tones in Deori. \nIndex Terms: tone, production, perception, tone swap. "
   ],
   "doi": "10.21437/TAL.2018-19"
  },
  "zhang18c_tal": {
   "authors": [
    [
     "Yaqing",
     "Zhang"
    ],
    [
     "Ying",
     "Chen"
    ]
   ],
   "title": "Kazakh Learners' Production of Mandarin Tones in Colloquial Contexts",
   "original": "48",
   "page_count": 5,
   "order": 52,
   "p1": 237,
   "pn": 241,
   "abstract": [
    "This study investigates of Kazakh learners’ production of Mandarin tones in ten colloquial contexts. Four acoustic parameters—mean F0, F0 range, F0 slope and duration were measured and analyzed. The acoustic and statistical analysis indicate nativelike duration and F0 slope in the learners’ production but non-nativelike F0 height. F0 range differs in tones—nativelike Tone 4, nonnative Tone 1 and better Tone 3 than Tone 2. The results reveal that the prosodic system of learners’ L2 Russian did not affect their tone production of L3 Mandarin as much as that of their L1 Kazakh did."
   ],
   "doi": "10.21437/TAL.2018-48"
  },
  "kuang18_tal": {
   "authors": [
    [
     "Jianjing",
     "Kuang"
    ],
    [
     "Jia",
     "Tian"
    ],
    [
     "Yipei",
     "Zhou"
    ]
   ],
   "title": "the common word prosody in Northern Wu",
   "original": "2",
   "page_count": 5,
   "order": 3,
   "p1": 7,
   "pn": 11,
   "abstract": [
    "This study revisits the phonological representation and phonetic implementation of tone sandhi of Wu dialects by examining three Northern Wu dialects that still have seven or eight monosyllabic tones. It is found that the implementation of tone sandhi is highly variable across tonal categories and dialects, and complete spreading is relatively rare. Despite all kinds of variations, we found that there is a common word prosody template shared by Northern Wu dialects: 1) non-initial syllables also contribute to the sandhi patterns; 2) both initial and non-initial syllables undergo neutralization, with the initial syllable neutralizing contours and the non-initial syllable neutralizing registers. In additionn, because of the reduced pitch range of the non-initial syllables, the contribution of the non-initial syllables is likely to get lost in Wu dialects. "
   ],
   "doi": "10.21437/TAL.2018-2"
  },
  "german18_tal": {
   "authors": [
    [
     "James S.",
     "German"
    ],
    [
     "Adam J.",
     "Chong"
    ]
   ],
   "title": "Stress, tonal alignment, and phrasal position in Singapore English",
   "original": "30",
   "page_count": 5,
   "order": 34,
   "p1": 150,
   "pn": 154,
   "abstract": [
    "Within a language, the way that f0 marks stressed syllables can depend on phrasal position. In this study, we examine how the relationship between tonal alignment and stress in Singapore English differs as a function of position within an Intonation Phrase (IP). Singapore English speakers produced sentences containing trisyllabic words with either initial or medial stress. These occurred in Accentual Phrases (APs) that were either medial or final in the IP.\nFor both positions, two broad patterns emerged. In one pattern, a low trough early in the AP was followed by a rise. In the other, there was a fall from the previous AP to a low elbow followed by a plateau. For both positions and patterns, the early L aligned to either the beginning of the AP or the stressed syllable. The alignment of the peaks (rises) and fall onsets (plateaux) differed by position. For medial targets, this aligned to the end of the AP, whereas for final targets, it aligned to the end of the stressed syllable.\nThese findings contrast sharply with earlier findings that tonal alignment is not sensitive to stress for IP-initial words, suggesting that cues to phrasal and word-level prominence involve a complex trading relation."
   ],
   "doi": "10.21437/TAL.2018-30"
  },
  "lai18_tal": {
   "authors": [
    [
     "Li-Fang",
     "Lai"
    ],
    [
     "Shelome",
     "Gooden"
    ]
   ],
   "title": "Tonal Hybridization in Yami-Mandarin Contact",
   "original": "7",
   "page_count": 5,
   "order": 8,
   "p1": 32,
   "pn": 36,
   "abstract": [
    "Yami, an endangered Austronesian language spoken on Orchid Island in Taiwan has been under heavy influence from Mandarin for several decades. In the current linguistic ecology, the pressure of Mandarin on Yami is increasing and its influence has been reported in Yami intonation. This study, on the flip side, examines whether Yami influence has also diffused through the Mandarin spoken on Orchid Island. Taiwan Mandarin speakers make a three-way distinction in sentence intonation: (1) falling statements, (2) level neutral questions and statement questions conveying lighter incredulity, and (3) high-rising default statement questions. Orchid Islanders showed deviation in their default statement question intonation by using a high-level intonation. Interestingly, we observed two hybridization patterns in Yami-Mandarin bilingual intonation: one that fuses Yami phono-syntax with Mandarin intonation in Orchid Island Mandarin, and one that incorporates Mandarin phono-syntax with Yami intonation in young islanders' Yami speech. This provides crucial evidence showing that in addition to the overwhelming phenomenon of transfer/borrowing, speakers may combine discrete (sub)strates from different sources. If the innovative, hybrid pattern continues, present-day Yami intonation may evolve over time into a newly-styled system."
   ],
   "doi": "10.21437/TAL.2018-7"
  },
  "han18_tal": {
   "authors": [
    [
     "Yueqiao",
     "Han"
    ],
    [
     "Martijn",
     "Goudbeek"
    ],
    [
     "Maria",
     "Mos"
    ],
    [
     "Marc",
     "Swerts"
    ]
   ],
   "title": "Mandarin Tone Identification in Musicians and Non-musicians: Effects of Modality and Speaking Style",
   "original": "24",
   "page_count": 5,
   "order": 27,
   "p1": 119,
   "pn": 123,
   "abstract": [
    "A considerable amount of studies has shown that musical ability affects the success of second language learning. Extending the existing body of work, this study investigates the combined effects of musical ability, modality and speaking style for tone-naïve listeners in identifying Mandarin tones. In order to examine the added value of visual information and hyperarticulated speech, Mandarin tones were presented in two modalities (audio-only and audiovisual) and speaking styles (natural and teaching style) to listeners with or without musical experience. Results showed that musicians generally outperformed non-musicians, but that modality and speaking style both affected learning: both accuracy and response times were better in the audiovisual and teaching style conditions. In addition, the tones differed in learnability: the identification of tone 3 proved the easiest and all participants had more difficulty identifying tone 4. Nevertheless, musicians showed significantly greater accuracy in their identification of tones. These findings suggest that learning to perceive Mandarin tones benefits from musical expertise, visual information and hyperarticulated speaking style."
   ],
   "doi": "10.21437/TAL.2018-24"
  },
  "lai18b_tal": {
   "authors": [
    [
     "Wei",
     "Lai"
    ]
   ],
   "title": "Voice Gender Effect on Tone Categorization and Pitch Perception",
   "original": "21",
   "page_count": 5,
   "order": 24,
   "p1": 103,
   "pn": 107,
   "abstract": [
    "Current research on Cantonese tone perception showed that listeners were able to adjust their categorization boundaries between level tones in f0 space depending on the voice gender [1]. The present study followed up on the voice gender normalization effect by replicating the tone identification experiment with an improved design, and further investigating whether the voice gender would affect the low-level pitch sensation in a parallel manner at a prelexical stage. Results from tone identification and pitch perception by Cantonese listeners showed that stimuli presented in male voices would not only give rise to identification of a higher tone, but also perception of a higher pitch, compared to stimuli of the same f0 in female voices. Moreover, the magnitude of this effect on tone identification was significantly correlated with that on pitch perception for individual Cantonese listeners. However, pitch comparison behaviors of English listeners did not show obviously different patterns under different voice gender conditions. Implications were discussed with regards to the integration of indexical cues in phonological categorization and prelexical processing, and its interaction with individual language experience."
   ],
   "doi": "10.21437/TAL.2018-21"
  },
  "dodzi18_tal": {
   "authors": [
    [
     "Kpoglu Promise",
     "Dodzi"
    ],
    [
     "Patin",
     "Cédric"
    ]
   ],
   "title": "Depressor consonants and the tones of Tonjungbe",
   "original": "45",
   "page_count": 5,
   "order": 49,
   "p1": 222,
   "pn": 226,
   "abstract": [
    "This paper is a first introduction to the tone system of T??úgbé, a dialect of Ewe, focusing on its differences with the tone system of other Ewe dialects, on the one hand, and the role of depressor consonants on the other hand. After a brief reminder of the tone system of Ewe, a brief presentation of the tone system of verbs in T??úgbé is provided, indicating that voiced obstruents can operate as depressors in the dialect. A detailed description of the surface tones of root nouns follows, insisting on their acoustic correlates. In addition to the presence of a superhigh tone, the section insists on the presence of a contrast in duration between mid-toned and low-toned nouns, in addition to the difference in pitch realization. Then, a comparison is made between T??úgbé on one hand and A?l?gbe and E?edomegbe on the other hand. Consequences of this comparison on our knowledge of tone in Ewe are addressed in a brief discussion. "
   ],
   "doi": "10.21437/TAL.2018-45"
  },
  "yiu18_tal": {
   "authors": [
    [
     "Suki",
     "Yiu"
    ]
   ],
   "title": "Metrical and Tonal Prominence in Swatou",
   "original": "32",
   "page_count": 5,
   "order": 36,
   "p1": 159,
   "pn": 163,
   "abstract": [
    "This paper explores a metrical interpretation of prominence in Swatou (Teochew, Southern Min), a six-tone language with bi-directional sandhi spoken in the Chaoshan region of China, Hong Kong, and Southeast Asia. It attempts to provide phonetic evidence in terms of duration and intensity to see whether systematic patterns can be observed based on predictions of the Iambic-Trochaic Law. Acoustic data elicited from two native speakers of Swatou was processed with Praat, then submitted to Linear Mixed Effect Regression Models with R to generate estimates for disyllabic units at both positions (i.e. the first and second syllables) of two sandhi types (i.e. anterior and posterior sandhi) for determining whether the durational and intensity contrasts of each estimate point are significantly different. Model comparison was also made to examine whether sandhi type predicts duration and intensity contrasts. Results showed significant duration and intensity contrasts for anterior and posterior sandhi respectively, despite a tendency for higher intensity on the first syllable for both sandhi types. The results largely support a metrical interpretation of prominence in complex tone languages, in addition to the pitch-related cue for tonal prominence in terms of tone sandhi.\nIndex Terms: metrical prominence, tonal prominence, Iambic-Trochaic Law, tone and stress, Swatou, Teochew"
   ],
   "doi": "10.21437/TAL.2018-32"
  },
  "breteler18_tal": {
   "authors": [
    [
     "Jeroen",
     "Breteler"
    ],
    [
     "Paul",
     "Boersma"
    ]
   ],
   "title": "Using simulated learning to account for tone typology",
   "original": "11",
   "page_count": 5,
   "order": 12,
   "p1": 51,
   "pn": 55,
   "abstract": [
    "This study reports on the first investigation into the learnability of tone spread and shift patterns, as determined by computer simulations of the learning process.\nOur simulations are cast within the context of a synchronic analytical framework developed in earlier work.\nThe framework uses licensing constraints and foot structure to drive various kinds of tonal reassociation.\nOne problem with the framework was that it was able to generate various unattested patterns.\nWe address this problem through the learnability simulations; our results show that the representable-but-unattested patterns are harder to learn, explaining their non-attestation.\nThis way, we demonstrate that learnability simulations are a meaningful tool for a typological account of tonal phenomena."
   ],
   "doi": "10.21437/TAL.2018-11"
  },
  "wang18_tal": {
   "authors": [
    [
     "Caiyu",
     "Wang"
    ]
   ],
   "title": "Falsetto tones and Their Evolution in the Southern Hubei",
   "original": "41",
   "page_count": 5,
   "order": 45,
   "p1": 202,
   "pn": 206,
   "abstract": [
    "In the southern Hubei of China, the non-modal phonation types, falsetto and breathy, are used for phonological distinctions and the dialects are uni- (modal-only), di- (falsetto and modal) or tri-phonational (falsetto, modal and breathy). This study is conducted mainly according to the distribution of the falsetto tones. In the five investigated towns, di-phonational varieties co-exist with their corresponding uni-phonational varieties. The acoustic and auditory methods are applied to analyze the first-hand sound data to define falsetto tones and the tonal systems. Consecutive changes are found with the perspective of language evolution. The di- and uni- phonational tonal systems are undertaking the reduction of phonation types and tones. The phonologization of the tonal variations into varieties is strongly driven by phonetic and phonological reasons. The change of the phonation types and the relative tonal distance are found to be the causes for tonal changes. This study of the varieties with their affluent variations will benefit the understanding and definition of tones and shed light on the studies of tonal changes and evolution."
   ],
   "doi": "10.21437/TAL.2018-41"
  },
  "lalhminghlui18_tal": {
   "authors": [
    [
     "Wendy",
     "Lalhminghlui"
    ],
    [
     "Priyankoo",
     "Sarmah"
    ]
   ],
   "title": "Production and Perception of Rising Tone Sandhi in Mizo",
   "original": "23",
   "page_count": 5,
   "order": 26,
   "p1": 114,
   "pn": 118,
   "abstract": [
    "Mizo, a Tibeto-Burman language of the Kuki-Chin group is primarily spoken in the north-east Indian state of Mizoram in Northeast India. Mizo has four lexical tones, namely, high (H), rising (R) , falling (F) and low (L). Mizo tones are mostly dynamic, except the H tone which is a static tone. Previous researches have reported that the rising tone in Mizo changes into low tone when it is followed by either high tone or falling tone which is regarded as rising tone sandhi. The present study analyzes the production and perception of rising tone sandhi. The production data of rising tone sandhi is carried out by comparing the F0 contours of the derived low tone of rising tone sandhi in trisyllabic phrases with the citation form of low tone and low tone in phrases. Results have shown that the F0 contour of rising tone sandhi and the canonical low tone in Mizo are different in terms of F0 contour. The result of perception study in the form of identification test has shown that the speakers of Mizo could distinguish the low tone derived out of rising tone sandhi from the canonical low tone which indicates that tone sandhi in Mizo is perceptually categorical. "
   ],
   "doi": "10.21437/TAL.2018-23"
  },
  "meyase18_tal": {
   "authors": [
    [
     "Savio Megolhuto",
     "Meyase"
    ]
   ],
   "title": "Tenyidie: Another African Tone System in Southeast Asia?",
   "original": "34",
   "page_count": 4,
   "order": 38,
   "p1": 169,
   "pn": 172,
   "abstract": [
    "In this paper, I compare Tenyidie (Angami) with two neighbouring languages Kuki-Thadou and Mizo, which are also Tibeto-Burman, by looking at the similarities and dissimilarities in the tonal aspects, with the knowledge that Kuki-Thadou is known to be an outlier in the language map by showing more of an African tone aspect (Hyman 2007).\nWhile Mizo shows up to be a very typical Tibeto-Burman tone language (Sreenivasan 2015), Tenyidie lies somewhere in between Mizo and Kuki-Thadou in its similarities to African tonal characteristics. The properties of ‘contour tone system’ in Pike (1948) fit more for the Mizo contours and those for ‘register tone system’ fit more for Thadou and Tenyidie. However, while the post-lexical phenomena of ‘downstep’ and ‘downdrift’ are present in Thadou, they are absent in both Mizo and Tenyidie. "
   ],
   "doi": "10.21437/TAL.2018-34"
  },
  "genzel18_tal": {
   "authors": [
    [
     "Susanne",
     "Genzel"
    ]
   ],
   "title": "The non-lax question prosody of Akan",
   "original": "1",
   "page_count": 5,
   "order": 2,
   "p1": 2,
   "pn": 6,
   "abstract": [
    "The paper investigates the acoustics of the final vowel in string-identical Yes-No questions and statements in Akan, a Kwa languages classified as belonging to the group of lax prosody languages. Several spectral measures and measure of periodicity are presented. Results show that the final vowels of Yes-No questions are not characterized by lax laryngeal settings. The final vowel of Yes-No questions is produced with more speech effort due to an additional tonal target at the right edge of the question (L%). The question prosody of Akan thus exhibits non-lax characteristics.\nIndex Terms: African tone language, Yes-No question, prosody, vowel quality"
   ],
   "doi": "10.21437/TAL.2018-1"
  },
  "wang18b_tal": {
   "authors": [
    [
     "Bei",
     "Wang"
    ],
    [
     "Frank",
     "Kügler"
    ],
    [
     "Susanne",
     "Genzel"
    ]
   ],
   "title": "Downstep effect and the interaction with focus and prosodic boundary in Mandarin Chinese",
   "original": "5",
   "page_count": 5,
   "order": 6,
   "p1": 22,
   "pn": 26,
   "abstract": [
    "It has been observed that in a HLH (High-Low-High) tone sequence, the second H tone is lowered in pitch, as compared to a HHH tone sequence, which was termed as downstep. To calculate the downstep effect and test its scope, we compared sentences in the tonal structure of (HHHHHH)(HHHHHHH) to (HHHHHL)(HHHHHHH). The syntactic boundary between the L (X) and the H (Y) was either a syllable boundary or a phrase boundary. Moreover, corrective focus was elicited either on the syllable X, Y, sentence final (Z) or none (wide focus). The results showed that: (1) in the wide focus and sentence-final focus (ZF) condition, downstep can last for several syllables; (2) a phrase boundary did not block downstep; (3) when syllable Y was focused, on-focus F0 raising did not override downstep, however, it stopped the trend of downstep in the following H tones; (4) when syllable X was focused, it caused a post-low-bouncing effect on the following H tones instead. Taken together the data showed that downstep is relatively stable and independent."
   ],
   "doi": "10.21437/TAL.2018-5"
  },
  "dilley18_tal": {
   "authors": [
    [
     "Laura",
     "Dilley"
    ],
    [
     "Mara",
     "Breen"
    ]
   ],
   "title": "An enhanced autosegmental-metrical theory (AM+) facilitates phonetically transparent prosodic annotation",
   "original": "14",
   "page_count": 5,
   "order": 16,
   "p1": 67,
   "pn": 71,
   "abstract": [
    "The application of autosegmental theory to a variety of tonal systems in the past 40 years has spurred a wealth of insight. This general theoretic framework, informed by metrical stress theory, has come to be known as autosegmental-metrical (AM) theory. The application of this theory to intonation languages spawned a family of transcription approaches known generally as Tones and Break Indices, or ToBI. Yet, a number of weaknesses and limitations have been noted, both at the theoretical level and the empirical level with ToBI.\nWe show here that core limitations in the traditional AM theoretic approach can be traced clearly to a failure to consistently and transparently encode syntagmatic relationships in phonology. Building on the core insights of traditional AM theory from the past 40 years, and drawing on empirical evidence about cognitive representations for pitch from phonetics, music cognition, music theory, and cognitive neuroscience, we propose a new theoretic approach, termed enhanced AM theory, or AM+. This proposal offers a theoretical clarification of syntagmatic elements in phonology. It is shown that attributing both syntagmatic and paradigmatic properties to tones provides a unifying account of multiple outstanding challenges in tone and intonation research. "
   ],
   "doi": "10.21437/TAL.2018-14"
  },
  "arjmandi18_tal": {
   "authors": [
    [
     "Meisam",
     "Arjmandi"
    ],
    [
     "Laura",
     "Dilley"
    ],
    [
     "Matt",
     "Lehet"
    ]
   ],
   "title": "A Comprehensive Framework for F0 Estimation and Sampling in Modeling Prosodic Variation in Infant-Directed Speech",
   "original": "15",
   "page_count": 5,
   "order": 17,
   "p1": 72,
   "pn": 76,
   "abstract": [
    "Accurate estimates of F0 are essential for modeling how pitch variation is used as an informative cue to linguistic structure. Multiple challenges exist for estimation and valid statistical modeling of F0 variation. First, certain speech styles, such as infant-directed speech, can involve dramatic pitch variation across utterances. Second, non-modal phonation can cause spurious F0 values. Third, F0 samples are not independent of one another, leading to issues with validity in applying generalized linear mixed effect models (GLMMs). To address these problems, we propose a comprehensive framework for accurate F0 estimation and sampling to model prosodic variation. Our method involves segmentation of speech into utterances, followed by determination of speaker- and utterance-specific pitch range parameters. Regions of non-modal phonation are identified, ensuring that portions of speech leading to spurious F0 values are rejected early. Next, F0 stylization at the utterance level ensures robustness to microprosodic variation. Finally, F0 turning points (e.g., local F0 minima and maxima) are extracted; these are linguistically significant “control points” in F0 contours connected by monotonic interpolations. This overall approach not only ensures accurate F0 estimates, but critically overcomes the problem of non-independence of successive samples for valid statistical treatments within GLMMs."
   ],
   "doi": "10.21437/TAL.2018-15"
  },
  "borise18_tal": {
   "authors": [
    [
     "Lena",
     "Borise"
    ],
    [
     "Xavier",
     "Zientarski"
    ]
   ],
   "title": "Word Stress and Phrase Accent in Georgian",
   "original": "42",
   "page_count": 5,
   "order": 46,
   "p1": 207,
   "pn": 211,
   "abstract": [
    "This paper investigates the properties of stress in Georgian (Kartvelian). There is no agreement in the literature as to the existence or location of stress in Georgian; initial, penultimate or antepenultimate syllables are often quoted as possible stress loci, with potentially more than one of these carrying stress in longer words. It has also been noted that the F0 contour of a word/phrase plays an important role in Georgian, leading to hypotheses that pitch might be the primary cue for stress in Georgian. This paper reports on a pilot study that contributes to disentangling these issues. It concludes Georgian has fixed initial stress, which is primarily duration-based and is easiest to detect in shorter words, while in longer words its durational effect is obscured by polysyllabic shortening. There is no evidence, however, for a similar duration-based stress-like target on the antepenultimate/ penultimate syllable. Instead, it is a pitch target that is part of the prosodic makeup of a phrase. The high importance of this pitch target for the prosodic felicity of an utterance, and the insignificant role that stress plays in the overall phonological make-up of Georgian, raise questions about the typological properties of the loci of word-level and phrase-level prominence."
   ],
   "doi": "10.21437/TAL.2018-42"
  },
  "caballero18_tal": {
   "authors": [
    [
     "Gabriella",
     "Caballero"
    ],
    [
     "Sharon",
     "Rose"
    ]
   ],
   "title": "Construction-based tone patterns in Choguita Raramuri and Cilungu",
   "original": "9",
   "page_count": 5,
   "order": 10,
   "p1": 41,
   "pn": 45,
   "abstract": [
    "Through examination of the inflectional tone marking properties of Choguita Rarámuri (Tarahumara), a Uto-Aztecan language spoken in Northern Mexico, this paper assesses the benefits of a construction-morphology approach, compared to an autosegmental morphemic tone approach. Choguita Rarámuri is a prosodically complex language with both stress-accent and a three-way lexical tonal contrast (with H, L and HL tones). Tone distribution is dependent on stress-accent, which is in turn morphologically governed. As a result, many tonal patterns in this language are predictable based on the lexical tone properties of roots and affixes and the distribution of stress. In addition, tone also serves a morphological role in the language, via patterns of grammatical tone, morphologically conditioned tonal effects and paradigmatic distribution of tonal melodies, all of which may trigger overwriting of lexical tones. Based on data obtained through field research, this paper shows that a construction-based analysis captures several properties of inflectional tone in this system, including: (i) arbitrary relationship between tone patterns of related forms, (ii) heterogeneous nature of morphosyntactic classes expressed by tone melodies, and (iii) overwriting/avoidance of lexical tone by grammatical tone."
   ],
   "doi": "10.21437/TAL.2018-9"
  },
  "silbervarod18_tal": {
   "authors": [
    [
     "Vered",
     "Silber-Varod"
    ],
    [
     "Hamutal",
     "Kreiner"
    ],
    [
     "Noam",
     "Amir"
    ]
   ],
   "title": "Context dependent and time-course dependent prosodic analysis",
   "original": "43",
   "page_count": 5,
   "order": 47,
   "p1": 212,
   "pn": 216,
   "abstract": [
    "",
    " In this preliminary study, we examine the change in prosodic parameters along personal interviews comprised of six questions. Our purpose is to demonstrate the importance of examining prosodic discourse context when studying conversational prosody. Findings show that as the interview unfolds, speakers tend to increase their speaking rate in longer IPUs while their intensity is lowered, and its instability increases. It is suggested here that the meaningful context that might explain the behavior of the acoustic parameters is the level of intimacy for one group of features, and the level of fluency and \"easy going\" topic for a different group of features. This preliminary study shows that context dependent and time-course dependent prosodic analysis are associated with the discourse content and can assist in understanding the discourse as a whole and the interaction in which it occurred. "
   ],
   "doi": "10.21437/TAL.2018-43"
  }
 },
 "sessions": [
  {
   "title": "Keynote",
   "papers": [
    "dichter18_tal"
   ]
  },
  {
   "title": "Oral session 1: Tone, accent, and intonation I",
   "papers": [
    "genzel18_tal",
    "kuang18_tal",
    "syed18_tal",
    "patin18_tal"
   ]
  },
  {
   "title": "Oral session 2: Tone, accent, and intonation II",
   "papers": [
    "wang18b_tal",
    "hualde18b_tal",
    "lai18_tal",
    "pan18_tal"
   ]
  },
  {
   "title": "Oral session  3: Typology of tones and tone languages",
   "papers": [
    "caballero18_tal",
    "yang18_tal",
    "breteler18_tal",
    "gao18_tal"
   ]
  },
  {
   "title": "Keynote",
   "papers": [
    "kula18_tal"
   ]
  },
  {
   "title": "Oral session 4: Modeling of tonal aspects of languages",
   "papers": [
    "mcpherson18_tal",
    "dilley18_tal",
    "arjmandi18_tal",
    "grabowski18_tal"
   ]
  },
  {
   "title": "Keynote",
   "papers": [
    "kugler18_tal"
   ]
  },
  {
   "title": "Oral session 5: Tone production and perception I",
   "papers": [
    "peralta18_tal",
    "huang18_tal",
    "acharyya18_tal",
    "hualde18_tal"
   ]
  },
  {
   "title": "Oral session 6: Tone production and perception II",
   "papers": [
    "lai18b_tal",
    "ramachers18_tal",
    "lalhminghlui18_tal",
    "han18_tal"
   ]
  },
  {
   "title": "Oral session 7: Psychological and neural mechanisms of tones",
   "papers": [
    "kelterer18_tal",
    "zhang18_tal",
    "ho18_tal"
   ]
  },
  {
   "title": "Keynote",
   "papers": [
    "vainio18_tal"
   ]
  },
  {
   "title": "Poster session:",
   "papers": [
    "bahmanian18_tal",
    "kuo18_tal",
    "german18_tal",
    "rahmani18_tal",
    "yiu18_tal",
    "feng18_tal",
    "meyase18_tal",
    "mckendry18_tal",
    "hussein18_tal",
    "gerazov18_tal",
    "lin18_tal",
    "ren18_tal",
    "chow18_tal",
    "wang18_tal",
    "borise18_tal"
   ]
  },
  {
   "title": "Oral session 8: Phonology and phonetics of tones",
   "papers": [
    "silbervarod18_tal",
    "lee18_tal",
    "dodzi18_tal",
    "zhang18b_tal"
   ]
  },
  {
   "title": "Oral session 9: Cross-linguistic study of tone languages and non-tone languages",
   "papers": [
    "liu18_tal",
    "zhang18c_tal",
    "vogel18_tal",
    "hao18_tal",
    "hu18_tal"
   ]
  }
 ],
 "doi": "10.21437/TAL.2018"
}