{
 "title": "2nd International Symposium on Tonal Aspects of Languages (TAL 2006)",
 "location": "La Rochelle, France",
 "startDate": "27/4/2006",
 "endDate": "29/4/2006",
 "conf": "TAL",
 "year": "2006",
 "name": "tal_2006",
 "series": "TAL",
 "SIG": "SProSIG",
 "title1": "2nd International Symposium on Tonal Aspects of Languages",
 "title2": "(TAL 2006)",
 "date": "27-29 April 2006",
 "booklet": "tal_2006.pdf",
 "papers": {
  "fujisaki06_tal": {
   "authors": [
    [
     "Hiroya",
     "Fujisaki"
    ]
   ],
   "title": "The roles of a generative model in the study of tonal features of speech",
   "original": "tal6_001",
   "page_count": 1,
   "order": 1,
   "p1": "1",
   "pn": "",
   "abstract": [
    "This paper presents the author's view on the roles of models in the study of speech, with particular emphasis on generative and quantitative models in studying tone and intonation, and explains the importance of physiology, physics and mathematics in constructing such models. It then describes the author's own approach in building a model for the process of generation of the contour of the fundamental frequency (henceforth the F0 contour) of speech. Finally, it illustrates the use of the model in various aspects of speech research..   In the study of phonetic and phonological aspects of prosody, the model provides a means to analyze an observed F0 contour of an utterance into its constituent components, and allows one to define the units and structures of prosody, not only of words, phrases, and sentences, but also of larger units of spoken language. This will be demonstrated by a study of prosodic organization of Japanese text reading.   In speech analysis and synthesis, the model provides a means to generate extremely close approximations to observedF0 contours from a limited number of commands that broadly correspond to the lexical and syntactic information of the corresponding text, but not entirely constrained by the text. This point is illustrated by examples from many languages. A conspicuous advantage of the model over other models is that F0 contours generated by the model retain their naturalness even when they are not close approximations to observed F0 contours. This is because the model incorporates the constraints imposed by the physiological and physical properties of the mechanisms of laryngeal control.   In speech recognition, the model can be used to provide information on the syntactic structure and the lexical constituents of an utterance, and thus to improve the recognition performance that is obtained by using only segmental information.   Finally, the model provides a novel means to look at the typological differences and the phonological structures of tone systems of various tone languages. This point will be discussed only briefly here, but will be described in more detail in a separate contributed paper at this symposium.\n",
    ""
   ]
  },
  "rialland06_tal": {
   "authors": [
    [
     "Annie",
     "Rialland"
    ]
   ],
   "title": "Questions for a round table on \"tone and intonation\"",
   "original": "tal6_002",
   "page_count": 5,
   "order": 2,
   "p1": "2",
   "pn": "6",
   "abstract": [
    "This paper introduces questions to be discussed in a round-table on \"Tone and intonation\". Considering the state of the art, we propose the following topics: Downstep preplanning and downstep patterns &# 29;Question prosody and prosodic universals &# 29;Focus prosody and prosodic universals &# 29;\"Boundary tones\", \"intonational tails\" and \"particles\".\n",
    ""
   ]
  },
  "tseng06_tal": {
   "authors": [
    [
     "Chiu-yu",
     "Tseng"
    ]
   ],
   "title": "Higher level organization and discourse prosody",
   "original": "tal6_007",
   "page_count": 12,
   "order": 3,
   "p1": "7",
   "pn": "18",
   "abstract": [
    "This paper addresses higher level organization in discourse prosody. Fluent speech prosody of text reading illustrated higher level speech planning above phrases and prosody segments above intonation units. Adopting a top-down perspective allowed clearer reflection of scope and unit involved. We examined large amount of speech data via a corpus approach, studied read discourse through perceived boundaries, analyzed prosodic characteristics of between-boundary units, and found evidence of higher prosodic specifications above phrase intonation. Through tailored quantitative analyses corresponding to a multi-layer prosodic hierarchy, we found how different prosodic levels contribute separately to prosody output, and how cumulative contributions added up to output prosody. The prosody hierarchy specifies that speech paragraphs are immediate constituents of discourse; phrases immediate constitute of speech paragraphs. Lower level nodes are subjacent units subject to higher level constraints; sister constituents bear association to one another. Hence central to discourse prosody is higher level specification as well as cross-phrase association in addition to discrete intonation patterns. Cross-phrase cadence templates could be derived to account for the melody, rhythm, loudness and boundary breaks of fluent speech. Further, evidence of cross-paragraph discourse association is also found. We believe in addition to advance understanding of discourse prosody; the knowledge is also directly applicable to speech technology development, especially speech synthesis. Index terms: higher level organization, speech prosody, prosodic phrase grouping (PG), prosodic hierarchy, top-down, multi-phrase, cross-phrase association, templates, speech planning, global F0 templates, temporal allocations, syllable duration patterns, intensity distribution, boundary breaks\n",
    ""
   ]
  },
  "xu06_tal": {
   "authors": [
    [
     "Yi",
     "Xu"
    ]
   ],
   "title": "Principles of tone research",
   "original": "tal6_019",
   "page_count": 11,
   "order": 4,
   "p1": "19",
   "pn": "29",
   "abstract": [
    "Current advances in tone research are rather uneven. The major obstacles to faster progress in the area are not in the lack of technological means, but in the mindset of our discipline. This paper discusses ways to improve tone research by considering a set of basic principles both in research methodology and in theoretical thinking.\n",
    ""
   ]
  },
  "adumanyah06_tal": {
   "authors": [
    [
     "Kofi",
     "Adu Manyah"
    ]
   ],
   "title": "Relation between tone and vowel quality in Twi",
   "original": "tal6_030",
   "page_count": 5,
   "order": 5,
   "p1": "30",
   "pn": "34",
   "abstract": [
    "This study is part of a programmatic research on Twi undertaken at the laboratory of general and experimental phonetics at the Institut de Phonétique de Strasbourg. Twi is a register tone language spoken in Ghana, West Africa. It has a two tone system (high/low) and the downstep phenomena.   The aim of this paper is two-fold. First, some phonological aspects of Twi tones are described. Second, preliminary acoustic measurements are carried out to investigate for differences between vowel quality in the two groups. In this preliminary analysis, two adult male speakers produced a series of isolated words belonging to the two phonological classes.   The evidence from our acoustic data is for high tones to have higher fundamental frequency values than low tones. Acoustic results further show that high and low tones show sparse qualitative (F1, F2, F3 and F4) as well as sparse syllabic durational differences. However, the tendency is also for low tones to have lower F1, higher F2, higher F3 and lower F4 values than the high counterparts.\n",
    ""
   ]
  },
  "chen06_tal": {
   "authors": [
    [
     "Hua",
     "Chen"
    ]
   ],
   "title": "Tone patterns in Chinese EFL learners' read speech",
   "original": "tal6_035",
   "page_count": 4,
   "order": 6,
   "p1": "35",
   "pn": "38",
   "abstract": [
    "This study employs a method in experimental phonetics to investigate the use of tones in 45 Chinese EFL learners' read speech. The study is based on O'Connor & Arnold's (1973) descriptions of tones of English, and takes the recorded spoken data of 8 English-speaking British university students as the norm for comparison. Findings of the study indicate that, so far as primary tones are concerned, most of the learners know how to use falling and rising tones to a satisfactory extent, but serious problems prevail in their use of level tones. Further, many learners could not express their attitudes and moods by using appropriate secondary tones. As many of the characteristics found in these learners have also been reported to exist in EFL learners of other cultural and ethnic backgrounds, the results of this study seem to confirm the belief that there exists an interlanguage intonation system. This study has important implications for how EFL learners should convey their intended meanings with the proper use of different tones, as well as for the teaching of intonation in L2 pedagogy.\n",
    ""
   ]
  },
  "chen06b_tal": {
   "authors": [
    [
     "Xiaoxia",
     "Chen"
    ]
   ],
   "title": "The research for the effect of speaking rate to segmental reduction",
   "original": "tal6_039",
   "page_count": 4,
   "order": 7,
   "p1": "39",
   "pn": "42",
   "abstract": [
    "This paper mainly researches the speaking rate effect for segmental reduction in a phrase word. Four speakers spoke eight words with different speaking rates. The investigation includes the durational variation of each syllable, the durational variation of each semi-syllable and the total word duration variation. Different speakersf material in read speech was explored at last.\n",
    ""
   ]
  },
  "cheung06_tal": {
   "authors": [
    [
     "Yuk-Man",
     "Cheung"
    ]
   ],
   "title": "The F0 patterns of tones in Hakka Chinese",
   "original": "tal6_043",
   "page_count": 4,
   "order": 8,
   "p1": "43",
   "pn": "46",
   "abstract": [
    "This paper investigates the patterns of the F0 contours for the two level tones [44, 11], two falling tones [52, 31] and two short tones [5, 1] on syllables that associated with vowels [i, a, u] in Meixian Hakka, which is one of the Chinese dialects. Results show that (i) the F0 contours of the two level tones are level as expected and the difference in F0 value between the two tones is around 50 Hz; (ii) the F0 values of the ending points of the F0 contours for the two falling tones are similar. The two tones are acoustically differentiated by the starting point, the highest point and the shape of the F0 contour; (iii) the high short tones tend to be level, whereas the low short tones tend to be falling; and (iv) the differences between the F0 patterns of the tones on syllables with different vowels are due to the influence of the initial consonants.\n",
    ""
   ]
  },
  "dominicis06_tal": {
   "authors": [
    [
     "Amedeo De",
     "Dominicis"
    ]
   ],
   "title": "Tonal patterns of Gizey",
   "original": "tal6_047",
   "page_count": 6,
   "order": 9,
   "p1": "47",
   "pn": "52",
   "abstract": [
    "This paper aims to give the first description of tones in Gizey. The description will be carried out not only on the basis of the analysis of speech production, but also by means of perceptive tests.\n",
    ""
   ]
  },
  "fujisaki06b_tal": {
   "authors": [
    [
     "Hiroya",
     "Fujisaki"
    ],
    [
     "Wentao",
     "Gu"
    ]
   ],
   "title": "Phonological representation of tone systems of some tone languages based on the command-response model for F0 contour generation",
   "original": "tal6_053",
   "page_count": 4,
   "order": 10,
   "p1": "53",
   "pn": "56",
   "abstract": [
    "After reviewing three traditional approaches to the description of tones and their essential shortcomings in deriving the phonological structure of a tone language, the present paper describes the authors' own approach to extract both quantitative and qualitative characteristics of tones from the contours of fundamental frequency, and presents a novel framework for describing the phonological structure of the tone system of a tone language, based on the pattern of tone commands obtained from the fundamental frequency contours using the command-response model. The classification of tone command patterns is based on ternary distinction (positive-null-negative)  of command polarity and binary distinction (early-late) of timing of occurrence of tone commands. The validity of the approach is demonstrated by several example languages including Mandarin, Shanghainese, Thai, Vietnamese and Lanqi. It is also shown that a finer distinction of tone command amplitude becomes necessary for the tone system of Cantonese.\n",
    ""
   ]
  },
  "gussenhoven06_tal": {
   "authors": [
    [
     "Carlos",
     "Gussenhoven"
    ]
   ],
   "title": "Nubi is not a tone language",
   "original": "tal6_057",
   "page_count": 4,
   "order": 11,
   "p1": "57",
   "pn": "60",
   "abstract": [
    "This paper argues that Nubi, an Arabic creole spoken in Bombo, Uganda (among other places) escapes a categorization as either a tone language or a stress-accent languages. It could be classified as a pitch accent language in the sense of Beckman (1986), but unlike languages like Tokyo Japanese lacks a class of unaccented words.\n",
    "",
    "",
    "Beckman, M. E. (1986). Stress and Non-stress Accent. Dordrecht: Foris.\n",
    ""
   ]
  },
  "gu06_tal": {
   "authors": [
    [
     "Wentao",
     "Gu"
    ],
    [
     "Keikichi",
     "Hirose"
    ],
    [
     "Hiroya",
     "Fujisaki"
    ]
   ],
   "title": "A comparative study between intonation question and particle question in Cantonese on their realization of F0 contours",
   "original": "tal6_061",
   "page_count": 4,
   "order": 12,
   "p1": "61",
   "pn": "64",
   "abstract": [
    "Question has a significant effect on F0 contours in various languages, among which tone languages require more careful study because of the complex interaction between lexical tones and phrase intonation. In this study we employ the command-response model to compare the realization of F0 contours in two types of questions in Cantonese, a typical tone language with nine lexical tones. In intonation question, the tone command in the later part of the sentence-final syllable is substituted by a positive tone command. Particle question, on the other hand, maintains the inherent tone command pattern for the sentence-final particle. In both cases, the effect of question on F0 contours is localized in the sentence-final part, not only by an addition of sentence-final phrase command, but also by the question ending tone command, the absolute amplitude of which is usually larger and also indicates the degree of inquisitive intention.\n",
    ""
   ]
  },
  "gu06b_tal": {
   "authors": [
    [
     "Wentao",
     "Gu"
    ],
    [
     "Keikichi",
     "Hirose"
    ],
    [
     "Hiroya",
     "Fujisaki"
    ]
   ],
   "title": "Modeling the tones in Suzhou and Wujiang dialects on the basis of the command-response model for the process of F0 contour generation",
   "original": "tal6_065",
   "page_count": 4,
   "order": 13,
   "p1": "65",
   "pn": "68",
   "abstract": [
    "Suzhou dialect and Wujiang dialect, as two examples of Chinese Wu dialects, have complex tone systems consisting of 7 and 12 lexical tones respectively. In order to overcome the limitations of the traditional 5-level tone code system, the command-response model for the process of F0 contour generation is employed to analyze quantitatively the lexical tones in continuous speech of these two dialects. The analysis shows that there can be as many as three tone commands within a syllable. Not only the polarities but also the timing and amplitudes of tone commands can be varied to distinguish different tones. Especially, the tones sharing the same command polarities are compared in each dialect. By providing both phonological interpretations to each lexical tone and quantitative descriptions to continuous F0 contours, the command-response model shows the validity of being applied to tone languages with very complex tone systems.\n",
    ""
   ]
  },
  "ho06_tal": {
   "authors": [
    [
     "Vincie W. S.",
     "Ho"
    ]
   ],
   "title": "An optimality-theoretic analysis of the tone-melody mapping in Cantonese popular songs",
   "original": "tal6_069",
   "page_count": 4,
   "order": 14,
   "p1": "69",
   "pn": "72",
   "abstract": [
    "This paper provides a preliminary analysis of some mapping phenomena at the tone-melody interface in Cantonese popular songs. Pitch is one of the common acoustic properties shared by language and music. In tone languages in particular, pitch variations are contrastive and therefore play an important role in differentiating word meanings. The question that arises is whether the lexical tones correspond to the melody of a song written in these languages, and if so, to what extent and how tone and tune match. This study investigates a sample of popular songs written in Cantonese, a language with a relatively complex tonal inventory. In all the Cantonese songs collected and analyzed, it is observed that tone and tune correlate closely, and the patterns of correlation are found to be quite systematic. It is suggested that these regular mapping characteristics can be accounted for by constraint interaction from the optimality-theoretic perspective. Optimality Theory, being one of the current central linguistic theories in the areas of phonology and syntax, is adopted as the theoretical framework in this study, and is extended to address tonal issues at the interface of language and music.\n",
    ""
   ]
  },
  "jia06_tal": {
   "authors": [
    [
     "Yuan",
     "Jia"
    ],
    [
     "Ziyu",
     "Xiong"
    ],
    [
     "Aijun",
     "Li"
    ]
   ],
   "title": "Narrow focus patterns of disyllabic words with different morphosyntactic structures in standard Chinese",
   "original": "tal6_073",
   "page_count": 4,
   "order": 15,
   "p1": "73",
   "pn": "76",
   "abstract": [
    "The present study investigates the phonetic realization and phonological patterns of focal accents of disyllabic words with different inner morphosyntactic structures in standard Chinese. This was done through the study of phonetic realization of disyllabic focused words with Modifier-Head, Reduplicated and Prefix-Stem (MH, Rd, and PS hereafter, respectively) structures in short declarative sentences of Mandarin. These target sentences each consists of seven syllables with three kinds of focused words in different positions of the sentences. The sentences involved in the present study were applied with only one focus condition: narrow focus, and by one speaker. Results of acoustic and frequency analyses show that the distribution of focal accents is restricted by the inner morphosyntactic structure of the focused words; therefore, we propose the phonological patterns of disyllabic narrow focused constituents through the theoretical model of Metrical phonology (Liberman and Prince, 1977), that is, w-s relation for MH structure, s-w for Rd structure and w-s for PS structure.\n",
    "",
    "",
    "Liberman, Mark and Alan Prince. 1977. On stress and linguistic rhythm. LI 8.\n",
    ""
   ]
  },
  "kugler06_tal": {
   "authors": [
    [
     "Frank",
     "Kügler"
    ],
    [
     "Stavros",
     "Skopeteas"
    ]
   ],
   "title": "Interaction of lexical tone and information structure in Yucatec Maya",
   "original": "tal6_077",
   "page_count": 6,
   "order": 16,
   "p1": "77",
   "pn": "82",
   "abstract": [
    "Previous research on the tone system of Yucatec Maya provides contradictory accounts which this paper intends to do away with, disentangling tonal and intonational effects. The first part presents the mere realisation of lexical high and low tones, the only tonal distinction we identify for Yucatec Maya. Second, we claim that in Yucatec Maya no interaction exists between intonation and lexical tone. We prove this claim showing that neither topic nor focus is realized by means of intonational pitch accents; instead they are marked only by syntax. Deviating tonal patterns from tonal default realisation are a result of tonal effects that surface as tonal transitions, and/or phrasing effects\n",
    ""
   ]
  },
  "lei06_tal": {
   "authors": [
    [
     "Ka Yan Margaret",
     "Lei"
    ]
   ],
   "title": "A phonetic study on the acquisition of Cantonese tone",
   "original": "tal6_083",
   "page_count": 4,
   "order": 17,
   "p1": "83",
   "pn": "86",
   "abstract": [
    "This study adopts an acoustical approach in analyzing the fundamental frequency (F0) patterns in tonal production of a Cantonese-speaking child, based on audio data from the Hong Kong Cantonese Child Language Corpus (CANCORP) [1]. Through examining F0 patterns and variability on the production of different types of tones in Cantonese, the study attempts to address issues in the acquisition of tone by Cantonese-acquiring children.\n",
    ""
   ]
  },
  "ma06_tal": {
   "authors": [
    [
     "Joan K.-Y.",
     "Ma"
    ],
    [
     "Valter",
     "Ciocca"
    ],
    [
     "Tara L.",
     "Whitehill"
    ]
   ],
   "title": "Perception of intonation in Cantonese",
   "original": "tal6_087",
   "page_count": 4,
   "order": 18,
   "p1": "87",
   "pn": "90",
   "abstract": [
    "This study investigated the significance of different intonation markers in intonation perception, and the effect of lexical tone on the perception of intonation. Six tonal contrasts at the final position were presented to twelve listeners in three presentation conditions: complete sentence, carrier-only and final-syllable-only. Results showed similar perceptual accuracy in both complete sentence and final-syllable-only conditions, but significantly poorer performance was observed in the carrier-only condition. This showed that intonation markings at the final position are important for correct intonation identification, when compared with perceptual cues of the carrier. In addition, differences in perceptual accuracy were noted for statements and questions embedded with different tones at the final position, suggesting that lexical tone has an effect on the identity of intonation\n",
    ""
   ]
  },
  "mixdorff06_tal": {
   "authors": [
    [
     "Hansjörg",
     "Mixdorff"
    ],
    [
     "Mai Chi",
     "Lirong"
    ],
    [
     "Dung Tien",
     "Nguyen"
    ],
    [
     "Denis",
     "Burnham"
    ]
   ],
   "title": "Syllabic tone perception in Vietnamese",
   "original": "tal6_091",
   "page_count": 4,
   "order": 19,
   "p1": "91",
   "pn": "94",
   "abstract": [
    "This paper discusses tone perception in Vietnamese under audio only and audio plus video conditions. The lower part of a male speaker's face was recorded on digital video as he uttered 22 sets of syllabic tokens covering the six different tones of Vietnamese. In a perception study the audio signal alone, as well as audio plus video conditions were presented to native Vietnamese speakers who were required to decide which tone they perceived. Audio was presented in various conditions: clear and babble-noise masked at different SNR levels, as well as a devoiced noise condition using LPC resynthesis. In the devoiced and the clear audio conditions, there is little augmentation of audio alone due to the addition of video. However, the addition of visual information did significantly improve perception in the babble-noise masked condition at an SNR of -9 dB. This outcome suggests that the improvement in noise-masked conditions is not due to additional information in the video per se, but rather to an effect of early integration of acoustic and visual cues facilitating auditory-visual speech perception.\n",
    ""
   ]
  },
  "tao06_tal": {
   "authors": [
    [
     "Jianhua",
     "Tao"
    ],
    [
     "Jian",
     "Yu"
    ]
   ],
   "title": "The pause duration prediction for Mandarin text to speech system",
   "original": "tal6_095",
   "page_count": 4,
   "order": 20,
   "p1": "95",
   "pn": "98",
   "abstract": [
    "In the paper, we enter into detailed analysis on how the pause duration under different prosodic boundaries are affected by various contextual factors in natural speech. To get the correlation between them, the paper calculates the mean pause duration under different prosodic boundaries. The contextual factors investigated in this paper contains both linguistic features, such as boundary types, syllable tones of boundary sides, initial and final types etc, and acoustic features, such as pitch gap across the boundary. The paper made experiments and discussions to reveal the influence of these factors on pause duration. Based on that, the paper creates a pause duration prediction model for mandarin speech synthesis system. The model was proved to be able to generate high quality prosody output with the listening test.\n",
    ""
   ]
  },
  "thurgood06_tal": {
   "authors": [
    [
     "Ela",
     "Thurgood"
    ]
   ],
   "title": "An exploration of intrinsic F0 in Hainan Cham tones",
   "original": "tal6_099",
   "page_count": 4,
   "order": 21,
   "p1": "99",
   "pn": "102",
   "abstract": [
    "In this study, the correlations in Hainan Cham between IF0 and tones are analyzed. The study shows that, while for five speakers it is possible to suggest that this correlation is an automatic consequence of vowel production, one subject shows an especially exaggerated IF0 effect that suggests a deliberate auditory enhancement. The study also shows a non-mechanical enhancement of IF0 to enhance a vowel contrast but one that does not put the tonal contrasts at risk.\n",
    ""
   ]
  },
  "tran06_tal": {
   "authors": [
    [
     "Do Dat",
     "Tran"
    ],
    [
     "Eric",
     "Castelli"
    ],
    [
     "Xuan Hung",
     "Le"
    ],
    [
     "Jean-FrançOis",
     "Serignat"
    ],
    [
     "Van Loan",
     "Trinh"
    ]
   ],
   "title": "Linear F0 contour model for vietnamese tones and vietnamese syllable synthesis with TD-PSOLA",
   "original": "tal6_103",
   "page_count": 5,
   "order": 22,
   "p1": "103",
   "pn": "107",
   "abstract": [
    "Understanding and managing tonal characteristics of Vietnamese language is one of the most difficult aspects in Vietnamese speech processing. Our newest results indicate that, the initial consonant of one Vietnamese syllable does not carry information of the tone, the Vietnamese tone has an effect only on the Final part of the syllable. Based on obtained results, this article proposes linear F0 contour models for the generation of Vietnamese tones. These models only describe the F0 evolution of a final part of the Vietnamese syllable, and they are evaluated through perception tests.\n",
    ""
   ]
  },
  "tseng06b_tal": {
   "authors": [
    [
     "Chiu-yu",
     "Tseng"
    ],
    [
     "Zhao-yu",
     "Su"
    ],
    [
     "Chun-Hsiang",
     "Chang"
    ],
    [
     "Chia-hung",
     "Tai"
    ]
   ],
   "title": "Prosodic fillers and discourse markers–discourse prosody and text prediction",
   "original": "tal6_108",
   "page_count": 6,
   "order": 23,
   "p1": "108",
   "pn": "113",
   "abstract": [
    "Mandarin Chinese fluent speech prosody is characterized by a hierarchical multiple-phrase structure that specifies how speech paragraphs are constituted via Prosodic Phrase Grouping. Hence we view spoken discourse prosody as yet another higher node treats PGs (Prosodic Phrase Groups) as sister constituents. The goals of present study are two fold: one is to study how speech paragraphs are connected in speech flow; another is to derive prosody prediction from text analysis. Investigating cross-phrase F0 range narrowing and F0 reset with boundary information, we further conducted corresponding text analysis for prosody prediction. Results revealed two types of PG connectors, one is redundant Prosodic Fillers (PF) that are mostly duration triggered and manifested through narrowed F0 ranges; another is obligatory Discourse Markers (DM) that are lexically and/or syntactically triggered and manifested through widened F0 ranges and resets. Both could be predicted from text analysis. We believe this is a significant step forward towards understanding the organization of discourse prosody. It could also be applied to speech synthesis and/or unlimited TTS for prosody enhancement.\n",
    ""
   ]
  },
  "vainio06_tal": {
   "authors": [
    [
     "Martti",
     "Vainio"
    ],
    [
     "Daniel",
     "Aalto"
    ],
    [
     "Juhani",
     "Järvikivi"
    ],
    [
     "Antti",
     "Suni"
    ]
   ],
   "title": "Quantity and tone in Finnish lexically stressed syllables",
   "original": "tal6_114",
   "page_count": 4,
   "order": 24,
   "p1": "114",
   "pn": "117",
   "abstract": [
    "This paper presents results from a study on the tonal aspects of quantity in Finnish lexically stressed syllables. Fourteen speakers produced a set of 66 utterances where the quantity and structure of the lexically stressed syllable was systematically varied. The tonal aspects of the syllable nucleus and nucleus and coda in case of closed syllables was studied in the framework of the Target Approximation theory as formulated by Yi Xu. The results show a clear tendency towards the quantity distinction and bimoracity in general in Finnish to be signalled tonally by a dynamic falling tone as opposed to a static high tone in short (one mora) nuclei.\n",
    ""
   ]
  },
  "wong06_tal": {
   "authors": [
    [
     "Ying Wai",
     "Wong"
    ]
   ],
   "title": "Temporal distribution of tonal information in continuous Cantonese speech",
   "original": "tal6_118",
   "page_count": 4,
   "order": 25,
   "p1": "118",
   "pn": "121",
   "abstract": [
    "According to previous studies on contextual tonal variations, as a result of interaction between tone-bearing syllables, carryover effect is much greater than anticipatory effect. Consequently, for a given tone in continuous speech, the most consistent portion of F0 (fundamental frequency) contour resides in the latter part of the host syllable. Perception tests on Cantonese level tones were conducted in this study to investigate whether such asymmetry in terms of F0 contour consistency is exploited by our tone perception system. Given conflicting tonal information within the target syllable, our tests give evidence that the latter portion is more prominent in determining tonal identities. This finding coincides harmoniously with several related results like syllable structure typology and contour tone restrictions, and more importantly, leads us to deeper understanding of temporal organization of human speech sounds. Topics relevant to the current study such as role of intensity profile, etc. and further extensions are also presented.\n",
    ""
   ]
  },
  "xiong06_tal": {
   "authors": [
    [
     "Ziyu",
     "Xiong"
    ]
   ],
   "title": "Pitch variations in the running speech of standard Chinese",
   "original": "tal6_122",
   "page_count": 4,
   "order": 26,
   "p1": "122",
   "pn": "125",
   "abstract": [
    "The present study investigates four kinds of pitch variations in the running speech of Standard Chinese: (1) the down-step effect on the second H tone in a HLH tonal sequence motivated by the L tone; (2) the up-step effect on the focal H tone and the drop-step effect on the following H tone in the same sentence; (3) the lift-step effect on the H tone when it follows a focal L tone in the same sentence. Findings suggest that the pitch values of the running speech in Standard Chinese are determined by two types of factors: the pitch features of syllabic tones and some kinds of modification effects which play the role of raising or lowering the pitch register of the syllabic tone. Although these two kinds of factors work simultaneously on parallel on different tiers, the pitch features (e.g. H or L) of syllabic tones determine the manner of association between these two kinds of factors.\n",
    ""
   ]
  },
  "yang06_tal": {
   "authors": [
    [
     "Jie",
     "Yang"
    ],
    [
     "Thomas Hun-tak",
     "Lee"
    ]
   ],
   "title": "Lexical variation and rime-tone correlation in early tonal acquisition: a longitudinal study of Mandarin Chinese",
   "original": "tal6_126",
   "page_count": 6,
   "order": 27,
   "p1": "126",
   "pn": "131",
   "abstract": [
    "Introduction. Studies of the acquisition of tones in Chinese dialects have documented the early mastery of tones in terms of accuracy in children's tonal production, suggesting that children produce the distinctive tones of their target language competently by age two or earlier (Li and Thompson 1977, J. Tse 1977, Clumeck 1980, Hsu 1996, Zhu and Dodd 2000). These studies have also revealed interesting patterns of order of tone acquisition (such as the level tone and the high falling tone occurring before the fall-rise tone in Mandarin), and of tonal substitution in child language (such as the substitution of a high rising tone for the fall-rise tone in Mandarin). However, the claim about early tonal acquisition deserves critical scrutiny even at the level of phonetic production, given that detailed longitudinal studies have revealed that some tones such as the low rising in Cantonese are acquired late (A. Tse 1993), and a clear lexical effect has been observed for the acquisition of Taiwanese tone (Tsay 2004). In line with other studies suggesting lexical diffusion in phonological development (Ferguson and Farwell 1975, Hsieh 1977), the fact that children can produce a tone accurately on selected morphemes may not mean s/he can produce the same tone accurately for most or all lexical items being acquired.   Recent pitch studies of the babbling of infants acquiring Cantonese and Mandarin have revealed preferences for level pitch over falling and rising pitch contours, which were in turn favored over concave and convex contours (Chen 2005, Lee, Lee and Chen 2005). How these preferential pitch patterns in babbling evolve into the adult tonal system would need to be understood on the basis of acoustical analysis of infant pitch production, as well as analysis of adult input.   The present study addresses the following issues: (a) What is the acquisition order of Mandarin tones, with respect to consistency and accuracy of tonal production? (b) To what extent does accuracy of tonal production depend on the lexical dimension? (c) Given that tone needs to be realized on the syllable, would there be any correlation between tonal complexity and the complexity of the rime of the syllable, in the spirit of Woo (1969) and Yip (1980,1989) (d) Do the tonal substitution patterns in child language reflect early preferences for pitch contour types? [Remark. This paper does not contain an abstract. Here the introduction is printed instead. For references, the reader is referred to the full paper. ISCA Archive.]\n",
    ""
   ]
  },
  "zheng06_tal": {
   "authors": [
    [
     "Xiaoju",
     "Zheng"
    ]
   ],
   "title": "Voice quality variation with tone and focus in Mandarin",
   "original": "tal6_132",
   "page_count": 5,
   "order": 28,
   "p1": "132",
   "pn": "136",
   "abstract": [
    "Mandarin Chinese is one of the well studied tone languages, and related contextual tonal variations as a function of prosody have attracted many researchers' interest. Change of voice quality, which is not phonemic in Mandarin, is also subject to prosody. The focus of this study will be the effects of prosodic structure, focus in particular, on voice quality in Mandarin Chinese, and the results show that there are consistent effects of prominence and T3 on voice quality change. There are also great individual variations in terms of rates and kinds of non-modal voice quality utilized.\n",
    ""
   ]
  },
  "zheng06b_tal": {
   "authors": [
    [
     "Yuling",
     "Zheng"
    ],
    [
     "Jianfen",
     "Cao"
    ],
    [
     "Huaiqiao",
     "Bao"
    ]
   ],
   "title": "Coarticulation and prosodic hierarchy",
   "original": "tal6_137",
   "page_count": 6,
   "order": 29,
   "p1": "137",
   "pn": "142",
   "abstract": [
    "This paper attempts to discuss the relationship between segmental coarticulation and prosodic structure in Mandarin Chinese. The discussion is mainly based on the EPG measurements to a set of phrases and short sentences produced in moderate speed. Main parameters measured in this study include (1) inter-gesture timing: temporal intervals overlapped between different articulatory gestures of V1#C2 at prosodic boundaries with different strength. (2) articulatory integrality: linguo-palatal contact state of different articulatory gestures for the related segments.   The preliminary EPG evidences obtained from this study show that, all the pre-boundary vowels (V1) at PW level strongly coarticulate with post-boundary consonants (C2); while there are less cross-boundary coarticulation between V1 and C2 at PP and IP levels; especially in IP level, the pre-boundary vowels are almost not interfered from the post-boundary consonants. These evidences suggest a close link between segmental articulation and prosodic control in speech production.   The results of data analysis show that there exist a negative correlativity between the extent of coarticulation and the height of prosodic hierarchy, it offers an account of that the higher the prosodic level, the less the cross-boundary segmental overlapping, and the more sufficient segmental articulation.   These evidences indicate that segmental coarticulation and suprsegmental (prosodic) organization is originally indivisible in speech production. Therefore, in modeling of articulatory planning of speech production, one must take account of the close link between prosodic structure and segmental phonetic manifestation.\n",
    ""
   ]
  }
 },
 "sessions": [
  {
   "title": "Keynotes",
   "papers": [
    "fujisaki06_tal",
    "rialland06_tal",
    "tseng06_tal",
    "xu06_tal"
   ]
  },
  {
   "title": "Regular Papers",
   "papers": [
    "adumanyah06_tal",
    "chen06_tal",
    "chen06b_tal",
    "cheung06_tal",
    "dominicis06_tal",
    "fujisaki06b_tal",
    "gussenhoven06_tal",
    "gu06_tal",
    "gu06b_tal",
    "ho06_tal",
    "jia06_tal",
    "kugler06_tal",
    "lei06_tal",
    "ma06_tal",
    "mixdorff06_tal",
    "tao06_tal",
    "thurgood06_tal",
    "tran06_tal",
    "tseng06b_tal",
    "vainio06_tal",
    "wong06_tal",
    "xiong06_tal",
    "yang06_tal",
    "zheng06_tal",
    "zheng06b_tal"
   ]
  }
 ]
}