{
 "title": "3rd International Symposium on Tonal Aspects of Languages (TAL 2012)",
 "location": "Nanjing, China",
 "startDate": "26/5/2012",
 "endDate": "29/5/2012",
 "conf": "TAL",
 "year": "2012",
 "name": "tal_2012",
 "series": "TAL",
 "SIG": "SProSIG",
 "title1": "3rd International Symposium on Tonal Aspects of Languages",
 "title2": "(TAL 2012)",
 "date": "26-29 May 2012",
 "booklet": "tal_2012.pdf",
 "papers": {
  "fujisaki12_tal": {
   "authors": [
    [
     "Hiroya",
     "Fujisaki"
    ]
   ],
   "title": "Physiology, physics and mathematics of <i>F</i><sub>0</sub> contour generation with application to phonological representation of tone systems",
   "original": "abs1",
   "page_count": 0,
   "order": 1,
   "p1": "paper KN-1",
   "pn": "",
   "abstract": [
    "I will start this talk by comparing three major approaches for the study of tone and intonation – labeling, stylization, and modeling. I will point out advantages of the modeling approach over the other two because of the ability and accuracy of quantitative analysis as well as of re-synthesis. For the modeling approach, I will emphasize the necessity/importance of the knowledge of physiological and physical mechanisms of controlling the fundamental frequency (henceforth F0 for short) of speech as well as of the use of proper mathematical tools for describing these mechanisms.   The command-response model, which represents an F0 contour in the logarithmic scale as the sum of accent components (caused by pedestal-shaped accent commands), phrase components (caused by impulse-shaped phrase commands), and a baseline component, is considered to meet these requirements, and has been successfully applied to the analysis and synthesis of F0 contours of speech since 1969. Initially, the model was shown to apply to non-tone languages involving only positive local excursions of F0 corresponding to lexical word accent (such as common Japanese), but has been extended to apply to languages involving both positive and negative F0 excursions (such as Swedish).   It was also found that F0 contours of many tone languages can be modeled, instead of positing an accent command per lexical word, by positing the existence of more than one tone commands per syllable, each of which can be positive, negative, or zero. These results lead to a novel method of describing the phonological structure of tone system of a tone language that is more powerful than conventional methods using binary categories such as low/high or level/contour tones.\n",
    ""
   ]
  },
  "wang12_tal": {
   "authors": [
    [
     "William S.-Y.",
     "Wang"
    ]
   ],
   "title": "Adventures with tones",
   "original": "abs2",
   "page_count": 0,
   "order": 2,
   "p1": "paper KN-2",
   "pn": "",
   "abstract": [
    "In this presentation, I will offer a brief sketch of the emergence of tones in Old Chinese, and their evolution from Middle Chinese to the modern dialects. I will re-visit several issues concerned with how tones are represented in terms of features, and how they interact paradigmatically and syntagmatically.\n",
    ""
   ]
  },
  "kohler12_tal": {
   "authors": [
    [
     "Klaus J.",
     "Kohler"
    ]
   ],
   "title": "Developing a framework of communicative functions for the study of speech prosody",
   "original": "1",
   "page_count": 12,
   "order": 3,
   "p1": "paper KN-3",
   "pn": "",
   "abstract": [
    "This is a proposal in favour of proceeding from communica-tive function to linguistic form, rather than the reverse, for an insightful account of how humans communicate by speech in languages. A functional framework is developed that encom-passes argumentation structures, declarative and interrogative functions, and expressive intensification. Such a function orientation can become a powerful tool in comparative pro-sodic research across the world’s languages. The potential of this approach is shown by comparing the prosodic form of Mandarin Chinese data collected in functionally contextua-lized scenarios with corresponding data from English.\n",
    "Index Terms: linguistic form, communicative function, argumentation structure, declarative, interrogative, emphasis\n",
    ""
   ]
  },
  "ohala12_tal": {
   "authors": [
    [
     "John J.",
     "Ohala"
    ]
   ],
   "title": "Tone and the physiology of <i>F</i><sub>0</sub> variation",
   "original": "abs3",
   "page_count": 0,
   "order": 4,
   "p1": "paper KN-4",
   "pn": "",
   "abstract": [
    "That it is the rate of vibration of the vocal cords that regulates the “pitch” of voice has been known since the mid-18th c. Subsequent research, notably by the German physiologist Johannes Müller in the early 19th c. established that it was contraction of the cricothyroid muscle which was the primary cause of F0 variation by virtue of lengthening the vocal cords and thus increasing their tension. But phonetic and phonological studies of common cross-language sound patterns (loosely referred to as “universal”) involving tones suggests that there may be other physiological mechanisms which affect F0. These are: (a) variations in the pressure differential (subglottal pressure – oral pressure) across the vocal cords, (b) variations in the vertical position of the larynx, (c) contraction of the pharyngeal constrictors which affects the tension in the pharyngeal walls and possibly contributes to the tension of the vocal cords. Evidence for (a) is substantial but the effect is small (vis-à-vis) to the action of the cricothyroid); the evidence for (b) is promising but needs more quantification and a model which accounts for the link between larynx height (in the neck) and the change in vocal cord tension; evidence for (c) is weak but is such that it demands more systematic research. A possible fifth influence on the F0 variation exhibited in tone and intonation is not physiological as such but is ethological. Ethology is the study of behavior, especially from a Darwinian viewpoint: behavior which contributes to the survival of the animal showing the behavior or the animal’s progeny. I will discuss all five of these influences on the F0 of tone.\n",
    ""
   ]
  },
  "rose12_tal": {
   "authors": [
    [
     "Philip",
     "Rose"
    ]
   ],
   "title": "Two sides of the same coin: between-speaker <i>F</i><sub>0</sub> differences in linguistic-tonetic description and forensic voice comparison",
   "original": "abs4",
   "page_count": 0,
   "order": 5,
   "p1": "paper KN-5",
   "pn": "",
   "abstract": [
    "Since the sound shape of language has to be processed through an individual’s vocal tract, the radiated speech wave carries the imprint of the vocal tract that produced it. To the extent that vocal tracts differ between individuals, between-speaker variation in acoustic output is always with us. Linguists usually want to get rid of it as much as possible; but sometimes it is very useful to preserve some.   In my talk I will look at between-speaker differences in tonally-relevant acoustic output from two complementary perspectives. We are all accustomed to F0 being used descriptively to furnish a quantifiable representation of tonal and intonational pitch. To arrive at a linguistic-tonetic representation of the tonal pitch of a particular variety, however, it is necessary to remove between-speaker differences, usually by some form of normalisation. I will use tonal F0 data from varieties of Chinese and Thai to discuss two important aspects of normalisation: how to assess its effectiveness, and how it can be used to investigate tonal typology. In forensic voice comparison, on the other hand, it is precisely the differences between speakers that are important: self-evidently, since if there were none it would not be possible to recognise someone by their voice, or for the forensic expert to help the trier-of-fact decide whether the suspect said the incriminating speech. In keeping with the theme of this conference - Tonal Aspects across Tone and Non-Tone Languages - I describe a recent case involving a $150 million dollar telephone fraud that was successfully prosecuted based, at least partly, on the representation of intonational tone. I will also use this case to explain how forensic voice comparison is done in the logically and legally correct way, making use of between-speaker differences.\n",
    ""
   ]
  },
  "michaud12_tal": {
   "authors": [
    [
     "Alexis",
     "Michaud"
    ]
   ],
   "title": "The complex tones of East/Southeast Asian languages: current challenges for typology and modelling",
   "original": "2",
   "page_count": 7,
   "order": 6,
   "p1": "paper KN-6",
   "pn": "",
   "abstract": [
    "In some of the tone systems of East and Southeast Asian languages, linguistic tone cannot simply be equated with pitch; some tones have phonation-type characteristics as part of their phonological definition; and there is no compelling evidence for analyzing tonal contours into sequences of levels. Salient findings are reviewed, first from a synchronic perspective, then from a diachronic one, to bring out facts that are relevant for tonal typology and for evolutionary approaches to phonology.\n",
    "Index Terms: tonal typology, Asian tones, phonation-type characteristics, tonogenesis, registrogenesis, diachrony of tone systems, level tones, complex tones\n",
    ""
   ]
  },
  "niebuhr12_tal": {
   "authors": [
    [
     "Oliver",
     "Niebuhr"
    ],
    [
     "Alexis",
     "Michaud"
    ]
   ],
   "title": "Speech data acquisition - the underestimated challenge",
   "original": "abs5",
   "page_count": 0,
   "order": 7,
   "p1": "paper T-01",
   "pn": "",
   "abstract": [
    "The end of the 20th century was the dawn of information technology; and at the beginning of the 21st century the digital age has arrived everywhere. In the linguistic world, scientists replaced tape recorders by all kinds of digital recorders, which become increasingly powerful and mobile. The coverage of the worlds languages is also increasing rapidly; in China, for example, most languages are currently open to academic scrutiny. More and more languages are discovered, described, analyzed (and, in some cases, eventually taught). Together, digitalization and the diversification of linguistic and phonetic research led to an explosion of evidence (Janet Pierrehumbert, Speech Prosody 2010, Chicago), which offers great chances, but also bears risks.   Our tutorial aims at sensitizing linguists in general as well as phoneticians in particular to the fact that speech-data acquisition is an underestimated challenge. Researchers working on language and speech are no signal hunters. Rather, they hunt for functions and meanings, which merely manifest themselves in phonetic signals that are to be recorded, analyzed and compared. Moreover, informants are no vending machines that emit the desired function or meaning signal by paying and pressing a button. The researcher must know not only how to handle recorders and other machines, but also how to relate tactfully to the language consultants. Researchers should bear in mind that no two speakers are exactly alike, which entails among others that speaker-specific differences must be taken into account.   Against this backdrop, our tutorial will recapitulate practical wisdom on how to collect speech data to attain the very best research results. The two tutors will approach the acquisition of speech material for phonetic studies from (i) more data-oriented and (ii) more theory-oriented perspectives, which are prototypically (but nowadays not necessarily) related to fieldwork and laboratory conditions. The know-how that we aim to convey is essentially the same in both cases. The empirical basis of ones research has paramount importance for all later stages. We will scrutinize, with reference to cross-linguistic examples, which recording situations and elicitation methods are applicable to which research questions, and under which circumstances a more unrestricted data acquisition can be useful as well. In addition, we will show that a thoughtful design of the materials to be recorded facilitates a good communication with the language consultants taking part in the investigation. On the technological side, we will emphasize the necessity of using professional recording equipment and of making and sharing sustainable recordings, as opposed to the widespread practice of recording disposable data with iPhones, laptop microphones etc.   The final result is no less than a cumulative approach to research in the phonetic sciences, data collection/documentation and research progressing hand in hand.   The initial presentation will be followed by exchanges with the participants on topics such as I have this and that research aim, what kind of data should I collect and how?\n",
    ""
   ]
  },
  "hirst12_tal": {
   "authors": [
    [
     "Daniel",
     "Hirst"
    ]
   ],
   "title": "How can speech technology help linguists understand tone and intonation?",
   "original": "abs6",
   "page_count": 0,
   "order": 8,
   "p1": "paper T-02",
   "pn": "",
   "abstract": [
    "Six years ago, I wrote:   It is unfortunate that there is still today an enormous gap between the community of linguists and phoneticians on the one hand and that of engineers and computer scientists on the other. Each community needs the other and, in an ideal world, linguists would provide theoretical frameworks and data which are useful to engineers, while engineers would provide tools which are useful to linguists. The exchange between the two communities, however, is in practice very slow. [Hirst 2006: 198]\n",
    "In the next decade or so we may expect speech technology to contribute to at least partially solving one of the greatest problems facing modern multicultural societies - the language barrier. Tools already exist for speech recognition, automatic translation and speech synthesis. Unfortunately the tools available for the general public are not yet quite good enough to be used in real life situations although the versions for the small minority of languages which have been the most researched are already beginning to be useful.   The transfer of resources to the vast majority of languages and dialects which are currently under-resourced will require a particular effort at creating language independent tools and standards. This will require the analysis and annotation of vast quantities of data from very many languages. It will also require a concerted effort from linguists to try to gain a wider and deeper understanding of the nature of tone and intonation based on the analysis of large quantities of spoken data.   I will present a number of considerations on the characteristics which are desirable for prosodic annotation and in particular the problems in the measurement and modelling of speech melody.\n",
    ""
   ]
  },
  "gu12_tal": {
   "authors": [
    [
     "Wentao",
     "Gu"
    ]
   ],
   "title": "Quantitative analysis and modeling of tonal and intonational variations on different layers",
   "original": "abs7",
   "page_count": 0,
   "order": 9,
   "p1": "paper T-03",
   "pn": "",
   "abstract": [
    "The information conveyed by speech includes linguistic, paralinguistic, and nonlinguistic information. Surface prosodic variations are triggered by the combined effect of the underlying information of all three types. To have a deep insight into prosodic variations affected by so many factors, a phonological description is far from being adequate, and a fully quantitative approach is required. Instead of giving a comprehensive overview of various prosodic models that have been proposed, this tutorial will be focused on the presenters research work on quantitative analysis and modeling of speech prosody (especially for F0) on a number of layers, including lexical tone, tonal coarticulation, prosodic phrasing, sentential intonation, emphatic focus, attitude, and emotion. The work on F0 modeling is based on the command- response model.   Another research topic to be addressed in this tutorial is the tonal transfer from tone languages as L1 (e.g. Mandarin & Cantonese) to non-tone languages as L2 (e.g. Japanese & English). By modeling non-native prosody, the characteristics of F0 transfer can be shown quantitatively, while prosodic analysis of code-mixing speech reveals the way of interaction between tone in tone languages and stress in stress languages.\n",
    ""
   ]
  },
  "zhou12_tal": {
   "authors": [
    [
     "Liuxi",
     "Zhou"
    ]
   ],
   "title": "The application of Chinese phonemics to the chanting of classical verse and prose",
   "original": "abs8",
   "page_count": 0,
   "order": 10,
   "p1": "paper T-04",
   "pn": "",
   "abstract": [
    "The metrical patterns in Chinese works, classical verse and prose, are the manifestation of the prosodic features of the Chinese language. They are not identical with the potential metrical patterns in the vernacular; but they are not totally artificial. From a functional point of view, they are essentially emphatic forms to fulfill the emotive function and poetic function of the language.   Chinese phonemics has been developed on the accumulation of practical experiences of composing and chanting of poems and the conscious analysis of their syllables under the guidance of sabdavidya- principles in Sanskrit. The appropriate application of phonemics to chanting will enable chanters to improve their skills to make chanting more melodious, elegant and effective, which is an important issue to carry on the invaluable literary tradition of Chinese verse and prose.\n",
    ""
   ]
  },
  "malins12_tal": {
   "authors": [
    [
     "Jeffrey G.",
     "Malins"
    ],
    [
     "Marc F.",
     "Joanisse"
    ]
   ],
   "title": "Towards a model of tonal processing during Mandarin spoken word recognition",
   "original": "3",
   "page_count": 6,
   "order": 11,
   "p1": "paper S1-01",
   "pn": "",
   "abstract": [
    "Despite the prevalence of tonal languages in the world, current models of spoken word recognition do not account for tonal processing. In this review, we consider how current models might be modified to include tone, asking at what level tones should be added to these models, whether they should have their own distinct processing structures, and what the representational nature of these structures might be. Focusing specifically on Mandarin Chinese, we present evidence supporting the idea that tones and phonemes are processed simultaneously, and are respectively handled by structures that are independent of one another yet similar in nature. These findings are integrated into a proposed model of spoken word recognition that includes tone.\n",
    "Index Terms: tone, spoken word recognition, speech perception, models, Mandarin Chinese\n",
    ""
   ]
  },
  "shuai12_tal": {
   "authors": [
    [
     "Lan",
     "Shuai"
    ],
    [
     "Tao",
     "Gong"
    ]
   ],
   "title": "Temporal relationship of top-down and bottom-up processing in tone perception",
   "original": "4",
   "page_count": 6,
   "order": 12,
   "p1": "paper S1-02",
   "pn": "",
   "abstract": [
    "Both the top-down and bottom-up processing are identified in language comprehension: the top-down processing depends on previous language experience and the bottom-up processing depends on instant language inputs. In speech perception, both types of processing are needed while perceiving pitch variations as lexical tones. In this paper, based on three ERP experiments, we propose a temporal model unifying both types of processing in a parallel way. These two types of processing, existing in both the early and late time windows, modulate the degrees of the general left lateralization of different ERP components (N1, P2, and N400).\n",
    "Index Terms: tone perception, lateralization, ERP, top-down processing, bottom-up processing\n",
    ""
   ]
  },
  "gu12b_tal": {
   "authors": [
    [
     "Feng",
     "Gu"
    ],
    [
     "Xiao-Dong",
     "Wang"
    ],
    [
     "Kang",
     "He"
    ],
    [
     "Lin",
     "Chen"
    ]
   ],
   "title": "Preattentive auditory processing of pitch glide",
   "original": "5",
   "page_count": 6,
   "order": 13,
   "p1": "paper S1-03",
   "pn": "",
   "abstract": [
    "Pitch glide is a continuously rising or falling characteristic of pitch contour in tonal languages, such as Mandarin Chinese, and is critical for tonal speech comprehension. An interesting but unanswered question is whether pitch glide can be automatically processed at a preattentive stage in the brain. To address this question, we used iterated rippled noise (IRN) as a linguistically meaningless nonspeech stimulus to evoke mismatch negativity (MMN), an indicator of automatic auditory processing, from native speakers of Mandarin Chinese. To create a pitch glide contrast, we frequently presented IRN to the subjects with a flat pitch contour at different pitch levels and infrequently varied its pitch contour from flat to flat-rise. The pitch glide contrast evoked a robust MMN response with the peak latency around 155 ms after the rising onset. In addition, the steeper rising slope was, the larger MMN was evoked. These results suggest a preattentive auditory analysis of pitch glide information, which may be fundamental for contour tone perception.\n",
    "Index Terms: pitch glide, lexical tone, mismatch negativity, preattentive auditory perception, Mandarin Chinese\n",
    ""
   ]
  },
  "fung12_tal": {
   "authors": [
    [
     "Roxana",
     "Fung"
    ],
    [
     "Carmen",
     "Kung"
    ],
    [
     "Sam-Po",
     "Law"
    ],
    [
     "I-Fan",
     "Su"
    ],
    [
     "Cathy",
     "Wong"
    ]
   ],
   "title": "Near-merger in Hong Kong Cantonese tones: a behavioural and ERP study",
   "original": "6",
   "page_count": 6,
   "order": 14,
   "p1": "paper S1-04",
   "pn": "",
   "abstract": [
    "Near-merger is a recalcitrant phenomenon in sound change in which speakers are able to differentiate two sounds in production but consistently report that they are the same in perception. This phenomenon challenges the dominant models of phonological processing, and raises methodological questions whether speakers’ judgment can truly reflect their ability to discriminate speech sounds. The present study attempts to provide a thorough assessment of this intriguing phenomenon through performing behavioural and ERP studies on the perception of a tonal contrast (T4/T6) in Hong Kong Cantonese which has been reported to exhibit near-merger in previous studies. The behavioural study adopts auditory discrimination and oral production tasks, whereas the ERP study employs passive oddball task to elicit MMNs. Preliminary findings showed that the results of ERP measures were consistent with that of the behavioural measures. MMNs were found in participants who could discriminate the two tones whereas no MMN was found in participants who failed to discriminate them behaviourally. These initial observations are not only consistent with the existence of near-merger, but also mark the beginning of research efforts into understanding this baffling phenomenon.\n",
    "Index Terms: mismatch negativity, merger, tone perception, tone production, Cantonese\n",
    ""
   ]
  },
  "liu12_tal": {
   "authors": [
    [
     "Ye",
     "Liu"
    ],
    [
     "Gang",
     "Peng"
    ]
   ],
   "title": "Electrophysiological evidence for an early categorical processing of tones",
   "original": "7",
   "page_count": 6,
   "order": 15,
   "p1": "paper S1-05",
   "pn": "",
   "abstract": [
    "Previous studies discovered electrophysiological evidence for tone categorical effects with mismatch negativity (140 ms - 250 ms), and P300 (300 ms - 700 ms). The present study further investigates the detailed time course of categorical perception of pitch contours by native Mandarin speakers. N1 components (90 ms - 150 ms) of within-category change, across-category change, and no-change conditions for speech and nonspeech stimuli were analyzed. The current results showed: 1) Speech sounds were detected early in comparison to non-speech sounds, as indexed by the shorter peak latency of N1; 2) Significant N1 amplitude difference between conditions of across-category change and no-change signified an early signature of tone categorical effect; 3) The tone categorical effect in terms of N1 amplitude existed only in speech context, suggesting a speech specific processing underlying speech perception.\n",
    "Index Terms: categorical perception, lexical tone, Mandarin, event-related potentials, N1\n",
    ""
   ]
  },
  "wang12b_tal": {
   "authors": [
    [
     "Yunjia",
     "Wang"
    ],
    [
     "Dayoung",
     "Jeong"
    ],
    [
     "Junlong",
     "Feng"
    ]
   ],
   "title": "The effect of intonation on tone 2 and the register of tone 2 in Mandarin: a preliminary study",
   "original": "8",
   "page_count": 6,
   "order": 16,
   "p1": "paper P1-01",
   "pn": "",
   "abstract": [
    "This study aims to investigate how tone 2 in Mandarin varies in different intonational contexts. Target tones were embedded in three focus positions and two non-focus positions in actual utterances. The high point and low point pitch values of the tones were observed and compared. The results witness a constant lower tonal high point of tone 2 over that of tone 1 and tone 4, while a similarly equal low point of tone 2 and tone 4. These results support our hypothesis in previous study that there exist [+upper] and [-upper] registers in Mandarin where tone 2 belongs to the latter one.\n",
    "Index Terms: tone, register, intonation, focus\n",
    ""
   ]
  },
  "mohasi12_tal": {
   "authors": [
    [
     "Lehlohonolo",
     "Mohasi"
    ],
    [
     "Hansjörg",
     "Mixdorff"
    ],
    [
     "Thomas",
     "Niesler"
    ],
    [
     "Sabine",
     "Zerbian"
    ]
   ],
   "title": "Analysis of Sesotho tone using the Fujisaki model",
   "original": "9",
   "page_count": 6,
   "order": 17,
   "p1": "paper P1-02",
   "pn": "",
   "abstract": [
    "In this paper, two approaches that can be used to determine the tonal pattern of sentences in Sesotho are compared: surface tone transcription and the Fujisaki model. The tone commands of the latter technique, which represent high tones, are compared with the high surface tones predicted by the tone rules. The mismatched syllables are investigated in order to account for the discrepancies, and particular attention is given to the influence of the adjacent syllables on the tone of the target syllable. Results reveal that the discrepancies are in many cases due to minor errors in the Fujisaki model such as the effects of microprosody, or are due to inconsistent surface tone prediction. An investigation into the prosodic groups formed by the tone commands found that these sequences are mainly due to two or more adjacent syllables with high tone labels, and sometimes due to alternating tone labels between the adjacent syllables.\n",
    "Index Terms: Fujisaki model, Sesotho tone, Sesotho TTS\n",
    ""
   ]
  },
  "wakefield12_tal": {
   "authors": [
    [
     "John C.",
     "Wakefield"
    ]
   ],
   "title": "It’s not so bad: an English tone for ‘downplaying’",
   "original": "10",
   "page_count": 6,
   "order": 18,
   "p1": "paper P1-03",
   "pn": "",
   "abstract": [
    "Cantonese has a complex lexical tone system that severely restricts its use of intonation. To compensate for this restriction, sentence-final particles (SFPs) are used to express meanings that are expressed through intonation in other languages. This study examined the pitch contours of Cantonese-to-English translations of the SFP ze1 in order to test whether the meaning of ze1 is expressed as a tone in English, and if so, what form this tone takes. Several authors have said that ze1 expresses the meaning “only” plus a downplaying of the situation.   Based on the F0s of the translations it is concluded that English has a near semantic equivalent of ze1, which is expressed by the word “only” plus a rise-fall-rise pitch contour. Guided by the meaning of ze1, a definition is proposed for its intonational counterpart in English. Based on previous arguments from the literature, it is proposed that this pitch contour is a floating tone that exists as a morpheme in the English lexicon.\n",
    "Index Terms: English, Cantonese discourse particles, discourse intonation, floating tone\n",
    ""
   ]
  },
  "yin12_tal": {
   "authors": [
    [
     "Hui",
     "Yin"
    ]
   ],
   "title": "A unified account of Mandarin tone 3 and tone 4 sandhi",
   "original": "11",
   "page_count": 5,
   "order": 19,
   "p1": "paper P1-04",
   "pn": "",
   "abstract": [
    "This paper aims to provide a unified account of tone 3 and 4 sandhi. Some linguists have noticed there are obvious phonetic differences between sandhi tone 3 and tone 2 and that they are not neutralized. Traditional analyses viewing tone 3 sandhi as categorical change fail to account for differences between sandhi tone 3 and tone 2. In this paper a constraints-based analysis within the Optimality Theory (OT) framework is developed to look into Mandarin tone sandhi and to explain differences between sandhi tone 3 and tone 2. A new analysis claiming that tone 3 sandhi is a tonal reduction is proposed and justified within the OT framework. The OT device of constraint conflicts permits the present analysis of tone 3 sandhi as a resolution of conflicts between a general principle of markedness and a general principle of tonal faithfulness. This approach provides straightforward descriptions and motivations for tone 3 sandhi. This paper also shows tone 4 sandhi can be accounted for within the OT framework. In the present analysis both tone 3 sandhi and tone 4 sandhi are viewed as tonal reductions and the same basic set of constraints are used to accommodate both tone sandhi phenomena.\n",
    "Index Terms: tone, sandhi, OT, constraint\n",
    ""
   ]
  },
  "higashi12_tal": {
   "authors": [
    [
     "Takahiro",
     "Higashi"
    ]
   ],
   "title": "Stability of tone 2 <i>F</i><sub>0</sub> contours across different syllable structures in Mandarin",
   "original": "12",
   "page_count": 4,
   "order": 20,
   "p1": "paper P1-05",
   "pn": "",
   "abstract": [
    "The syllables of Mandarin are usually divided into four different structures. Previous studies on adults and children reported the features of F0 contours across different syllable structures in Mandarin. This paper presents the stability of some parameters of Tone 2 F0 contours across different syllable structures. The indicator of stability for F0 is Standard Deviation (SD) while the parameters include syllable duration, initial duration, time of maximum/minimum F0 and maximum/minimum frequency F0. In order to observe the stability of the tone, four native speakers of Beijing Mandarin were recorded using the same syllable table for Tone 2. This experiment found that the SDs for time of minimum F0 correlated with the syllable structures, and the SDs for the most complex syllables were higher than other syllables. However, the other parameters did not show correlation with their syllable structures.\n",
    "Index Terms: Mandarin, syllable structures, time of minimum F0, stability, Tone 2 variants\n",
    ""
   ]
  },
  "jia12_tal": {
   "authors": [
    [
     "Yuan",
     "Jia"
    ],
    [
     "Qibin",
     "Ran"
    ]
   ],
   "title": "Internal differences of tones in Shandong dialect",
   "original": "13",
   "page_count": 5,
   "order": 21,
   "p1": "paper P1-06",
   "pn": "",
   "abstract": [
    "The present study employs phonetic means and LZ-Score values to systematically investigate and tonal patterns and the internal differences of tones in Shandong (Hereinafter, SD) dialect. The dialect regions selected in the study is Jinan, Liaocheng, Taifan and Zibo, all of which belong to Xiqi district. Results demonstrate that all of the four regions deserve four tones, specifically, tonal values are: tone1: 324, tone2: 52, tone3: 44 and tone4: 412 in Jinan dialect; tone1: 24; tone2: 51, tone3: 44 and tone4: 23 in Liaocheng dialect; tone1: 24, tone2: 42, tone3: 44 and tone4: 323 in Taifan dialect; tone1: 323, tone2: 43, tone3: 44, tone4: 41 in Zibo dialect. Based on this result, the study further proposes that tone2 & tone3 keep stable in SD dialect and tone1 & tone4 show great variations. Furthermore, it is different from other dialects, Liaocheng processes tones merging from four tones to three tones.\n",
    "Index Terms: tonal pattern, Shandong dialect, tonal differences\n",
    ""
   ]
  },
  "shao12_tal": {
   "authors": [
    [
     "Pengfei",
     "Shao"
    ],
    [
     "Yuan",
     "Jia"
    ],
    [
     "Aijun",
     "Li"
    ]
   ],
   "title": "Tonal patterns of Linyi dialects",
   "original": "14",
   "page_count": 4,
   "order": 22,
   "p1": "paper P1-07",
   "pn": "",
   "abstract": [
    "This paper investigates the tonal pattern of mono-syllabic and the tone sandhi pattern of disyllable of Linyi dialect through the method of experimental phonetics. Previous studies provided the five-scale value of four citation tones and some of the features of tone sandhi of Linyi dialect. Further experimental data is needed to confirm these results, and to verify the tone sandhi patterns. First of allC this paper gets the pitch contour of mono-syllabic of Linyi dialect, and compares the results in the form of five-scale value with the results of previous tonal pattern investigation of Linyi dialect. Slight differences have been observed between them. Then this study explored the tone sandhi pattern within disyllable. Most of the tone sandhi occurs to the initial tone of the two syllables.\n",
    "Index Terms: Linyi Dialect, tone sandhi, tone pattern, Mandarin\n",
    ""
   ]
  },
  "xu12_tal": {
   "authors": [
    [
     "Juan",
     "Xu"
    ]
   ],
   "title": "Neutral tone of Luoshan dialect",
   "original": "15",
   "page_count": 6,
   "order": 23,
   "p1": "paper P1-08",
   "pn": "",
   "abstract": [
    "This thesis studies the neutral tone of Luoshan Dialect. Neutral tone in disyllabic and trisyllabic sequences is firstly analyzed on the basis of acoustic experiment, and then a phonological analysis of the behavior of the neutral tone is carried out within the framework of Optimality Theory.\n",
    "Index Terms: neutral tone, dialect, Optimality Theory\n",
    ""
   ]
  },
  "lin12_tal": {
   "authors": [
    [
     "Chihkai",
     "Lin"
    ]
   ],
   "title": "Is there floating tone in Taiwan Southern Min?",
   "original": "16",
   "page_count": 4,
   "order": 24,
   "p1": "paper P1-09",
   "pn": "",
   "abstract": [
    "This paper investigates special tone sandhi in Taiwan Southern Min (TSM), arguing that special tone sandhi in trisyllabic adjective reduplication in TSM is due to pragmatic factor rather than phonological factor, floating tone for example. It is proposed that a floating high tone appears between the first and second syllable of the trisyllabic adjective reduplication and it leads to the special tone sandhi. Two potential problems are identified, a) whether a floating tone is edge-sensitive and b) why there is no high level in special tone sandhi. Pragmatic factor by focusing on the first syllable accounts better than phonological factor.\n",
    "Index Terms: tone sandhi, floating tone, reduplication, Taiwan Southern Min\n",
    ""
   ]
  },
  "li12_tal": {
   "authors": [
    [
     "Bin",
     "Li"
    ],
    [
     "Yanmeng",
     "Guo"
    ]
   ],
   "title": "Mandarin tone contrast in whisper",
   "original": "17",
   "page_count": 4,
   "order": 25,
   "p1": "paper P1-10",
   "pn": "",
   "abstract": [
    "The dominant cue to distinguish lexical tones is the fundamental frequency. In whisper, no such information is available due to the lack of excitation of the vocal folds. This paper examines the acoustics of Mandarin tonal contrasts in whispered speech and compares it with that of normal speech, aiming to identify potential cues for tone identification in situations where the major pitch correlate is absent.\n",
    "Index Terms: tone, whisper, Mandarin, production\n",
    ""
   ]
  },
  "yang12_tal": {
   "authors": [
    [
     "Li-chiung",
     "Yang"
    ],
    [
     "Richard",
     "Esposito"
    ]
   ],
   "title": "Tonal and prosodic variations in Mandarin: new evidence from spontaneous and read speech",
   "original": "18",
   "page_count": 6,
   "order": 26,
   "p1": "paper P1-11",
   "pn": "",
   "abstract": [
    "Tonal identity and tonal variation in Mandarin have been the focus of intensive research that has long sought to bring out the underlying causes of variations in realized pitch values. Included among the variables studied in tonal variation are syntactic, contextual, emotional, and interactional influences. In this paper we profile and analyze the variability of Mandarin tones in spontaneous discourse, and compare tone shapes in read and spontaneous speech. In illustrating both the adherence and non-adherence to defined shape of spontaneous speech, our data also indicate that both read and spontaneous Mandarin share many contextually determined tonal characteristics.\n",
    "Index Terms: Tone, prosody, Mandarin, tonal variability, spontaneous speech\n",
    ""
   ]
  },
  "li12b_tal": {
   "authors": [
    [
     "Yinghao",
     "Li"
    ],
    [
     "Jiangping",
     "Kong"
    ]
   ],
   "title": "An electropalatographic and acoustic study of the tonal effects on vowel production in standard Chinese: a pilot study",
   "original": "19",
   "page_count": 7,
   "order": 27,
   "p1": "paper P1-12",
   "pn": "",
   "abstract": [
    "This paper carried out a pilot study for the tonal effects on the production of monophthongal vowels in Standard Chinese. The electropalatographic (EPG) and acoustic signals for six vowels /i, u, y, i1, i2, ʏ/ in monosyllables uttered in four tones were recorded, and the articulatory and acoustic measures were taken at three time points in zero-initial syllables and mid-portion frame/point in non-zero-initial syllables. The results show: (1) the articulatory variation in vowel production was mainly induced by the low tone (T3) compared with other tone. (2) Two strategies for articulatory adjustment were identified: the tongue lowering and retraction was found for vowels in T3 syllables when the post-dorsum of tongue is involved in vowel articulation, as shown in /u, ʏ, i1/; the increased tongue raising was found in T3 syllables when the pre-dorsum of tongue is involved in vowel production, as shown in /i, y, i2/. (3) The T3 influence on the articulatory measures for vowels tends to be present in the better part of the vocalic length, regardless of the pitch changes. (4) Consistent tonal effect on F1 for the vowels was found for which T4 tends to increase the F1. This might be attributed to the larynx raising that leads to the shortening of the vocal tract.\n",
    "Index Terms: tone, vowel production, electropalatography (EPG), Standard Chinese\n",
    ""
   ]
  },
  "cun12_tal": {
   "authors": [
    [
     "Xi",
     "Cun"
    ]
   ],
   "title": "Implosives and the inherent <i>F</i><sub>0</sub> perturbation in Chinese dialects",
   "original": "20",
   "page_count": 6,
   "order": 28,
   "p1": "paper P1-13",
   "pn": "",
   "abstract": [
    "It is gradually noticed that in a tonal language such as Chinese, phonation types are the phonetic cause of tonogenesis, different phonation modes can define three tonological registers, and the initial consonants of a syllable and the consonants at the end of the syllable would perturb the pitch contour [1]. In the traditional Chinese phonology, the “voiced” (actually, in most cases, they are sounds with slack voice, not real voiced consonants) initial consonants correspond to Yang tonal category, a lower tonal category, while the voiceless initial consonants correspond to Yin tonal category, a higher tonal category. However, implosives in Chinese dialects are contradicted to this rule. The voiced implosives are corresponding to the higher tonal category. Previous studies discussed about the consonantal perturbation on F0 of the following vowels. The physiological mechanism of F0control is refined. However, the tonal perturbation of implosives in Chinese dialect is rarely mentioned. Current study is going to explore two questions: 1) which tonological register do implosive initial consonants correspond to? High, Mid, or Low? 2) How do implosive initials perturb the pitch contour? It is found that generally, implosive initials correspond to the Mid tonological register, just as the voiceless initials do. But there are a few cases in which implosive initials can be produced with slack voice and creaky voice, when the syllable is produced with these phonation types. Also, it is found that implosive initials have its inherent F0. It ranges from 140-200Hz for male speaker; and 200-270Hz for female speaker. The inherent F0 for implosives produced with slack voice and creaky voice could be lower.\n",
    "Index Terms: Implosive, Pitch contour, Consonantal Perturbation, Tonological register, Chinese dialects\n",
    ""
   ]
  },
  "nkamigbo12_tal": {
   "authors": [
    [
     "Linda Chinelo",
     "Nkamigbo"
    ]
   ],
   "title": "A phonetic analysis of Igbo tone",
   "original": "21",
   "page_count": 5,
   "order": 29,
   "p1": "paper P1-14",
   "pn": "",
   "abstract": [
    "This paper studies tone in Igbo, a West Benue-Congo language spoken predominantly in the southeastern part of Nigeria, from a phonetic perspective. The study examines the acoustics of Igbo tone by checking the effects of prevocalic consonants, vowel height and vowel quality on tone as well as the interaction of tone and intonation in the language under. A word list of 128CV tokens and 10 sentences was digitally recorded with an average of 3 repetitions. The digital recordings were made at a sample rate of 44,100Hz. The eight Igbo vowels were used to test the variations that were caused by vowel height and it was observed that vowels bearing high tones are higher than their low counterparts. The study also revealed that voiced consonants have greater perturbations on tone than their voiceless counterparts; Igbo local pitch effect is a lowering of the high tone of the initial pronominal element in interrogatives. This study will contribute to the understanding of the behaviours of tone in Igbo.\n",
    "Index Terms: tone, intonation, pitch effect\n",
    ""
   ]
  },
  "caelenhaumont12_tal": {
   "authors": [
    [
     "Geneviève",
     "Caelen-Haumont"
    ]
   ],
   "title": "Towards the tonal system of an unknown language from south-east asia: a deeper insight",
   "original": "22",
   "page_count": 6,
   "order": 30,
   "p1": "paper P1-15",
   "pn": "",
   "abstract": [
    "This paper is focused on melodic and tonal analyses of a language without a writing system, the Mo Piu one, from an endangered ethnic minority of the south-east Asia in North Vietnam. The Mo Piu language is a branch still unknown of the Hmong-Mien family. Based on a previous experience, we try to get a deeper insight into the tonal system of this language, getting support with a dedicated tool, MISTRAL+ recently upgraded with new functionalities under Praat.\n",
    "Index Terms: tonal system, unknown language, ethnic minority, Hmong-Mien family\n",
    ""
   ]
  },
  "promon12_tal": {
   "authors": [
    [
     "Santitham",
     "Prom-on"
    ],
    [
     "Yi",
     "Xu"
    ]
   ],
   "title": "Pitch target representation of Thai tones",
   "original": "23",
   "page_count": 4,
   "order": 31,
   "p1": "paper O1-01",
   "pn": "",
   "abstract": [
    "This paper presents a quantitative representation of Thai tones in the form of pitch targets. The optimal pitch targets of Thai tones were estimated by using a combination of the quantitative Target Approximation (qTA) model and a stochastic learning algorithm. With the advent of this technique, the representation of communicative functions can be systematically and quantitatively studied. The statistical analysis of estimated parameters shows clear contrastive differences between tone categories, indicating unique representation of Thai tones. The results of the modeling experiment demonstrate the adequacy of unitary (as opposed to compositional) underlying targets for generating continuous tonal contours in Thai.\n",
    "Index Terms: Thai tone, pitch target, modeling\n",
    ""
   ]
  },
  "liu12b_tal": {
   "authors": [
    [
     "Jiang",
     "Liu"
    ]
   ],
   "title": "A production and perception study on tonal neutralization in Nanchang",
   "original": "24",
   "page_count": 6,
   "order": 32,
   "p1": "paper O1-02",
   "pn": "",
   "abstract": [
    "In a production study of tonal contrasts in lexically stressed but grammatically stressless syllables vs. lexically stressless syllables in Nanchang, a Gan dialect spoken in the city of Nanchang, Jiangxi province, we found that tonal neutralization only occurs in lexically stressless syllables. We argue that the main phonetic ground for such a tonal contrast distribution lies in the rhyme duration difference between syllables with and without lexical stress, namely, lexically stressless syllables have shorter rhyme duration than lexically stressed but grammatically stressless syllables, and the shorter the rhyme duration of a syllable is the fewer tonal contrasts the syllable allows. In terms of perception, we found that different tonal contrasts indeed become neutralized in lexically stressless syllables. However, the neutralization pattern at the perception level is not the same as the one at the production level due to word specific effects.\n",
    "Index Terms: tonal neutralization, production, perception, lexical stress, grammatical stress, word specific effects, Nanchang\n",
    ""
   ]
  },
  "kuang12_tal": {
   "authors": [
    [
     "Jianjing",
     "Kuang"
    ]
   ],
   "title": "Registers in tonal contrasts",
   "original": "25",
   "page_count": 6,
   "order": 33,
   "p1": "paper O1-03",
   "pn": "",
   "abstract": [
    "This study revisits the issue of tonal registers by exploring the cues used in producing and perceiving the five level tones of Black Miao. Both production and perception experiments show that non-modal phonations are very important cues for tonal contrasts. Two different kinds of non-modal phonations that either enhance pitch contrasts or provide an additional contrastive cue divide tonal levels into several registers. Benefiting from more than one cue, 11, 33 and 55 are well distinguished in the tonal space; by contrast, 22 and 44, only contrasting in pitch, are the most confusable tones. The tonal registers model can explain the different uses of non-modal phonations across languages.\n",
    "Index Terms: tonal contrast, registers, production, perception\n",
    ""
   ]
  },
  "zuo12_tal": {
   "authors": [
    [
     "Donghui",
     "Zuo"
    ],
    [
     "Qiuyue",
     "Chen"
    ],
    [
     "Peggy",
     "Mok"
    ]
   ],
   "title": "Does orthography affect L2 tone production and perception?",
   "original": "26",
   "page_count": 5,
   "order": 34,
   "p1": "paper O1-04",
   "pn": "",
   "abstract": [
    "Many studies have investigated the production and perception of second language learners. However, very few of them have discussed the effect of orthography. Although Mandarin and Cantonese share the same orthographic system, the phonological systems of the two languages are quite different. This preliminary study investigates the production and perception of Mandarin tones by Cantonese learners, and compares their error patterns in two conditions: when the subjects were presented with 1) stimuli written in Mandarin Pinyin (a transparent orthography), 2) stimuli written in Chinese characters (an opaque orthography). The result shows that orthography has different effects in tone production and perception: the Pinyin system facilitated tone production only, while the subjects performed significantly better with Chinese characters in perception. Possible accounts for the observed differences are discussed.\n",
    "Index Terms: Mandarin, L2 production and perception of tones, orthography\n",
    ""
   ]
  },
  "zhu12_tal": {
   "authors": [
    [
     "Xiaonong",
     "Zhu"
    ],
    [
     "Li",
     "Yi"
    ],
    [
     "Ting",
     "Zhang"
    ]
   ],
   "title": "Types of dipping tones",
   "original": "27",
   "page_count": 7,
   "order": 35,
   "p1": "paper O1-05",
   "pn": "",
   "abstract": [
    "This paper classifies dipping tones in the framework of the Multi-Register and Four-Level tonal model. There are six types of dipping tones, four in Register M and two in Register L. The former includes (1) low dipping {323}, (2) back dipping /523/, (3) front dipping /324/, and (4) double circumflex /3232/, and the latter includes (5) creaky dipping {202} and (6) slack dipping /213/. After the establishment of a dipping typology, a set of distinctive features is proposed to specify these contours, and an evolutionary map is depicted to trace the changing routes of dipping tones.\n",
    "Index Terms: tone, typology, contrastive tonal types, dipping, double circumflex, multi registers, four levels\n",
    ""
   ]
  },
  "zhang12_tal": {
   "authors": [
    [
     "Caicai",
     "Zhang"
    ],
    [
     "Gang",
     "Peng"
    ],
    [
     "William S.-Y.",
     "Wang"
    ]
   ],
   "title": "Normalizing talker variation in the perception of Cantonese level tones: impact of speech and nonspeech contexts",
   "original": "28",
   "page_count": 6,
   "order": 36,
   "p1": "paper O2-01",
   "pn": "",
   "abstract": [
    "Cantonese level tones (high level, mid level, and low level tone) are perceptually confusing if produced by talkers with different pitch ranges. External context with cues of a talker’s pitch range is essential for resolving the ambiguity of level tones. This study investigates the impact of two contexts – speech and nonspeech contexts on the perceptual normalization of talker variation in Cantonese level tones. Four talkers with different pitch ranges are asked to produce the stimuli so that perceptual ambiguity is expected without normalization. We find unequal effects of speech and nonspeech contexts. F0 cues in speech context are efficiently used as reference for normalizing talker difference in tone perception, whereas nonspeech context carrying identical F0 cues shows no obvious effect. It suggests that the carrier of F0 cues (speech or nonspeech) affects whether the context is engaged or not in tone normalization. This finding implies that tone normalization is likely to be a speech specific process, congruent with the phonetic module of speech perception.\n",
    "Index Terms: talker normalization, tone perception, context, level tones, Cantonese\n",
    ""
   ]
  },
  "xu12b_tal": {
   "authors": [
    [
     "Bo Robert",
     "Xu"
    ],
    [
     "Peggy",
     "Mok"
    ]
   ],
   "title": "Intonation perception of low-pass filtered speech in Mandarin and Cantonese",
   "original": "29",
   "page_count": 6,
   "order": 37,
   "p1": "paper O2-02",
   "pn": "",
   "abstract": [
    "The intonation patterns of Mandarin and Cantonese are very different. While Mandarin uses a raised global F0 contour to signal questions, Cantonese relies on a boundary tone strictly located at the end of a question. Previous individual-language studies and cross-linguistic studies with normal speech stimuli have shown that intonation interpretation was influenced by both universal perceptual factors and language-tone specific factors. In this study, Mandarin and Cantonese listeners participated in a forced identification task to judge the sentence type of the low-pass filtered Mandarin or Cantonese utterances they heard. The results confirm the different intonation patterns between Cantonese and Mandarin. They also show that when lexical-semantic information was absent and when identities of lexical tones were covered up, listeners relied solely on the frequency code to interpret the intonation. Finally, the results also suggest that F0 contour alone was not sufficient for intonation perception. Lexical-semantic context, segmental information and duration-rhythmic profile also contribute to intonation production and perception.\n",
    "Index Terms: intonation, perception, low-pass filter, Mandarin, Cantonese\n",
    ""
   ]
  },
  "wang12c_tal": {
   "authors": [
    [
     "Dazuo",
     "Wang"
    ],
    [
     "Gang",
     "Peng"
    ]
   ],
   "title": "The effects of pitch range and duration on tone categorical perception",
   "original": "30",
   "page_count": 5,
   "order": 38,
   "p1": "paper O2-03",
   "pn": "",
   "abstract": [
    "Previous research has mainly focused on the influence of language experience (cross-language or cross-dialect), and stimulus complexity (speech vs. non-speech) on the categorical perception of tones. This study further investigates whether pitch range and duration affect tone categorical perception. Four speech tone continua differing in pitch range and duration were presented to native Mandarin listeners. Both identification and discrimination experiments were conducted. The results confirm that perception of speech tone continua for native Mandarin listeners is categorical, with discrimination peaks being well aligned with the identification boundaries. Pitch range was found to significantly influence the position of categorical boundary while duration only played a limited role in modulating the boundary position.\n",
    "Index Terms: categorical perception, Mandarin, tone perception, pitch range, duration\n",
    ""
   ]
  },
  "liu12c_tal": {
   "authors": [
    [
     "Liquan",
     "Liu"
    ],
    [
     "René",
     "Kager"
    ]
   ],
   "title": "Non-tone monolingual and bilingual infants' tone perception under perceptual reorganization",
   "original": "31",
   "page_count": 6,
   "order": 39,
   "p1": "paper O2-04",
   "pn": "",
   "abstract": [
    "Perceptual reorganization (PR) for tones occurs from 6 to 9 months in the first year of life (Mattock & Burnham, 2006; Mattock, Molnar, Polka & Burnham, 2008). No previous study has discussed whether monolingual and bilingual infants follow the same trajectory in tonal PR. Monolingual Dutch infants and bilingual infants with Dutch as one of their native languages and a non-tone language as the other language were tested on their perception of two tonal contrasts. Results suggest that 1) both monolingual and bilingual infants show PR for tones at the same age range between 5-6 and 8-9 months; 2) bilingual infants seem to show greater sensitivity towards difficult tonal contrasts at a later age; 3) the acoustic salience of the tonal contrast alters infants' tone perception.\n",
    "Index Terms: tone, infant, speech perception, bilingualism, perceptual reorganization\n",
    ""
   ]
  },
  "chen12_tal": {
   "authors": [
    [
     "Ao",
     "Chen"
    ],
    [
     "René",
     "Kager"
    ]
   ],
   "title": "Domain specificity of lexical tone perception in early infancy: lexical tones versus musical tones",
   "original": "32",
   "page_count": 6,
   "order": 40,
   "p1": "paper O2-05",
   "pn": "",
   "abstract": [
    "In the current study, we tested the perception of pitch variations in early infancy from a domain general perspective for two auditory domains: speech and music. 4-month-old Dutch infants were tested on their discrimination of a musical relative pitch difference, a musical absolute pitch difference, and a Mandarin lexical tone difference. Our results showed that the infants failed to discriminate between Mandarin lexical tones, whereas they succeeded in discriminating both musical pitch differences, both absolute and relative. Crucially, the musical relative pitch difference resembled that between lexical tones, while the acoustical difference between the musical pitches was even smaller than the acoustical difference between lexical tones. Yet, infants only succeeded in discriminating musical pitch contrasts. The performance of the infants who participated in all three tasks conformed to the same pattern. Our findings suggest that young infants are capable of tracking subtle pitch differences, while the lack of proficiency in processing lexical tones is likely to be speech specific and plausibly restricted to lexical tones only.\n",
    "Index Terms: Mandarin lexical tone, cross-domain perception, perception in early infancy\n",
    ""
   ]
  },
  "chen12b_tal": {
   "authors": [
    [
     "Jenn-Yeu",
     "Chen"
    ],
    [
     "Train-Min",
     "Chen"
    ],
    [
     "You-Yu",
     "Dai"
    ]
   ],
   "title": "Cognitive mechanisms and locus of tone sandhi during Chinese spoken word production",
   "original": "33",
   "page_count": 6,
   "order": 41,
   "p1": "paper S2-01",
   "pn": "",
   "abstract": [
    "Cognitive mechanisms of tone sandhi during Chinese spoken word production were investigated with the implicit priming paradigm. Participants produced a disyllabic spoken word upon seeing a visual word that was associated by prior learning with the spoken word. When the spoken words in a homogeneous block shared the first syllables and their tones, response times were faster than when they had nothing in common, indicating an advantage of advanced preparation of the first tonal syllable. The sizes of the preparation effects were similar for words that were rendered homogeneous after tone sandhi (Experiment 1, e.g., qi3-wu3, qi3-tao3, qi2-xian3, qi2-dao3) and for words that were homogeneous prior to tone sandhi (Experiment 2, e.g., dao3-yan3, dao3-gui3, dao3-mei2, dao3-guo2). A control experiment (Experiment 3) where the first syllables of the spoken words in a homogeneous block assumed tone 2 and tone 3 but involved no tone sandhi revealed a similar preparation effect comparable in size with those involving tone sandhi. A second control experiment (Experiment 4) using tone 1 and tone 3 without involving tone sandhi produced a reduced effect. The results of Experiment 1 suggest that disyllabic words with two third tones may be stored in the post-tone-sandhi form (i.e., as T2-T3). The results of Experiment 2 and 3 suggest that tone sandhi is an articulatory operation when carried out online. This conclusion is based on the fact that the phonetic values of Tone 2 and Tone 3 share the initial part (low, dipping) of their pitch contours. Participants of the experiment might have prepared the first syllable up to the articulatory gesture involving the initial portion of the tonal contour. They could then shift the gestural movement with no apparent delay to accommodate the subsequent portion of the tonal contour, which is different for Tone 2 and Tone 3. Research from hand and arm reaching studies offers support for this conclusion.\n",
    "Index Terms: Mandarin Chinese, speech production, implicit priming, syllable, tone sandhi [Remark. Chinese characters in this abstract were omitted in the HTML version. ISCA Archive]\n",
    ""
   ]
  },
  "zhu12b_tal": {
   "authors": [
    [
     "Hong",
     "Zhu"
    ],
    [
     "Peng",
     "Zhang"
    ],
    [
     "Kei",
     "Yoshimoto"
    ]
   ],
   "title": "The acquisition of Mandarin tones by Japanese learners",
   "original": "34",
   "page_count": 3,
   "order": 42,
   "p1": "paper S2-02",
   "pn": "",
   "abstract": [
    "This study focuses on the problem Japanese learners have in distinguishing between Tone 2 and Tone 3 when learning tones in Mandarin. Acoustic experiments were carried out based on the four basic vowels in Mandarin. They were designed using continual sound stimuli, which gradually changed from Tone 2 to Tone 3 (i.e. turning point and ΔF0) and performed on Japanese learners and Chinese native speakers. We demonstrated that the ability of Japanese learners to distinguish between tones 2 and 3 was affected by both factors, but more so by the turning point. Moreover, the perception distributions of the Japanese learners in our experiments varied amongst the four vowels. We found the distribution for the ambiguity of perception boundary was /i/ > /ü/ > /a/ > /u/, while the sequences of the four vowelsf F2 values is also /i/ > /ü/ > /a/ > /u/. Thus, our experimental results suggest that the perception discrimination of the Tone 2 and Tone 3 in Japanese learners of Mandarin may be affected by the difference in F2 value.\n",
    "Index Terms: tone, turning point, ΔF0, perception, vowel\n",
    ""
   ]
  },
  "tseng12_tal": {
   "authors": [
    [
     "Chin-Chin",
     "Tseng"
    ],
    [
     "Alice",
     "Lee"
    ]
   ],
   "title": "An online perceptual test of Mandarin Chinese tones by L2 learners of tonal vs. nontonal languages",
   "original": "35",
   "page_count": 6,
   "order": 43,
   "p1": "paper S2-03",
   "pn": "",
   "abstract": [
    "The principal aim of the online Mandarin Chinese perceptual test is to understand how learners of Mandarin Chinese identify the language’s four tones and its correlated factors. There are many factors involved in successfully learning a second language. Therefore, aside from a learner’s L1 language and prior experience, his/her attitude and motivation also contribute to L2 learning. That may be why previous research did not come to a conclusion about how L2 learners acquire Mandarin tones. In this study, we investigated tonal vs. nontonal, and other factors that may contribute to the perceptual test results. An online perceptual test of Mandarin tones is designed for the collection of L2 learners' perceptual data. We collected data from a total 206 participants in this study. 75 participants identified themselves as tonal speakers, 91 as nontonal speakers, while 40 chose other. The participants were university students in the US and Vietnam, learning Mandarin Chinese at the time they took the experiment. The test contains a questionnaire and 20 test items. The results show that tonal speakers achieved significantly higher accuracy rates in identifying Mandarin tones and their response time was significantly shorter than nontonal speakers. Most identification errors for tonal speakers occurred for Tone 1, while Tone 2 had the most errors for nontonal speakers. Correlation analysis shows that majoring in Chinese is positively correlated with their test score. Regarding attitude and motivation factors, the more important one valued tones, the better he/she performed. The more the student wanted to master Chinese tones, the better he/she performed.\n",
    "Index Terms: tone, perception, Mandarin Chinese, second language\n",
    ""
   ]
  },
  "yang12b_tal": {
   "authors": [
    [
     "Chung-Hsien",
     "Yang"
    ],
    [
     "Chin-Chin",
     "Tseng"
    ],
    [
     "Yi-Jing",
     "Lin"
    ]
   ],
   "title": "A Chinese tone learning platform based on advanced speech technologies",
   "original": "36",
   "page_count": 4,
   "order": 44,
   "p1": "paper S2-04",
   "pn": "",
   "abstract": [
    "This paper describes the tone-learning features of the MyET-MyCT software, which is a computer-assisted language learning platform based on advanced speech technologies. We describe the theories involved, the advantages it offered, and the challenges we faced when developing such a computer-assisted language learning system.\n",
    "Index Terms: computer assisted language learning, automatic speech analysis, Chinese tones, Mandarin Chinese learning\n",
    ""
   ]
  },
  "karlsson12_tal": {
   "authors": [
    [
     "Anastasia M.",
     "Karlsson"
    ],
    [
     "Jan-Olof",
     "Svantesson"
    ],
    [
     "David",
     "House"
    ]
   ],
   "title": "Adaptation of focus to lexical tone and phrasing in Kammu",
   "original": "37",
   "page_count": 5,
   "order": 45,
   "p1": "paper O3-01",
   "pn": "",
   "abstract": [
    "Recently it has been proposed to base intonational typology on the way languages convey focus (pragmatic prominence). Generally, languages can enhance, add or delete phrase boundary tones (phrase languages) or add an extra pitch accent (intonation languages) to mark focus. Tone languages are somewhat problematic for this typology as it is difficult to make direct observations on their sentence intonation. Generally, tone languages are supposed to have a suppressed use of intonation on the sentence level. As a consequence, tone languages are usually described as a separate prosodic type.   We investigate Kammu, an Austroasiatic language spoken mainly in Laos. Kammu has two main dialects, one with lexical tones and one without tones; other phonological differences are minimal. In our previous studies we concentrated on elicited and controlled speech to explore the role of F0 in focusing and phrasing. We concluded that both dialects belong to the phrase language type. In the present study we use spontaneous material and investigate both F0 and duration for phrasing and focusing. We show that both F0 and duration are used for focusing in the two dialects. However, the prosodic realization of focus is restricted to the rightmost edge of the prosodic phrase, which coincides with the phrase boundary. The main conclusion is that the prevalence for edge marking influences the realization of focus, in accordance with prosodic typology. Further, the occurrence of lexical tones can still be combined with the phrasing pattern, and the tonal dialect shows the same strategies for focusing and phrasing as a phrase language.\n",
    "Index Terms: lexical tone, intonation, phrasing, focusing, prosodic typology, Kammu\n",
    ""
   ]
  },
  "zhang12b_tal": {
   "authors": [
    [
     "Zhang",
     "Zhang"
    ],
    [
     "Zhiyong",
     "Wu"
    ],
    [
     "Jia",
     "Jia"
    ],
    [
     "Lianhong",
     "Cai"
    ]
   ],
   "title": "Modeling prosody pattern of Chinese expressive speech and its application in personalized speech conversion",
   "original": "38",
   "page_count": 5,
   "order": 46,
   "p1": "paper O3-02",
   "pn": "",
   "abstract": [
    "This paper proposes an approach for modeling prosody patterns of acoustic features of Chinese expressive speech. In a Chinese multi-syllabic prosodic word, a syllable is identified as the core syllable based on the observation that speaker usually puts more emphasis on such syllable. The variations of the acoustic features migrating from neutral to expressive speech are then analyzed for both the core and non-core syllables. It is found that the acoustic variations of the core syllable are the most significant; the variations of the non-core syllables are influenced by the core syllable; such influence decreases while the non-core syllable moves farther from the core syllable. A double-layer perturbation model is then proposed to model such prosody patterns, which is further applied to generate personalized prosody patterns for personalized speech conversion. Experimental results indicate that our model can catch and regenerate the personality of prosodic features in expressive speech.\n",
    "Index Terms: prosody pattern, expressive speech, prosodic features, personalized speech conversion\n",
    ""
   ]
  },
  "li12c_tal": {
   "authors": [
    [
     "Aijun",
     "Li"
    ],
    [
     "Qiang",
     "Fang"
    ],
    [
     "Yuan",
     "Jia"
    ],
    [
     "Jianwu",
     "Dang"
    ]
   ],
   "title": "Successive addition boundary tone in Chinese disgust intonation",
   "original": "39",
   "page_count": 4,
   "order": 47,
   "p1": "paper O3-03",
   "pn": "",
   "abstract": [
    "Based on two Mandarin speakers’ data, we found a kind of successive addition boundary tone in disgust intonation when the tones of the final boundary syllables are tone 1, tone 2 or tone 3. In this case, the disgust boundary tone is composed by two components, i.e., the lexical tone which is employed to express lexical meaning, and the expressive tone which is realized as a falling tone to express disgust emotion. Further, the acoustic features of the boundary tones in disgust emotion were analyzed, and the study proposed that tone1 has a longer successive addition tone which almost equals to the length of its lexical tone. In regard with tone 2 and tone 3, the successive tones are relatively shorter which account for 36% and 58% of the proceeding lexical tones. The mean slopes of the additive falling tones range from -53st/s to -33st/s.\n",
    "Index Terms: Boundary tone, Successive addition boundary tone, Disgust emotion, Intonation, Mandarin Chinese\n",
    ""
   ]
  },
  "gussenhoven12_tal": {
   "authors": [
    [
     "Carlos",
     "Gussenhoven"
    ]
   ],
   "title": "Tone and intonation in Cantonese English",
   "original": "40",
   "page_count": 4,
   "order": 48,
   "p1": "paper O3-04",
   "pn": "",
   "abstract": [
    "Cantonese English tonal patterns are analyzed based on the description provided by K.K. Luke. Results of a production test with isolated words lead to the conclusion that the language has at least three intonations, declarative, emphatic and interrogative. The last two are expressed through the boundary tones L% and H%, while the first is characterized by having no boundary tone. The interaction with the word tone on the last syllable leads to a situation in which L-ending words (whose British English counterparts have non-final primary stress) either have a rising or a low final syllable, but H-ending words (whose British English counterparts have final primary stress) have high pitch, low pitch or high rising pitch. A comparison with British English shows that surface contours receive very different interpretations in the two languages.\n",
    "Index Terms: Hong Kong English, Cantonese English, lexical tone, boundary tone\n",
    ""
   ]
  },
  "cao12_tal": {
   "authors": [
    [
     "Jianfen",
     "Cao"
    ]
   ],
   "title": "Pitch prominence and tonal typology for low register tone in Mandarin",
   "original": "41",
   "page_count": 5,
   "order": 49,
   "p1": "paper O3-05",
   "pn": "",
   "abstract": [
    "This paper tries to explore the relationship between pitch prominence and tonal typology by examining pitch behavior of the 3rd tone, a low register tone, in different accent contexts under Mandarin Chinese. The primary results obtained so far show that, pitch level of the 3rd tone is obviously lowered in focal condition, which is mainly manifested by lowering the L-point value of its F0, rather than raising the H-point value. This peculiar prominence pattern is not only reverse to the general model well established as the H raising effect in many languages of the world, but also remarkably diverse from the case of low register tone in Cantonese, another Chinese dialect typologically different from Mandarin. Considering on this deviation and referring to similar findings reported in other languages, we propose that implementational strategy of pitch prominence in certain language may be restricted by not only phonological contrast, but also by typological distinction.\n",
    "Index Terms: pitch prominence, 3rd tone of Mandarin, register, typology\n",
    ""
   ]
  },
  "politzerahles12_tal": {
   "authors": [
    [
     "Stephen",
     "Politzer-Ahles"
    ],
    [
     "Jie",
     "Zhang"
    ]
   ],
   "title": "The role of tone sandhi in speech production: evidence for phonological parsing",
   "original": "42",
   "page_count": 6,
   "order": 50,
   "p1": "paper O4-01",
   "pn": "",
   "abstract": [
    "The present study investigates the role of phonological alternation during speech production in Mandarin, using the odd-man-out implicit priming paradigm, a task in which participants respond faster to words in sets that are phonologically homogeneous in some respect than in sets that are phonologically heterogeneous. We test whether priming is obtained when words in a set share the some tones at the underlying level but have different tones at the surface level— i.e., when the set includes a word that undergoes third tone sandhi. We find that sets of words that are heterogeneous at the surface level (i.e., the heterogeneity is due to application of tone sandhi) failed to elicit priming, just as sets of words that are heterogeneous at the underlying level (i.e., the heterogeneity is due to lexical tone). This finding suggests that the phonological alternation was computed abstractly before the initiation of articulation, offering evidence that the progression from underlying phonological representations to articulatory execution may be mediated online by a level at which abstract phonological alternations are processed.\n",
    "Index Terms: tone sandhi, speech production, implicit priming, Mandarin\n",
    ""
   ]
  },
  "zhang12c_tal": {
   "authors": [
    [
     "Jingwei",
     "Zhang"
    ],
    [
     "Hans Van de",
     "Velde"
    ],
    [
     "René",
     "Kager"
    ]
   ],
   "title": "The correlation of tonal variation in citation and sandhi forms: a Wuxi case",
   "original": "43",
   "page_count": 4,
   "order": 51,
   "p1": "paper O4-02",
   "pn": "",
   "abstract": [
    "This paper presents the results of a sociophonetic study of variation in the sandhi form with initial Yangshang (low ascending tone in Middle Chinese) in the Wuxi dialect. In contrast with older phonetic studies showing a stable pattern of sandhi variation, a change in progress was observed in our study. A comparison of the changes in progress in citation tone and tone sandhi revealed that there is a strong, positive correlation between the use of conservative forms in citation tone and tone sandhi. Furthermore, our data show the same social distribution in the Wuxi speech community.\n",
    "Index Terms: sociophonetics, citation tone, tone sandhi, Wuxi dialect, social stratification\n",
    ""
   ]
  },
  "zhang12d_tal": {
   "authors": [
    [
     "Jie",
     "Zhang"
    ],
    [
     "Yuanliang",
     "Meng"
    ]
   ],
   "title": "Structure-dependent tone sandhi in real and nonce words in Shanghai Wu",
   "original": "44",
   "page_count": 6,
   "order": 52,
   "p1": "paper O4-03",
   "pn": "",
   "abstract": [
    "Disyllabic sequences in Shanghai Wu undergo different types of tone sandhi depending on their syntactic structure: modifier-noun compounds spread the initial tone across the disyllable, while verb-noun phrases often maintain the final tone and neutralize the nonfinal tone, especially if the phrase has a low frequency of occurrence. We investigated the productivity of the two tone sandhi types through 48 speakers’ productions of real and nonce words. Our results showed that Shanghai speakers were sensitive to the structure-dependency of the sandhi pattern and performed different sandhis according to the disyllable’s syntactic structure in both real and nonce words. But in nonce words, the productivity of each specific sandhi varies, and the difference between left- and right-dominant sandhis is attenuated. Additionally, neither the left- or right-dominant sandhi involves complete tonal neutralization. These results indicate that in order to arrive at a full picture of the sandhi patterning, traditional impressionistic descriptions need to be complemented by instrumental data.\n",
    "Index Terms: tone, tone sandhi, Shanghai Wu, productivity, incomplete neutralization\n",
    ""
   ]
  },
  "song12_tal": {
   "authors": [
    [
     "Jinpang",
     "Song"
    ]
   ],
   "title": "Level/oblique opposition and Raoyang tonology",
   "original": "45",
   "page_count": 5,
   "order": 53,
   "p1": "paper O4-04",
   "pn": "",
   "abstract": [
    "Phonetic experiments and phonological analysis reveal that Raoyang tone system characterizes level/oblique (LO) opposition, which is hardly captured by a node of contour in tonal geometry. A specific model featuring independent LO feature and pitch feature is then proposed. For cross-linguistic universality of tonal representation, the essay turns to the theory of Contrastive Hierarchy. Related OT constraints are then constructed and ranked for a formal grammar. The paper concludes with a discussion on the theoretical implications of this analysis.\n",
    "Index Terms: Raoyang, level/oblique opposition, tone sandhi, contrastive hierarchy, Optimality Theory\n",
    ""
   ]
  },
  "zhao12_tal": {
   "authors": [
    [
     "Cunhua",
     "Zhao"
    ],
    [
     "Honghua",
     "Zhai"
    ]
   ],
   "title": "Tone sandhi in Jiaonan dialect: an optimality theoretical account",
   "original": "46",
   "page_count": 5,
   "order": 54,
   "p1": "paper O4-05",
   "pn": "",
   "abstract": [
    "Based on phonetic experiment, this paper aims at providing phonetic description on the tones and disyllabic tone sandhi in Jiaonan dialect, and then illustrating the phonological structures within the framework of Auto-segmental Phonology to conduct an OT analysis on the tone sandhi patterns of Jiaonan dialect.\n",
    "Index Terms: Jiaonan dialect, phonetics, tone, tone sandhi, OT\n",
    ""
   ]
  },
  "li12d_tal": {
   "authors": [
    [
     "Qian",
     "Li"
    ],
    [
     "Yiya",
     "Chen"
    ]
   ],
   "title": "Trisyllabic tone sandhi in Tianjin Mandarin",
   "original": "47",
   "page_count": 6,
   "order": 55,
   "p1": "paper O4-06",
   "pn": "",
   "abstract": [
    "Tianjin Mandarin is known for its complex tone sandhi patterns over bisyllabic constituents and the conflicting directionality as well as the possible iterative application of sandhi rules over trisyllabic constituents. Previous studies on Tianjin tone sandhi, especially those on sandhi in trisyllabic sequences, have been mainly based on impressionistic descriptions. In this paper, we argue that tone sandhi in Tianjin Mandarin is much simpler than what the literature suggests. First, only three bisyllabic tonal combinations in Tianjin introduce sandhi changes: T1+T1, T4+T1, and T3+T3. Furthermore, tone sandhi in Tianjin Mandarin does not involve the change of one lexical tone into another. Second, in trisyllabic sequences, these bisyllabic sandhi rules do not apply consistently, as claimed in the literature. Specifically, T1+T1 and T4+T1 only introduce sandhi changes when they are right-aligned. Iterative sandhi application was only observed over T3+T3+T3 sequence where sandhi must have been applied from the left edge. Conjointly, we argue that there is no experimental evidence to support the so-called “paradox” in Tianjin tone sandhi (Chen, 2000).\n",
    "Index Terms: tone sandhi, Tianjin Mandarin, production\n",
    "",
    "",
    "Chen, M. Y., Tone Sandhi: Patterns across Chinese Dialects, 98-149, Cambridge Univ. Press, 2000.\n",
    ""
   ]
  },
  "yeh12_tal": {
   "authors": [
    [
     "Chia-Hsin",
     "Yeh"
    ],
    [
     "Yen-Hwei",
     "Lin"
    ]
   ],
   "title": "The effect of tone sandhi on speech perception of Taiwanese falling tones",
   "original": "48",
   "page_count": 4,
   "order": 56,
   "p1": "paper P2-01",
   "pn": "",
   "abstract": [
    "This study investigates phonetic and lexical effects on speech perception of two Taiwanese tones: high-falling and lowfalling, and suggests that tone sandhi also plays a role. A tonal identification task and a lexical task were conducted on 30 Taiwanese speakers. The results show that onset pitch and pitch drop are more crucial than offset pitch to the contrast of the two falling tones, and participants are more responsive to frequent words. In addition, the response frequency of the two categories is consistently lower than 90%, and that the highfalling responses significantly increase in the tone sandhi condition. This study verifies the psychological reality of multiple linguistic representations, including phonetic, phonological, lexical information, and suggests that a model of speech perception should consider these linguistic cues as processing fundaments.\n",
    "Index Terms: falling tone, speech perception, Taiwanese, lexical effect, tone sandhi\n",
    ""
   ]
  },
  "xu12c_tal": {
   "authors": [
    [
     "Xiaoying",
     "Xu"
    ],
    [
     "Xuefei",
     "Liu"
    ],
    [
     "Jianhua",
     "Tao"
    ],
    [
     "Hao",
     "Che"
    ]
   ],
   "title": "Pitch and phonation type perception in Wenzhou dialect tone",
   "original": "49",
   "page_count": 6,
   "order": 57,
   "p1": "paper P2-02",
   "pn": "",
   "abstract": [
    "Wenzhou dialect is characterized by a large tonal inventory and tones which combine pitch contour and phonation type cues. In this paper, a perception experiment was conducted to investigate identification cues of the eight tones in Wenzhou. The results of the experiment show that: I) Not all native speakers can identify tones using pitch contour alone. II) It was difficult for participants to recognize tone 1. III) Some stimuli, especially tone 4, could carry a wide range of F0 contours and still be identified as belonging to the original tonal category; many other tones, however, were perceived as belonging to other categories after only slight modifications to F0. IV) Phonation type impacts the identification of some tone categories. Based on the results, the phonological organization of Wenzhou’s tone system is examined and the possibility of reconstructing the Middle Chinese tone system is discussed.\n",
    "Index Terms: Wenzhou Wu dialect, tone, pitch, phonation type, perception\n",
    ""
   ]
  },
  "yang12c_tal": {
   "authors": [
    [
     "Bei",
     "Yang"
    ]
   ],
   "title": "How many types of neutral tones in Mandarin: a case study of perception",
   "original": "50",
   "page_count": 5,
   "order": 58,
   "p1": "paper P2-03",
   "pn": "",
   "abstract": [
    "This paper explores the environments of tonal neutralization in Mandarin using two perception experiments: Experiment 1 examines whether changing the pitch of the neutral tone can affect how it is perceived; Experiment 2 investigates whether a neutral tone with a lengthened duration can be perceived as a full or neutral tone naturally. Twenty native speakers participated in this study. The results indicate that pitch plays an important role during perception. Therefore, four full tones become indistinguishable in four phonetic environments and there are four categories of neutral tones. The results are similar to the tone sandhi in Wu dialects, giving rise to some interesting comparisons.\n",
    "Index Terms: neutral tone, tone sandhi, perception\n",
    ""
   ]
  },
  "lu12_tal": {
   "authors": [
    [
     "Yan",
     "Lu"
    ],
    [
     "Véronique",
     "Aubergé"
    ],
    [
     "Albert",
     "Rilliard"
    ]
   ],
   "title": "Tonal influences on the prosodic cross-linguistic perception of Mandarin - social affects by French and Vietnamese listeners",
   "original": "51",
   "page_count": 4,
   "order": 59,
   "p1": "paper P2-04",
   "pn": "",
   "abstract": [
    "Social affects play an important role in the face-to-face interaction and are implied in the realization of speech acts. The prosody is a main vector of social affects and its crosslanguage variability is a challenge for language description as well as for foreign language teaching. The present paper aims at examining the influences of tones on the perception of 19 prosodic social affects of Mandarin Chinese by French and Vietnamese subjects. A corpus of attitudinal speech was designed with a variation of tones values and location. The test results show that most social affects were globally recognized over chance by the two groups of foreign-language subjects. For French subjects, “contempt”, “irony” and “confidence”, and “irony” for Vietnamese, were not identified – independently of tones distribution. A significant effect of tones for the two groups was found, with a higher magnitude for French than for Vietnamese. Moreover, a significant attitude & tone interaction is observed for both languages.\n",
    "Index Terms: prosodic attitudes, cross-linguistic perception of tones, Mandarin Chinese, Vietnamese, French\n",
    ""
   ]
  },
  "li12e_tal": {
   "authors": [
    [
     "Shu",
     "Li"
    ]
   ],
   "title": "Perceptual boundary of Mandarin tone 3 and tone 4",
   "original": "52",
   "page_count": 4,
   "order": 60,
   "p1": "paper P2-05",
   "pn": "",
   "abstract": [
    "The study investigates the perceptual boundary of Mandarin Tone 3 and Tone 4 in real language environment. Combining the continuum with characters of different tones (tone 1, tone 2 and tone 4) and locating it before and after these characters (target-prior continua such as \"huŏ/huò chē\" and reference-prior continua such as \"fā huŏ/huò\"), we choose six groups of meaningful disyllable words as experimental materials. The boundary is at 81% of the pitch range (the top line is 100%) in target-prior continua and 58% of the pitch range in reference-prior continua. In target-prior continua, the perceptual distributions show that starting point of tone 4 is highly restricted and on-glide of Tone 3 is variable. In reference-prior continua, the boundaries differ significantly and are farther from the top line of the pitch range. The results show that perceptual boundary varies in different tone environment, and it is greatly affected by continuum position.\n",
    ""
   ]
  },
  "jin12_tal": {
   "authors": [
    [
     "Jian",
     "Jin"
    ]
   ],
   "title": "A perceptual study on rising and contour tone of Hunan Leiyang dialect",
   "original": "abs9",
   "page_count": 0,
   "order": 61,
   "p1": "paper P2-06",
   "pn": "",
   "abstract": [
    "There is one rising tone and three contour tones in the Leiyang dialect, the high rising tone (T1) 35, the contour tone (T4) 313, the high and mid-high contour tones have a flat curve before inflection (T2 and T5) 335 and 334. Acoustic analysis results showed that there were four acoustic parameters, namely RDBIP, ΔF0, IPP, and curvature may influence how native speakers perceive these four special Leiyang dialect tones. This paper examined the roles of these four acoustic parameters in separating these four tones using identification and discrimination tests. Identification and discrimination data revealed that RDBIP, ΔF0 and IPP respectively played a role in distinguish tones of T1-T2, T2-T5, and T4-T5.\n",
    ""
   ]
  },
  "wang12d_tal": {
   "authors": [
    [
     "Xinchun",
     "Wang"
    ]
   ],
   "title": "Difficulties with Mandarin tones: learners’ perspectives and speech data analysis",
   "original": "53",
   "page_count": 5,
   "order": 62,
   "p1": "paper P2-07",
   "pn": "",
   "abstract": [
    "This study investigates beginning level adult Chinese as a Foreign Language (CFL) learners’ difficulties with Mandarin Chinese tones. Twenty CFL learners enrolled in a first semester CFL course in a U.S. university participated as speakers. Their productions of Mandarin phrases and sentences were judged by native Mandarin listeners for pronunciation and tone problems and were also rated by native Mandarin listeners. A post course survey questionnaire was also analyzed to investigate the learners’ learning experience and their perception of difficulties with Mandarin pronunciation and tones. Results suggest the speakers’ productions of Mandarin phrases and sentences were judged to be most problematic with tones. Learners also reported tones to be the most difficult aspect in learning Chinese at initial stage of learning.\n",
    "Index Terms: Mandarin tones, production of tones, difficulties with tones, survey\n",
    ""
   ]
  },
  "huang12_tal": {
   "authors": [
    [
     "Lina",
     "Huang"
    ]
   ],
   "title": "An analysis of the pitch contour of an English declarative question read aloud by Chinese EFL learners",
   "original": "54",
   "page_count": 7,
   "order": 63,
   "p1": "paper P2-08",
   "pn": "",
   "abstract": [
    "The pitch contour of an English declarative question read aloud by 12 Chinese EFL learners is labeled and analyzed by means of the phonetic software “praat” on the basis of the English intonation grammar proposed by Pierrehumbert. The careful study yields to two findings. 1) Most Chinese EFL learners can locate correctly the stresses of the target sentence and attach legal tonal events to the pitch accents and edge tones, but they prefer to employ non-monotonies for the pitch accents. 2) They are unable to manage the tone scaling of the pitch accents according to their strength in an IP or the proper combination of the tonal events into a pitch contour. Learners’ improper management of the tonal events for the pitch accents of the target sentence, their tone scaling and the pitch transition between two starred tones probably arises from the negative transfer of Chinese lexical tones and intonation, the severe shortage of input on English intonation grammar and their low-level skills in tone management at the declarative stage in English intonation learning. The results provide some inspiration for English intonation teaching and learning.\n",
    "Index Terms: pitch contour, pitch accent, phrase accent, boundary tone\n",
    ""
   ]
  },
  "cao12b_tal": {
   "authors": [
    [
     "Wen",
     "Cao"
    ],
    [
     "Yuko",
     "Ota"
    ],
    [
     "Hong",
     "Jiang"
    ],
    [
     "Lu",
     "Liu"
    ],
    [
     "Jinsong",
     "Zhang"
    ]
   ],
   "title": "Identification of Mandarin tone-2 and tone-3 in disyllabic contexts by Chinese natives and Japanese students",
   "original": "55",
   "page_count": 5,
   "order": 64,
   "p1": "paper P2-09",
   "pn": "",
   "abstract": [
    "This study primarily explores the perception of Mandarin Tone-2 (T2) and Tone-3 (T3) in disyllabic contexts by Chinese natives and Japanese students. Seventeen contours of a T2-T3 continuum and twelve contours of a T2-=Half T3‘ continuum are respectively synthesized and connected before or after the four tones separately as stimuli. The results of their perception show that: (1) Both Chinese and Japanese participants are affected by contexts in tone identifying; (2) Japanese rely more on acoustic characteristics other than phonological rules; (3) T3 identification is more difficult than T2 for Japanese, especially when it is after the context tone.\n",
    "Index Terms: tone, perception, context, Chinese, Japanese\n",
    ""
   ]
  },
  "zhao12b_tal": {
   "authors": [
    [
     "Lijun",
     "Zhao"
    ]
   ],
   "title": "Russian learners’ acquisition features of Chinese tones",
   "original": "56",
   "page_count": 4,
   "order": 65,
   "p1": "paper P2-10",
   "pn": "",
   "abstract": [
    "Tone is an important aspect of speech in standard Chinese language. Acquisition of Chinese tones is directly related to the learner’s speaking level. There is little research published on Russian learners’ acquisition of Chinese tones, therefore a group of students from Belarus were chosen as a sample for this investigation. Abundant data and results were gained from their demonstration over a period of one and a half years. As regards their tones, we determined that the main errors made by Russian students are errors of changing tone categories. The acquisition order from easy to difficult is tone 1, tone 4, tone 2 and tone 3. The reasons for the errors and the teaching countermeasures are analyzed and explained within this paper.\n",
    "Index Terms: tone\n",
    ""
   ]
  },
  "ma12_tal": {
   "authors": [
    [
     "Guangqin",
     "Ma"
    ]
   ],
   "title": "On the use of the attitudinal function of English intonation",
   "original": "abs10",
   "page_count": 0,
   "order": 66,
   "p1": "paper P2-11",
   "pn": "",
   "abstract": [
    "As we know, in communication between people with different mother tongues, intonation can not only eliminate ambiguity and convey information, but also reveal the speaker’s mood and attitude. If we use intonation improperly, it will make the native listeners puzzled, or lead to misunderstandings. Nowadays, the economic, political and technological communication between countries all over the world is developing at a great speed. Therefore, we can differentiate the right intonations from the wrong ones that baffle our communication to promote international communication and cooperation. In this paper, the use of the attitudinal function of English intonation is specifically studied, through native speakers’ judgment and analysis to explore characteristics and problems exhibited by Chinese learners of English in using English intonation to express emotions and attitudes and at the same time try to provide suggestions to solve these problems and provide guides for English intonation teaching and learning.\n",
    ""
   ]
  },
  "yang12d_tal": {
   "authors": [
    [
     "Jin",
     "Yang"
    ]
   ],
   "title": "A study on the English stress placement of Chinese EFL learners",
   "original": "57",
   "page_count": 4,
   "order": 67,
   "p1": "paper P2-12",
   "pn": "",
   "abstract": [
    "The paper reports an experimental study on the learning of stress placement rules of Chinese EFL learners. The F0 slope of stress assignment rules in English by 30 Chinese EFL learners were compared with that of native speakers. The learners had an average of 5-minute instruction with a tenminute practice period. The stimulus words, sentences, and paragraph contrast the compound stress rule and nuclear stress rule in compound nouns and noun phrases such as the 'White House' and 'a white house.' The result indicates that the learners had an F0 drop for the compound nouns but an F0 rise for noun phrases. It is also observed that the learners showed a more characteristic F0 slope than the native speaker did. It is thus concluded that Chinese EFL learners easily learn stress assignment in English, which is realized as pitch.\n",
    "Index Terms: stress assignment rules, F0 slope, compound noun, noun phrase\n",
    ""
   ]
  },
  "hu12_tal": {
   "authors": [
    [
     "Na",
     "Hu"
    ],
    [
     "Yuan",
     "Jia"
    ],
    [
     "Bin",
     "Liu"
    ]
   ],
   "title": "Phonetic realization of narrow focus by beijing EFL learners",
   "original": "58",
   "page_count": 6,
   "order": 68,
   "p1": "paper P2-13",
   "pn": "",
   "abstract": [
    "Focus is of great importance in English. The present study investigates how focus is phonetically realized in English declarative sentences by Beijing EFL learners. The goal is to explore the effects of focus on their F0 contours, the shapes of F0 contours and the correlations between F0 variations and accent perception. Sixteen Beijing EFL learners and two native speakers of American English recorded short declarative sentences in different focus locations. Detailed F0 inspection reveals that Beijing EFL learners realize focus in the similar way with native speakers do. However, Beijing EFL learners‘ F0 contours under focus show several distinctions, i.e., fewer delayed F0 peaks and fewer post-focus F0 peaks. Furthermore, the results of a perceptive grading show that F0 rising of minor magnitudes on focus would not be perceived as accented and over-sized F0 rising would result in unnaturalness.\n",
    "Index Terms: Focus, Beijing EFL learners, phonetic realization, negative transfer\n",
    ""
   ]
  },
  "schellenberg12_tal": {
   "authors": [
    [
     "Murray",
     "Schellenberg"
    ]
   ],
   "title": "Tone realization in sung Mandarin",
   "original": "59",
   "page_count": 3,
   "order": 69,
   "p1": "paper O5-01",
   "pn": "",
   "abstract": [
    "Drawing on previous work which showed that singers in Cantonese transfer contour tone information over to singing, this paper examines whether singers in Mandarin exhibit similar kinds of transfer. Analysis of contour slope, duration and fundamental frequency suggest that Mandarin singers do not transfer these elements of tone to their singing.\n",
    "Index Terms: tone, singing, Mandarin, contour, duration\n",
    ""
   ]
  },
  "zhou12b_tal": {
   "authors": [
    [
     "Weijing",
     "Zhou"
    ],
    [
     "Yi",
     "Zhang"
    ],
    [
     "Hong",
     "Chen"
    ],
    [
     "Xiaoli",
     "Ji"
    ],
    [
     "Pengfei",
     "Shao"
    ]
   ],
   "title": "The acquisition of English tones by Mandarin EFL learners: a preliminary study",
   "original": "60",
   "page_count": 4,
   "order": 70,
   "p1": "paper O5-02",
   "pn": "",
   "abstract": [
    "This paper reports a pretest-posttest experimental study of the acquisition of English tones by Mandarin EFL learners in a Chinese university. The target tones are high fall, high rise, fall-rise and complex level tones embedded in non-English words, one/two-syllable English words and short English sentences. The subjects are 31 Mandarin EFL learners majoring in English, who have learnt English for over 10 years. The pretest data reveal that the subjects’ average acquisition rate (AAR) of English tones is quite moderate (AAR=59%), indicating English tones are considerably difficult for Mandarin EFL learners to acquire. After a 10-week implicit instruction in English tones, the subjects’ AAR of target tones has been significantly improved by 25%, demonstrating the strong support for the teachability of English tones to Mandarin EFL learners. These findings shed light on the learning and teaching of English tones and English intonation in mainland China.\n",
    "Index Terms: English tones, intonation, production, learnability, teachability.\n",
    ""
   ]
  },
  "chen12c_tal": {
   "authors": [
    [
     "Zhongmin",
     "Chen"
    ],
    [
     "Yizhi",
     "Wang"
    ]
   ],
   "title": "Roles of <i>F</i><sub>0</sub> and closure in the voiced-voiceless distinction for initial stops in Wu dialects — take Shanghainese for example",
   "original": "61",
   "page_count": 6,
   "order": 71,
   "p1": "paper O5-03",
   "pn": "",
   "abstract": [
    "Abstract Most previous works on acoustic cues for the voiced-voiceless distinction of initial stops have focused on non-tonal languages such as English. The present study seeks to determine some possible cues for voicing perception of initial stops in a tonal language — Shanghainese. Perceptual experiments were conducted using stimuli which were created based on natural sounds in the initial position and the medial position of two-syllable words respectively. The results show that F0 is critical in perceiving voicing on initial stops in initial position, but only has a weak effect in medial position. Another acoustic cue—closure, is proved to be an important cue for voiced-voiceless distinction of initial stops in medial position. The data indicate that there is a significant trading relationship between these two cues for voicing perception in medial position.\n",
    "Index Terms:F0, closure, voiced-voiceless distinction, initial stops, Shanghainese.\n",
    ""
   ]
  },
  "wang12e_tal": {
   "authors": [
    [
     "Ting",
     "Wang"
    ],
    [
     "Hongwei",
     "Ding"
    ]
   ],
   "title": "Production and perception of nasal coda mergence in Hohhot dialect: from a prosodic point of view",
   "original": "62",
   "page_count": 6,
   "order": 72,
   "p1": "paper O5-04",
   "pn": "",
   "abstract": [
    "The present paper conducts two experiments on the nasal coda performance in Hohhot dialect from a prosodic point of view. In the production experiment, acoustic characteristics of nasal codas in Hohhot dialect are shown in comparison with that in Mandarin Chinese in the dimensions of duration, fundamental frequency and intensity, which reveal that Hohhot dialect speakers cannot produce the nasal coda [n]. There appears no significant difference between [n] and [ŋ] in Hohhot dialect, and there exists a mergence from [n] to [ŋ] in Hohhot Dialect. The perception tests indicate that the Hohhot dialect speakers cannot discern the distinction between [n] and [ŋ] in both Hohhot dialect and the Mandarin Chinese. This mergence is an inherent speech perception mode in the Hohhot dialect speaker.s brain. Moreover, for each individual subject, the accuracy of production of nasal codas is highly correlated with that of perception. And their perception performances of nasal codas in Tone 1 and Tone 4 are much better than those in Tone 2 and Tone 3. Perceptual accuracy of nasal codas in Tone 2 is worst.\n",
    "Index Terms: Hohhot dialect; nasals; production; perception\n",
    ""
   ]
  }
 },
 "sessions": [
  {
   "title": "Keynote Papers",
   "papers": [
    "fujisaki12_tal",
    "wang12_tal",
    "kohler12_tal",
    "ohala12_tal",
    "rose12_tal",
    "michaud12_tal"
   ]
  },
  {
   "title": "Tutorials",
   "papers": [
    "niebuhr12_tal",
    "hirst12_tal",
    "gu12_tal",
    "zhou12_tal"
   ]
  },
  {
   "title": "Neural Mechanism (Special Session)",
   "papers": [
    "malins12_tal",
    "shuai12_tal",
    "gu12b_tal",
    "fung12_tal",
    "liu12_tal"
   ]
  },
  {
   "title": "Phonetics and Phonology",
   "papers": [
    "wang12b_tal",
    "mohasi12_tal",
    "wakefield12_tal",
    "yin12_tal",
    "higashi12_tal",
    "jia12_tal",
    "shao12_tal",
    "xu12_tal",
    "lin12_tal",
    "li12_tal",
    "yang12_tal",
    "li12b_tal",
    "cun12_tal",
    "nkamigbo12_tal",
    "caelenhaumont12_tal"
   ]
  },
  {
   "title": "Phonetic Analysis and Modeling",
   "papers": [
    "promon12_tal",
    "liu12b_tal",
    "kuang12_tal",
    "zuo12_tal",
    "zhu12_tal"
   ]
  },
  {
   "title": "Perception",
   "papers": [
    "zhang12_tal",
    "xu12b_tal",
    "wang12c_tal",
    "liu12c_tal",
    "chen12_tal"
   ]
  },
  {
   "title": "L2 Learning of Mandarin Tones (Special Session)",
   "papers": [
    "chen12b_tal",
    "zhu12b_tal",
    "tseng12_tal",
    "yang12b_tal"
   ]
  },
  {
   "title": "Tone and Intonation",
   "papers": [
    "karlsson12_tal",
    "zhang12b_tal",
    "li12c_tal",
    "gussenhoven12_tal",
    "cao12_tal"
   ]
  },
  {
   "title": "Tone Sandhi",
   "papers": [
    "politzerahles12_tal",
    "zhang12c_tal",
    "zhang12d_tal",
    "song12_tal",
    "zhao12_tal",
    "li12d_tal"
   ]
  },
  {
   "title": "Perception and L2 Learning",
   "papers": [
    "yeh12_tal",
    "xu12c_tal",
    "yang12c_tal",
    "lu12_tal",
    "li12e_tal",
    "jin12_tal",
    "wang12d_tal",
    "huang12_tal",
    "cao12b_tal",
    "zhao12b_tal",
    "ma12_tal",
    "yang12d_tal",
    "hu12_tal"
   ]
  },
  {
   "title": "Other Tone-Related",
   "papers": [
    "schellenberg12_tal",
    "zhou12b_tal",
    "chen12c_tal",
    "wang12e_tal"
   ]
  }
 ]
}