{
 "title": "First International Symposium on Tonal Aspects of Languages (TAL 2004)",
 "location": "Beijing, China",
 "startDate": "28/3/2004",
 "endDate": "31/3/2004",
 "conf": "TAL",
 "year": "2004",
 "name": "tal_2004",
 "series": "TAL",
 "SIG": "SProSIG",
 "title1": "First International Symposium on Tonal Aspects of Languages",
 "title2": "(TAL 2004)",
 "date": "28-31 March 2004",
 "papers": {
  "lehiste04_tal": {
   "authors": [
    [
     "Ilse",
     "Lehiste"
    ]
   ],
   "title": "Bisyllabicity and tone",
   "original": "tal4_111",
   "page_count": 4,
   "order": 1,
   "p1": "111",
   "pn": "114",
   "abstract": [
    "This paper deals with three instances in which the emergence of contrastive tone is tied with bisyllabicity. The emerging tonal patterns presuppose the presence of two syllables. In other words, the domain of the contrastive prosodic pattern is a sequence of two syllables. There are no tonal contrasts on monosyllabic words, and in a polysyllabic word, two syllables determine the prosodic identity of the word. The three languages considered here are Serbocroatian, Swedish, and Estonian. It will be shown in each case how the prosodic structure is connected with bisyllabicity.\n",
    ""
   ]
  },
  "abramson04_tal": {
   "authors": [
    [
     "Arthur S.",
     "Abramson"
    ]
   ],
   "title": "Toward prosodic contrast: Suai and Pattani Malay",
   "original": "tal4_001",
   "page_count": 4,
   "order": 2,
   "p1": "1",
   "pn": "4",
   "abstract": [
    "We may have an early stage of tonogenesis in two minority languages of Thailand. In one of them, Suai, its old voiceregister distinction is apparently giving way to one of pitch accent. In the other, Pattani Malay, an existing distinction of word-initial consonant length is giving way to one of relative salience on the first syllable of disyllabic words. The role of pitch in both may foretell the ultimate emergence of tones.\n",
    ""
   ]
  },
  "fujisaki04_tal": {
   "authors": [
    [
     "Hiroya",
     "Fujisaki"
    ],
    [
     "Sumio",
     "Ohno"
    ],
    [
     "Wentao",
     "Gu"
    ]
   ],
   "title": "Physiological and physical mechanisms for fundamental frequency control in some tone languages and a command-response model for generation of their F0 contours",
   "original": "tal4_061",
   "page_count": 4,
   "order": 3,
   "p1": "61",
   "pn": "64",
   "abstract": [
    "This paper first presents the physiological and physical properties of the vocal fold and the laryngeal structure involving intrinsic laryngeal muscles that are mainly responsible for the generation of F0 contours with global components and positive local components. It then takes up the mechanism involving extrinsic laryngeal muscles for generating negative local components. Based on these evidences, a command-response model is derived for generating F0 contours of tone languages with an extremely high accuracy. Experimental results support the validity of the model for Mandarin, Thai, and Cantonese.\n",
    ""
   ]
  },
  "bruce04_tal": {
   "authors": [
    [
     "Gösta",
     "Bruce"
    ],
    [
     "Johan",
     "Frid"
    ],
    [
     "Ida",
     "Thelander"
    ]
   ],
   "title": "Swedish accent navigation",
   "original": "tal4_009",
   "page_count": 4,
   "order": 4,
   "p1": "9",
   "pn": "12",
   "abstract": [
    "In this paper a method for displaying dialectal, particularly intonational differences is presented. This map-based multimedia tool for simultaneous listening to speech samples and viewing acoustic records is called Swedia Prosody. It is based on Swedish speech data collected within the SweDia 2000 project from more than 100 different places in Sweden and Finland. Swedia Prosody uses both accent I and accent II words from the elicited material and short samples having a kind of prosodic equivalence from the spontaneous material. The paper describes our considerations in developing an accent navigator of this kind.\n",
    ""
   ]
  },
  "hirst04_tal": {
   "authors": [
    [
     "Daniel",
     "Hirst"
    ]
   ],
   "title": "Lexical and non-lexical tone and prosodic typology",
   "original": "tal4_081",
   "page_count": 8,
   "order": 5,
   "p1": "81",
   "pn": "88",
   "abstract": [
    "Prosodic typology has generally concentrated on those aspects of prosodic representation which are assumed to be represented in the lexicon. It is argued here that non-lexical representation at various levels, underlying phonological, surface phonological and phonetic, can also constitute a basis for prosodic typology. An example is given of a low-level comparison of English and French pitch patterns. A prosodic model integrating these different levels is presented which, it argued can provide a useful tool for the investigation of prosodic typology and for a more robust basis for establishing the more abstract levels including those of lexical representations.\n",
    ""
   ]
  },
  "gibbon04_tal": {
   "authors": [
    [
     "Dafydd",
     "Gibbon"
    ]
   ],
   "title": "Tone and timing: two problems and two methods for prosodic typology",
   "original": "tal4_065",
   "page_count": 8,
   "order": 6,
   "p1": "65",
   "pn": "72",
   "abstract": [
    "After an overview of some recent work on prosodic typology, both tonal and rhythmic, it is argued that both symbolic and numeric computational methods are required in order to advance the field by using large annotated resources and developing consistent, precise and evaluable models. Symbolic modelling is illustrated with reference to the lexical and grammatical tone systems of West African languages, and extensions to these are introduced in order to handle grammatical constraints on tone, affecting tonal templates and inflectional categories. A major motivating factor for the present discussion was tone generation for TTS system for Ibibio, a Lower Cross (Benue Congo) tone language spoken in South Eastern Nigeria. Numerical modelling is illustrated with reference to timing patterns, in particular rhythm, and a numerical method is introduced for inducing temporal hierarchies from annotated data, and for comparing these with syntactic hierarchies.\n",
    ""
   ]
  },
  "wang04_tal": {
   "authors": [
    [
     "Jialing",
     "Wang"
    ]
   ],
   "title": "The neutral tone in trisyllabic sequences in Chinese dialects",
   "original": "tal4_201",
   "page_count": 2,
   "order": 7,
   "p1": "201",
   "pn": "202",
   "abstract": [
    "Early studies of the pitch of the neutral tone are confined to the study of its appearance in the second syllable of disyllabic sequences in Beijing dialect. Although the study was extended to more dialects later, it was still confined to disyllabic sequences. This paper argues that in trisyllabic sequences with the neutral tone in the middle, the syllable following the neutral tone plays different roles in different dialects. So in studying the pitch of the neutral tone, it is imperative also to take into consideration trisyllabic sequences in order to have an overall understanding of the neutral tone and to compare the properties of the neutral tone in different dialects.\n",
    ""
   ]
  },
  "zu04_tal": {
   "authors": [
    [
     "Yiqing",
     "Zu"
    ],
    [
     "Runqiang",
     "Yan"
    ]
   ],
   "title": "Tonal alignment in different tone systems",
   "original": "tal4_243",
   "page_count": 4,
   "order": 8,
   "p1": "243",
   "pn": "246",
   "abstract": [
    "This study analyzed pitch distribution on speech corpora of Mandarin Chinese, Cantonese and American English. Each Language or dialect has one male speaker and one female speaker. The results show that the tone language has boarder pitch range in high frequency range for tones realization. As a result, tonal alignment is crucial for tone languages. It seems unnecessary to use boarder pitch range for lexical stress in English.\n",
    "In Mandarin Chinese, when two tones in a di-syllable word is conflicting and the initial of second syllable is voice, it will introduce a extra pitch peak to the onset of second syllable. When those syllables are used in another context when concatenation is conducted it will sounds un-pleasant perceptively. To investigate tonal alignment, this paper studies the di-syllable prosodic words in a Mandarin TTS speech corpus and concludes that the alignment failure phenomena, which are important to speech technology, have more chances occurring in tone languages.\n",
    ""
   ]
  },
  "house04_tal": {
   "authors": [
    [
     "David",
     "House"
    ]
   ],
   "title": "Pitch and alignment in the perception of tone and intonation: pragmatic signals and biological codes",
   "original": "tal4_093",
   "page_count": 4,
   "order": 9,
   "p1": "93",
   "pn": "96",
   "abstract": [
    "In this paper a case is made for examining tone perception and particularly phenomena of tonal alignment in terms of perceptual limitations to pitch processing. The perception of pitch and tonal movement is discussed in relationship to research on alignment. Results from perception experiments using Swedish listeners and non-scripted speech production data from Swedish speakers are used to exemplify the discussion. The results of these experiments are further discussed in terms of biological codes. Finally thresholds of tonal movement perception are proposed based on principles of syllable alignment consistent with perceptual constraints including cognitive processing.\n",
    ""
   ]
  },
  "niebuhr04_tal": {
   "authors": [
    [
     "Oliver",
     "Niebuhr"
    ],
    [
     "Klaus J.",
     "Kohler"
    ]
   ],
   "title": "Perception and cognitive processing of tonal alignment in German",
   "original": "tal4_155",
   "page_count": 4,
   "order": 10,
   "p1": "155",
   "pn": "158",
   "abstract": [
    "Results are presented of two parallel sets of discrimination and identification experiments for peak and valley shift in German.\n",
    ""
   ]
  },
  "lin04_tal": {
   "authors": [
    [
     "Maocan",
     "Lin"
    ]
   ],
   "title": "On production and perception of boundary tone in Chinese intonation",
   "original": "tal4_125",
   "page_count": 5,
   "order": 11,
   "p1": "125",
   "pn": "130",
   "abstract": [
    "Two variables: pitch accent and boundary tone in Chinese intonation have been found by acoustical analysis and listening test of echo questions in read speech and yes-no questions in spontaneous speech.\n",
    "Identification test is adopted to verify the acoustic manifestations of boundary tone, and to find out that the register of the ending-point (or the slope) of the F0 curve in boundary tone plays a more important role than the register of its starting-point in differentiating between question and statement and the identification function about question and statement is not categorical, but continuous.\n",
    "It is advocated that features of boundary tone is \"high\" and \"low\". Pitch (F0) patterns of boundary tone in Standard Chinese is given. Whether tone-1, tone-2, tone-3, or tone-4, pitch pattern in the boundary tone with question keeps the citation form.\n",
    "It is single-directionally and hierarchically that intonation acts upon on tones. In the pitch space of five-point values, intonation is represented mainly by register and range of the F0 curve, but tone is represented by its F0 contour.\n",
    ""
   ]
  },
  "li04_tal": {
   "authors": [
    [
     "Po-Yee",
     "Li"
    ]
   ],
   "title": "Perceptual analysis of the six contrastive tones in Cantonese",
   "original": "tal4_119",
   "page_count": 4,
   "order": 12,
   "p1": "119",
   "pn": "122",
   "abstract": [
    "The experiment here is a perceptual study of the six contrastive tones in Cantonese. The monosyllable [si] was synthesized, and a large number of closely spaced Fo contours were applied to it. The identification tests were separated into three parts. In Part I of the tests, subjects were asked to identify each synthetic stimulus as a Cantonese word with a high-high, mid-high, or mid-low tone. In Part II of the tests, subjects were asked to identify each synthetic stimulus as a Cantonese word with a mid-low, low-rising or high-rising tone. In Part III of the tests, subjects were asked to identify each synthetic stimulus as a Cantonese word with a mid-low or low-low tone. The influence of Fo on the perception of Cantonese words was investigated and the categorical boundaries for the six contrastive tones were established. The identification results may prove Chao's and Vance's descriptions of the level tones are more accurate than Hashimoto's description.\n",
    ""
   ]
  },
  "kong04_tal": {
   "authors": [
    [
     "Jiangping",
     "Kong"
    ]
   ],
   "title": "Phonation models of tone and diatone in Mandarin",
   "original": "tal4_101",
   "page_count": 6,
   "order": 13,
   "p1": "101",
   "pn": "106",
   "abstract": [
    "This paper is concerned with the study on the phonation models of tone and diatone in Mandarin. The method used in this study has 3 parts: 1) extracting glottal signal by inverse filtering; 2) extracting phonation parameters from glottal signal in time domain; 3) modeling the phonation natures of tones and diatones by polynomial curve fitting. There are 3 conclusions, which are 1) there are 3 types of phonation pulses, which are single peak pulse, double-peak pulse and tri-peak pulse; 2) F0 is in the inverse ratio of PR1 and PP1, which reflects the basic phonation natures of tones and diatones in Mandarin; 3) PR2 and PR3 have correlation with PP2 and PP3, which reflects the personal changes of phonation natures in different conditions.\n",
    ""
   ]
  },
  "hoole04_tal": {
   "authors": [
    [
     "Philip",
     "Hoole"
    ],
    [
     "Fang",
     "Hu"
    ]
   ],
   "title": "Tone-vowel interaction in standard Chinese",
   "original": "tal4_089",
   "page_count": 4,
   "order": 14,
   "p1": "89",
   "pn": "92",
   "abstract": [
    "The effect of tone production on the position of the articulators (tongue, jaw, lower lip) was examined by means of threedimensional electromagnetic articulography. Most differences found involved Tone 3 relative to the other tones. While /u, a/ showed retraction and lowering this pattern did not extend to all vowels. Head position during vowel production was also analyzed. Even more consistently than for the articulatory data, Tone 3 tended to differ from the other tones, showing a lower and more posterior head position. Finally, tongue and jaw influences on intrinsic pitch in Mandarin are briefly considered.\n",
    ""
   ]
  },
  "erickson04_tal": {
   "authors": [
    [
     "Donna",
     "Erickson"
    ],
    [
     "Ray",
     "Iwata"
    ],
    [
     "Mitsuaki",
     "Endo"
    ],
    [
     "Akinori",
     "Fujino"
    ]
   ],
   "title": "Effect of tone height on jaw and tongue articulation in Mandarin Chinese",
   "original": "tal4_053",
   "page_count": 4,
   "order": 15,
   "p1": "53",
   "pn": "56",
   "abstract": [
    "This study investigates some of the articulatory changes that occur due to the tonal conditions of the syllable; specifically, jaw, tongue and formant frequency changes. Articulatory and acoustic data were collected using the electromagnetic articulatograph (EMA) at NTT Research Laboratories (Atsugi, Japan) from two native female speakers of Mandarin Chinese producing Tones 1 and 3 on monosyllabic words containing the vowel /a/ (ba, ma, pa). Measurements of both acoustics (F0, F1) and pellet positions (tongue tip, tongue dorsum, and jaw) were made at the center of the syllable, i.e., at the time when the jaw was lowest.\n",
    "T-tests show that supralaryngeal articulation is significantly different for the two tones. For the low Tone 3 compared to high Tone 1, for both speakers, the jaw and tongue are significantly more retracted and F1 is significantly higher. This study provides useful data for exploring the interactive control between laryngeal mechanisms and articulation of vocal tract shape, which a speaker of a tone language must access to produce tones. It also provides interesting data applicable to current issues in phonology and phonetics about the interaction between prosody and articulation.\n",
    ""
   ]
  },
  "mixdorff04_tal": {
   "authors": [
    [
     "Hansjörg",
     "Mixdorff"
    ]
   ],
   "title": "Quantitative tone and intonation modeling across languages",
   "original": "tal4_137",
   "page_count": 6,
   "order": 16,
   "p1": "137",
   "pn": "142",
   "abstract": [
    "Although it has been shown for many languages that the Fujisaki model is in principle capable of decomposing F0 contours in these languages, problems remain as to the automatic extraction as well as the interpretation of parameters extracted with respect to their phonological relevance. The claim is made in the current article that the Fujisaki model parametrization used must be rooted in the linguistic system of the particular language, and that this consideration should always be given priority over simple fitting accuracy. To this effect, this article presents settings and results from a number of more recent studies by the author and his co-workers in various languages, such as German, Finnish, Thai and Vietnamese.\n",
    ""
   ]
  },
  "luksaneeyanawin04_tal": {
   "authors": [
    [
     "Sudaporn",
     "Luksaneeyanawin"
    ]
   ],
   "title": "Prosodic analysis revisited: the interplay of prosodies resulting in pitch variation in different languages",
   "original": "tal4_131",
   "page_count": 0,
   "order": 17,
   "p1": "131",
   "pn": "",
   "abstract": [
    "The ultimate aim of tone and intonation modeling across languages is to create a model which can decompose and recompose F0 contours in languages of the world. The concepts of poly systemic approach and contextualization of Prosodic Analysis Theory proposed by Firth (1948) and his disciples (1948-1961) give thoughts to the modeling of tones, word accents, sentence prominence, and sentence tunes or intonation. The Fujisaki model covers both the local F0 contour and the global F0 contour in the frequency domain as well as the temporal domain quite nicely. The model helps researchers to cope with variation in language specific characteristics. Especially in some languages, prosodies of the phonematic units play an important role in the variation of F0 resulting in minute F0 perturbation. This minute perturbation is very sensitive to the auditory pitch perception. This paper reviews prosodic characteristics of languages with specific prosodic features that are difficult to decompose and recompose and thus relates to Mixdorff s paper on Quantitative Tone and Intonation Modeling across Languages.\n",
    ""
   ]
  },
  "tao04_tal": {
   "authors": [
    [
     "Jianhua",
     "Tao"
    ]
   ],
   "title": "Acoustic and linguistic information based Chinese prosodic boundary labelling",
   "original": "tal4_181",
   "page_count": 4,
   "order": 18,
   "p1": "181",
   "pn": "184",
   "abstract": [
    "The paper analyzes both acoustic and linguistic features with different Chinese prosodic boundaries. Then a rule-learning approach was used to do the prosodic boundary labelling. In the paper the prosodic boundaries are classified into four levels, full intonational boundary with strong intonational marking with/without lengthening or change in speech tempo, prosodic phrase boundary with rather weak intonational marking, prosodic word boundary and phone foot boundary. Candidate acoustic and linguistic features related to prosodic boundary were extracted from the corpus to establish an example database. Based on this, a series of comparative experiments is conducted to collect the most effective features from the candidates. Results show that the selected candidates characterize the boundary features efficiently. Final experiments show that rule-learning approach introduced in the paper can achieve better prediction accuracy than the nonrule and RNN based methods and yet retain the advantage of the simplicity and understandability\n",
    ""
   ]
  },
  "fant04_tal": {
   "authors": [
    [
     "Gunnar",
     "Fant"
    ],
    [
     "Anita",
     "Kruckenberg"
    ]
   ],
   "title": "Intonation analysis and synthesis with reference to Swedish",
   "original": "tal4_057",
   "page_count": 4,
   "order": 19,
   "p1": "57",
   "pn": "60",
   "abstract": [
    "The present report reviews findings about FO patterns and in specific the realisation of the Swedish accent 1 and accent 2 tone patterns. We have developed a novel system for normalizing FO contours which allows the handling of male and female data in a common frame. It also facilitates the sorting out of individual patterns from a norm. For this purpose we have defined a semitone scale with a fixed reference. As in the Fujisaki model, we have employed a superposition scheme of adding local FO modulations to prosodic phrase contours, but with different shaping algorithms. The influence of the syntactic frame, and of word prominence and its relation to the single peak of accent 1 and the dual peak of accent 2 has been quantified. Some language universal traits, such as time constants and typical shapes of local FO patterns, are discussed. The perceptual smoothing of local FO contours has been illustrated in a simple experiment which relates to the concept of an auditory time constant. Our Swedish prosody modules have ensured a high quality in synthesis and a robustness in performance with respect to uncertainties in text parsing. Modifications for English and French prosody have provided promising results.\n",
    ""
   ]
  },
  "xu04_tal": {
   "authors": [
    [
     "Yi",
     "Xu"
    ]
   ],
   "title": "Transmitting tone and intonation simultaneously - the parallel encoding and target approximation (PENTA) model",
   "original": "tal4_215",
   "page_count": 6,
   "order": 20,
   "p1": "215",
   "pn": "220",
   "abstract": [
    "Lexical tones use F0 to distinguish between words that are otherwise phonemically identical. Intonation uses F0 to convey discourse, attitudinal and affective information that is often not directly encoded in the words or syntax of the spoken utterances. Because the same acoustic parameter is being used, it is a question how well lexical tones and intonation can coexist in a language. The Parallel Encoding and Target Approximation (PENTA) model proposed here addresses the concurrent transmission of these two aspects of speech in a principled way. As will be demonstrated, the PENTA model can help us better understand both the capacity and limitation of F0 contours in simultaneously conveying meanings carried by tone and intonation.\n",
    ""
   ]
  },
  "shih04_tal": {
   "authors": [
    [
     "Chilin",
     "Shih"
    ]
   ],
   "title": "Tonal effects on intonation",
   "original": "tal4_163",
   "page_count": 5,
   "order": 21,
   "p1": "163",
   "pn": "168",
   "abstract": [
    "This paper investigates the intricate patterns of tone and intonation interaction by sampling and comparing data across a few interactive terms. We identify situations with different degrees of tonal effects on intonation, and suggest that the prominence level, or prosodic strength, associated with narrow focus is a key factor controlling the magnitude of the effect.\n",
    ""
   ]
  },
  "myers04_tal": {
   "authors": [
    [
     "Scott",
     "Myers"
    ]
   ],
   "title": "The effects of boundary tones on the f0 scaling of lexical tones",
   "original": "tal4_147",
   "page_count": 4,
   "order": 22,
   "p1": "147",
   "pn": "150",
   "abstract": [
    "Many languages display a pattern in which the f0 values of tones are higher in a phrase ending in a high boundary tone than in one ending with a low boundary tone. In some cases it is only the tones closest to the boundary tone that are affected, while in others it affects all tones in the phrase. An account is suggested in this paper, according to which these effects are due to perceptually-based sound changes. Coarticulatory effects of the boundary tone on the f0 value of an immediately preceding tone can in shorter phrases be confused with a more global effect on phrasal scaling parameters. Such confusions can lead to a sound change linking pitch range and downtrends to final boundary tone. Such an account expresses the attested patterns without special representational machinery.\n",
    ""
   ]
  },
  "connell04_tal": {
   "authors": [
    [
     "Bruce",
     "Connell"
    ]
   ],
   "title": "Tone, utterance length and FO scaling",
   "original": "tal4_041",
   "page_count": 3,
   "order": 23,
   "p1": "41",
   "pn": "44",
   "abstract": [
    "One important strand of research into the scaling of fundamental frequency has been concerned with the hypothesis that utterance length is a determining factor of initial pitch height, with longer utterances involving a higher initial FO than that found in shorter utterances. Most work in this vein has been done on 'intonation' languages, with very little investigation having been carried out on tone languages, and the effect utterance length might have on the scaling of tones. This study investigates the relationship between utterance length and tone in Mambila. Previous work revealed that, for sentences comprised of all High tones, or of all Low tones, utterance length in Mambila had no effect on the scaling of either initial or final tones. Here utterances of alternating Hs and Ls are investigated. Results confirm those found earlier, that utterance does not determine the scaling of FO in Mambila. These results are discussed from the point of view of utterance planning and tonal specification.\n",
    ""
   ]
  },
  "hirose04_tal": {
   "authors": [
    [
     "Keikichi",
     "Hirose"
    ]
   ],
   "title": "Accent type recognition of Japanese using perceived mora pitch values and its use for pronunciation training system",
   "original": "tal4_077",
   "page_count": 4,
   "order": 24,
   "p1": "77",
   "pn": "80",
   "abstract": [
    "Through perceptual experiments, the fundamental frequency (F0) in mora unit was defined which well corresponded to the perceived pitch value. Several candidates, given as the combination of periods of observation and methods of F0 calculation, were tested. Based on the definition, a method was developed for the accurate recognition of Japanese lexical accents, and was applied to a system for teaching non- Japanese learners pronunciation of Japanese accents. In the method, each accent type was represented as a multidimensional Gaussian model, where F0 change between two adjacent morae was used as the feature parameter. The system first recognizes accent types of words in a learner's utterance, and then notices the learner if his/her pronunciation is good or not with audio and visual corrective feedbacks. Using TD-PSOLA technique, the learner's utterance is corrected in its prosodic features by referring to teacher's features, and offered to the learner. Since the learner can hear how his/her utterance should sound after correction, he/she can obtain a better idea on the correction as compared to the case where only teacher’s utterance is offered as the audio feedback. The visual feedback is also offered to enhance the modifications that occurred. Accent type pronunciation training experiments were conducted for 8 non-Japanese speakers, and the results showed that the training process could be facilitated by the feedbacks especially when they were asked to pronounce sentences.\n",
    ""
   ]
  },
  "tseng04_tal": {
   "authors": [
    [
     "Chiu-yu",
     "Tseng"
    ],
    [
     "Shao-Huang",
     "Pin"
    ]
   ],
   "title": "Mandarin Chinese prosodic phrase grouping and modeling - method and implications",
   "original": "tal4_193",
   "page_count": 4,
   "order": 25,
   "p1": "193",
   "pn": "196",
   "abstract": [
    "One major feature of the prosody of Mandarin Chinese speech flow is prosodic phrase grouping [1, 2, and 3]. Phrasal and sentential intonations are governed by a prosody framework that structurally group phrases into a larger/longer and identifiable unit. An overall prosody pattern of such phrase grouping with prosodic specifications is superimposed on phrase group. In turn, individual phrasal intonation under prosody grouping has to adjust in accordance with structural specification from the prosody framework. The output is then seen as derived outcome. The aim of the present paper is to experiment how to simulate prosodic phrase grouping using the Fujisaki intonation model that originally specifies only phrasal or sentential intonations, and how such an intonation model can be further enhanced by incorporating prosodic specifications such as boundaries and breaks, prosody levels/layers and phrase positions under the notion of phrase grouping. The experiments began with aligning the phrase command of the intonation model to boundaries of breaks in the speech flow, then examining prosodic characteristics such as relative position of the target phrase within a prosodic phrase group. Finally, using a linear regression model to predict prosody output from prosodic words upward, predictions of an overall pattern for prosodic phrase grouping was derived. The pattern matched with a prosody base form aimed at prosodic phrase grouping; it also accounted for how and why phrasal intonations were modified in relation to prosody organization. Hence, phrasal intonation is seen as components of prosodic phrase grouping.\n",
    ""
   ]
  },
  "chen04_tal": {
   "authors": [
    [
     "Gao Peng",
     "Chen"
    ],
    [
     "Yu",
     "Hu"
    ],
    [
     "Ren Hua",
     "Wang"
    ],
    [
     "Hansjörg",
     "Mixdorff"
    ]
   ],
   "title": "Quantitative analysis and synthesis of focus in Mandarin",
   "original": "tal4_025",
   "page_count": 4,
   "order": 26,
   "p1": "25",
   "pn": "28",
   "abstract": [
    "This paper analyzes the influence of narrow and broad focus on the F0 contours in Mandarin utterances. We employ the Fujisaki model as a means for parameterizing F0 contours. We can regard the F0 contour in Mandarin as a superposition of slowly and fast changing components. Whereas the slow phrase component is associated with declination, the fast tone component is the manifestation of the syllabic tone shape. If there is narrow focus on a word, the amplitude of tone commands (of positive and/or negative polarity) aligned with it increases. The amplitudes of commands on the preceding word increase likewise whereas the amplitudes of commands on all following words are reduced. When focus broadens, that is, when it is placed on more than one word of an utterance, command amplitudes are reduced as the length of the focus domain increases. As a consequence, the influence of focus on words at the tail of an utterance is relatively weak. Focus also influences duration and intensity.\n",
    ""
   ]
  },
  "campbell04_tal": {
   "authors": [
    [
     "Nick",
     "Campbell"
    ]
   ],
   "title": "Listening between the lines: a study of paralinguistic information carried by tone-of-voice",
   "original": "tal4_013",
   "page_count": 4,
   "order": 27,
   "p1": "13",
   "pn": "16",
   "abstract": [
    "This paper describes a study of speaking-style characteristics, or \"tone-of-voice\", in conversational speech, and shows that non-verbal information is transmitted efficiently regardless of cultural and linguistic contexts through differences in prosodic and voice-quality features. We asked Korean and American listeners with no previous kowledge of Japanese to judge the meaning of various utterances of the interjection \"eh\" in Japanese conversations, and compared their perceptions with the acoustic characteristics of the speech. We found voice-quality information to be an important discriminator.\n",
    ""
   ]
  },
  "tillmann04_tal": {
   "authors": [
    [
     "Hans G.",
     "Tillmann"
    ],
    [
     "Hartmut R.",
     "Pfitzinger"
    ]
   ],
   "title": "Applying the Munich parametric high definition (PHD) speech synthesis system to the problem of teaching Chinese tones to L1 speakers of German",
   "original": "tal4_185",
   "page_count": 4,
   "order": 28,
   "p1": "185",
   "pn": "188",
   "abstract": [
    "The aim of this paper is threefold: First and foremost we would like to propose a new strategy of phonetic speech research that can be distinguished from more traditional research programs in more than one important aspect. As directly opposed to the classical analysis-by-synthesis paradigm our second aim is to install the new paradigm of synthesis-by-analysis. And our third aim is to convince our audience that only strictly application-oriented phonetic speech research will lead to a deeper understanding of how speech acts really function phonetically. The paper will be given in two parts. After the presentation of the philosophy behind our new research activity mentioned in the title, the second author will present a demonstration of the PHD-system in order to illustrate its applicability for solving the problems described by the first author.\n",
    ""
   ]
  },
  "svantesson04_tal": {
   "authors": [
    [
     "Jan-Olof",
     "Svantesson"
    ],
    [
     "Anastasia Mukhanova",
     "Karlsson"
    ]
   ],
   "title": "Minor syllable tones in Kammu",
   "original": "tal4_177",
   "page_count": 4,
   "order": 29,
   "p1": "177",
   "pn": "180",
   "abstract": [
    "The existence of sesquisyllabic words consisting of one 'minor' and one 'major' syllable is often mentioned as a characteristic property of the Mon-Khmer language group, but the existence of contrastive tones on minor syllables has been described only for (Northern) Kammu. In this article we investigate the acoustic properties of the the minor syllable tones, and also give a brief overview of their morphology and their historical development.\n",
    ""
   ]
  },
  "cao04_tal": {
   "authors": [
    [
     "Jianfen",
     "Cao"
    ]
   ],
   "title": "Tonal aspects in spoken Chinese: global and local perspectives",
   "original": "tal4_017",
   "page_count": 3,
   "order": 30,
   "p1": "17",
   "pn": "20",
   "abstract": [
    "The present study try to clarify the deep essence and structure of Chinese intonation by objectively approach to the production process of tone and intonation and their interaction based on the acoustic-phonetic observation. Our main attention is paid to examine (1)what is the basic intonation pattern for the whole course of utterance and how it is formed? (2) how the lexical tone patterns integrate with the global intonation pattern? The preliminary results indicate that intonation pattern is mainly related to pitch register movement of global utterance, it is undulated depending on physiological mechanism and the needs of speech mood and semantic expression. While tone pattern is mainly referred both to the contour and the register of pitch change of local syllable or word, and it is lexically given. In real speech, each tone must be modified by global intonation through adjusting its relative register on one hand, and keeps its basic tone shape on the other hand. At the same time, the global intonation must be manifested through the pitch movement of each local tone. The key point is that the relationship between tone and intonation is an \"algebraic sum\" of pitch register, in stead of that of pitch contour.\n",
    ""
   ]
  },
  "chen04b_tal": {
   "authors": [
    [
     "Fangxin",
     "Chen"
    ],
    [
     "Jianfen",
     "Cao"
    ]
   ],
   "title": "Mandarin Chinese tonal issues from the perspective of speech synthesis",
   "original": "tal4_021",
   "page_count": 4,
   "order": 31,
   "p1": "21",
   "pn": "24",
   "abstract": [
    "This paper presents two tonal issues in spoken Mandarin Chinese from the perspective of speech synthesis. One is a unique Chinese phonetic category Qingsheng. Based on speech synthesis and natural speech analysis, two acoustic criteria were suggested for distinguishing Qingsheng from the unstressed syllables which occur frequently in natural speech. The other is a tone sandhi phenomenon which differed from the known tonal behaviors and affected the application of normal tone sandhi rules in our text-to-speech system. Tentative discussion was presented to solicit further theoretical enquiry.\n",
    ""
   ]
  },
  "li04b_tal": {
   "authors": [
    [
     "Aijun",
     "Li"
    ],
    [
     "Fangxin",
     "Chen"
    ],
    [
     "Haibo",
     "Wang"
    ],
    [
     "Tianqing",
     "Wang"
    ]
   ],
   "title": "Perception on synthesized friendly standard Chinese speech",
   "original": "tal4_115",
   "page_count": 4,
   "order": 32,
   "p1": "115",
   "pn": "118",
   "abstract": [
    "This paper presents a perceptual experiment on the friendliness of the synthesized Standard Chinese. Based on the acoustic investigation of friendly speech, tonal pitch, phone duration and spectral energy distribution were adjusted in synthesis and the synthesized stimuli were subjected to perception test. It was found that: (1) Friendliness of synthesized speech could be achieved via adjusting the perceptually distinctive acoustic parameters; (2) Tonal pitch is the most prominent cue for better expression of friendliness. However, the optimal adjustment for friendliness is the combination of pitch, phone duration and spectral energy.\n",
    ""
   ]
  },
  "chen04c_tal": {
   "authors": [
    [
     "Hu",
     "Chen"
    ]
   ],
   "title": "Tone and prominence in standard Chinese",
   "original": "tal4_029",
   "page_count": 3,
   "order": 33,
   "p1": "29",
   "pn": "32",
   "abstract": [
    "This paper studies the relationship between tone and prominence in Standard Chinese (SC). Unlike in English and some other intonation languages where intonational prominence is phonologically free to be associated with L tones as well as H tones, we have found that the four SC lexical tones behave quite regularly yet distinctively under prominence. Specifically, as emphasis on the tones escalates from none to strong, Tone 1 constantly raises its pitch level; Tone 2 constantly raises its H target, with its L target moderately raised only under strong prominence. Besides, as prominence increases, Tone 2 shows an increasingly upstepping effect on the following tone; Tone 3 generally keeps its L target unchanged, with its prominence level more clearly indicated by the pitch level (i.e., degree of upstepping) of the following tone; Tone 4 constantly raises its H target, with its L target moderately lowered only under strong prominence. On the whole, the realization of prominence in SC intonation is more dependent on the raising either of the H target of the lexical tones themselves or of the following (or maybe also the preceding) tone if they do not have one. The L targets do have an effect in Tones 2 and 4 as prominence becomes very strong, but still this effect is only auxiliary. As for the L target of Tone 3, its realization of prominence has a heavy reliance on the H target of the following (or preceding) tone.\n",
    ""
   ]
  },
  "davison04_tal": {
   "authors": [
    [
     "Deborah S.",
     "Davison"
    ]
   ],
   "title": "Tianjinese lexical tone, tone sandhi, and prosody: amplitude-F0 dependency under prominence in Mandarin",
   "original": "tal4_045",
   "page_count": 4,
   "order": 34,
   "p1": "45",
   "pn": "48",
   "abstract": [
    "In Tianjin Mandarin, F0 and amplitude track together on low (L) tone Tl, low rising (LH) tone T3, and high falling (HL) tone T4, as is claimed to be true generally of Standard Mandarin (see Yip 2002). In contrast, lexical high tone T2 F0 tracks least systematically with amplitude, whereas tone- sandhi derived high tones on T3 and T2 co-vary with amplitude most consistently. The tone sandhi induced insertion of T2 high F0/db pitch accent between adjacent low tones co-occurs with phrase level prominence on the disyllabic word or phrase in which it appears. These facts are consistent with other evidence in Tianjinese of H pitch accent surfacing before L tones: F0 on neutral tone 0 before L Tone 1 and LH Tone 3 syllables is high, on hypothesis in the same phrasal environments, and F0/amplitude excursions on T3 before L Tl often are as well. These data support the author's hypothesis (Davison in press) that a high F0/db pitch accent marks intonational phrase, contrary to the prevailing assumption that lexical tone languages such as Chinese do not permit phrasal pitch accents internal to intonational phrases.\n",
    ""
   ]
  },
  "yan04_tal": {
   "authors": [
    [
     "Pengju",
     "Yan"
    ],
    [
     "Fang",
     "Zheng"
    ]
   ],
   "title": "Context directed speech recognition in dialogue systems",
   "original": "tal4_225",
   "page_count": 4,
   "order": 35,
   "p1": "225",
   "pn": "228",
   "abstract": [
    "For the time being, research and development on spoken dialogue systems (SDSs) become more and more important with the constant increasing demands. However, defects of the recognition strategies adopted for the sake of only laboratory demos are revealed evidently under the real-world circumstances, with the utterances of the casual style instead of the declamatory one. Both the shortage of domain-specific corpus and the existence of other empirical/heuristic knowledge appeal new methods to improve the recognition performance. Here we present a recognition framework where the dialogue contexts (DCs) are incorporated in as a restrictive source. Firstly, the idea of a focus expected (FE) under certain dialogue states is introduced. Secondly, the adaptation of lexicon and grammar rules is proposed. Finally, the recognition automaton generation under a specific FE is put forward. Experiments are carried out in the dialogue system EasyFlight, and the results show the effectiveness of the strategies.\n",
    ""
   ]
  },
  "hiki04_tal": {
   "authors": [
    [
     "Shizuo",
     "Hiki"
    ],
    [
     "Kazuko",
     "Sunaoka"
    ],
    [
     "Liming",
     "Yang"
    ],
    [
     "Yasuyo",
     "Tokuhiro"
    ]
   ],
   "title": "Occurrence frequency and transition probability of the Chinese four tones",
   "original": "tal4_073",
   "page_count": 4,
   "order": 36,
   "p1": "73",
   "pn": "76",
   "abstract": [
    "Occurrence frequency and transition probability of the Chinese four tones were analyzed statistically. The database used for the analysis was the Grammatical Knowledge-base of Contemporary Chinese (S-W. Yu, editor, Tsinghua University Press, China, 1998). One, two, three and four syllable words, about 55,000 words in total, were categorized into more than twenty kinds of parts of speech in this database.\n",
    "The occurrence frequency of the four tones deviated from 25%, depending on number of syllables in a word or position of the syllables in the word. In nouns, Tone-2 was always around 25% but Tone-3 was 5% to 10% less. In the 1st syllables of the words with any number of syllables, Tone- 1 were more than 25%, but it became less in the back position of syllables. Tone-4 was 5% more even in the 1st syllables and became as large as 40% in the last syllables.\n",
    "In the total 38,968 syllables of the nouns, occurrence frequencies of Tone-1, Tone-2, Tone-3 and Tone-4 were 24%, 23%, 18% and 33%, respectively. The deviations were much larger in the cases of some of the other parts of speech such as verb, adjective, adverb and onomatopoeia.\n",
    "The entropy of the four tones, which is 2 bits when the ratios are equal, decreased by less than 0.05 bit when averaged over all positions of syllables. This indicates that the four tones are used fairly effectively in Chinese language. In the nouns, transition probability between Tone-2 and Tone-3 were less than average. Transitions beginning at Tone-1 and ending at Tone-4, or beginning at Tone-4 and ending at Tone-4 in the two, three and four syllable words were much more. Some other kind of parts of speech showed characteristic transition such as repetition of the same tone in successive syllables.\n",
    ""
   ]
  },
  "hu04_tal": {
   "authors": [
    [
     "Fang",
     "Hu"
    ]
   ],
   "title": "Tonal effect on vowel articulation in a tone language",
   "original": "tal4_097",
   "page_count": 4,
   "order": 37,
   "p1": "97",
   "pn": "100",
   "abstract": [
    "This study investigates the tonal effect on vowel articulation in the Ningbo Chinese, a tone language. Tongue, jaw, and lip articulators were monitored during the production of different types of high and low tones using EMA. Preliminary results suggest that there are articulatory differences between high and low short tones and high and low rising tones, namely a retraction of tongue is detected in the production of low short and rising tones. However, for the high and low tonal element in the falling tone within the same syllable, there is no articulatory difference observed.\n",
    ""
   ]
  },
  "lee04_tal": {
   "authors": [
    [
     "Wai-Sum",
     "Lee"
    ]
   ],
   "title": "The effect of intonation on the citation tones in Cantonese",
   "original": "tal4_107",
   "page_count": 4,
   "order": 38,
   "p1": "107",
   "pn": "110",
   "abstract": [
    "The paper investigates the F0 contours of the nine citation tones [55, 33, 22, 21, 25, 23, 5, 3, 2] in Hong Kong Cantonese that occur on the test syllables in the sentence-final position in the declarative and question sentences. Results show that (i) the citation tones in the declarative context are noticeably different from the same tones in the question context; (ii) the differences between the same citation tones in the declarative context and question context are in F0 level and F0 contour; (iii) in all the cases, the F0 contours of [33, 22, 21, 25, 23, 3, 2] on the sentence-final test syllables in the question context are rising, and for the F0 contours of [55, 5], there is a slight upward deflection and a pronounced increase in F0 level; and (iv) the differences in F0 contour and F0 level between the tones in the declarative context are reduced in the question context in some cases and in other cases they have disappeared due to neutralization.\n",
    ""
   ]
  },
  "ma04_tal": {
   "authors": [
    [
     "Joan K.-Y.",
     "Ma"
    ],
    [
     "Valter",
     "Ciocca"
    ],
    [
     "Tara L.",
     "Whitehill"
    ]
   ],
   "title": "The effects of intonation patterns on lexical tone production in Cantonese",
   "original": "tal4_133",
   "page_count": 4,
   "order": 39,
   "p1": "133",
   "pn": "136",
   "abstract": [
    "This study investigated the influence of intonation patterns on lexical tone identity. The use of intonation in tonal languages poses an interesting research question since changes in the fundamental frequency (F0) of phonation serve two separate functions at the same time: marking of lexical meaning at the syllabic level and signaling intonation patterns at the sentential level. Speech materials of two intonation patterns (question versus statement) with six tonal contrasts placed at different positions (medial and final) were produced by 10 speakers (five males and five females). Dialogue was used for elicitation. Acoustic analysis was performed by measuring the F0 at nine evenly-spaced point from the beginning to the end of the voiced segment on each of the target word embedded. The F0 patterns of each of the six tones were similar for targets in statements and in medial position of questions. In the final position of questions, all six tones were observed to have rising contours. Final tone lowering effect was also noted in statements. The level of the tone at the final position was lowered in statements.\n",
    ""
   ]
  },
  "mixdorff04b_tal": {
   "authors": [
    [
     "Hansjörg",
     "Mixdorff"
    ],
    [
     "Patavee",
     "Charnvivit"
    ]
   ],
   "title": "Visual cues in Thai tone recognition",
   "original": "tal4_143",
   "page_count": 4,
   "order": 40,
   "p1": "143",
   "pn": "146",
   "abstract": [
    "The current paper presents preliminary experiments on the exploitation of visual cues in the perception of Thai tones. The lower half of a female speaker's face was recorded on digital video as she uttered a set of monosyllabic tokens covering the five different tones of Thai. The trajectories of 12 light points on the speaker's face were traced frame-by-frame and converted into velocity tracks which were then time-aligned with the speech signal. In parallel, a perception experiment was conducted in which the silent movies were shown to native speakers of Thai who had to decide which tone they perceived. Results, so far, are inconclusive. Whereas the identification results by the speaker herself being the subject are clearly above chance level, results from the other subjects are not and suggest that visual cues only are not sufficient for reliable identification. Since, however, subjects in Thailand were presented a compressed movie at a reduced resolution this circumstance might have also flawed their results.\n",
    ""
   ]
  },
  "ni04_tal": {
   "authors": [
    [
     "Jinfu",
     "Ni"
    ],
    [
     "Hisashi",
     "Kawai"
    ]
   ],
   "title": "Skeletonising Chinese fundamental frequency contours with a functional model and its evaluation",
   "original": "tal4_151",
   "page_count": 4,
   "order": 41,
   "p1": "151",
   "pn": "154",
   "abstract": [
    "This paper presents a method for skeletonising a fundamental frequency (F0 ) contour with its underlying F0 peaks and valleys, without losing the linguistic and para-linguistic information that it conveys. The F0 peaks and valleys are mainly associated with underlying lexical tones, and can be easily converted into other features, such as the response time and amplitude of local F0 rise/fall movements. Consequently, the exact shape of the F0 contour can be then recovered by the use of a functional F0 model, given the F0 peaks and valleys. Experiments were conducted on 668 Chinese utterances (around 1.4 hours of speech) from two native speakers. The validity of the proposed method is consistently proved by a three-fold evaluation: error analyses, perceptual similarity between the re-synthesised tone and intonation and the original, and a listening test of the naturalness of synthetic speech with incorporation of the recovered F0 contours into the unit selection process for synthesis.\n",
    ""
   ]
  },
  "shao04_tal": {
   "authors": [
    [
     "Yan-Qiu",
     "Shao"
    ],
    [
     "Ji-Qing",
     "Han"
    ],
    [
     "Ting",
     "Liu"
    ],
    [
     "Yong-Zhen",
     "Zhao"
    ]
   ],
   "title": "Prosodic word boundaries prediction for Mandarin text-to-speech",
   "original": "tal4_159",
   "page_count": 4,
   "order": 42,
   "p1": "159",
   "pn": "162",
   "abstract": [
    "In Mandarin speech, the Prosodic Word (PW) is the basic rhythmic unit instead of Lexical Word (LW), and the naturalness of TTS will be directly influenced by the segmentation of PW. Most of the PWs are the combination of some LWs. In this paper, three models, i.e. a directed acyclic graph (DAG) model, segmentation model and Markov Model (MM) combined with Transformation-Based Error Driven (TBED) learning algorithm are designed to combine lexical words into prosodic words. Considering some long LWs should be broken into two or more PWs, a long word break model is also applied to those LWs. Experimental results show that MM combined with TBED plus a long word break model is the best one among the three methods, and 93.00% precision and 93.23% recall are achieved.\n",
    ""
   ]
  },
  "sittiprapaporn04_tal": {
   "authors": [
    [
     "Wichian",
     "Sittiprapaporn"
    ],
    [
     "Chittin",
     "Chindaduangratn"
    ],
    [
     "Naiphinich",
     "Kotchabhakdi"
    ]
   ],
   "title": "Auditory preattentive processing of speech prosody in lexical tone: a functional imaging with low resolution brain electromagnetic topography (LORETA)",
   "original": "tal4_169",
   "page_count": 4,
   "order": 43,
   "p1": "169",
   "pn": "172",
   "abstract": [
    "The present study investigated the preattentive perception of speech prosody changes in lexical tone as revealed by the low-resolution electromagnetic tomography (LORETA). The mismatch negativity (MMN), elicited by consonant-vowel (CV) syllable change of both native and non-native speech sound contrasts in tonal languages was assessed by measuring the electric sources of MMN in both hemispheres. Our results suggest that the left hemisphere was predominant in the perception of native speech sounds, whereas the non-native speech sound was dominated by the right hemisphere, which may be explained by the specialization in processing the prosodic and emotional components of speech formed in this hemisphere.\n",
    ""
   ]
  },
  "lu04_tal": {
   "authors": [
    [
     "Sun",
     "Lu"
    ],
    [
     "Hu",
     "Yu"
    ],
    [
     "Wang",
     "Ren-Hua"
    ]
   ],
   "title": "Perceptual analysis of duration evaluation in Mandarin",
   "original": "tal4_173",
   "page_count": 4,
   "order": 44,
   "p1": "173",
   "pn": "176",
   "abstract": [
    "This paper is emphasized on analyzing the evaluation ability of RMSE and correlation in duration prediction. RMSE and correlation, as two chief evaluation means of duration prediction models, have their own strong points and weaknesses. We have hence carried out a perceptual experiment to investigate the characteristics of these two means, both in comparing two prediction systems and in evaluating the performance of a single predictor. In analyzing the performance of a duration prediction system, we put forward a more effective approach to appraise the predicted duration and hence come to the conclusion that a duration prediction system can be improved through valid information of stress/unstress and phonologically important syllables.\n",
    ""
   ]
  },
  "wang04b_tal": {
   "authors": [
    [
     "Maolin",
     "Wang"
    ],
    [
     "Maocan",
     "Lin"
    ]
   ],
   "title": "An analysis of pitch in Chinese spontaneous speech",
   "original": "tal4_203",
   "page_count": 3,
   "order": 45,
   "p1": "203",
   "pn": "206",
   "abstract": [
    "In this study, based on spontaneous speech corpus, the FO values and the FO ranges of 79 speakers are analyzed. It is found that when FO value is converted to semitone, there is no difference between the ranges of the two genders. Intonation phrases can be classified according to their pitch range and pitch register.\n",
    ""
   ]
  },
  "wang04c_tal": {
   "authors": [
    [
     "Gongping",
     "Wang"
    ],
    [
     "Xiaochuan",
     "Peng"
    ]
   ],
   "title": "Experimental research on the modal function of two adverbs <i>dao</i> and <i>que</i>",
   "original": "tal4_197",
   "page_count": 4,
   "order": 46,
   "p1": "197",
   "pn": "200",
   "abstract": [
    "While voice information processing is moving from static and physical research towards dynamic and functional research, experimental research on mood has become a necessity. Based on experiment on the modal function of the two adverbs Dao and Que, this thesis proposes the following points:1. Both Dao and Que can effectively express mood, which is supported by the change of F0 and volume increase of the phonological words before and after Dao and Que in the experimental sentences. 2. In normal cases, Que is more effective than Dao in expressing a strong mood, which is proved by how each of them affect the F0(including pitch range) of a sentence, the duration of a whole sentence and the pause between clauses. 3.The different performances of the two words in regard to their modal function are represented by F0, intense, duration etc.\n",
    ""
   ]
  },
  "wang04d_tal": {
   "authors": [
    [
     "Yunjia",
     "Wang"
    ]
   ],
   "title": "Tone pattern and word stress in Mandarin",
   "original": "tal4_207",
   "page_count": 4,
   "order": 47,
   "p1": "207",
   "pn": "210",
   "abstract": [
    "The relationship between tone pattern and word stress is investigated on different aspects. The distribution of the original tones of the unstressed syllables in disyllabic words, the perception of word stress in utterances and the allocation of sentence stresses within words are analyzed. The results of the analyses coincide quite well, indicating that tone has something to do with the engendering of the unstressed syllables at lexical level and with word stress pattern in continuous speech. Specifically, when appearing in the final position in a disyllabic word, the high level tone, i.e. T1, makes a syllable have the smallest possibility to be unstressed at lexical level, and also makes it most prominent in perception, and the low tone, i.e. T3, does the reverse. It is argued from the diachronic viewpoint that to some degree the prominence of a tone in continuous speech makes it uneasy to become neutralized at lexical level.\n",
    ""
   ]
  },
  "xiong04_tal": {
   "authors": [
    [
     "Ziyu",
     "Xiong"
    ]
   ],
   "title": "The control of tones on pitch movement in Mandarin",
   "original": "tal4_211",
   "page_count": 4,
   "order": 48,
   "p1": "211",
   "pn": "214",
   "abstract": [
    "This paper studied the control of tones on pitch movement in syllables. Five types of corpora are used here: corpus of monosyllables, corpus of disyllables, corpus of read sentences, corpus of read paragraphs, and corpus of spontaneous speech. The results show that the ability of tones to control the pitch movement is descending in the above listed sequence. With the more intervention of other factors in connected speech, tones play a less important role in controlling pitch movement. It proves that pitch movement in utterance is controlled by various factors and the type of tones is just one of them.\n",
    ""
   ]
  },
  "yan04b_tal": {
   "authors": [
    [
     "Long",
     "Yan"
    ],
    [
     "Rencai",
     "Zhao"
    ],
    [
     "Gang",
     "Liu"
    ],
    [
     "Jun",
     "Guo"
    ]
   ],
   "title": "Large vocabulary Mandarin Chinese continuous speech recognition system based on tonal triphone",
   "original": "tal4_221",
   "page_count": 3,
   "order": 49,
   "p1": "221",
   "pn": "224",
   "abstract": [
    "Large vocabulary mandarin Chinese continuous speech recognition has been a difficult problem in speech recognition area because of several reasons. First, it is a tone language. There are five lexical tones that are important in distinguishing the confusable words in mandarin. So the modeling of tones plays an important role in mandarin speech recognition. Second, the variation of tones in spontaneous mandarin speech would have some effects on the performance. Third, the co-articulation is inevitable in spontaneous mandarin speech recognition. In this paper, a large vocabulary mandarin Chinese continuous system based on tonal triphone was constructed. The experimental results shows that a good performance in acoustic level has been achieved while poor performance in word level.\n",
    ""
   ]
  },
  "zeng04_tal": {
   "authors": [
    [
     "Xiao-Li",
     "Zeng"
    ],
    [
     "Philippe",
     "Martin"
    ],
    [
     "Georges",
     "Boulakia"
    ]
   ],
   "title": "Tones and intonation in declarative and interrogative sentences in Mandarin",
   "original": "tal4_235",
   "page_count": 4,
   "order": 50,
   "p1": "235",
   "pn": "238",
   "abstract": [
    "This study investigates three modal variations in Mandarin Chinese: 1) declarative (\"D\"); 2) interrogative ended with the interrogative marker \"ma\" (\"I-ma\"), and 3) interrogative without \"ma\" (or \"Rhetoric Question\" - \"RQ\", demand of confirmation). The acoustic comparison of these variations shows precedence on the realization of modal intonation on any of the four tones in sentence-final position. The instrumental analysis reveals that: 1) interrogative intonation (with or without the interrogative marker \"ma\") has a higher sentence- final melodic curve than the declarative counterpart; 2) the duration of the last syllable in the interrogative is shorter than that in the declarative. These results prove that even with the presence of the interrogative marker \"ma\", the interrogative is characterized with a specific prosodic melodic pattern, different from the ones used in the other modality variations.\n",
    ""
   ]
  },
  "zhang04_tal": {
   "authors": [
    [
     "Jin-Song",
     "Zhang"
    ],
    [
     "Keikichi",
     "Hirose"
    ],
    [
     "Satoshi",
     "Nakamura"
    ]
   ],
   "title": "Robust acoustic modeling of contextual tonal F0 variations on the basis of tone nucleus framework",
   "original": "tal4_239",
   "page_count": 4,
   "order": 51,
   "p1": "239",
   "pn": "242",
   "abstract": [
    "This paper presents our tone nucleus based framework to model the complex variations in sentential F0 contours to build robust tonal acoustic models. By focusing on tone nuclei, the approach can get rid of the influence of aritculatory transition loci on tonal modeling. Anchoringbased Tone nucleus normalization improves the discriminability among the tones. Hypo- and Hyper- intonation model is to account for the interplay of tone coarticulation and higher level prosodic effects. The whole approach achieved significant higher performance of tone recognition than the conventional method.\n",
    ""
   ]
  },
  "chen04d_tal": {
   "authors": [
    [
     "Juanwen",
     "Chen"
    ],
    [
     "Aijun",
     "Li"
    ],
    [
     "Xia",
     "Wang"
    ]
   ],
   "title": "Contrastive study on prosodic aspects for standard and regional accented Chinese",
   "original": "tal4_033",
   "page_count": 4,
   "order": 52,
   "p1": "33",
   "pn": "36",
   "abstract": [
    "It is commonly held that there exists some prosodic differences between standard Chinese and accented Mandarin. In this paper, a perceptual test was first made by filtering the signal above 500 Hz to conceal the segmental information and make utterances meaningless. It is proven that people could identify Standard Chinese (SC) and Shanghai-accented Mandarin (ASH) only by the prosodic features. Then, we studied the word stress of disyllables in citation form and found the word stress distribution and its acoustic features are different between SC and ASH.\n",
    ""
   ]
  },
  "yu04_tal": {
   "authors": [
    [
     "Jue",
     "Yu"
    ],
    [
     "Aijun",
     "Li"
    ],
    [
     "Xia",
     "Wang"
    ]
   ],
   "title": "A contrastive investigation of diphthongs between standard Mandarin and shanghai accented Mandarin",
   "original": "tal4_229",
   "page_count": 6,
   "order": 53,
   "p1": "229",
   "pn": "234",
   "abstract": [
    "9 diphthongs [ai, ei, ao, ou, ia, ie, ua, uo, ye] for 10 SC and 20 ASH speakers with medium accent were compared in this paper. In order to find out the differences in diphthongs between SC and ASH, the vowel charts and the formant patterns were plotted for them. Finally, comparative distinctions were obtained and analyzed.\n",
    ""
   ]
  },
  "chen04e_tal": {
   "authors": [
    [
     "Xiaoxia",
     "Chen"
    ]
   ],
   "title": "An investigation of voicing consonants in continuous speech",
   "original": "tal4_037",
   "page_count": 4,
   "order": 54,
   "p1": "37",
   "pn": "40",
   "abstract": [
    "This paper shows the results of an investigation of consonant voicing in an utterance according to labeled read speech and spontaneous speech. Five speakers’ materials were researched. Some interesting results were gotten from labeled materials.\n",
    ""
   ]
  },
  "deng04_tal": {
   "authors": [
    [
     "Dan",
     "Deng"
    ],
    [
     "Ming",
     "Chen"
    ],
    [
     "Shinan",
     "Lu"
    ]
   ],
   "title": "Study on stress models of Chinese disyllable",
   "original": "tal4_049",
   "page_count": 4,
   "order": 55,
   "p1": "49",
   "pn": "52",
   "abstract": [
    "This paper investigates the stress distributions of Chinese disyllables in 1+1, 2+2 and 4+4. The result shows that: 1) most of Chinese disyllables do not have fixed stress models, moreover, two syllables have equal opportunities of being stressed; 2) disyllables in 2+2 and 4+4 have obviously initial-stressed inclination due to \"neutralization\" in final syllable; 3) not only pitch and duration, but also break level and the position in the prosodic phrase influence the distributions of word stress.\n",
    ""
   ]
  },
  "tseng04b_tal": {
   "authors": [
    [
     "Chin-Chin",
     "Tseng"
    ]
   ],
   "title": "Prosodic properties of intonation in two major varieties of Mandarin Chinese: mainland China vs. Taiwan",
   "original": "tal4_189",
   "page_count": 3,
   "order": 56,
   "p1": "189",
   "pn": "192",
   "abstract": [
    "Prosodic properties of intonation in Putonghua (Mandarin spoken in China) and Guoyu (Mandarin spoken in Taiwan) were investigated in this study. The major findings are: (1) Guoyu has a slower tempo than Putonghua. (2) Putonghua demonstrated a general higher register than Guoyu. (3) The neutral tone and the preceding accented syllable in Putonghua form a great FO change, while the neutral tone in Guoyu is more independent from the preceding syllable, for it tends to be pronounced with a low entering tone regardless the tone of the preceding syllable. (4) The final particle \"a\" of the Wh- question in j518 has a distinctive rising intonation in Putonghua. (5) The downdrift phenomenon is more prominent for announcers from Taiwan. (6) Putonghua demonstrates more syntagmatic contrasts in the prosodic properties of intonation.\n",
    ""
   ]
  },
  "belotelgrenie04_tal": {
   "authors": [
    [
     "Agnès",
     "Belotel-Grenié"
    ],
    [
     "Michel",
     "Grenié"
    ]
   ],
   "title": "The creaky voice phonation and the organisation of Chinese discourse",
   "original": "tal4_005",
   "page_count": 4,
   "order": 57,
   "p1": "5",
   "pn": "8",
   "abstract": [
    "The term voice quality or phonation types often come from studies of pathological speech. In normal speech speakers use different phonation types in some languages for linguistic distinction, prosodically as a boundary signal and in attitudes and emotions. Our paper aims to describe the different phonation types that occur in Standard Chinese TV newscasts and the relationship between creaky voice phonation and the prosody structure of such corpus.\n",
    ""
   ]
  },
  "liang04_tal": {
   "authors": [
    [
     "Lei",
     "Liang"
    ]
   ],
   "title": "Tonal neutralization in Chinese: a cross-dialectal perspective",
   "original": "tal4_123",
   "page_count": 2,
   "order": 58,
   "p1": "123",
   "pn": "124",
   "abstract": [
    "The general aim of this paper is to elucidate the nature of the tonal neutralization and the relationship between the neutral tone and (weak) stress in Chinese. Although there has been increased recent interest in various prosodic aspects of this language, most of the previous studies mainly focused on the interaction of tone and intonation. Relatively little attention has been paid to stress, especially stress in different dialects. It is hypothesized that a cross-dialectal study of the neutral tone will make us have a better understanding of prosody in general and the interaction between tone and stress.\n",
    ""
   ]
  }
 },
 "sessions": [
  {
   "title": "Special Invited Talks",
   "papers": [
    "lehiste04_tal",
    "abramson04_tal",
    "fujisaki04_tal",
    "bruce04_tal"
   ]
  },
  {
   "title": "Typology and Phonology in Tone Languages",
   "papers": [
    "hirst04_tal",
    "gibbon04_tal",
    "wang04_tal",
    "zu04_tal"
   ]
  },
  {
   "title": "Perception of Tones and Intonation",
   "papers": [
    "house04_tal",
    "niebuhr04_tal",
    "lin04_tal",
    "li04_tal"
   ]
  },
  {
   "title": "Production of Tone and Intonation",
   "papers": [
    "kong04_tal",
    "hoole04_tal",
    "erickson04_tal"
   ]
  },
  {
   "title": "Modelling of Tone and Intonation",
   "papers": [
    "mixdorff04_tal",
    "luksaneeyanawin04_tal",
    "tao04_tal",
    "fant04_tal"
   ]
  },
  {
   "title": "Interface of Tone and Intonation",
   "papers": [
    "xu04_tal",
    "shih04_tal",
    "myers04_tal",
    "connell04_tal"
   ]
  },
  {
   "title": "Prosodic Processing",
   "papers": [
    "hirose04_tal",
    "tseng04_tal",
    "chen04_tal"
   ]
  },
  {
   "title": "Phonetic Aspects",
   "papers": [
    "campbell04_tal",
    "tillmann04_tal",
    "svantesson04_tal"
   ]
  },
  {
   "title": "Poster Session",
   "papers": [
    "cao04_tal",
    "chen04b_tal",
    "li04b_tal",
    "chen04c_tal",
    "davison04_tal",
    "yan04_tal",
    "hiki04_tal",
    "hu04_tal",
    "lee04_tal",
    "ma04_tal",
    "mixdorff04b_tal",
    "ni04_tal",
    "shao04_tal",
    "sittiprapaporn04_tal",
    "lu04_tal",
    "wang04b_tal",
    "wang04c_tal",
    "wang04d_tal",
    "xiong04_tal",
    "yan04b_tal",
    "zeng04_tal",
    "zhang04_tal",
    "chen04d_tal",
    "yu04_tal",
    "chen04e_tal",
    "deng04_tal",
    "tseng04b_tal",
    "belotelgrenie04_tal",
    "liang04_tal"
   ]
  }
 ]
}