{
 "title": "5th International Symposium on Tonal Aspects of Languages (TAL 2016)",
 "location": "Buffalo, New York",
 "startDate": "24/5/2016",
 "endDate": "27/5/2016",
 "URL": "http://ubwp.buffalo.edu/TAL2016",
 "chair": "Chairs: C. DiCanio, J. Malins, J. Good, K. Michelson, J. Jaeger, and H. Keily",
 "conf": "TAL",
 "year": "2016",
 "name": "tal_2016",
 "series": "TAL",
 "SIG": "SProSIG",
 "title1": "5th International Symposium on Tonal Aspects of Languages",
 "title2": "(TAL 2016)",
 "date": "24-27 May 2016",
 "booklet": "tal_2016.pdf",
 "papers": {
  "tessmer16_tal": {
   "authors": [
    [
     "Rachel",
     "Tessmer"
    ],
    [
     "Barath",
     "Chandrasekaran"
    ]
   ],
   "title": "Stability and plasticity in the neural representation of linguistic pitch patterns",
   "original": "02-TessmerChandrasekaran",
   "page_count": 5,
   "order": 1,
   "p1": 1,
   "pn": 5,
   "abstract": [
    "﻿In this paper we discuss evidence that early, long-term experience with a tonal language leaves a stable and lasting influence on the neural encoding of linguistic pitch patterns. We will also demonstrate that plastic changes in the neural representation of linguistic pitch are possible during adulthood, after just a few hundred trials of sound-to-category mapping training that establish behavioral relevance of the incoming stimuli. Notably, such category training creates large individual differences in learning success, the reasons for which are unclear. Within the context of a novel theoretical approach, the dual-learning systems (DLS) model, we will discuss the mechanisms underlying tone learning in adulthood, sources of individual differences, and the potential to design optimized training approaches that reduce individual differences."
   ],
   "doi": "10.21437/TAL.2016-1"
  },
  "hyman16_tal": {
   "authors": [
    [
     "Larry",
     "Hyman"
    ]
   ],
   "title": "Lexical vs. Grammatical Tone: Sorting out the Differences",
   "original": "03-Hyman",
   "page_count": 6,
   "order": 2,
   "p1": 6,
   "pn": 11,
   "abstract": [
    "﻿Researchers of tone are largely influenced by the properties of the language(s) on which they work. Since tone has an almost exclusively lexical function in East and Southeast Asian languages, researchers of these languages focus primarily on how languages and speakers distinguish tone on lexical morphemes. Languages such Thai, Vietnamese and the wide range within Chinese lead one to posit a particular typology of lexical, monosyllabic tones which may interact with each other or be influenced by the syntax, but which rarely function as direct exponents of grammar. At the other extreme are languages from other parts of the world where tone is primarily grammatical. Languages such as Somali and Chimwiini treat their (sparse) tones syntagmatically, where the grammar determines where a H tone will be realized on a word or phrase, thereby encouraging many to feel they in fact represent a different typology altogether, often identified as “pitch accent”. In between these two endpoints are the majority of languages whose tones exhibit both a lexical and grammatical function. In this paper I suggest that there is in principle no difference in the range of phenomena found in lexical vs. grammatical tonology."
   ],
   "doi": "10.21437/TAL.2016-2"
  },
  "zhang16_tal": {
   "authors": [
    [
     "Jie",
     "Zhang"
    ]
   ],
   "title": "Using Nonce-probe Tests and Auditory Priming to Investigate Speakers' Phonological Knowledge of Tone Sandhi",
   "original": "04-Zhang",
   "page_count": 7,
   "order": 3,
   "p1": 12,
   "pn": 18,
   "abstract": [
    "﻿Recent phonological research has shown that speakers may both overlearn and underlearn from lexical patterns of their language. This points to the importance of experimental studies to the construction of phonological analysis. In this paper, I explore the use of nonce-probe tests and auditory priming in the investigation of speakers’ tacit knowledge of tone sandhi in a variety of Chinese dialects, with a particular focus on the effect of opacity on how speakers internalize the sandhi pattern. Nonce-probe results show that opaque tone sandhis typically lack full productivity and often categorically fail to apply to novel words, while transparent sandhis are more productive. Auditory priming studies show that disyllabic words undergoing an opaque sandhi on the first syllable are more strongly primed by a syllable carrying the sandhi tone, while words undergoing a transparent sandhi are more strongly primed by the base tone. These results suggest that speakers internalize opaque sandhis as the listing of allomorphs, while transparent sandhis can be derived through productive phonological processes from the base tone."
   ],
   "doi": "10.21437/TAL.2016-3"
  },
  "chien16_tal": {
   "authors": [
    [
     "Yu-Fu",
     "Chien"
    ],
    [
     "Joan",
     "Sereno"
    ],
    [
     "Jie",
     "Zhang"
    ]
   ],
   "title": "Priming the Representation of Taiwanese Tone Sandhi Words",
   "original": "05-ChienSerenoZhang",
   "page_count": 4,
   "order": 4,
   "p1": 19,
   "pn": 22,
   "abstract": [
    "﻿Tone sandhi is a tonal alternation phenomenon in which a tone changes to a different tone in certain phonological environments. Taiwanese tone sandhi realizes itself in a circular chain-shift fashion. This study aims to investigate how Taiwanese disyllabic words with sandhi T51 → T55 and sandhi T24 → T33 are represented in the listeners’ mental lexicon, namely, whether Taiwanese listeners are more sensitive to the surface representations or underlying representations of Taiwanese sandhi words in spoken word recognition. An auditory priming lexical decision experiment was conducted to examine priming effects between monosyllabic primes and their corresponding disyllabic targets. Each target was preceded by either a surface-tone prime (e.g., ping55-ping55tsun24; pue33-pue33jong51), an underlying-tone prime (e.g., ping51-ping55tsun24; pue24-pue33jong51), or an unrelated control (e.g., ping21-ping55tsun24; pue21-pue33jong51). Results showed that for sandhi T51 → T55, surface tone primes elicited a stronger facilitation effect than underlying tone primes, with sizeable frequency effects, while for sandhi T24 → T33, underlying tone primes elicited a stronger facilitation effect than surface tone primes. Our data show that the phonological nature of tone sandhi influences how listeners process and represent tone sandhi words."
   ],
   "doi": "10.21437/TAL.2016-4"
  },
  "liu16_tal": {
   "authors": [
    [
     "Jiang",
     "Liu"
    ],
    [
     "Jie",
     "Zhang"
    ]
   ],
   "title": "The effects of talker variability and variances on incidental learning of lexical tones",
   "original": "06-LiuZhang",
   "page_count": 5,
   "order": 5,
   "p1": 23,
   "pn": 27,
   "abstract": [
    "﻿Multi-talker variability has been found to be very effective in the perception and production training of nonnative sound categories in the past few decades. The phonetic training paradigms were mostly explicit learning in which learners received feedback of the categories when exposed to the training stimuli. More recently, studies have started to investigate how auditory categories are learned by adults incidentally during unsupervised training—a simulation of sound category learning in a natural environment without any experimenter-provided feedback. The stimuli used in incidental learning were mostly re-synthesized nonspeech sound categories due to the ease of manipulating the variance of different acoustic dimensions. Very few studies examined the effect of talker variability on incidental learning of novel speech categories. This study investigated whether American adults without any tone language experience can learn Mandarin Chinese lexical tones incidentally by playing a video game. We also examined the effects of carefully manipulated variability of the re-synthesized stimuli and the natural variability of multi-talkers on lexical tone category learning. In addition to tone discrimination and identification, we also examined the participants’ cue-weighting change after the incidental learning. The result showed that novel speech categories, lexical tones in this case, can be learned incidentally. The results also showed that multi-talker stimuli not only led to better generalization for the identification of tones in stimuli not present in the training but also made learners have a more nativelike cue-weighting in tone perception. The results suggest that the manipulation of variance on significant acoustic dimensions such as pitch direction and height may not be as robust as talker variability in terms of learning lexical tones when incidental learning occurred."
   ],
   "doi": "10.21437/TAL.2016-5"
  },
  "alexander16_tal": {
   "authors": [
    [
     "Jennifer",
     "Alexander"
    ],
    [
     "Yue",
     "Wang"
    ]
   ],
   "title": "Cross-language Lexical-tone Identification",
   "original": "07-Alexander",
   "page_count": 5,
   "order": 6,
   "p1": 28,
   "pn": 32,
   "abstract": [
    "﻿We examine how native lexical-tone experience influences identification of novel tone. Cantonese, Thai, Mandarin, and Yoruba listeners identified CV syllables bearing the six phonemic Cantonese tones. Overall tone accuracy scores and tone-error patterns were assessed. Consistent with previous reports, native listeners’ perception reflected effects of ongoing tonal mergers and acoustic similarities incurred by a crowded lower tone space [27]. Non-native listeners’ perception appeared to be influenced by L1 auditory experience, as they attended to acoustic and phonetic cues relevant to the phonological and phonetic properties of L1 tone categories. [Support: NSF grant 0965227 to J.A.A.]"
   ],
   "doi": "10.21437/TAL.2016-6"
  },
  "li16_tal": {
   "authors": [
    [
     "Xin",
     "Li"
    ],
    [
     "René",
     "Kager"
    ],
    [
     "Wentao",
     "Gu"
    ]
   ],
   "title": "Surface vs. Underlying Listening Strategies for Cross-Language Listeners in the Perception of Sandhied Tones in the Nanjing Dialect",
   "original": "08-LiKagerGu",
   "page_count": 5,
   "order": 7,
   "p1": 33,
   "pn": 37,
   "abstract": [
    "﻿This study is devoted to exploring surface/underlying listening strategies adopted by native and non-native, tone and non-tone language groups in their perception of sandhied tones, and the possible effect of the coarticulatory/non-coarticulatory nature of the sandhi rule on tone perception. The mapping between surface sandhied tones and underlying tones is investigated by a pair of Nanjing sandhi rules, one coarticulatory and the other non-coarticulatory, involving three groups of listeners: Dutch, Beijing, and native Nanjing, by means of a Concept Formation paradigm. Results reveal distinct perceptual patterns in the three groups. Dutch listeners experience difficulty in creating phonological representation for tones even in surface listening; Beijing listeners use their native ability at tone perception for interpreting Nanjing sandhied tones in surface tone perception, but have no access to underlying patterns; Nanjing listeners perceive native sandhied tones at both the underlying level and surface level and seem to always mix them when analyzing tones. The coarticulatory/non-coarticulatory nature of sandhi rules does not seem to play a role in the current experiment."
   ],
   "doi": "10.21437/TAL.2016-7"
  },
  "kugler16_tal": {
   "authors": [
    [
     "Frank",
     "Kügler"
    ]
   ],
   "title": "Embedded clauses and recursive prosodic phrasing in Akan",
   "original": "09-Kuegler",
   "page_count": 5,
   "order": 8,
   "p1": 38,
   "pn": 42,
   "abstract": [
    "﻿This study investigates the interaction of lexical tone and intonation in embedded clauses in the two-tone Kwa language Akan. The claim is that embedded clauses show recursive prosodic phrasing at the level of intonation phrases (ι-phrase). The prosodic boundary of an embedded clause is expressed by means of a pitch register reset. At the boundary, lexical tonal distinctions are maintained in the recursively embedded ι-phrase. The amount of pitch register reset depends on the nature of the following tone, smaller reset in case of a following L tone, and larger reset in case of a following H-tone. I will argue that recursive prosodic phrasing at the level of an ι-phrase is thus achieved by means of a pitch register reset."
   ],
   "doi": "10.21437/TAL.2016-8"
  },
  "mcpherson16_tal": {
   "authors": [
    [
     "Laura",
     "McPherson"
    ]
   ],
   "title": "Cyclic spell-out and the interaction of Seenku tonal processes",
   "original": "10-McPherson",
   "page_count": 5,
   "order": 9,
   "p1": 43,
   "pn": 47,
   "abstract": [
    "﻿This paper demonstrates how tone can provide clues about large-scale grammatical architecture, by focusing on the interaction between three tonal processes in Seenku, a Mande language of Burkina Faso with a four-height tone system (tones: eL, L, H, eH). First, a phonotactic restriction against H in word-final position in open class vocabulary triggers epenthesis of eL, creating a H-eL contour. Second, plurals are formed in part by a raising tonal chain shift, argued to be due to the suffixation of a [+raised] feature. Third, the tone of inalienably possessed nouns changes according to the possessor (spreading from non-pronominal possessors, a series of tonal alternations triggered by pronominal possessors). The interaction of these three processes points to systemic cyclicity, rather than word-level cyclicity in the phonology: the possessor must undergo all tonal processes first, as the raised plural tone or epenthesized eL can spread to the possessed noun. Within the possessed noun’s cycle, it must undergo possessive interactions before plural formation. The facts can be accounted for in a framework of cyclic spell-out, where more deeply embedded phases (here, the possessor’s DP) are sent to spell-out and receive morphophonological form before less deeply embedded phases (the overarching DP containing the possessed noun). Further, the order of processes within a cycle points to Morphology before Phonology in the computation of surface form. This approach fares better than alternatives, including cophonologies and Stratal OT."
   ],
   "doi": "10.21437/TAL.2016-9"
  },
  "kirby16_tal": {
   "authors": [
    [
     "James",
     "Kirby"
    ],
    [
     "D. Robert",
     "Ladd"
    ]
   ],
   "title": "Tone-melody correspondence in Vietnamese popular song",
   "original": "11-KirbyLadd",
   "page_count": 4,
   "order": 10,
   "p1": 48,
   "pn": 51,
   "abstract": [
    "﻿We examine the degree of correspondence between musical and linguistic tone sequences in a corpus of 20 Vietnamese popular songs. Our data suggest that text-setting constraints in Vietnamese, as in some other Asian tone languages, are based primarily on the direction of the pitch transition from one syllable/ note to the next. Borrowing some musical terminology, we may say that ‘similar motion’ is favoured, ‘oblique motion’ is allowed in certain cases, and ‘contrary motion’ is disfavoured. As with other Asian tone languages, the definition of these three types of motion depends on the categorisation of the linguistic tones; our current best model achieves a rate of 77% similar motion. We hypothesize that avoidance of contrary motion may be as or more important than achieving correspondence between tonal and melodic transitions in Vietnamese popular song."
   ],
   "doi": "10.21437/TAL.2016-10"
  },
  "luo16_tal": {
   "authors": [
    [
     "Qian",
     "Luo"
    ],
    [
     "Karthik",
     "Durvasula"
    ],
    [
     "Yen-Hwei",
     "Lin"
    ]
   ],
   "title": "Inconsistent Consonantal Effects on F- in Cantonese and Mandarin",
   "original": "12-Luo",
   "page_count": 4,
   "order": 11,
   "p1": 52,
   "pn": 55,
   "abstract": [
    "﻿Previous research shows that aspiration and sonorancy can have inconsistent consonantal effects on vowel F0 across languages, and even within the same language in different studies: they are reported to either lower F0, raise F0, or have neutral effects. This paper is interested in such inconsistent consonantal effects on vowel F0 in Cantonese and Mandarin. The results of a series of production experiments show that: (1) consonantal effects on vowel F0 are language-specific; (2) the consonantal effects can be conditioned by lexical tones. The findings also provide insights for puzzles in historical tone change."
   ],
   "doi": "10.21437/TAL.2016-11"
  },
  "perkins16_tal": {
   "authors": [
    [
     "Jeremy",
     "Perkins"
    ],
    [
     "Seunghun",
     "Lee"
    ],
    [
     "Julián",
     "Villegas"
    ]
   ],
   "title": "An Interplay Between F0 and Phonation in Du'an Zhuang Tone",
   "original": "13-Perkins",
   "page_count": 4,
   "order": 12,
   "p1": 56,
   "pn": 59,
   "abstract": [
    "﻿This paper undertook an acoustic study of the tone system of one speaker of Du'an Zhuang, finding that his tone system involved phonation contrasts in addition to F0 contrasts. It was found that two of the six tones in unchecked syllables involved significant creakiness near the midpoint of the vowel. These results suggest a phonological tone contrast that involves both F0 and creakiness. Among pairs of tones that differed in their phonation, significant differences in the timing of F0 fall were discovered. Additionally, the two creaky tones differed in the timing of the maximum creakiness. Future research could establish whether and to what extent Du'an Zhuang speakers utilize creakiness and F0, and their relative timing, in discerning between tonal categories. Production studies are needed with larger samples of speakers and perception studies are needed to confirm the contrastive roles of phonation and F0 in the Du’an Zhuang tone system."
   ],
   "doi": "10.21437/TAL.2016-12"
  },
  "brunelle16_tal": {
   "authors": [
    [
     "Marc",
     "Brunelle"
    ]
   ],
   "title": "Intonational phrase marking in Southern Vietnamese",
   "original": "14-Brunelle",
   "page_count": 5,
   "order": 13,
   "p1": 60,
   "pn": 64,
   "abstract": [
    "﻿Earlier studies of Vietnamese prosody, which, to a single exception, looked at the Northern dialect, portray a language in which intonation is weak, variable and idiosyncratic. The intonational targets typically proposed in autosegmentalmetrical models (boundary tones, pitch-accents) have remained elusive. This may very well be due to the fact that almost all previous experimental work was conducted on relatively unnatural read speech; in fact, research conducted on natural conversations has revealed that intonation may surface in peripheral areas of grammar where lexical tone plays a low functional role, like backchannels and repair utterances. In this short paper, an eight-hour corpus of Southern Vietnamese spontaneous speech is used as a basis for investigation. I first show that, just as in Northern Vietnamese, there is little evidence for strongly phonologized boundary tones in Southern Vietnamese. I then put forward evidence that although an effect of intonation is seen in discursive monosyllabic utterances, this effect seems more optional and less categorical than in Northern Vietnamese."
   ],
   "doi": "10.21437/TAL.2016-13"
  },
  "erickson16_tal": {
   "authors": [
    [
     "Donna",
     "Erickson"
    ],
    [
     "Ray",
     "Iwata"
    ],
    [
     "Atsuo",
     "Suemitsu"
    ]
   ],
   "title": "Jaw displacement and phrasal stress in Mandarin Chinese",
   "original": "15-EricksonIwataSuemitsu",
   "page_count": 5,
   "order": 14,
   "p1": 65,
   "pn": 69,
   "abstract": [
    "﻿Spoken languages have rhythmic structures, often phonologically described in terms of the metrical phrasal stress patterns of that language [1, 2, 3, 4]. Recent studies with English, Japanese, and Spanish suggest that rhythmic phrasal stress patterns are articulated by syllable to syllable jaw displacement variations, with concomitant syllable to syllable changes in vocal tract resonance frequencies, especially F1[5, 6, 7, 8, 9, 10, 11]. Moreover, the jaw and F1 patterns match the hierarchical (metrical) structure of the particular language. Inspired by these cross-linguistic findings, we investigate Mandarin Chinese to see if a tonal language also shows patterns of jaw displacement/F1 reflecting phrasal stress/hierarchical groupings of syllables. Acoustic and electromagnetic articulatory recordings of jaw displacement of 6 Mandarin Chinese speakers were analyzed. The results indicate that jaw displacement increases for phrase-final syllables, and optionally for phrase-initial syllables, regardless of lexical tone, with acoustic consequences of increased F1/duration, but not increased intensity or F0."
   ],
   "doi": "10.21437/TAL.2016-14"
  },
  "wang16_tal": {
   "authors": [
    [
     "Xiaomei",
     "Wang"
    ],
    [
     "Yen-Hwei",
     "Lin"
    ]
   ],
   "title": "Metrical Structure and Tone Sandhi: Evidence from Ei Tonal Reduction",
   "original": "16-WangLin",
   "page_count": 5,
   "order": 15,
   "p1": 70,
   "pn": 74,
   "abstract": [
    "﻿This study examines the interaction of metrical structure and tone sandhi in Ei (an endangered language spoken in Rongshui, Guangxi Province, China), focusing on tonal reduction conditioned by a foot-like prosodic structure. Our analysis shows that within a disyllabic domain, Ei tone sandhi, mainly in the form of tonal reduction, applies only to the first syllable and the second syllable remains unchanged, suggesting a tone sandhi domain that exhibits a weak-strong metrical structure regardless of morpho-syntactic structures. The tonal reduction process leads to a low-register tone of variable and gradient pitch values in the non-head position. This interaction pattern between metrical structure and tone sandhi in Ei differ from other cases of metrically-conditioned tone sandhi in Chinese, such as New Shanghai and Beijing Mandarin, contributing to the typology of prosodically-conditioned tone sandhi. As the first phonological analysis of Ei tone sandhi, this study also enriches our understanding of an understudied and endangered language."
   ],
   "doi": "10.21437/TAL.2016-15"
  },
  "lee16_tal": {
   "authors": [
    [
     "Albert",
     "Lee"
    ],
    [
     "Yi",
     "Xu"
    ]
   ],
   "title": "Effect of speech rate on pre-low raising in Cantonese",
   "original": "17-Lee",
   "page_count": 5,
   "order": 16,
   "p1": 75,
   "pn": 79,
   "abstract": [
    "﻿This paper investigates the effect of speech rate on pre-low raising in Cantonese. Pre-low raising is an anticipatory tonal process where a high tone is raised when followed by a low tone (i.e. the trigger). Six native speakers of Cantonese were recorded saying a disyllable in 36 tone combinations (6 tones×6 tones) at two speech rates (normal and slow). It was found that in slow speech pre-low raising only occurred when the trigger was extremely low in pitch, whereas at normal speech rate it was observed in more tonal contexts. It is argued that pre-low raising is a result of enhanced cricothyroid activity in preparation for an upcoming low pitch target."
   ],
   "doi": "10.21437/TAL.2016-16"
  },
  "franich16_tal": {
   "authors": [
    [
     "Kathryn",
     "Franich"
    ]
   ],
   "title": "Perception of Tonal Contours in Medʉmba",
   "original": "18-Franich",
   "page_count": 4,
   "order": 17,
   "p1": 80,
   "pn": 83,
   "abstract": [
    "﻿This paper explores cues to contour tone perception in Medʉmba, a Grassfields Bantu language of Cameroon. Like many Bantu languages, Medʉmba contrasts only level high (H) and low (L) tones, but contour tones can result where H and L tones associate to a single syllable. Here, we examine the relative influence of vowel duration and tonal slope in Medʉmba speakers’ perception of contour tones, as well as the influence of a following downstep on contour tone perception. Results of a tone identification task indicate that duration, rather than tonal slope, was the primary cue to contour perception. At longer vowel durations, tonal slope also played a role in contour perception, but only when the the context following the contour tone was not downstepped. We explain this finding in terms of an f0-related auditory masking effect and suggest that such effects may be partially responsible for the relatively more common occurrence of downstep in languages with level tone inventories over those with mixed contour and level tone inventories."
   ],
   "doi": "10.21437/TAL.2016-17"
  },
  "chen16_tal": {
   "authors": [
    [
     "Mao-Hsu",
     "Chen"
    ]
   ],
   "title": "Production and Perception of a Tonal Neutralization Case in Taiwan Souther Min",
   "original": "19-Chen",
   "page_count": 5,
   "order": 18,
   "p1": 84,
   "pn": 88,
   "abstract": [
    "﻿This study explored the tonal neutralization of context tones 55 and 24 in Taiwan Southern Min, which are said to be realized both as sandhi tone 33 on surface when occurring in the context positions according to the Tone Circle. A production experiment with a reading task was conducted and the speech samples produced by speakers of two different age groups, old and young generations, were examined. The f0 contours of the two target context tones embedded in the minimal pair of sentences were compared using smoothing spline analysis of variance (SS ANOVA). The result showed an age-based acoustic variation, where the f0 contours of context tones 55 produced by the old speakers were significantly higher in pitch than those of context tones 24 throughout the entire contour, which was absent from the data of the young speakers, where the f0 contours of context tones 55 and 24 were indistinguishable from each other. The result of a preliminary perception experiment with an identification task was in line with the production data."
   ],
   "doi": "10.21437/TAL.2016-18"
  },
  "ling16_tal": {
   "authors": [
    [
     "Wenyi",
     "Ling"
    ],
    [
     "Amy",
     "Schafer"
    ]
   ],
   "title": "Tone Pair Similarity and the Perception of Mandarin Tones by Mandarin and English Listeners",
   "original": "20-LingSchafer",
   "page_count": 5,
   "order": 19,
   "p1": 89,
   "pn": 93,
   "abstract": [
    "﻿Previous work [1]–[5] has provided evidence that the perception of lexical tones by native speakers of Mandarin can be more categorical than that of naïve foreign listeners, for the tone pairings T1-T2, T2-T4, T1-T4 and T3-T4. The present study extended this work by testing Mandarin and naïve English listeners’ perception of all six possible pairwise combinations of the four Mandarin tones, using identification and AXB discrimination tasks. The results revealed significant differences in perception across tone pairs, highlighting potential challenges for language learning. They also confirmed that Mandarin listeners were more categorical in their perception than the naïve listeners, who showed higher discrimination accuracy than Mandarin listeners. The latter finding contrasts with previous results for naïve French speakers’ perception of Mandarin tone [2], and is consistent with an effect of native-language suprasegmental patterns on foreign-language tone perception."
   ],
   "doi": "10.21437/TAL.2016-19"
  },
  "zhang16b_tal": {
   "authors": [
    [
     "Hong",
     "Zhang"
    ]
   ],
   "title": "Boundary effects on allophonic creaky voice: A case study of Mandarin lexical tones",
   "original": "21-Zhang",
   "page_count": 5,
   "order": 20,
   "p1": 94,
   "pn": 98,
   "abstract": [
    "﻿The present study investigates the effects of prosodic boundary on the acoustic realization of allophonic Mandarin lexical tone creak. Speech of twenty speakers from Mandarin Call Home corpus was analyzed. Results show that stronger creaky voice occurs more often at the end of an utterance than the end of an intermediary phrase, and is least likely to occur phrase medially. The observed creak is stronger at boundaries with higher BI levels, regardless of the intrinsic pitch target of lexical tones. Tonal category also appears to be worse at predicting the phonetics of creak. Therefore, compared to lexical tone, prosodic boundary has stronger effects on the acoustic realization of creaky voice. The interaction between prosodic boundary and lexical tone on the acoustics of creaky voice also has implication on the interaction between lexical tone and intonation."
   ],
   "doi": "10.21437/TAL.2016-20"
  },
  "connell16_tal": {
   "authors": [
    [
     "Katrina",
     "Connell"
    ],
    [
     "Annie",
     "Tremblay"
    ],
    [
     "Jie",
     "Zhang"
    ]
   ],
   "title": "The Timing of Acoustic vs. Perceptual Availability of Segmental and Suprasegmental Information",
   "original": "22-ConnellTremblayZhang",
   "page_count": 4,
   "order": 21,
   "p1": 99,
   "pn": 102,
   "abstract": [
    "﻿This study investigates the timing of perception of tonal and segmental information. Its purpose is to determine whether the apparent delay that previous priming studies have reported for the processing of tonal information (relative to the processing of segmental information) may stem from low-level speech perception. Native Chinese listeners and native English listeners without knowledge of tone languages completed a gated AX-discrimination task where they heard increasingly large fragments of Chinese word pairs that differed only in tones or only in segments. The gates where listeners perceived the contrasts were compared after factoring out differences in when the contrasts became reliably present acoustically. The results of both groups show that the perception of tonal information is delayed compared to that of segmental information, with English speakers showing a larger delay than Chinese speakers."
   ],
   "doi": "10.21437/TAL.2016-21"
  },
  "liu16b_tal": {
   "authors": [
    [
     "Zenghui",
     "Liu"
    ],
    [
     "Hans",
     "Van de Velde"
    ],
    [
     "Aoju",
     "Chen"
    ]
   ],
   "title": "Prosodic focus marking in Dali Mandarin",
   "original": "23-LiuVandeVeldeChen",
   "page_count": 4,
   "order": 22,
   "p1": 103,
   "pn": 106,
   "abstract": [
    "﻿This study investigated prosodic marking of focus in Dali Mandarin, a variety of Xinan Guanhua (Southwestern Mandarin) spoken in Dali city, the capital of Dali Bai Autonomous Prefecture, China. Dali Mandarin as a variety of Mandarin has had heavy contact with Bai, a Tibeto-Burman language, for a long time. We adopted a semi-spontaneous experimental approach to elicit SVO sentences with different focus conditions. Our data showed that native speakers of Dali Mandarin lengthened the duration of focal constituents compared to non-focal constituents for marking focus. However, they did not use duration to distinguish focus types differing in size and contrastivity. Further, pitch played no role at all in signaling focus, or in differentiating focus types. These results thus suggested that Dali Mandarin speakers use prosody by exploiting duration to mark focus. Therefore, the encoding of focus in Dali Mandarin is more similar to Bai than to Beijing Mandarin, the latter being genetically more closely related to Dali Mandarin. This result suggests that prosodic focus marking in Dali Mandarin has been influenced by Bai due to the heavy language contact."
   ],
   "doi": "10.21437/TAL.2016-22"
  },
  "carterenyi16_tal": {
   "authors": [
    [
     "Aaron",
     "Carter-Ényi"
    ],
    [
     "Quintina",
     "Carter-Ényi"
    ]
   ],
   "title": "Perception of Syntagmatic Tone Intervals in Ìgbò and Yorùbá",
   "original": "24-CarterEnyi",
   "page_count": 4,
   "order": 23,
   "p1": 107,
   "pn": 110,
   "abstract": [
    "﻿This paper revisits the syntagmatic model of tone to see what perception has to say. We asked the question: Is word identification possible based on syntagmatic (relative) pitch information? Listeners were asked to identify words from a minimal pair without the context necessary for making paradigmatic (associative) judgments. 1409 Nigerian university students, staff and faculty responded to one of two parallel studies, one for Ìgbò and one for Yorùbá. The results suggest that word identification is closely tied to STI direction (+ 0 –) in Niger-Congo A tone languages. There is also evidence for a cross-language minimum STI distance of +1 or –2 semitones to leave a tone level and enter an adjacent tone level. Word identification based on STI magnitude alone (e.g. HM v. HL) is weaker. Paradigmatic features may be needed to differentiate homophones with HM and HL tone. This is consistent with recent findings by other researchers outside of the context of tone languages that suggest perceiving direction is automatic while judging magnitude is a higher level process [16]. In general, judging unidimensional magnitude is hard [17]."
   ],
   "doi": "10.21437/TAL.2016-23"
  },
  "das16_tal": {
   "authors": [
    [
     "Kalyan",
     "Das"
    ],
    [
     "Shakuntala",
     "Mahanta"
    ]
   ],
   "title": "Tonal Alignment and Prosodic Word domain in Boro",
   "original": "25-Das",
   "page_count": 5,
   "order": 24,
   "p1": 111,
   "pn": 115,
   "abstract": [
    "﻿This paper discusses the way morphological factors influence the distribution of lexical tones in Boro. Another objective of this paper is to unravel the underlying tonal nature of various prefixes and suffixes that participate in these processes. Boro is a tone language belonging to the Tibeto-Burman group. The language lexically distinguishes L and H tones. The TBU in Boro is the syllable and the lexical tone surfaces on the rightmost syllable both in derived and non-derived disyllabic words (Sarmah, 2004). The study presented here is based on data collected from 5 male speakers of Boro. The data set consisted of 175 scripted sentences containing the target words. The sentences were analysed by extracting their pitch contour using the software- Praat5.3.04_win32 (Boersma and Weenink, 2012). Results show that tonal specification of the affixes in Boro is related to a minimally disyllabic stem condition. Suffixes surface with their tone when they follow a disyllabic stem. Otherwise they surface with the lexical specification of the stem itself. This paper tries to show how a minimally disyllabic prosodic word domain condition regulates the occurrence of tones in Boro. This paper also tries to describe the prosodic status of derived and non-derived words in Boro."
   ],
   "doi": "10.21437/TAL.2016-24"
  },
  "li16b_tal": {
   "authors": [
    [
     "Yang",
     "Li"
    ]
   ],
   "title": "Complete and incomplete neutralisation in Fuzhou tone sandhi",
   "original": "26-Li",
   "page_count": 5,
   "order": 25,
   "p1": 116,
   "pn": 120,
   "abstract": [
    "﻿This is a study of incomplete neutralisation using Fuzhou tone sandhi as a test case. In Fuzhou Min, Tone 44 and Tone 232 undergo putative neutralisation into Tone 53 preceding a set of low tones, while T44 and T53 are neutralised into T44 preceding T53. Data from 10 Fuzhou speakers show the former neutralisation to be acoustically incomplete, with the sandhi tone of underlying Tone 44 having a higher pitch onset, while the latter appears to be acoustically complete. This result expands the typology of incomplete neutralisation by showing that two distinct phonological objects can incompletely neutralise (A / B → C) into a third object, as previous studies predominantly feature neutralisation of one object into another: A / B → B, e.g. Beijing tone sandhi T2/T3 → T2 / __ T3. It is argued that a hybrid model with both abstract categories and stored exemplars can best account for the data (Pierrehumbert, 2002 & 2006)."
   ],
   "doi": "10.21437/TAL.2016-25"
  },
  "sun16_tal": {
   "authors": [
    [
     "Xiaole",
     "Sun"
    ]
   ],
   "title": "Interaction between breathy tones and aspirated consonants in S'gaw Karen",
   "original": "27-Sun",
   "page_count": 4,
   "order": 26,
   "p1": 121,
   "pn": 124,
   "abstract": [
    "﻿This instrumental study first describes the five lexical tones in S’gaw Karen and their interaction with breathy, creaky and modal phonation types. It is found that there is a phonotactic restriction on onset consonant and phonation. The combination of an aspirated onset with a breathy high tone is exceptionally rare and an aspirated onset does not co-occur with a breathy low tone. Acoustically, the aspiration release causes breathiness at vowel onset, while tonal breathiness is distinguished from the consonant breathiness in terms of timing and magnitude. In addition, an aspirated stop has a shorter VOT with a breathy tone than with a modal tone. It appears that onset VOT is correlated with tones in S’gaw Karen. These findings demonstrate that the gap of CʰV̤ might result from avoidance of the ambiguity between the phonological vowel breathiness and the phonetic breathiness overlapped from the aspirated onset."
   ],
   "doi": "10.21437/TAL.2016-26"
  },
  "benn16_tal": {
   "authors": [
    [
     "Joshua",
     "Benn"
    ]
   ],
   "title": "Consonant-Tone-Phonation Interactions in Guienagati Zapotec",
   "original": "28-Benn",
   "page_count": 4,
   "order": 27,
   "p1": 125,
   "pn": 128,
   "abstract": [
    "﻿Guienagati Zapotec is one of three modern languages that comprise the Northeast Tehuantepec Zapotec (NETZ) subfamily. Like most Zapotec languages, Guienagati has a complex suprasegmental system involving contrastive tones and phonation types that both serve lexical and grammatical functions. There are also three types of codas: voiceless singleton, voiced singleton, and geminate. The distribution of coda type with respect to suprasegmental category of the preceding vowel is highly restricted. This study addresses the observation that geminate codas and voiceless singleton codas occur in complementary environments, despite evidence suggesting that the two consonant types are not allophonic. By comparing the three modern NETZ languages, the suprasegmental categories of Proto-NETZ are determined to have included breathiness in three environments: preceding geminate codas, and accompanying high tone or rearticulated phonation. In Guienagati, breathiness before geminate consonants was lost due to tonogenesis. Breathiness accompanying high tone and rearticulated phonation was lost due to the shift of [+spread glottis] rightward onto the coda, yielding the voiceless singleton series of consonants. This dual path to loss of breathiness helps to explain why voiceless singletons codas do not occur in the same environments as geminate codas."
   ],
   "doi": "10.21437/TAL.2016-27"
  },
  "liu16c_tal": {
   "authors": [
    [
     "Xiaoluan",
     "Liu"
    ],
    [
     "Yi",
     "Xu"
    ]
   ],
   "title": "Pitch perception and surprise in Mandarin Chinese: Evidence for parallel encoding via additive division of pitch range",
   "original": "29-LiuXu",
   "page_count": 4,
   "order": 28,
   "p1": 129,
   "pn": 132,
   "abstract": [
    "﻿This study addressed the question of how multiple layers of meanings can be simultaneously encoded with F0 in speech by assessing pitch perception thresholds of focus and surprise in Mandarin Chinese. We synthetically increased the pitch height of one syllable in a sentence up to 12 semitones from its neutral baseline in one-semitone steps, and asked listeners to judge the strength of focus and surprise conveyed by the manipulated utterances. Results showed that for the perception of focus, at least 4 semitones above the baseline were needed while for surprise, at least 7 semitones above were needed. Despite the threshold difference, there was a downward overlap of surprise with focus, i.e., the range of 7-12 semitones above the baseline signalled both focus and surprise. These results suggest that the pitch perception threshold for focus in Mandarin may be higher than that in non-tonal languages due to the use of F0 for lexical contrast in Mandarin. They also reveal, more intriguingly, an encoding mechanism of additive division of pitch range. That is, a higher-level function such as surprise is encoded by using additional pitch ranges beyond that used by lower-level functions such as focus and lexical tone, without harming the encoding of the lower-level functions."
   ],
   "doi": "10.21437/TAL.2016-28"
  },
  "wu16_tal": {
   "authors": [
    [
     "Mengyue",
     "Wu"
    ],
    [
     "Brett",
     "Baker"
    ],
    [
     "Janet",
     "Fletcher"
    ],
    [
     "Rikke",
     "Bundgaard-Nielsen"
    ]
   ],
   "title": "How Pitch Moves: Production of Cantonese Tones by Speakers with Different Tonal Experiences",
   "original": "30-WuBakerFletcherBundgaard-Nielsen",
   "page_count": 5,
   "order": 29,
   "p1": 133,
   "pn": 137,
   "abstract": [
    "﻿This study investigates how native prosodic systems as well as L2 learning experience shape non-native tone production in terms of tone movement, a primary cue to tone identity. In an imitation task, the six Cantonese tones were produced by four speaker groups: native Mandarin speakers (tonal), native English speakers (non-tonal), native English speakers with Mandarin learning experience (L2 tonal) and native Cantonese speakers (control group). The results indicate that native prosodic systems influence non-native tone production: Mandarin speakers are more accurate on pitch contour than pitch height while English speakers perform better on level tones than contour ones. Furthermore, L2 tonal experience assists L3 tone production, as English-speaking Mandarin learners produce Cantonese tones in the most native-like shape, outperforming both Mandarin and English speakers."
   ],
   "doi": "10.21437/TAL.2016-29"
  },
  "huang16_tal": {
   "authors": [
    [
     "Xunan",
     "Huang"
    ],
    [
     "Caicai",
     "Zhang"
    ],
    [
     "Feng",
     "Shi"
    ],
    [
     "Nan",
     "Yan"
    ],
    [
     "Lan",
     "Wang"
    ]
   ],
   "title": "Impaired Vowel Discrimination in Mandarin-speaking Congenital Amusics",
   "original": "31-HuangZhangShiYanWang",
   "page_count": 4,
   "order": 30,
   "p1": 138,
   "pn": 141,
   "abstract": [
    "﻿This paper investigates if individuals with amusia show deficits in the identification and discrimination of Mandarin vowels, with the aim of exploring whether the deficiency of the amusics lies in the acoustic processing of frequency, or in pitch processing. The results showed that the amusics performed comparably as the controls in vowel identification. For discrimination, both groups exhibited better discrimination for between-category pairs than within-category pairs, indicating that the amusics are not impaired in the categorical perception of vowels. However, amusics exhibited poorer accuracy than the controls in vowel discrimination across the board, irrespective of between- or within-category vowel pairs. Moreover, the participants’ vowel discrimination accuracy is significantly correlated to their musical ability, as indexed by the Montreal Battery of Evaluation of Amusia (MBEA) scores. The results suggest that individuals with congenital amusia might be impaired in frequency processing in general, a deficiency broader than originally believed."
   ],
   "doi": "10.21437/TAL.2016-30"
  },
  "gope16_tal": {
   "authors": [
    [
     "Amalesh",
     "Gope"
    ],
    [
     "Shakuntala",
     "Mahanta"
    ]
   ],
   "title": "Perception of Lexical Tones in Sylheti",
   "original": "32-GopeMahanta",
   "page_count": 5,
   "order": 31,
   "p1": 142,
   "pn": 146,
   "abstract": [
    "﻿Tone as a phonological category is capable of distinguishing the meanings of two lexical words by varying the pitch height and/or contour differences. In a tone language, it is indispensable for a hearer to perceive the f0 fluctuations (and the phonetic and phonological properties) associated with distinct speech signals that distinguish the lexical meanings (Yip 2004, Francis et. al 2003). To qualify as distinct tones, speech signals of (contrasting) words (with distinct tonal property, viz., high and low) must contain large enough f0 fluctuations between them so that the hearer can use the pitch difference as a cue to distinguish the lexical meanings (viz., high and low). This paper investigates the process of tone perception in Sylheti. A series of historical developments such as the loss of breathy voice contrasts, spirantization and deaffrication predominantly led to a high tone in Sylheti ([dáx 'drum' [dh>d], [dàx 'roar/call') (Gope & Mahanta, 2015, 2014). The results indicate that the Sylheti speakers by and large rely on f0 fluctuation in identifying the contrastive tones. Further, the trend of perception of contrastive tones also suggest that tones in Sylheti is perceived (mostly) in categorical manner."
   ],
   "doi": "10.21437/TAL.2016-31"
  },
  "tian16_tal": {
   "authors": [
    [
     "Jia",
     "Tian"
    ],
    [
     "Jianjing",
     "Kuang"
    ]
   ],
   "title": "Revisiting the Register Contrast in Shanghai Chinese",
   "original": "33-TianKuang",
   "page_count": 5,
   "order": 32,
   "p1": 147,
   "pn": 151,
   "abstract": [
    "﻿Earlier studies claimed that the contrastive tonal registers in the Shanghai dialect of Chinese were distinguished by contrastive phonation types, with the lower register showing breathier phonation. However, more recent studies found that younger speakers of Shanghai Chinese did not use phonation cues to contrast the tonal registers. The different results between the studies may indicate an ongoing sound change: phonation contrasts are merging among younger speakers. To better understand the phonetic realization of the tonal registers in Shanghai Chinese and to investigate whether a sound change is underway, speakers from both the older generation and the younger generation were recruited to produce pairs of words in different registers. Simultaneous audio and EGG signals were collected, and extensive acoustic and articulatory measurements were extracted. Significant age difference was found. Older speakers reliably produce contrastive phonation types for different registers, as demonstrated by significant differences in the overall spectral slope and the periodicity in acoustic signals, and the contact quotient in EGG signals. The lower register is breathier. In contrast, younger speakers do not produce breathier phonation for the lower register. This study provides evidence for the suggestion that Shanghai Chinese is gradually losing the breathy voice associated with the lower register."
   ],
   "doi": "10.21437/TAL.2016-32"
  },
  "twaha16_tal": {
   "authors": [
    [
     "Asim",
     "Twaha"
    ],
    [
     "Shakuntala",
     "Mahanta"
    ]
   ],
   "title": "Phonetic cues to contrastive focus in Standard Colloquial Assamese",
   "original": "34-TwahaMahanta",
   "page_count": 5,
   "order": 33,
   "p1": 152,
   "pn": 156,
   "abstract": [
    "﻿In this paper our goal is to investigate the phonetic cues of duration and pitch (F0) for contrastive focus (henceforth CF) in Standard Colloquial Assamese (henceforth SCA), spoken in the eastern part of Assam. SCA declarative utterances in non-final Phonological phrases (henceforth P-phrase) display rising pitch contours (L*HP) and the final constituent undergoes a smooth fall [1]. When a constituent is contrastively focused it forms a P-phrase with a low pitch accent (L*) and high focus boundary tone annotated with an ‘f’ immediately preceding it (fHP). It was also observed that phonetic cues such as increased pitch range and final syllable lengthening of focused sequence characterise CF [1]. In the experiment reported in this paper, longer string of sentences are considered with focus on three different constituents in order to observe the pre- and post-focus constituents along with the focused constituent. The results show that a constituent with CF has higher pitch and duration value compared to wide focus baseline; the pre-focus constituents though undergo pitch and duration reduction, the compression level is not statistically significant, and finally the post-focus constituents display a flattened pitch contour."
   ],
   "doi": "10.21437/TAL.2016-33"
  },
  "lai16_tal": {
   "authors": [
    [
     "Wei",
     "Lai"
    ],
    [
     "Jianjing",
     "Kuang"
    ]
   ],
   "title": "Prosodic grouping in Chinese trisyllabic structures by multiple cues—tone coarticulation, tone sandhi and consonant lenition",
   "original": "35-LaiKuang",
   "page_count": 5,
   "order": 34,
   "p1": 157,
   "pn": 161,
   "abstract": [
    "﻿Traditionally, the prosodic domain as has been called ‘foot’ in Mandarin Chinese is considered to be derivable from the application of Tone 3 sandhi rule. This study investigated the internal prosodic grouping of Chinese trisyllabic structures by examining multiple cues in parallel – tone coarticulation, tone sandhi application and consonant lenition. Analyses by tone coarticulation and consonant lenition were consistent with each other, both showing a grouping effect between the former two syllables in a trisyllabic structure. This pattern is especially evident on the fast speech rate condition. However, these analyses contradicted the analysis by tone sandhi, in that tone sandhi application indicated a prior grouping effect between the latter two syllables in trisyllabic nominal phrases and verbal phrases. The finding that tone sandhi domain violated the minor rhythmic unit reflected by consonant lenition and tone coarticulation suggested that foot formation and tone sandhi application might not be the same process in Mandarin. It was argued that “foot” was encoded and reflected by rhythmically organized phonetic cues such as pitch and timing, not by tone sandhi."
   ],
   "doi": "10.21437/TAL.2016-34"
  },
  "proto16_tal": {
   "authors": [
    [
     "Teresa",
     "Proto"
    ]
   ],
   "title": "Methods of analysis for tonal text-setting. The case study of Fe'Fe' Bamileke",
   "original": "36-Proto",
   "page_count": 5,
   "order": 35,
   "p1": 162,
   "pn": 166,
   "abstract": [
    "﻿This paper focuses on the interaction of speech tones and musical pitches in Fe'Fe' Bamileke, a Grassfields Bantu language of Cameroon. Like earlier studies of tonal text-setting, it aims to test the hypothesis that, in song, the melodic contour of tunes matches the tonal contour of the lyrics. The study is based on four songs and was carried out with the help of a native speaker who provided the songs and accurate feedback on the musical settings. His acceptability judgments of musical settings in song #4 were integrated into the study to complement the evidence from song data. Most of the paper is a detailed discussion of the findings, and the methodology employed for measuring the degree of correspondence between speech and song. Some issues with a bearing on the interpretation of the data are addressed, and alternative analyses are proposed. It is argued that all of the suggested analyses have drawbacks and, as revealed through a comparison of the different sets of results, need to be supplemented with qualitative approaches that evaluate the interaction between the phonological and musical systems involved."
   ],
   "doi": "10.21437/TAL.2016-35"
  },
  "chow16_tal": {
   "authors": [
    [
     "Una",
     "Chow"
    ],
    [
     "Stephen",
     "Winters"
    ]
   ],
   "title": "The Role of the Final Tone in Singaling Statements and Questions in Mandarin",
   "original": "37-ChowWinters",
   "page_count": 5,
   "order": 36,
   "p1": 167,
   "pn": 171,
   "abstract": [
    "﻿This study investigated the role of the F0 height of the final tone in signaling the difference between Mandarin statements and echo questions. We recorded native speakers producing pairs of statements and echo questions ending in the four Mandarin tones (high, rising, low, and falling). The first two syllables of the utterances comprised pairs of high and low tones, or rising and falling tones. From these pairs of tones, we extracted the speaker’s F0 range at the start of the utterance. With the speaker’s initial F0 range serving as a baseline, we compared the difference between statements and echo questions in two ways: 1) using the overall mean of the F0 height of the final tone of each sentence type, and 2) using the mean difference in F0 height of the final tone between the sentences in each statement-question pair. The results of ANOVAs suggest that the F0 height of the final tone is a potential cue for the identification of statements versus echo questions in Mandarin. However, since significant differences in F0 were found between only some of the final tonal pairs, native speakers must also use other prosodic cues to distinguish statements from echo questions in Mandarin."
   ],
   "doi": "10.21437/TAL.2016-36"
  }
 },
 "sessions": [
  {
   "title": "Plenary Talks",
   "papers": [
    "tessmer16_tal",
    "hyman16_tal",
    "zhang16_tal"
   ]
  },
  {
   "title": "Oral Sessions",
   "papers": [
    "chien16_tal",
    "liu16_tal",
    "alexander16_tal",
    "li16_tal",
    "kugler16_tal",
    "mcpherson16_tal",
    "kirby16_tal",
    "luo16_tal",
    "perkins16_tal",
    "brunelle16_tal",
    "erickson16_tal",
    "wang16_tal",
    "lee16_tal",
    "franich16_tal",
    "chen16_tal",
    "ling16_tal",
    "zhang16b_tal"
   ]
  },
  {
   "title": "Poster Sessions",
   "papers": [
    "connell16_tal",
    "liu16b_tal",
    "carterenyi16_tal",
    "das16_tal",
    "li16b_tal",
    "sun16_tal",
    "benn16_tal",
    "liu16c_tal",
    "wu16_tal",
    "huang16_tal",
    "gope16_tal",
    "tian16_tal",
    "twaha16_tal",
    "lai16_tal",
    "proto16_tal",
    "chow16_tal"
   ]
  }
 ],
 "doi": "10.21437/TAL.2016"
}