{
 "title": "Voice Quality: Functions, Analysis and Synthesis (VOQUAL 2003)",
 "location": "Geneva, Switzerland",
 "startDate": "27/8/2003",
 "endDate": "29/8/2003",
 "conf": "VOQUAL",
 "year": "2003",
 "name": "voqual_2003",
 "series": "",
 "SIG": "",
 "title1": "Voice Quality: Functions, Analysis and Synthesis",
 "title2": "(VOQUAL 2003)",
 "date": "27-29 August 2003",
 "papers": {
  "fourcin03_voqual": {
   "authors": [
    [
     "Adrian",
     "Fourcin"
    ]
   ],
   "title": "Phonetics and measurements of voice quality",
   "original": "voq3_011",
   "page_count": 2,
   "order": 1,
   "p1": "11",
   "pn": "11",
   "abstract": [
    "\"Voice\" is often used to refer to speech as a whole but historically, in work in Phonetics, there are long established precedents for defining voice with reference to activity at the level of the larynx. The measurement of voice is then made with special reference to those aspects of vocal tract excitation that are associated with the control and vibration of the vocal folds and associated laryngeal structures. This is also the theme of the present overview, and six related areas of voice measurement are discussed:\n",
    "direct vocal fold imaging gives a basic way of classifying salient characteristics of vocal fold vibration and of distinguishing between modes of voice production auditory criteria determine, and provide the basis for defining, the primary subjective dimensions of voice the most widespread methods of quantitative voice quality assessment are based on the use of sustained vowel sounds and auditory criteria make it possible to set up a practical reference frame for their measurement that is quite different from that used in ordinary speech transmission in communication engineering another set of pitch criteria are similarly needed for the adequate representation of voice in fluent speech and their application is discussed in the analysis of normal, pathological and synthetic voices the relation between closing and opening is an obvious feature of vocal fold imaging and the techniques used for measuring pitch related aspects of voice can also be applied to the analysis of closed phase ratio in normal and pathological voice.\n",
    "",
    "",
    "The final discussion concerns the implications of these approaches for future developments in quantitative cross-language comparison and clinical diagnosis.\n",
    ""
   ]
  },
  "doval03_voqual": {
   "authors": [
    [
     "Boris",
     "Doval"
    ],
    [
     "Christophe",
     "d'Alessandro"
    ],
    [
     "Nathalie",
     "Henrich"
    ]
   ],
   "title": "The voice source as a causal/anticausal linear filter",
   "original": "voq3_016",
   "page_count": 6,
   "order": 2,
   "p1": "16",
   "pn": "20",
   "abstract": [
    "A new type of glottal flow model, namely a causal-anticausal linear filter model, is proposed. It is shown that the glottal flow signal can be considered as the impulse response of a linear filter. Then the source/filter speech model can be interpreted as an excitation/filter speech model, the \"filter\" comprising the glottal flow, vocal tract and radiation components. The spectral features of the voice source models are reviewed, both in the amplitude and phase domains. In the spectral amplitude domain the main features are a spectral maximum (the \"glottal formant\") and spectral tilt. Evidence for a mixed causal/anticausal phase behavior of the source is given. Then, a causal-anticausal linear filter voice source model is designed. In conclusion, applications of this new approach are discussed for voice quality modification, voice source estimation, voice quality perception.\n",
    ""
   ]
  },
  "bozkurt03_voqual": {
   "authors": [
    [
     "Baris",
     "Bozkurt"
    ],
    [
     "Thierry",
     "Dutoit"
    ]
   ],
   "title": "Mixed-phase speech modeling and formant estimation, using differential phase spectrums",
   "original": "voq3_021",
   "page_count": 4,
   "order": 3,
   "p1": "21",
   "pn": "24",
   "abstract": [
    "This paper introduces a new speech model, termed as the mixed-phase model, based on the assumption that the speech signal is produced by convolution of a maximum phase glottal excitation signal with a minimum phase vocal tract filter impulse response. The glottal excitation signal is assumed to be an anti-causal stable signal and the vocal tract filter is assumed to be causal and stable. For estimating resonances of the maximum phase signal (source) and the minimum phase filter (vocal tract filter), use of differential phase spectrums of z-transforms is proposed.\n",
    ""
   ]
  },
  "bjorkner03_voqual": {
   "authors": [
    [
     "Eva",
     "Björkner"
    ],
    [
     "Johan",
     "Sundberg"
    ]
   ],
   "title": "MR and area function study of throaty voice quality",
   "original": "voq3_025",
   "page_count": 4,
   "order": 4,
   "p1": "25",
   "pn": "28",
   "abstract": [
    "Abstract \"Throaty\" is a term used for voice quality, generally pejorative, but sometimes considered as a desirable timbral ornament in non-classical singing. The throatiness of a male subjects examples of the vowels /u, i, a, ae/ pronounced in throaty and normal voice were rated by an expert panel, showing that the examples were representative. The formant frequencies of these vowels were analysed by inverse filtering, revealing a consistently higher F1 in the throaty versions. The same subjects vocal tract profiles for these vowels, pronounced in the two qualities, were documented by MR imaging and the area functions were computed. Their formant frequencies showed reasonably similar differences between the two qualities, discrepancies presumably resulting from lack of information on lip conditions and larynx height.\n",
    ""
   ]
  },
  "arroabarren03_voqual": {
   "authors": [
    [
     "Ixone",
     "Arroabarren"
    ],
    [
     "Alfonso",
     "Carlosena"
    ]
   ],
   "title": "Glottal source parameterization: a comparative study",
   "original": "voq3_029",
   "page_count": 6,
   "order": 5,
   "p1": "29",
   "pn": "34",
   "abstract": [
    "In this paper two parameterization methods are jointly studied and compared, namely the Normalized Amplitude Quotient (NAQ) and the Parabolic Spectral Parameter (PSP), which are different ways of glottal source characterization, in the time and frequency domains, respectively. First, a theoretical study for the derivative of the glottal source is carried out based on the LF model, and it is proved that the two above mentioned parameters represent globally the glottal source, in the sense that they are dependent on the three main characteristics of the glottal source: the open quotient, the asymmetry coefficient and the spectral tilt. Considering this implicit dependence it is shown that both parameters are correlated. Last, natural speech signals, from the workshop database, are analyzed and the performance of both parameters is analyzed in terms of their robustness.\n",
    ""
   ]
  },
  "orr03_voqual": {
   "authors": [
    [
     "Rosemary",
     "Orr"
    ],
    [
     "Bert",
     "Cranen"
    ],
    [
     "Felix I. C. R. S. de",
     "Jong"
    ]
   ],
   "title": "An investigation of the parameters derived from the inverse filtering of flow and microphone signals",
   "original": "voq3_035",
   "page_count": 6,
   "order": 6,
   "p1": "35",
   "pn": "40",
   "abstract": [
    "This paper is a part of a project concerning the finding of objective characteristics of susceptibility to voice strain. In that project, measurements were made of simultaneous recordings of microphone speech, oral flow, oral pressure and EGG. A comparison is made of parameters extracted from the inverse filtered waveforms of oral flow and speech pressure from these recordings, that is, with and without a face-mask.\n",
    "Microphone and flow recordings of the syllable /pæ/ were inverse filtered. The parameters speed quotient (SQ), open quotient (OQ), the amplitude difference between the first and second harmonic (H1-H2), and a measure of spectral slope were extracted from the glottal wave form.\n",
    "Initial analysis was intended to show a correlation between the parameter values for mask and non-mask recordings. The expected correlation was not forthcoming, and a re-assessment of the methodology was required.\n",
    "A repeated measures analysis of variance was then carried out to examine the effects of three independent variables: presence of the flow-mask, presence of an endoscope, and voicing condition. The results showed that the presence of the mask used for the flow recordings had a significant effect on the parameters which were examined.\n",
    "The explanation for these results include the psychological effect of the mask, inconsistent voicing strategies on behalf of the subjects, possible large within-speaker variation, and the acoustic effects of the flow mask.\n",
    ""
   ]
  },
  "tooher03_voqual": {
   "authors": [
    [
     "Michelle",
     "Tooher"
    ],
    [
     "John G.",
     "McKenna"
    ]
   ],
   "title": "Variation of glottal LF parameters across F0, vowels, and phonetic environment",
   "original": "voq3_041",
   "page_count": 6,
   "order": 7,
   "p1": "41",
   "pn": "46",
   "abstract": [
    "The following paper presents the results of a study of glottal source parameters and their behaviour across vowels, contexts and fundamental frequency. The utterances collected consisted of multiple recordings of three vowels in 4 different contexts, across seven different pitches from two male speakers. The vowels were extracted, automatically inverse filtered using a Kalman filter based linear prediction technique, and the Liljencrants-Fant model was automatically fitted to the resulting glottal flow derivative yielding the glottal flow parameters. Results obtained generally followed our expectations, and previous research in the area. The timing parameters do vary with fundamental frequency, however they do not vary uniformly. Parameters are also influenced slightly by both phonetic environment and the vowel utterance and patterns are apparent across both speakers.\n",
    ""
   ]
  },
  "hirtum03_voqual": {
   "authors": [
    [
     "Annemie van",
     "Hirtum"
    ],
    [
     "Ines",
     "Lopez"
    ],
    [
     "Mico",
     "Hirschberg"
    ],
    [
     "Xavier",
     "Pelorson"
    ]
   ],
   "title": "On the relationship between input parameters in the two-mass vocal-fold model with acoustical coupling and signal parameters of the glottal flow",
   "original": "voq3_047",
   "page_count": 4,
   "order": 8,
   "p1": "47",
   "pn": "50",
   "abstract": [
    "In this paper the sensitivity of the two-mass model with acoustical coupling to the model input-parameters is assessed. The model-output or the glottal volume air flow is characterised by signal-parameters in the time-domain. The influence of changing input-parameters on the signal-parameters is quantified.\n",
    ""
   ]
  },
  "chapmanaua03_voqual": {
   "authors": [
    [
     "Janice",
     "Chapman Aua"
    ]
   ],
   "title": "Voice quality and the singing voice",
   "original": "voq3_053",
   "page_count": 0,
   "order": 9,
   "p1": "53",
   "pn": "",
   "abstract": [
    "Singing is part of all known human cultures and is an intrinsic expression of our human need to communicate. Babies are born with a functional and effective vocal apparatus, having practised in utero. They communicate vocally before they develop language, and their range of vocal sounds arises from their emotional motor system. It is my strong belief that singing, at best, also emanates from a human need to make emotional connections with others.\n",
    "Singing in a classical style makes considerable demands on the vocal instrument especially in the operatic arena where vocal efficiency is an imperative for survival. After 40 years as a singer and 25 as a teacher (overlapping, I hasten to add) I am of the opinion that a holistic connection to the emotional motor system is crucial in meeting the demands of this art form. The voice must carry the main burden of the emotional message, not just in the text, but incorporated in the quality of the sound the singer is making. This emotional message in the sound also contains the potential for the \"goose bump\" factor in the listeners.\n",
    "My pedagogical model is an incremental one, dealing first with core components:\n",
    "Primal sound Postural alignment reathing and support\n",
    "Once these components are in place, I move on to deal with Phonation and the speaking voice Resonance Articulation Artistry and performance\n",
    "While all these components overlap, interact and are visited many times, the holistic nature of singing can begin to emerge quite early on in the process. Many things get in the way of finding this easy \"zone\" for singers, particularly breathing strategies of some teachers which contravene the bodys natural respiratory functions.\n",
    "This tutorial will be in a workshop mode. In exploring voice qualities and the factors which influence their production, I plan to demonstrate using young professional singers and delegates own voices.\n",
    ""
   ]
  },
  "kreiman03_voqual": {
   "authors": [
    [
     "Jody",
     "Kreiman"
    ],
    [
     "Bruce R.",
     "Gerratt"
    ]
   ],
   "title": "Jitter, shimmer, and noise in pathological voice quality perception",
   "original": "voq3_057",
   "page_count": 6,
   "order": 10,
   "p1": "57",
   "pn": "62",
   "abstract": [
    "Although jitter, shimmer, and turbulent noise characterize all voice signals, their perceptual importance has not been established psychoacoustically. To determine which of these acoustic attributes is important in listeners perceptions of pathologic voices, listeners used a speech synthesizer to adjust levels of jitter, shimmer, and noise so that synthetic voices matched natural pathological voices. Results show that listeners perceived spectrally-shaped, additive noise as the critical inharmonic acoustic element contributing to pathologic voice quality. Listeners proved highly insensitive to the amounts of jitter and shimmer present in a voice sample. These results suggest that jitter and shimmer are not useful indices of voice quality.\n",
    ""
   ]
  },
  "manfredi03_voqual": {
   "authors": [
    [
     "Claudia",
     "Manfredi"
    ],
    [
     "Fabrizio",
     "Dori"
    ],
    [
     "Ernesto",
     "Iadanza"
    ]
   ],
   "title": "Improvement in hoarse voice denoising for real-time DSP implementation",
   "original": "voq3_063",
   "page_count": 6,
   "order": 11,
   "p1": "63",
   "pn": "68",
   "abstract": [
    "Voice hoarseness is mainly related to airflow turbulence in the vocal tract. It can be due to vocal fold paralysis, polyps, cordectomisation or other dysfunction, which alter regular speech production, and is commonly treated as a noise component in the speech signal. A denoising approach is proposed, based on low-order singular value decomposition (SVD) of matrices whose entries come from sampled speech data frames, properly organised. A prototype DSP board implementing the procedure was developed, by means of properly optimised C and Assembler code. Enhanced results are obtained with respect to a previous scheme, by introducing a normalization step on the signal amplitude dynamics. This allows increasing the output level, as well as reducing click-noise, both due to the algorithm structure and DSP implementation constraints. Objective quality indexes are proposed, showing the better results achieved with the proposed modifications.\n",
    ""
   ]
  },
  "bettens03_voqual": {
   "authors": [
    [
     "Frédéric",
     "Bettens"
    ],
    [
     "Francis",
     "Grenez"
    ],
    [
     "Jean",
     "Schoentgen"
    ]
   ],
   "title": "Assessment of vocal noise via bi-directional long-term linear prediction of running speech",
   "original": "voq3_069",
   "page_count": 4,
   "order": 12,
   "p1": "69",
   "pn": "72",
   "abstract": [
    "The presentation concerns the segregation of vocal noise by means of linear predictive analysis of running speech. Forward double linear predictive analysis has been proposed earlier as a tool to isolate vocal noise from speech signals produced by dysphonic speakers. Double linear predictive analysis involves a short-term and a long-term prediction stage. Long-term linear predictive analysis concerns the prediction of the present speech cycle by means of past ones. Problems with this analysis method are the following. The short-term linear predictive analysis stage is less suited for clinical analyses of speech, because the short-term linear prediction error may not only increase with vocal noise but also with speech and speaker properties that are not related to vocal pathologies. Also, the long-term predictive analysis stage focuses exclusively on the short-term prediction error, discarding any vocal noise that remains in the short-term predicted signal (that is, the weighted sum of past speech samples). Finally, the forward long-term prediction error comprises inflated error transients near the beginning of the recording interval, as well as in the vicinity of the boundaries between voiced and unvoiced speech sounds. The purpose of the presentation is to show that these problems can be solved by a forward and backward long-term predictive analysis of speech, within which the short-term predictive analysis stage can be omitted. A vocal noise cue is calculated that enables comparing forward and bi-directional, as well as double and long-term predictive analyses on a subset of sentences of the \"il est sorti avant le jour\" corpus.\n",
    ""
   ]
  },
  "meltzner03_voqual": {
   "authors": [
    [
     "Geoffrey S.",
     "Meltzner"
    ],
    [
     "Robert E.",
     "Hillman"
    ]
   ],
   "title": "Impact of abnormal acoustic properties on the perceived quality of electrolaryngeal speech",
   "original": "voq3_073",
   "page_count": 6,
   "order": 13,
   "p1": "73",
   "pn": "78",
   "abstract": [
    "A large percentage of patients who have undergone laryngectomy to treat advanced laryngeal cancer rely on an electrolarynx (EL) to verbally communicate. While serviceable, EL speech is plagued by shortcomings in both quality and intelligibility. As part of a larger ongoing effort to improve the oral communication of EL users, this study has attempted to better quantify the sources and perceptual impact of abnormal acoustic properties typically found in EL speech. EL speech tokens that were enhanced using combinations of three different improvements, low frequency enhancement, self-noise reduction, and added pitch information were presented in pairs to a group of ten listeners. Listeners were asked to judge which of the two tokens sounded most like normal natural speech and then to rate on a visual analog scale how different the chosen token was from normal speech. The results indicate that although EL speech can be most improved by removing its self-noise and providing proper pitch information, the resulting quality is still well below that of normal natural speech or even that of monotonous natural speech. This suggests that in order to effectively improve the quality of EL speech, other attributes that contribute to its unnatural quality must be explored and corrected.\n",
    ""
   ]
  },
  "alku03_voqual": {
   "authors": [
    [
     "Paavo",
     "Alku"
    ]
   ],
   "title": "Parameterisation Methods of the Glottal Flow Estimated by Inverse Filtering",
   "original": "voq3_081",
   "page_count": 8,
   "order": 14,
   "p1": "81",
   "pn": "88",
   "abstract": [
    "Estimation of the source of voiced speech, the glottal volume velocity waveform, with inverse filtering involves usually a parameterisation stage, where the obtained flow waveforms are expressed in numerical forms. This stage of the voice source analysis, the parameterisation of the glottal flow, is discussed in the present paper. The paper aims to give a review on the different methods developed for the parameterisation and it discusses how these parameters have reflected function of the voice source in various voice production studies.\n",
    ""
   ]
  },
  "kukharchik03_voqual": {
   "authors": [
    [
     "Peter D.",
     "Kukharchik"
    ],
    [
     "Igor E.",
     "Kheidorov"
    ],
    [
     "Hanna M.",
     "Lukashevich"
    ],
    [
     "Denis L.",
     "Mitrofanov"
    ]
   ],
   "title": "Entropy and dynamism criteria for voice quality classification applications",
   "original": "voq3_091",
   "page_count": 6,
   "order": 15,
   "p1": "91",
   "pn": "96",
   "abstract": [
    "We describe the voice quality classification system that uses entropy and dynamism criteria as discrimination features. The main idea of this approach is that the input neural net is considered as an informational channel. Channel tuned to the certain type of information transmits it best of all according to the informational criterion. In our case a multilayer perceptron (MLP) emitted posterior probabilities for speech recognition was used as such information channel. Then two features entropy and dynamism were computed using these posterior probabilities. And finally HMM was used as a classifier. Different experiments demonstrated efficient usage possibilities of entropy and dynamism criteria not only in audio classification tasks but also in the voice quality classification applications.\n",
    ""
   ]
  },
  "keller03_voqual": {
   "authors": [
    [
     "Eric",
     "Keller"
    ]
   ],
   "title": "Voice characteristics of MARSEC speakers",
   "original": "voq3_097",
   "page_count": 6,
   "order": 16,
   "p1": "97",
   "pn": "102",
   "abstract": [
    "An examination of Bark scale spectra of some 30'000 vowel nuclei from the Marsec corpus showed significant voice quality differences for sex and speech style. Of the two, speech style appeared to be the stronger predictor in multiple correlation analyses. Clustering further documented the effects of speech style, with hierarchical clustering grouping voice profiles of similar-sounding styles. Sports, news and market reports were at one end of the clustering tree, while fiction, poetry and dialogues occupied other distinctive areas on the tree. Further, a factor analysis of the Bark scale spectrum showed four areas of relatively independent variation for the common speech frequencies involved in transmitting voice quality, indicating that considerable parameter reduction is possible in the prediction of voice quality-related spectral variation. The results suggest that high-quality spectrallybased speech synthesis systems could profit from a systematic biasing of spectral profiles to convey vocal quality, particularly in the lower frequencies (up to 600 Hz) and in the higher frequencies of speech (above 1600 Hz).\n",
    ""
   ]
  },
  "gutierrezarriola03_voqual": {
   "authors": [
    [
     "Juana M.",
     "Gutiérrez-Arriola"
    ],
    [
     "Juan Manuel",
     "Montero"
    ],
    [
     "Ricardo",
     "Córdoba"
    ],
    [
     "José Manuel",
     "Pardo"
    ]
   ],
   "title": "Analysis of parameter importance in speaker identity",
   "original": "voq3_103",
   "page_count": 4,
   "order": 17,
   "p1": "103",
   "pn": "106",
   "abstract": [
    "We present the analysis performed over eleven speakers (five women and 6 men) in order to obtain the most important parameters as far as speaker identity is concerned. Parameters that have been studi studied are F0, six formants, five bandwidths ed and four source parameters. Feature selection is based on linear discriminant analysis. Results show that the most relevant parameter is F0, followed by formant frequencies and open quotient.\n",
    ""
   ]
  },
  "kawahara03_voqual": {
   "authors": [
    [
     "Hideki",
     "Kawahara"
    ]
   ],
   "title": "Exemplar-based voice quality analysis and control using a high quality auditory morphing procedure based on STRAIGHT",
   "original": "voq3_109",
   "page_count": 6,
   "order": 18,
   "p1": "109",
   "pn": "114",
   "abstract": [
    "This paper tries to introduce a new strategy and tools for voice quality research that complements conventional approaches. A very high-quality speech analysis, modification and synthesis procedure STRAIGHT, which is basically a channel VOCODER based on a pitch-synchronous analysis synthesis framework, was extended to implement auditory morphing in terms of spectral, pitch and voice quality parameters. This extension enables voice quality modification by parametric transformation using STRAIGHT. It also enables an exemplar-based research strategy for perceptual aspects of voice quality analysis and control. In other words, manipulated synthetic voice having virtually equivalent naturalness to natural voice introduces a mean to perform a unique research strategy called systematic downgrading, that is suitable especially for para- and nonlinguistic aspects of human vocalization. In addition to morphing procedure, a set of visualization techniques were introduced based on fixed-point analyses in the time and the frequency domain for assisting exploratory data analysis that is indispensable in voice quality research.\n",
    ""
   ]
  },
  "kreiman03b_voqual": {
   "authors": [
    [
     "Jody",
     "Kreiman"
    ],
    [
     "Diana",
     "Vanlancker-Sidtis"
    ],
    [
     "Bruce R.",
     "Gerratt"
    ]
   ],
   "title": "Defining and measuring voice quality",
   "original": "voq3_115",
   "page_count": 6,
   "order": 19,
   "p1": "115",
   "pn": "120",
   "abstract": [
    "Although voices provide listeners with significant information about speakers, defining and measuring voice quality remain elusive goals. We argue that the much-maligned ANSI standard definition of sound quality is in fact an appropriate definition, because it treats quality as the result of a perceptual process rather than a fixed quantity, and highlights the interaction between listeners and signals in determining quality in the context of specific perceptual goals. Which aspects of the signal are important will depend on the task, the characteristics of the stimuli, the listeners background, perceptual habits, and so on. Given the many kinds of information listeners extract from voice signals, it is not surprising that these characteristics vary from task to task, voice to voice, and listener to listener. Application of speech synthesis in method-of-adjustment tasks allows measurement of quality psychoacoustically as those aspects of the signal that allow a listener to determine that two sounds of equal pitch and loudness are different, and holds promise for improving the reliability and validity of measures of voice quality.\n",
    ""
   ]
  },
  "rao03_voqual": {
   "authors": [
    [
     "Preeti",
     "Rao"
    ],
    [
     "Pushkar",
     "Patwardhan"
    ]
   ],
   "title": "On the representation of voice source aperiodicities in the MBE speech coding model",
   "original": "voq3_121",
   "page_count": 6,
   "order": 20,
   "p1": "121",
   "pn": "126",
   "abstract": [
    "We present an investigation of the representation of voice source aperiodicities in the Multi-Band Excitation (MBE) speech model for the compression of narrowband speech. The MBE model is a fixed-frame based analysis-synthesis algorithm which combines harmonic and stochastic components to reconstruct speech from estimated model parameters. Pitch cycle perturbations, such as jitter and shimmer, are not captured accurately in the framewise constant parameter estimates, thus impacting the reproduced voice quality. The actual dependence of MBE reconstructed voice quality on the voice pitch and the type of perturbation are explored through objective measurements and subjective listening with synthetic and natural speech.\n",
    ""
   ]
  },
  "drioli03_voqual": {
   "authors": [
    [
     "Carlo",
     "Drioli"
    ],
    [
     "Graziano",
     "Tisato"
    ],
    [
     "Piero",
     "Cosi"
    ],
    [
     "Fabio",
     "Tesser"
    ]
   ],
   "title": "Emotions and voice quality: experiments with sinusoidal modeling",
   "original": "voq3_127",
   "page_count": 6,
   "order": 21,
   "p1": "127",
   "pn": "132",
   "abstract": [
    "Voice quality is recognized to play an important role for the rendering of emotions in verbal communication. In this paper we explore the effectiveness of a sinusoidal modeling processing framework for voice transformations finalized to the analysis and synthesis of emotive speech. A set of acoustic cues is selected to compare the voice quality characteristics of the speech signals on a voice corpus in which different emotions are reproduced. The sinusoidal signal processing tool is used to convert a neutral utterance into emotive utterances. Two different procedures are applied and compared: in the first one, only the alignment of phoneme duration and of pitch contour is performed; the second procedure refines the transformations by using a spectral conversion function. This refinement improves the reproduction of the different voice qualities of the target emotive utterances. The acoustic cues extracted from the transformed utterances are compared to the emotive original utterances, and the properties and quality of the transformation method are discussed.\n",
    ""
   ]
  },
  "mokhtari03_voqual": {
   "authors": [
    [
     "Parham",
     "Mokhtari"
    ],
    [
     "Hartmut R.",
     "Pfitzinger"
    ],
    [
     "Carlos Toshinori",
     "Ishi"
    ]
   ],
   "title": "Principal components of glottal waveforms: towards parameterisation and manipulation of laryngeal voice quality",
   "original": "voq3_133",
   "page_count": 6,
   "order": 22,
   "p1": "133",
   "pn": "138",
   "abstract": [
    "We propose a more holistic approach to modelling of the glottal volume-velocita waveform and its derivative. Principal components analysis (PCA) is applied to single-cycle glottal waveforms measured in Laver's (1980) recorded speech data representing several phonation types. The first four principal component lend themselves to qualitative interpretations, and account for over 90% of the total variance. Decision trees generated using those components yield around 64% accuracy in classifying the 13 voice qualities analysed. This approach is capable of modelling a wide variety of voice qualities, and should therefore be useful in speech synthesis.\n",
    ""
   ]
  },
  "story03_voqual": {
   "authors": [
    [
     "Brad H.",
     "Story"
    ]
   ],
   "title": "Physical modeling of voice and voice quality",
   "original": "voq3_141",
   "page_count": 8,
   "order": 23,
   "p1": "141",
   "pn": "148",
   "abstract": [
    "Physical modeling of the phonatory and vocal tract systems has served as a useful tool to study many aspects of speech production. This paper offers a brief review of two specific types of physically-based models. One for simulating the vibration of the vocal folds and another for representing the vocal tract shape in the form of an area function. While much of the technical detail of these models has been presented elsewhere, the emphasis here will be on providing examples of how physical models may be used for studying voice quality.\n",
    ""
   ]
  },
  "gobl03_voqual": {
   "authors": [
    [
     "Christer",
     "Gobl"
    ],
    [
     "Ailbhe",
     "Ní Chasaide"
    ]
   ],
   "title": "Amplitude-Based Source Parameters for Measuring Voice Quality",
   "original": "voq3_151",
   "page_count": 6,
   "order": 24,
   "p1": "151",
   "pn": "156",
   "abstract": [
    "This paper explores amplitude-based measures of the glottal  flow signal, as it has been suggested that they may provide a  more robust method for analysing voice quality than the more  typical time-based ones. Centred around an analysis of some  samples from the VOQUAL03 Speech database 2 of Japanese  spontaneous speech, this paper (i) presents a discussion of  whether a single global source parameter, such as the effective  pulse declination time (which can be calculated from two amplitudes) or the T0-normalised equivalent, is likely to capture  the tense-lax dimension of voice quality differentiation, across  tokens exhibiting large f0 differences; (ii) presents  formulations for an extended set of amplitude-based source parameters, to provide a richer coverage of voice source variation,  and (iii) compares results for the amplitude vs. time-based  measures.  Results for (i) indicate that the non-normalised  measure AQ is more effective in capturing tenselax differences across a large f0 range than the normalised NAQ.  Results for (iii) show a promising correspondence between the  proposed amplitude-based measures and the time-based ones.  A brief description is given of our planned research on Irish  prosody, for which these measures will be important.\n",
    ""
   ]
  },
  "ito03_voqual": {
   "authors": [
    [
     "Mika",
     "Ito"
    ]
   ],
   "title": "The contribution of voice quality to politeness in Japanese",
   "original": "voq3_157",
   "page_count": 6,
   "order": 25,
   "p1": "157",
   "pn": "162",
   "abstract": [
    "This study investigates the contribution of voice quality to the expression of \"positive politeness\" under varying conditions of relative social status between male speakers of Japanese. In previous studies, suprasegmental features have been found to express politeness. Bandwidth of the first formant (BW1) was also found to be relevant to perceived politeness. However, the association between BW1 and voice quality is complex. BW1 could be a parameter indicating breathiness, whispering, or nasality. In order to clarify the contribution of voice quality, in this study, spectral tilt and aspiration noise in high frequency region were observed as the focus of interest. Vowel data (/a/) extracted from natural utterances produced by two male native speakers of Tokyo dialect were observed. For measurement of breathiness, the method suggested by Hanson (1995) was employed in order to avoid known disadvantages of inverse filtering. Acoustic parameters were observed separately between two speakers, one whose overall BW1 was wide and whose speech were perceived as polite, and the other whose BW1 showed negative correlation with perceived politeness. The result indicates two tendencies. Firstly, when a speaker had overall wide BW1 and was rated polite overall, the ratings with aspiration noise in high frequency region showed positive correlation with politeness. Secondly, when a speaker showed negative correlation between BW1 and politeness, the speaker also showed negative correlation between spectral tilt and politeness, but showed no correlation with aspiration noise rated. Overall, it seems that when a speaker is rated polite, the speakers politeness is associated more with aspiration noise, and therefore related to breathiness.\n",
    ""
   ]
  },
  "bruckl03_voqual": {
   "authors": [
    [
     "Markus",
     "Brückl"
    ],
    [
     "Walter",
     "Sendlmeier"
    ]
   ],
   "title": "Aging female voices: an acoustic and perceptive analysis",
   "original": "voq3_163",
   "page_count": 6,
   "order": 26,
   "p1": "163",
   "pn": "168",
   "abstract": [
    "This study examines the changes in adult female voices due to the aging process. Acoustic cues in voices that enable listeners to recognize a speakers vocal age are specified as well as acoustic cues that straightly indicate the speakers chronological age.\n",
    "The analysed data are recordings of the voices of 56 female speakers differing in age. The recorded speech samples include sustained vowels, read speech and spontaneous speech. Our methods are acoustic analyses and perception tests. The perception tests are designed to analyse the influence of the vowel onset on the amount of information about aging transferred by sustained vowels. The acoustic evaluation comprises phonic parameters like measurements of stability of voice or of vocal tremor which are supposed to reflect voice qualities that are expected to vary with age. Changes in tempo of articulation are also investigated.\n",
    "We found that increasing amplitude perturbation is an indicator of increasing age even on the basis of spontaneous speech. Reading rate decreases with increasing age, whereas there is no significant change in articulation rate of spontaneous speech in womens voices. Based on sustained vowels of female voices, the frequency tremor intensity index indicates age more accurately than F0 and amplitude perturbations. We also found evidence for the relevance of the vowel onset to recognize age more accurately.\n",
    ""
   ]
  },
  "banziger03_voqual": {
   "authors": [
    [
     "Tanja",
     "Bänziger"
    ],
    [
     "Klaus R.",
     "Scherer"
    ]
   ],
   "title": "A study of perceived vocal features in emotional speech",
   "original": "voq3_169",
   "page_count": 4,
   "order": 27,
   "p1": "169",
   "pn": "172",
   "abstract": [
    "Perceived vocal features of emotional speech have rarely been investigated. In this contribution, a procedure allowing to collect reliable judgments on the perception of voice characteristics of emotional speech is presented. Relations between acoustic parameters and perceived features of speech are described. Some benefits and potential drawbacks of studying perceived vocal features in emotional speech are introduced and discussed.\n",
    ""
   ]
  },
  "dioubina03_voqual": {
   "authors": [
    [
     "Olga I.",
     "Dioubina"
    ]
   ],
   "title": "Annotation of expressive speech",
   "original": "voq3_173",
   "page_count": 6,
   "order": 28,
   "p1": "173",
   "pn": "178",
   "abstract": [
    "This study adresses the problems that arise in the process of annotating emotions and attitudes from the acoustic signal only. The study was evoked by the practical requirement to define acoustic properties of prominent words reflecting emotional/ cognitive state of human subjects and to suggest an alternative labeling procedure for annotating expressive speech in the SmartKom project.\n",
    ""
   ]
  },
  "bruijn03_voqual": {
   "authors": [
    [
     "Christel G. de",
     "Bruijn"
    ],
    [
     "Sandra P.",
     "Whiteside"
    ]
   ],
   "title": "Voice quality after using speech recognition software: perceptual results and reliability",
   "original": "voq3_179",
   "page_count": 6,
   "order": 29,
   "p1": "179",
   "pn": "184",
   "abstract": [
    "This study investigates the influence of using speech recognition software on voice quality. Two different groups of speakers (one group of subjects with a heavy daily vocal load and one control group) were subjected to different speech recognition tasks for 2 hours (either using discrete or continuous speech recognition software). Five listeners assessed the voice quality (14 parameters) before and after the task. Reliability of the ratings was evaluated for different types of speech fragments (3 different vowels, a read passage and conversation), for individual perceptual parameters and for male and female voices.\n",
    ""
   ]
  }
 },
 "sessions": [
  {
   "title": "Tutorial 1 - Phonetics and Measurements of Voice Quality",
   "papers": [
    "fourcin03_voqual"
   ]
  },
  {
   "title": "Session 1 - Source Modeling and Parameter Analysis",
   "papers": [
    "doval03_voqual",
    "bozkurt03_voqual",
    "bjorkner03_voqual",
    "arroabarren03_voqual",
    "orr03_voqual",
    "tooher03_voqual",
    "hirtum03_voqual"
   ]
  },
  {
   "title": "Tutorial 2 - Voice Quality and the Singing Voice",
   "papers": [
    "chapmanaua03_voqual"
   ]
  },
  {
   "title": "Session 2 - Pathological Voice Quality and Medical Applications",
   "papers": [
    "kreiman03_voqual",
    "manfredi03_voqual",
    "bettens03_voqual",
    "meltzner03_voqual"
   ]
  },
  {
   "title": "Tutorial 3 - Signal Processing for Voice Quality Processing",
   "papers": [
    "alku03_voqual"
   ]
  },
  {
   "title": "Session 3 - Classification/Recognition of Voice Quality",
   "papers": [
    "kukharchik03_voqual",
    "keller03_voqual",
    "gutierrezarriola03_voqual"
   ]
  },
  {
   "title": "Session 4 - Synthesis/Modification of Voice Quality",
   "papers": [
    "kawahara03_voqual",
    "kreiman03b_voqual",
    "rao03_voqual",
    "drioli03_voqual",
    "mokhtari03_voqual"
   ]
  },
  {
   "title": "Tutorial 4 - Physical Modeling of Voice and Voice Quality",
   "papers": [
    "story03_voqual"
   ]
  },
  {
   "title": "Session 5 - Perception of Voice Quality in Expressive Speech",
   "papers": [
    "gobl03_voqual",
    "ito03_voqual",
    "bruckl03_voqual",
    "banziger03_voqual",
    "dioubina03_voqual",
    "bruijn03_voqual"
   ]
  }
 ]
}