{
 "title": "6th Workshop on Child Computer Interaction (WOCCI 2017)",
 "location": "Glasgow, Scotland, UK",
 "startDate": "13/11/2017",
 "endDate": "13/11/2017",
 "URL": "http://wocci.org/",
 "chair": "Chairs: Keelan Evanini, Maryam Najafian, Saeid Safavi and Kay Berkling",
 "conf": "WOCCI",
 "year": "2017",
 "name": "wocci_2017",
 "series": "WOCCI",
 "SIG": "CHILD",
 "title1": "6th Workshop on Child Computer Interaction",
 "title2": "(WOCCI 2017)",
 "date": "13 November 2017",
 "papers": {
  "grossinho17_wocci": {
   "authors": [
    [
     "André",
     "Grossinho"
    ],
    [
     "João",
     "Magalhães"
    ],
    [
     "Sofia",
     "Cavaco"
    ]
   ],
   "title": "Visual-feedback in an interactive environment for speech-language therapy",
   "original": "6",
   "page_count": 6,
   "order": 6,
   "p1": 34,
   "pn": 39,
   "abstract": [
    "By combining visual-feedback and motivational elements, a speech therapy computer-based system can offer new approaches with various advantages when compared to traditional speech therapy techniques. Through visual-feedback and adaptation of traditional speech sound exercises, it is possible to create an engaging environment with motivation focused elements. These elements can be used in an interactive environment that motivates the therapy attendee towards better performances. Hereby we present an interactive gamified environment for speech therapy that combines visual-feedback and motivational components. The results from a survey and a usability study suggest that children can show more interest in the speech therapy sessions when the proposed environment is used.\n"
   ],
   "doi": "10.21437/WOCCI.2017-6"
  },
  "godde17_wocci": {
   "authors": [
    [
     "Erika",
     "Godde"
    ],
    [
     "Gérard",
     "Bailly"
    ],
    [
     "David",
     "Escudero"
    ],
    [
     "Marie-Line",
     "Bosse"
    ],
    [
     "Estelle",
     "Gillet-Perret"
    ]
   ],
   "title": "Evaluation of reading performance of primary school children: Objective measurements vs. subjective ratings",
   "original": "4",
   "page_count": 5,
   "order": 4,
   "p1": 23,
   "pn": 27,
   "abstract": [
    "We analyze here readings of the same reference text by 116 children. We show that several factors strongly impact subjective rating of fluency, notably number of correct words, repetitions, errors, syllables spelled per minute. We succeeded in predicting four subjective scores – rated between 1 and 4 by human raters – from such objective measurements with a rather high precision (R > .8 for 3 out of 4 scores). This open the way for automatic multidimensional assessment of reading fluency using calibrated texts.\n"
   ],
   "doi": "10.21437/WOCCI.2017-4"
  },
  "alharbi17_wocci": {
   "authors": [
    [
     "Sadeen",
     "Alharbi"
    ],
    [
     "Anthony J H",
     "Simons"
    ],
    [
     "Shelagh",
     "Brumfitt"
    ],
    [
     "Phil",
     "Green"
    ]
   ],
   "title": "Automatic recognition of children's read speech for stuttering application",
   "original": "1",
   "page_count": 6,
   "order": 1,
   "p1": 1,
   "pn": 6,
   "abstract": [
    "Stuttering is a common speech disfluency that may persist into adulthood if not treated in its early stages. Techniques from spoken language understanding may be applied to provide automated diagnoses of stuttering from voice recordings; however, there are several difficulties, including the lack of training data involving young children and the high dimensionality of these data. This study investigates how automatic speech recognition (ASR) could help clinicians by providing a tool that automatically recognises stuttering events and provides a useful written transcription of what was said. In addition, to enhance the performance of ASR and to alleviate the lack of stuttering data, this study examines the effect of augmenting the language model with artificially generated data. The performance of the ASR tool with and without language model augmentation is compared. Following language model augmentation, the ASR tool's performance improved recall from 38% to 62.2% and precision from 56.58% to 71%. When mis-recognised events are more coarsely classified as stuttering/non-stuttering events, the performance improves up to 73% in recall and 84% in precision. Although the obtained results are not perfect, they map to fairly robust stutter/non-stutter decision boundaries.\n"
   ],
   "doi": "10.21437/WOCCI.2017-1"
  },
  "chatzidaki17_wocci": {
   "authors": [
    [
     "Eleni",
     "Chatzidaki"
    ],
    [
     "Michalis",
     "Xenos"
    ],
    [
     "Charikleia",
     "Machaira"
    ]
   ],
   "title": "A natural user interface game for the evaluation of children with learning difficulties",
   "original": "3",
   "page_count": 6,
   "order": 3,
   "p1": 17,
   "pn": 22,
   "abstract": [
    "This paper presents Kin-LDD (stands for Kinaesthetic Learning Difficulties Diagnosis), which is a tool that supports the special educators during the assessment process of children's learning difficulties. Children using Kin-LDD, instead of participating in a tedious and extensive process, they are playing a game. The tool is using a natural user interface for the children-computer interaction, combining gestures and typical mouse usage. Kin-LDD provides a set of activities, by presenting the material in text, images, and sounds. Kin-LDD is also available to school teachers and parents, for the early identification of learning disabilities before engaging a special educator, but mostly is a tool for special educators to include the \"fun\" factor into the diagnostic process. The tool offers activities for spatial orientation, time orientation and storyboard sequencing and reports a set of key performance indicators, related to each child's performance in these activities, to the special educators helping them towards the diagnosis.\n"
   ],
   "doi": "10.21437/WOCCI.2017-3"
  },
  "kolovou17_wocci": {
   "authors": [
    [
     "Athanasia",
     "Kolovou"
    ],
    [
     "Elias",
     "Iosif"
    ],
    [
     "Alexandros",
     "Potamianos"
    ]
   ],
   "title": "Lexical and affective models in early acquisition of semantics",
   "original": "7",
   "page_count": 6,
   "order": 7,
   "p1": 40,
   "pn": 45,
   "abstract": [
    "Motivated by theories of early language development in children we investigate the contribution of affective features to early acquisition of lexical semantics. For the task of semantic similarity between words, semantic and affective spaces are modeled using network-based distributed semantic models. We propose a method for constructing semantic activations from a combination of lexical and affective relations and show that affective information plays a prominent role in our lexical development model.\n"
   ],
   "doi": "10.21437/WOCCI.2017-7"
  },
  "portaz17_wocci": {
   "authors": [
    [
     "Maxime",
     "Portaz"
    ],
    [
     "Maxime",
     "Garcia"
    ],
    [
     "Adela",
     "Barbulescu"
    ],
    [
     "Antoine",
     "Begault"
    ],
    [
     "Laurence",
     "Boissieux"
    ],
    [
     "Marie-Paule",
     "Cani"
    ],
    [
     "Rémi",
     "Ronfard"
    ],
    [
     "Dominique",
     "Vaufreydaz"
    ]
   ],
   "title": "Figurines, a multimodal framework for tangible storytelling",
   "original": "9",
   "page_count": 6,
   "order": 9,
   "p1": 52,
   "pn": 57,
   "abstract": [
    "This paper presents Figurines, an offline framework for narrative creation with tangible objects, designed to record storytelling sessions with children, teenagers or adults. This framework uses tangible diegetic objects to record a free narrative from up to two storytellers and construct a fully annotated representation of the story. This representation is composed of the 3D position and orientation of the figurines, the position of decor elements and interpretation of the storytellers' actions (facial expression, gestures and voice). While maintaining the playful dimension of the storytelling session, the system must tackle the challenge of recovering the free-form motion of the figurines and the storytellers in uncontrolled environments. To do so, we record the storytelling session using a hybrid setup with two RGB-D sensors and figurines augmented with IMU sensors. The first RGB-D sensor completes IMU information in order to identify figurines and tracks them as well as decor elements. It also tracks the storytellers jointly with the second RGB-D sensor. The framework has been used to record preliminary experiments to validate interest of our approach. These experiments evaluate figurine following and combination of motion and storyteller's voice, gesture and facial expressions. In a make-believe game, this story representation was re-targeted on virtual characters to produce an animated version of the story. The final goal of the Figurines framework is to enhance our understanding of the creative processes at work during immersive storytelling.\n"
   ],
   "doi": "10.21437/WOCCI.2017-9"
  },
  "safavi17_wocci": {
   "authors": [
    [
     "Saeid",
     "Safavi"
    ],
    [
     "Lily",
     "Meng"
    ]
   ],
   "title": "Comparison of two scoring method within i-vector framework for speaker recognition from children's speech",
   "original": "10",
   "page_count": 4,
   "order": 10,
   "p1": 58,
   "pn": 61,
   "abstract": [
    "Speaker recognition is a well established area for research but it mainly focuses on adult speech. Recent work on children's speech shows that not all the findings from speaker recognition on adult speech are directly applicable on children's speech. There are a variety of applications for speaker recognition from children's speech, for example it could be used as a safeguard for a child during her/his interactions on social media networking websites. It could also be used as one of the main blocks in automatic tutor systems for educational purposes at schools. In this research we have evaluated two scoring method for speaker recognition within the i-vector framework using two simulated environments; in a classroom (contains 30 students) and in a school (contains 288 students). The first method is based on the PLDA scoring approach and the second method is based on the cosine similarity measure. Results show that the first method outperforms the second approach in a simulated school, but it is the other way around for the recognition of a child in a classroom in which the second scoring method performs better.\n"
   ],
   "doi": "10.21437/WOCCI.2017-10"
  },
  "grimminger17_wocci": {
   "authors": [
    [
     "Angela",
     "Grimminger"
    ],
    [
     "Katharina J.",
     "Rohlfing"
    ]
   ],
   "title": "Can you teach me?: Children teaching new words to a robot in a book reading scenario",
   "original": "5",
   "page_count": 6,
   "order": 5,
   "p1": 28,
   "pn": 33,
   "abstract": [
    "In research on children's language development, joint book reading is appreciated as being a situation beneficial for language learning. Motivated by this string of research, our aim was to explore whether the situation of joint book reading can be applied to a child–robot interaction. Before investigating whether and how this situation – when applied in child–robot interaction – can be used as a language learning scenario, the interactional requirements for a successful dialogue have to be studied. Our main aim in this paper is to present a study design for a child–robot interaction, in which a robot is introduced as a learner that acquires new color words, and the child is asked to teach the robot those words within a familiar interaction format of joint book reading. We then report the observations that we made in a single-case pilot study conducted with a 4;8-year-old child, and discuss these observations in terms of how the robot's interactional behavior needs to be shaped to successfully participate in the situation of joint book reading.\n"
   ],
   "doi": "10.21437/WOCCI.2017-5"
  },
  "loukina17_wocci": {
   "authors": [
    [
     "Anastassia",
     "Loukina"
    ],
    [
     "Beata Beigman",
     "Klebanov"
    ],
    [
     "Patrick",
     "Lange"
    ],
    [
     "Binod",
     "Gyawali"
    ],
    [
     "Yao",
     "Qian"
    ]
   ],
   "title": "Developing speech processing technologies for shared book reading with a computer",
   "original": "8",
   "page_count": 6,
   "order": 8,
   "p1": 46,
   "pn": 51,
   "abstract": [
    "We present a preliminary report on developing technology for an application that supports shared book reading. We discuss how speech processing technology can be used to automate different components of the system for oral reading fluency evaluation during shared book reading and the challenges posed by this new context in comparison to other automated reading tutor systems. We also present performance evaluation of the baseline system on a corpus of read speech.\n"
   ],
   "doi": "10.21437/WOCCI.2017-8"
  },
  "berkling17_wocci": {
   "authors": [
    [
     "Kay",
     "Berkling"
    ]
   ],
   "title": "Phontasia: A phonics game for German and its effect on orthographic skills–first corpus explorations",
   "original": "2",
   "page_count": 10,
   "order": 2,
   "p1": 7,
   "pn": 16,
   "abstract": [
    "This paper reports on first results in a study on orthography acquisition for children in German elementary school. One major aspect of German orthography concerns the marking of vowel duration, which occurs in every regular word in German. Therefore, mastery of this pattern has a large impact both on accurate spelling and very likely on reading ability. However, data shows that acquisition of this sub-skill appears difficult for kids to master, even beyond elementary school. In this paper, we explore a corpus of freely written text data that was collected on a weekly basis across several third grade classes in three different schools over a period of three months. Two of the schools participated in an intervention (iPad Phonics Game for German, called Phontasia). Studying the impact of the game on skill acquisition proved difficult because the ability to employ iPads in the classroom was correlated with socio-economic status of the schools. Results from VERA, a German standardized test, were obtained for several classes, allowing us to add one control group to the study. Preliminary results indicate that Phontasia intervention is worth pursuing in future studies to improve orthographic skills.\n"
   ],
   "doi": "10.21437/WOCCI.2017-2"
  },
  "timpelaughlin17_wocci": {
   "authors": [
    [
     "Veronika",
     "Timpe-Laughlin"
    ],
    [
     "Jeremy",
     "Lee"
    ],
    [
     "Keelan",
     "Evanini"
    ],
    [
     "James",
     "Bruno"
    ],
    [
     "Ian",
     "Blood"
    ]
   ],
   "title": "Can you guess who I am?: An interactive task for young learners to practice yes/no question formation in English",
   "original": "11",
   "page_count": 6,
   "order": 11,
   "p1": 62,
   "pn": 67,
   "abstract": [
    "Although yes/no questions are one of the most frequently occurring question types in English, research on the development and production of yes/no questions–in particular in young English learners–is still very limited. For example, we know very little about potential errors young L2 learners make when they produce yes/no questions–an area that is crucial in order to provide useful feedback in different learning environments, including computer-based applications. This paper reports on an exploratory study conducted with Can you guess who I am?, an interactive, spoken-dialogue-based speaking activity that allows young English learners to practice yes/no questions. After introducing the SDS-based speaking activity, we present the findings from a systematic investigation of the output produced by 27 young English learners in Germany (ages 9-11) who engaged with the activity. A particular focus in the analysis was placed on the types of yes/no questions elicited and the types of errors made by the young learners. The findings provide further empirical support for a six-stage framework for the development of question formation in L2 learners (Pienemann et al., 1988) . Moreover, they offer insights into the types of errors young EFL learners make in forming polar interrogatives such as systematic confusion with regard to the auxiliaries \"to be\" and \"to do\". The findings are discussed in terms of (a) how they contribute to a more comprehensive understanding of young learner's speech and (b) how they will be used to inform further development of more targeted feedback options that can be implemented into the SDS-based speaking activity in order to harness its full potential for L2 learning.\n"
   ],
   "doi": "10.21437/WOCCI.2017-11"
  }
 },
 "sessions": [
  {
   "title": "WOCCI 2017",
   "papers": [
    "alharbi17_wocci",
    "berkling17_wocci",
    "chatzidaki17_wocci",
    "godde17_wocci",
    "grimminger17_wocci",
    "grossinho17_wocci",
    "kolovou17_wocci",
    "loukina17_wocci",
    "portaz17_wocci",
    "safavi17_wocci",
    "timpelaughlin17_wocci"
   ]
  }
 ],
 "doi": "10.21437/WOCCI.2017"
}